[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "1410",
    "instruction": "Find books on Wikimammenn with their authors' birthplaces.",
    "query": "SELECT ?livre ?livreLabel ?personneLabel ?lieuLabel ?page ?img ?coord WHERE {\n?livre wdt:P50 ?personne .\n?personne wdt:P19 ?lieu .\n?lieu wdt:P625 ?coord .\noptional { ?personne wdt:P18 ?img } .\n?page schema:about ?livre .\n?page schema:isPartOf <https://br.wikisource.org/> .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?livre ?livreLabel ?personneLabel ?lieuLabel ?page ?img ?coord WHERE {\n?livre wdt:[property:author] ?personne .\n?personne wdt:[property:place of birth] ?lieu .\n?lieu wdt:[property:coordinate location] ?coord .\noptional { ?personne wdt:[property:image] ?img } .\n?page schema:about ?livre .\n?page schema:isPartOf <https://br.wikisource.org/> .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "1139",
    "instruction": "List all entities named after Leonardo da Vinci.",
    "query": "SELECT ?item ?itemLabel ?itemDescription ?website ?image WHERE {\n?item wdt:P138 wd:Q762.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\nOPTIONAL { ?item wdt:P856 ?website }\nOPTIONAL { ?item wdt:P18 ?image }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?itemDescription ?website ?image WHERE {\n?item wdt:[property:named after] wd:[entity:Leonardo da Vinci].\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\nOPTIONAL { ?item wdt:[property:official website] ?website }\nOPTIONAL { ?item wdt:[property:image] ?image }\n}",
    "complexity": "medium"
  },
  {
    "id": "203",
    "instruction": "List all species with 'baueri' in their name.",
    "query": "SELECT ?item ?name WHERE {\n?item wdt:P225 ?name FILTER (CONTAINS(?name, \" baueri\")).\nMINUS {?item wdt:P138 wd:Q936580}\n}",
    "annotated": "PREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?item ?name WHERE {\n?item wdt:[property:taxon name] ?name FILTER (CONTAINS(?name, \" baueri\")).\nMINUS {?item wdt:[property:named after] wd:[entity:John Sibthorp]}\n}",
    "complexity": "medium"
  },
  {
    "id": "2051",
    "instruction": "List the top 20 most frequently depicted locations in paintings.",
    "query": "SELECT (COUNT(?anotherItem) AS ?anotherItemCount) ?anotherItemLabel ?loc WHERE {\n?item wdt:P31 wd:Q3305213 .\n?item wdt:P180 ?anotherItem .\n?anotherItem wdt:P625 ?loc .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?anotherItemLabel ?anotherItemCount ?loc\nORDER BY DESC(?anotherItemCount)\nLIMIT 20",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT (COUNT(?anotherItem) AS ?anotherItemCount) ?anotherItemLabel ?loc WHERE {\n?item wdt:[property:instance of] wd:[entity:painting] .\n?item wdt:[property:depicts] ?anotherItem .\n?anotherItem wdt:[property:coordinate location] ?loc .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?anotherItemLabel ?anotherItemCount ?loc\nORDER BY DESC(?anotherItemCount)\nLIMIT 20",
    "complexity": "medium"
  },
  {
    "id": "2295",
    "instruction": "How many species are classified under each IUCN conservation category?",
    "query": "SELECT (count(DISTINCT ?species ) as ?count) ?status ?statusLabel{\nVALUES ?status {wd:Q11394 wd:Q219127 wd:Q237350 wd:Q239509 wd:Q278113 wd:Q719675}\n?species wdt:P141 ?status.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP by ?status ?statusLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT (count(DISTINCT ?species ) as ?count) ?status ?statusLabel{\nVALUES ?status {wd:[entity:Endangered species] wd:[entity:Critically Endangered] wd:[entity:extinct species] wd:[entity:extinct in the wild] wd:[entity:Vulnerable] wd:[entity:Near Threatened]}\n?species wdt:[property:IUCN conservation status] ?status.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP by ?status ?statusLabel",
    "complexity": "medium"
  },
  {
    "id": "1556",
    "instruction": "List the early French aviation pioneers born before 1900.",
    "query": "SELECT DISTINCT ?author ?authorLabel ?date ?image WHERE {\n?author wdt:P106/wdt:P279* wd:Q2095549 .\n?author wdt:P569 ?date FILTER (YEAR(?date)<1900).\n?author wdt:P19 ?place .\n?place wdt:P17 wd:Q142 .\nOPTIONAL{?author wdt:P18 ?image .}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"de, fr, en\" }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?author ?authorLabel ?date ?image WHERE {\n?author wdt:[property:occupation]/wdt:[property:subclass of]* wd:[entity:aircraft pilot] .\n?author wdt:[property:date of birth] ?date FILTER (YEAR(?date)<1900).\n?author wdt:[property:place of birth] ?place .\n?place wdt:[property:country] wd:[entity:France] .\nOPTIONAL{?author wdt:[property:image] ?image .}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"de, fr, en\" }\n}",
    "complexity": "medium"
  },
  {
    "id": "2363",
    "instruction": "Show me the locations where Balinese palm-leaf manuscripts originated from.",
    "query": "SELECT ?label ?coord ?subj WHERE {\n?subj wdt:P31 wd:Q1641020 .\nOPTIONAL {?subj wdt:P291 ?loc .\n?loc wdt:P625 ?coord } .\n?subj rdfs:label ?label filter (lang(?label) = \"en\")\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?label ?coord ?subj WHERE {\n?subj wdt:[property:instance of] wd:[entity:palm-leaf manuscript] .\nOPTIONAL {?subj wdt:[property:place of publication] ?loc .\n?loc wdt:[property:coordinate location] ?coord } .\n?subj rdfs:label ?label filter (lang(?label) = \"en\")\n}",
    "complexity": "medium"
  },
  {
    "id": "2174",
    "instruction": "List all artworks that depict Mughal emperors from India.",
    "query": "SELECT ?item ?itemLabel ?painting ?paintingLabel WHERE {\n?painting wdt:P31 wd:Q3305213 ; wdt:P180 ?item ; wdt:P195 ?collection .\n?collection wdt:P17 wd:Q668.\n?item wdt:P39 wd:Q15390704.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?painting ?paintingLabel WHERE {\n?painting wdt:[property:instance of] wd:[entity:painting] ; wdt:[property:depicts] ?item ; wdt:[property:collection] ?collection .\n?collection wdt:[property:country] wd:[entity:India].\n?item wdt:[property:position held] wd:[entity:Mughal emperor].\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}",
    "complexity": "medium"
  },
  {
    "id": "326",
    "instruction": "List the occupations with the most people in them.",
    "query": "SELECT ?jobname (COUNT(?person) AS ?members)\nWHERE {\n?person wdt:P3429 ?ee;\nwdt:P106 ?job.\n?job rdfs:label ?jobname filter (lang(?jobname) = \"en\")\n} GROUP BY ?jobname\nORDER BY DESC (?members)",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?jobname (COUNT(?person) AS ?members)\nWHERE {\n?person wdt:[property:Electronic Enlightenment ID] ?ee;\nwdt:[property:occupation] ?job.\n?job rdfs:label ?jobname filter (lang(?jobname) = \"en\")\n} GROUP BY ?jobname\nORDER BY DESC (?members)",
    "complexity": "medium"
  },
  {
    "id": "2152",
    "instruction": "List all aircraft models that made their first flight after 1903.",
    "query": "SELECT ?pesawat ?pesawatLabel ?tgl (YEAR(?tanggal) as ?tahun) ?gambar WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n?pesawat wdt:P31/wdt:P279 wd:Q15056995.\n?pesawat wdt:P606 ?tanggal.\n?pesawat wdt:P606 ?tgl.\nFILTER ( YEAR(?tanggal) >= 1903 )\n?pesawat wdt:P18 ?gambar.\n}\nLIMIT 500\n#defaultView:Timeline\n#view:Timeline{\"hide\": \"?tgl\"}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?pesawat ?pesawatLabel ?tgl (YEAR(?tanggal) as ?tahun) ?gambar WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n?pesawat wdt:[property:instance of]/wdt:[property:subclass of] wd:[entity:aircraft model].\n?pesawat wdt:[property:first flight] ?tanggal.\n?pesawat wdt:[property:first flight] ?tgl.\nFILTER ( YEAR(?tanggal) >= 1903 )\n?pesawat wdt:[property:image] ?gambar.\n}\nLIMIT 500\n#defaultView:Timeline\n#view:Timeline{\"hide\": \"?tgl\"}",
    "complexity": "medium"
  },
  {
    "id": "2575",
    "instruction": "Find artworks with a National Galleries of Scotland ID created by female artists.",
    "query": "SELECT ?item ?itemLabel ?natgalIDLabel ?itemwikipage ?creatorLabel ?creatorwikipage\nWHERE {\n?item wdt:P8946 ?natgalID ;\nwdt:P170 ?creator .\n?creator wdt:P21 wd:Q6581072 .\nOPTIONAL { ?itemwikipage schema:about ?item; schema:isPartOf <https://en.wikipedia.org/> }\nOPTIONAL { ?creatorwikipage schema:about ?creator; schema:isPartOf <https://en.wikipedia.org/>}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?natgalIDLabel ?itemwikipage ?creatorLabel ?creatorwikipage\nWHERE {\n?item wdt:[property:National Galleries Scotland ID] ?natgalID ;\nwdt:[property:creator] ?creator .\n?creator wdt:[property:sex or gender] wd:[entity:female] .\nOPTIONAL { ?itemwikipage schema:about ?item; schema:isPartOf <https://en.wikipedia.org/> }\nOPTIONAL { ?creatorwikipage schema:about ?creator; schema:isPartOf <https://en.wikipedia.org/>}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "954",
    "instruction": "Show me a map of Mithras shrines.",
    "query": "SELECT ?item ?itemLabel ?countryLabel ?territorialEntityLabel ?placeLabel ?coords ?image WHERE {\n?item wdt:P31 wd:Q1151014 .\nOPTIONAL { ?item wdt:P17 ?country . }\nOPTIONAL { ?item wdt:P131 ?territorialEntity . }\nOPTIONAL { ?item wdt:P625 ?coords . }\nOPTIONAL { ?item wdt:P276 ?place . }\nOPTIONAL { ?item wdt:P18 ?image . }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} ORDER BY ?countryLabel ?territorialEntityLabel ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?countryLabel ?territorialEntityLabel ?placeLabel ?coords ?image WHERE {\n?item wdt:[property:instance of] wd:[entity:mithraeum] .\nOPTIONAL { ?item wdt:[property:country] ?country . }\nOPTIONAL { ?item wdt:[property:located in the administrative territorial entity] ?territorialEntity . }\nOPTIONAL { ?item wdt:[property:coordinate location] ?coords . }\nOPTIONAL { ?item wdt:[property:location] ?place . }\nOPTIONAL { ?item wdt:[property:image] ?image . }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} ORDER BY ?countryLabel ?territorialEntityLabel ?itemLabel",
    "complexity": "medium"
  },
  {
    "id": "715",
    "instruction": "List all Figshare DOIs with their frequency of occurrence in Wikidata statements.",
    "query": "SELECT ?doi (count(?doi) as ?counts) WHERE {\n?statement prov:wasDerivedFrom ?ref .\n?ref pr:P356 ?doi .\nFILTER (CONTAINS(lcase(?doi), \"figshare\"))\n}\nGROUP BY ?doi\nORDER BY DESC(?counts)",
    "annotated": "PREFIX prov: <http://www.w3.org/ns/prov#>\nPREFIX pr: <http://www.wikidata.org/prop/reference/>\n\nSELECT ?doi (count(?doi) as ?counts) WHERE {\n?statement prov:wasDerivedFrom ?ref .\n?ref pr:[property:DOI] ?doi .\nFILTER (CONTAINS(lcase(?doi), \"figshare\"))\n}\nGROUP BY ?doi\nORDER BY DESC(?counts)",
    "complexity": "medium"
  },
  {
    "id": "797",
    "instruction": "List the Twitter usernames of famous biologists.",
    "query": "SELECT DISTINCT ?personLabel ?twitterName ?pic WHERE {\n?person wdt:P2002 ?twitterName ;\nwdt:P106 ?occupation .\nOPTIONAL { ?person wdt:P18 ?pic . }\n?occupation wdt:P279* wd:Q864503 . # all subclasses of biologists\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?personLabel ?twitterName ?pic WHERE {\n?person wdt:[property:Twitter (X) username] ?twitterName ;\nwdt:[property:occupation] ?occupation .\nOPTIONAL { ?person wdt:[property:image] ?pic . }\n?occupation wdt:[property:subclass of]* wd:[entity:biologist] . # all subclasses of biologists\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n}",
    "complexity": "medium"
  },
  {
    "id": "2406",
    "instruction": "List books written by Canadian female authors available on Wikisource.",
    "query": "SELECT ?author ?authorLabel ?book ?bookLabel ?ouvrageWikisource WHERE {\n?ouvrageWikisource schema:about ?book;\nschema:isPartOf <https://fr.wikisource.org/>.\n?author wdt:P21 wd:Q6581072;\nwdt:P27 wd:Q16.\n?book wdt:P50 ?author.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],fr\". }\n}\nGROUP BY ?author ?authorLabel ?book ?bookLabel ?ouvrageWikisource\nORDER BY DESC (?count)\nLIMIT 200",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?author ?authorLabel ?book ?bookLabel ?ouvrageWikisource WHERE {\n?ouvrageWikisource schema:about ?book;\nschema:isPartOf <https://fr.wikisource.org/>.\n?author wdt:[property:sex or gender] wd:[entity:female];\nwdt:[property:country of citizenship] wd:[entity:Canada].\n?book wdt:[property:author] ?author.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],fr\". }\n}\nGROUP BY ?author ?authorLabel ?book ?bookLabel ?ouvrageWikisource\nORDER BY DESC (?count)\nLIMIT 200",
    "complexity": "medium"
  },
  {
    "id": "2519",
    "instruction": "List the birthplaces of famous rabbis.",
    "query": "SELECT ?item ?itemLabel ?naissance ?geoloc ?image WHERE {\n?item wdt:P106/wdt:P279* wd:Q133485.\n?item wdt:P19 ?lieudenaissance.\n?lieudenaissance wdt:P625 ?geoloc .\n?item wdt:P569 ?naissance, ?date.\nOPTIONAL { ?item wdt:P18 ?image }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,fr,he,ru,de\". }\n}\nORDER BY ASC(?naissance)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?naissance ?geoloc ?image WHERE {\n?item wdt:[property:occupation]/wdt:[property:subclass of]* wd:[entity:rabbi].\n?item wdt:[property:place of birth] ?lieudenaissance.\n?lieudenaissance wdt:[property:coordinate location] ?geoloc .\n?item wdt:[property:date of birth] ?naissance, ?date.\nOPTIONAL { ?item wdt:[property:image] ?image }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,fr,he,ru,de\". }\n}\nORDER BY ASC(?naissance)",
    "complexity": "medium"
  },
  {
    "id": "674",
    "instruction": "List all digital libraries worldwide along with their official websites.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?website\nWHERE {\n?item wdt:P31/wdt:P279* wd:Q212805 # digital libraries or subtypes\nOPTIONAL { ?item wdt:P856 ?website } # Official URL if known\nMINUS { ?item wdt:P576 [] } # Exclude those that have shut down\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en, es, ca, fr, de, pl, uk, ru, he\" }\n}\nORDER BY ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?website\nWHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:digital library] # digital libraries or subtypes\nOPTIONAL { ?item wdt:[property:official website] ?website } # Official URL if known\nMINUS { ?item wdt:[property:dissolved, abolished or demolished date] [] } # Exclude those that have shut down\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en, es, ca, fr, de, pl, uk, ru, he\" }\n}\nORDER BY ?itemLabel",
    "complexity": "medium"
  },
  {
    "id": "211",
    "instruction": "List all Wikidata items that have a collection property.",
    "query": "SELECT (COUNT(?obj) AS ?count) WHERE {\n?obj p:P195 ?s.\n?s ps:P195 ?collection.\nMINUS { ?s pq:P582 [] }\n}",
    "annotated": "PREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\n\nSELECT (COUNT(?obj) AS ?count) WHERE {\n?obj p:[property:collection] ?s.\n?s ps:[property:collection] ?collection.\nMINUS { ?s pq:[property:end time] [] }\n}",
    "complexity": "medium"
  },
  {
    "id": "2437",
    "instruction": "List the narrative locations mentioned in Itinerary from Paris to Mont-d'Or.",
    "query": "SELECT ?lieu ?lieuLabel ?layer ?coord WHERE {\nwd:Q108366183 p:P840 ?node .\n?node ps:P840 ?lieu .\n?node pq:P585 ?layer .\n?lieu wdt:P625 ?coord .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?lieu ?lieuLabel ?layer ?coord WHERE {\nwd:[entity:Itin\u00e9raire de Paris au mont-d\u2019or] p:[property:narrative location] ?node .\n?node ps:[property:narrative location] ?lieu .\n?node pq:[property:point in time] ?layer .\n?lieu wdt:[property:coordinate location] ?coord .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "193",
    "instruction": "List all the locations shown in 'Mediterranean Scenes' with their coordinates.",
    "query": "SELECT ?work ?workLabel ?page ?coords ?itemLabel WHERE {\n?work p:P361 [ps:P361 wd:Q54854779; pq:P304 ?page].\n?work wdt:P180 ?item. ?item wdt:P625 ?coords\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?work ?workLabel ?page ?coords ?itemLabel WHERE {\n?work p:[property:part of] [ps:[property:part of] wd:[entity:Mediterranean Scenes]; pq:[property:page(s)] ?page].\n?work wdt:[property:depicts] ?item. ?item wdt:[property:coordinate location] ?coords\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}",
    "complexity": "medium"
  },
  {
    "id": "1414",
    "instruction": "List the mountains in Basque Country with their coordinates.",
    "query": "SELECT ?itemLabel ?koord WHERE {\n?item wdt:P31 wd:Q8502.\n?item (wdt:P131*/^wdt:P527) wd:Q47588.\n?item wdt:P625 ?koord.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],eu\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?itemLabel ?koord WHERE {\n?item wdt:[property:instance of] wd:[entity:mountain].\n?item (wdt:[property:located in the administrative territorial entity]*/^wdt:[property:has part(s)]) wd:[entity:Basque Country].\n?item wdt:[property:coordinate location] ?koord.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],eu\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "1121",
    "instruction": "List all Icelandic names that do not have 'son' or 'dottir' as a suffix.",
    "query": "SELECT ?item ?label WHERE {\n?item wdt:P27 wd:Q189;\nrdfs:label ?label.\nFILTER(LANG(?label) = \"is\")\nFILTER(!REGEX(?label, \"(?:son|dottir|dottir)$\"))\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?item ?label WHERE {\n?item wdt:[property:country of citizenship] wd:[entity:Iceland];\nrdfs:label ?label.\nFILTER(LANG(?label) = \"is\")\nFILTER(!REGEX(?label, \"(?:son|dottir|dottir)$\"))\n}",
    "complexity": "medium"
  },
  {
    "id": "1683",
    "instruction": "Show me a list of archives around the world along with their locations.",
    "query": "SELECT * WHERE {\n?item wdt:P31*/wdt:P279* wd:Q166118;\nwdt:P625 ?geo .\n}#opendata",
    "annotated": "PREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT * WHERE {\n?item wdt:[property:instance of]*/wdt:[property:subclass of]* wd:[entity:archive];\nwdt:[property:coordinate location] ?geo .\n}#opendata",
    "complexity": "medium"
  },
  {
    "id": "1418",
    "instruction": "List scientific articles that used a specific version of STATA software.",
    "query": "SELECT ?article ?articleLabel ?softwareLabel ?date\nWHERE {\n?article wdt:P31 wd:Q13442814 .\n?article wdt:P2283 ?software .\n?software wdt:P279 wd:Q1204300 .\n?software wdt:P348 ?version .\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?article ?articleLabel ?softwareLabel ?date\nWHERE {\n?article wdt:[property:instance of] wd:[entity:scholarly article] .\n?article wdt:[property:uses] ?software .\n?software wdt:[property:subclass of] wd:[entity:Stata] .\n?software wdt:[property:software version identifier] ?version .\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n}",
    "complexity": "medium"
  },
  {
    "id": "2282",
    "instruction": "List all the Corona viruses and their parent taxons.",
    "query": "SELECT ?parent ?parentLabel ?virus ?virusLabel ?ncbi WHERE {\n?virus wdt:P171+ wd:Q57751738 .\n?virus wdt:P171 ?parent .\nOPTIONAL { ?virus wdt:P685 ?ncbi }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?parent ?parentLabel ?virus ?virusLabel ?ncbi WHERE {\n?virus wdt:[property:parent taxon]+ wd:[entity:Coronavirus] .\n?virus wdt:[property:parent taxon] ?parent .\nOPTIONAL { ?virus wdt:[property:NCBI taxonomy ID] ?ncbi }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "541",
    "instruction": "List the children of librarians with the most sitelinks.",
    "query": "SELECT ?person ?personLabel ?parentLabel ?linkcount WHERE {\n?parent wdt:P106 wd:Q182436 .\n?parent wdt:P40 ?person .\n?person wikibase:sitelinks ?linkcount .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,de,es,ar,fr\" }\n}\nGROUP BY ?linkcount ?person ?personLabel ?parent ?parentLabel\nORDER BY DESC(?linkcount)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?person ?personLabel ?parentLabel ?linkcount WHERE {\n?parent wdt:[property:occupation] wd:[entity:librarian] .\n?parent wdt:[property:child] ?person .\n?person wikibase:sitelinks ?linkcount .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,de,es,ar,fr\" }\n}\nGROUP BY ?linkcount ?person ?personLabel ?parent ?parentLabel\nORDER BY DESC(?linkcount)",
    "complexity": "medium"
  },
  {
    "id": "1928",
    "instruction": "List the weights of royal crowns from heaviest to lightest.",
    "query": "SELECT ?item ?itemLabel ?countryLabel ?weight ?unitLabel ?img WHERE {\n?item wdt:P31 wd:Q170984 .\nOPTIONAL {\n?item p:P2067 ?weight_stmt .\n?weight_stmt ps:P2067 ?weight .\n?weight_stmt psv:P2067/wikibase:quantityUnit ?unit .\n?weight_stmt psv:P2067/wikibase:quantityNormalized/wikibase:quantityAmount ?normalised .\n}\nOPTIONAL {?item wdt:P17 ?country} .\nOPTIONAL {?item wdt:P18 ?img} .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,fr,de,es,it,ru\". }\n} ORDER BY DESC(?normalised) ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?countryLabel ?weight ?unitLabel ?img WHERE {\n?item wdt:[property:instance of] wd:[entity:crown] .\nOPTIONAL {\n?item p:[property:mass] ?weight_stmt .\n?weight_stmt ps:[property:mass] ?weight .\n?weight_stmt psv:[property:mass]/wikibase:quantityUnit ?unit .\n?weight_stmt psv:[property:mass]/wikibase:quantityNormalized/wikibase:quantityAmount ?normalised .\n}\nOPTIONAL {?item wdt:[property:country] ?country} .\nOPTIONAL {?item wdt:[property:image] ?img} .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,fr,de,es,it,ru\". }\n} ORDER BY DESC(?normalised) ?itemLabel",
    "complexity": "medium"
  },
  {
    "id": "1787",
    "instruction": "List the locations of major urban centers.",
    "query": "SELECT ?item ?itemLabel ?loc ?c ?cLabel ?pop WHERE {\n# comment out the next line to hide WD's idea of \"big\"\n?item wdt:P31 wd:Q1549591 . # big city 'a population of more than 100,000 inhabitants'\n?item wdt:P625 ?loc .\n?item wdt:P17 ?c .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n?item wdt:P1082 ?pop .\n# FILTER( ?pop > 100000) # actually biggish cities\n}\nORDER BY DESC (?pop)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?loc ?c ?cLabel ?pop WHERE {\n# comment out the next line to hide WD's idea of \"big\"\n?item wdt:[property:instance of] wd:[entity:big city] . # big city 'a population of more than 100,000 inhabitants'\n?item wdt:[property:coordinate location] ?loc .\n?item wdt:[property:country] ?c .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n?item wdt:[property:population] ?pop .\n# FILTER( ?pop > 100000) # actually biggish cities\n}\nORDER BY DESC (?pop)",
    "complexity": "medium"
  },
  {
    "id": "928",
    "instruction": "List all movies directed by David Lynch and their duration.",
    "query": "SELECT ?film ?filmLabel ?seriesLabel ?durationLabel\nWHERE {?film wdt:P57 wd:Q2071 .\nOPTIONAL {?film wdt:P2047 ?duration .\n}\nOPTIONAL {?film wdt:P179 ?series .\n}\n# get a label in English\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en, pl, it, fr\" .\n}\n}\nORDER BY ?duration",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?film ?filmLabel ?seriesLabel ?durationLabel\nWHERE {?film wdt:[property:director] wd:[entity:David Lynch] .\nOPTIONAL {?film wdt:[property:duration] ?duration .\n}\nOPTIONAL {?film wdt:[property:part of the series] ?series .\n}\n# get a label in English\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en, pl, it, fr\" .\n}\n}\nORDER BY ?duration",
    "complexity": "medium"
  },
  {
    "id": "136",
    "instruction": "List all nuclear power plants along with their country and inception dates.",
    "query": "SELECT ?object ?objectLabel ?countryLabel ?inception ?service_entry WHERE {\n?object (wdt:P31/wdt:P279*) wd:Q134447;\nwdt:P17 ?country.\nOPTIONAL {?object wdt:P571 ?inception}\nOPTIONAL {?object wdt:P729 ?service_entry }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} ORDER BY ?countryLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?object ?objectLabel ?countryLabel ?inception ?service_entry WHERE {\n?object (wdt:[property:instance of]/wdt:[property:subclass of]*) wd:[entity:nuclear power plant];\nwdt:[property:country] ?country.\nOPTIONAL {?object wdt:[property:inception] ?inception}\nOPTIONAL {?object wdt:[property:service entry] ?service_entry }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} ORDER BY ?countryLabel",
    "complexity": "medium"
  },
  {
    "id": "1559",
    "instruction": "Show me pictures of planets outside our solar system.",
    "query": "SELECT ?exoplanet ?exoplanetLabel ?image WHERE {\n?exoplanet wdt:P31 wd:Q44559 ;\nwdt:P18 ?image .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?exoplanet ?exoplanetLabel ?image WHERE {\n?exoplanet wdt:[property:instance of] wd:[entity:exoplanet] ;\nwdt:[property:image] ?image .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  }
]