[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "2205",
    "instruction": "List all regions with their corresponding ISO 3166-2 codes.",
    "query": "SELECT ?region ?ISO3166_2 ?countryLabel ?ISO3166_1 ?regionLabel ?regionDescription ?coord WHERE {\n?region wdt:P300 ?ISO3166_2.\n?region wdt:P17 ?country.\nOPTIONAL {?region wdt:P625 ?coord}.\nOPTIONAL{?country wdt:P298 ?ISO3166_1}\n# OPTIONAL {?Wiki schema:about ?region;\n# schema:isPartOf <https://en.wikipedia.org/>}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"sv,en\". }\n} order by ?countryLabel ?ISO3166_2",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?region ?ISO3166_2 ?countryLabel ?ISO3166_1 ?regionLabel ?regionDescription ?coord WHERE {\n?region wdt:[property:ISO 3166-2 code] ?ISO3166_2.\n?region wdt:[property:country] ?country.\nOPTIONAL {?region wdt:[property:coordinate location] ?coord}.\nOPTIONAL{?country wdt:[property:ISO 3166-1 alpha-3 code] ?ISO3166_1}\n# OPTIONAL {?Wiki schema:about ?region;\n# schema:isPartOf <https://en.wikipedia.org/>}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"sv,en\". }\n} order by ?countryLabel ?ISO3166_2",
    "complexity": "complex"
  },
  {
    "id": "2403",
    "instruction": "What is the diameter of different types of balls?",
    "query": "SELECT ?item ?itemLabel ?diameter ?length ?mass ?sportLabel ?image WHERE {\n# Diameter (mm)\n?item wdt:P279+ wd:Q18545; p:P2386 ?diameterstmt .\n{ ?diameterstmt pq:P1013 wd:Q10578722 } UNION\n{ FILTER NOT EXISTS { ?diameterstmt pq:P1013 ?x } }\nFILTER NOT EXISTS { ?diameterstmt pq:P582 ?x }\n?diameterstmt psn:P2386 [\nwikibase:quantityAmount ?baseD ].\nBIND(?baseD * 1000 AS ?diameter)\n# Length (mm)\nOPTIONAL { ?item p:P2043 ?lengthstmt .\n{ ?lengthstmt pq:P1013 wd:Q10578722 } UNION\n{ FILTER NOT EXISTS { ?lengthstmt pq:P1013 ?x } }\n?lengthstmt psn:P2043 [\nwikibase:quantityAmount ?baseL ].\nBIND(?baseL * 1000 AS ?length)\n}\n# Mass (g)\nOPTIONAL { ?item p:P2067 ?massstmt .\n{ ?massstmt pq:P1013 wd:Q10578722 } UNION\n{ FILTER NOT EXISTS { ?massstmt pq:P1013 ?x } }\n?massstmt psn:P2067 [\nwikibase:quantityAmount ?baseM ].\nBIND(?baseM * 1000 AS ?mass)\n}\nOPTIONAL { ?item wdt:P641 ?sport } OPTIONAL { ?item wdt:P18 ?image } SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?diameter)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX psn: <http://www.wikidata.org/prop/statement/value-normalized/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?diameter ?length ?mass ?sportLabel ?image WHERE {\n# Diameter (mm)\n?item wdt:[property:subclass of]+ wd:[entity:ball]; p:[property:diameter] ?diameterstmt .\n{ ?diameterstmt pq:[property:criterion used] wd:[entity:maximum] } UNION\n{ FILTER NOT EXISTS { ?diameterstmt pq:[property:criterion used] ?x } }\nFILTER NOT EXISTS { ?diameterstmt pq:[property:end time] ?x }\n?diameterstmt psn:[property:diameter] [\nwikibase:quantityAmount ?baseD ].\nBIND(?baseD * 1000 AS ?diameter)\n# Length (mm)\nOPTIONAL { ?item p:[property:length] ?lengthstmt .\n{ ?lengthstmt pq:[property:criterion used] wd:[entity:maximum] } UNION\n{ FILTER NOT EXISTS { ?lengthstmt pq:[property:criterion used] ?x } }\n?lengthstmt psn:[property:length] [\nwikibase:quantityAmount ?baseL ].\nBIND(?baseL * 1000 AS ?length)\n}\n# Mass (g)\nOPTIONAL { ?item p:[property:mass] ?massstmt .\n{ ?massstmt pq:[property:criterion used] wd:[entity:maximum] } UNION\n{ FILTER NOT EXISTS { ?massstmt pq:[property:criterion used] ?x } }\n?massstmt psn:[property:mass] [\nwikibase:quantityAmount ?baseM ].\nBIND(?baseM * 1000 AS ?mass)\n}\nOPTIONAL { ?item wdt:[property:sport] ?sport } OPTIONAL { ?item wdt:[property:image] ?image } SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?diameter)",
    "complexity": "complex"
  },
  {
    "id": "95",
    "instruction": "List all doctoral theses that do not have an author.",
    "query": "SELECT ?thesis ?thesisDescription ?languageLabel WHERE {\n?thesis wdt:P31 wd:Q187685\nMINUS { [] wdt:P1026 ?thesis }\nMINUS { ?thesis wdt:P50 [] }\nOPTIONAL { ?thesis wdt:P364 ?language }\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\"\n}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?thesis ?thesisDescription ?languageLabel WHERE {\n?thesis wdt:[property:instance of] wd:[entity:doctoral thesis]\nMINUS { [] wdt:[property:academic thesis] ?thesis }\nMINUS { ?thesis wdt:[property:author] [] }\nOPTIONAL { ?thesis wdt:[property:original language of film or TV show] ?language }\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\"\n}\n}",
    "complexity": "complex"
  },
  {
    "id": "1902",
    "instruction": "What are the highest software version numbers recorded on Wikidata?",
    "query": "SELECT ?item ?itemLabel ?version WITH {\nSELECT ?item ?version ?versionNumber WHERE {\n?item wdt:P348 ?version.\nBIND(xsd:integer(REPLACE(STRBEFORE(?version, \".\"), \"^v\", \"\")) AS ?versionNumber)\n}\nORDER BY DESC(?versionNumber)\nLIMIT 25\n} AS %results WHERE {\nINCLUDE %results.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?versionNumber)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?version WITH {\nSELECT ?item ?version ?versionNumber WHERE {\n?item wdt:[property:software version identifier] ?version.\nBIND(xsd:integer(REPLACE(STRBEFORE(?version, \".\"), \"^v\", \"\")) AS ?versionNumber)\n}\nORDER BY DESC(?versionNumber)\nLIMIT 25\n} AS %results WHERE {\nINCLUDE %results.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?versionNumber)",
    "complexity": "complex"
  },
  {
    "id": "454",
    "instruction": "What properties are most commonly used on items with a specific identifier?",
    "query": "SELECT ?prop ?propLabel ?count WHERE {\n{\nSELECT ?prop (COUNT(DISTINCT ?item) AS ?count) WHERE {\nhint:Query hint:optimizer \"None\" .\n?item wdt:P1367 ?yp_id .\n?item ?p ?id .\n?prop wikibase:directClaim ?p .\n{?prop wdt:P31 wd:Q19847637} # Wikidata property representing a unique identifier\nUNION\n{?prop wdt:P31 wd:Q19595382} # Wikidata property for authority control for people\n} GROUP BY ?prop\n}\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n} ORDER BY DESC (?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX hint: <http://www.bigdata.com/queryHints#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?prop ?propLabel ?count WHERE {\n{\nSELECT ?prop (COUNT(DISTINCT ?item) AS ?count) WHERE {\nhint:Query hint:optimizer \"None\" .\n?item wdt:[property:Art UK artist ID] ?yp_id .\n?item ?p ?id .\n?prop wikibase:directClaim ?p .\n{?prop wdt:[property:instance of] wd:[entity:Wikidata property for an identifier]} # Wikidata property representing a unique identifier\nUNION\n{?prop wdt:[property:instance of] wd:[entity:Wikidata property for authority control for people]} # Wikidata property for authority control for people\n} GROUP BY ?prop\n}\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n} ORDER BY DESC (?count)",
    "complexity": "complex"
  },
  {
    "id": "1584",
    "instruction": "List all Russian Wikipedia articles about women that are featured or good but do not have a French counterpart.",
    "query": "SELECT DISTINCT ?item ?itemLabel WHERE {\n?featuredArticle schema:about ?item.\n?featuredArticle schema:inLanguage \"ru\".\n?featuredArticle wikibase:badge ?badgeValues.\n?item wdt:P31 wd:Q5.\n?item wdt:P21 wd:Q6581072.\nVALUES (?badgeValues) {\n(wd:Q17437796)\n(wd:Q17437798)\n}\nOPTIONAL {\n?sitelink schema:about ?item.\n?sitelink schema:inLanguage \"fr\".\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr,en,ru\". }\nFILTER(!BOUND(?sitelink))\n}\nORDER BY ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel WHERE {\n?featuredArticle schema:about ?item.\n?featuredArticle schema:inLanguage \"ru\".\n?featuredArticle wikibase:badge ?badgeValues.\n?item wdt:[property:instance of] wd:[entity:human].\n?item wdt:[property:sex or gender] wd:[entity:female].\nVALUES (?badgeValues) {\n(wd:[entity:featured article badge])\n(wd:[entity:good article badge])\n}\nOPTIONAL {\n?sitelink schema:about ?item.\n?sitelink schema:inLanguage \"fr\".\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr,en,ru\". }\nFILTER(!BOUND(?sitelink))\n}\nORDER BY ?itemLabel",
    "complexity": "complex"
  },
  {
    "id": "1610",
    "instruction": "What are the Wikimedia projects available in French and languages of France?",
    "query": "SELECT DISTINCT ?language ?languageLabel ?wpURL ?wiktURL ?wsURL ?wnURL ?wqURL ?wbURL ?wvURL ?wvoyURL\nWHERE\n{\n{ VALUES ?language {\nwd:Q150\nwd:Q33302\nwd:Q9051\n}\n} UNION\n{ ?language wdt:P361/wdt:P361 wd:Q496250 . }\n?wp wdt:P31 wd:Q10876391 .\n?wp p:P407 ?wpLangStatement .\n?wpLangStatement ps:P407 ?language .\n?wp wdt:P856 ?wpURL .\nOPTIONAL {\n?wikt wdt:P31 wd:Q22001389 .\n?wikt p:P407 ?wiktLangStatement .\n?wiktLangStatement ps:P407 ?language .\n?wikt wdt:P856 ?wiktURL .\n}\nOPTIONAL {\n?ws wdt:P31 wd:Q15156455 .\n?ws p:P407 ?wsLangStatement .\n?wsLangStatement ps:P407 ?language .\n?ws wdt:P856 ?wsURL .\n}\nOPTIONAL {\n?wn wdt:P31 wd:Q20671729 .\n?wn p:P407 ?wnLangStatement .\n?wnLangStatement ps:P407 ?language .\n?wn wdt:P856 ?wnURL .\n}\nOPTIONAL {\n?wq wdt:P31 wd:Q22001361 .\n?wq p:P407 ?wqLangStatement .\n?wqLangStatement ps:P407 ?language .\n?wq wdt:P856 ?wqURL .\n}\nOPTIONAL {\n?wb wdt:P31 wd:Q22001316 .\n?wb p:P407 ?wbLangStatement .\n?wbLangStatement ps:P407 ?language .\n?wb wdt:P856 ?wbURL .\n}\nOPTIONAL {\n?wv wdt:P31 wd:Q22001390 .\n?wv p:P407 ?wvLangStatement .\n?wvLangStatement ps:P407 ?language .\n?wv wdt:P856 ?wvURL .\n}\nOPTIONAL {\n?wvoy wdt:P31 wd:Q19826567 .\n?wvoy p:P407 ?wvoyLangStatement .\n?wvoyLangStatement ps:P407 ?language .\n?wvoy wdt:P856 ?wvoyURL .\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr,en\". }\n} ORDER BY ?languageLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?language ?languageLabel ?wpURL ?wiktURL ?wsURL ?wnURL ?wqURL ?wbURL ?wvURL ?wvoyURL\nWHERE\n{\n{ VALUES ?language {\nwd:[entity:French]\nwd:[entity:French Sign Language]\nwd:[entity:Luxembourgish]\n}\n} UNION\n{ ?language wdt:[property:part of]/wdt:[property:part of] wd:[entity:languages of France] . }\n?wp wdt:[property:instance of] wd:[entity:Wikipedia language edition] .\n?wp p:[property:language of work or name] ?wpLangStatement .\n?wpLangStatement ps:[property:language of work or name] ?language .\n?wp wdt:[property:official website] ?wpURL .\nOPTIONAL {\n?wikt wdt:[property:instance of] wd:[entity:Wiktionary language edition] .\n?wikt p:[property:language of work or name] ?wiktLangStatement .\n?wiktLangStatement ps:[property:language of work or name] ?language .\n?wikt wdt:[property:official website] ?wiktURL .\n}\nOPTIONAL {\n?ws wdt:[property:instance of] wd:[entity:Wikisource language edition] .\n?ws p:[property:language of work or name] ?wsLangStatement .\n?wsLangStatement ps:[property:language of work or name] ?language .\n?ws wdt:[property:official website] ?wsURL .\n}\nOPTIONAL {\n?wn wdt:[property:instance of] wd:[entity:Wikinews language edition] .\n?wn p:[property:language of work or name] ?wnLangStatement .\n?wnLangStatement ps:[property:language of work or name] ?language .\n?wn wdt:[property:official website] ?wnURL .\n}\nOPTIONAL {\n?wq wdt:[property:instance of] wd:[entity:Wikiquote language edition] .\n?wq p:[property:language of work or name] ?wqLangStatement .\n?wqLangStatement ps:[property:language of work or name] ?language .\n?wq wdt:[property:official website] ?wqURL .\n}\nOPTIONAL {\n?wb wdt:[property:instance of] wd:[entity:Wikibooks language edition] .\n?wb p:[property:language of work or name] ?wbLangStatement .\n?wbLangStatement ps:[property:language of work or name] ?language .\n?wb wdt:[property:official website] ?wbURL .\n}\nOPTIONAL {\n?wv wdt:[property:instance of] wd:[entity:Wikiversity language edition] .\n?wv p:[property:language of work or name] ?wvLangStatement .\n?wvLangStatement ps:[property:language of work or name] ?language .\n?wv wdt:[property:official website] ?wvURL .\n}\nOPTIONAL {\n?wvoy wdt:[property:instance of] wd:[entity:Wikivoyage language edition] .\n?wvoy p:[property:language of work or name] ?wvoyLangStatement .\n?wvoyLangStatement ps:[property:language of work or name] ?language .\n?wvoy wdt:[property:official website] ?wvoyURL .\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr,en\". }\n} ORDER BY ?languageLabel",
    "complexity": "complex"
  },
  {
    "id": "2294",
    "instruction": "What types of items in Australia do not have identifier properties?",
    "query": "SELECT ?type ?typeLabel (COUNT(*) AS ?count) (SAMPLE(?link) AS ?link)\n{\n{\nSELECT *\n{\n#hint:Query hint:optimizer \"None\".\n?item wikibase:identifiers 0 .\n?item wdt:P17 wd:Q408 .\n?item wdt:P31 ?type .\n#MINUS {?type wdt:P279 wd:Q17442446 .} I can't get this to work in time\n}\nLIMIT 200000\n}\nBIND (URI(CONCAT(\"https://query.wikidata.org/#SELECT%20%3Fitem%20%3FitemLabel%0A%20%7B%0A%20%20%20%20%3Fitem%20wikibase%3Aidentifiers%200%20.%0A%20%20%20%20%3Fitem%20wdt%3AP17%20wd%3AQ408%20.%0A%20%20%20%20%3Fitem%20wdt%3AP31%20wd%3A\",SUBSTR(str(?type),32, 250),\"%20.%0A%20%20%20%20SERVICE%20wikibase%3Alabel%20%7B%20bd%3AserviceParam%20wikibase%3Alanguage%20%22%5BAUTO_LANGUAGE%5D%2Cen%22.%20%7D%0A%20%7D%0A\")) as ?link)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} GROUP BY ?type ?typeLabel\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX hint: <http://www.bigdata.com/queryHints#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?type ?typeLabel (COUNT(*) AS ?count) (SAMPLE(?link) AS ?link)\n{\n{\nSELECT *\n{\n#hint:Query hint:optimizer \"None\".\n?item wikibase:identifiers 0 .\n?item wdt:[property:country] wd:[entity:Australia] .\n?item wdt:[property:instance of] ?type .\n#MINUS {?type wdt:[property:subclass of] wd:[entity:Wikimedia internal item] .} I can't get this to work in time\n}\nLIMIT 200000\n}\nBIND (URI(CONCAT(\"https://query.wikidata.org/#SELECT%20%3Fitem%20%3FitemLabel%0A%20%7B%0A%20%20%20%20%3Fitem%20wikibase%3Aidentifiers%200%20.%0A%20%20%20%20%3Fitem%20wdt%3A[property:country]%20wd%3A[entity:Australia]%20.%0A%20%20%20%20%3Fitem%20wdt%3A[property:instance of]%20wd%3A\",SUBSTR(str(?type),32, 250),\"%20.%0A%20%20%20%20SERVICE%20wikibase%3Alabel%20%7B%20bd%3AserviceParam%20wikibase%3Alanguage%20%22%5BAUTO_LANGUAGE%5D%2Cen%22.%20%7D%0A%20%7D%0A\")) as ?link)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} GROUP BY ?type ?typeLabel\nORDER BY DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "1159",
    "instruction": "Show me a map of libraries in Wales.",
    "query": "SELECT ?s ?sLabel ?coor ?operator ?operatorLabel ?image ?layer WHERE {\n?s wdt:P31/wdt:P279* wd:Q7075 ;\nwdt:P17 wd:Q145 ;\nwdt:P625 ?coor ;\nwdt:P137 ?operator ;\nOPTIONAL {?s wdt:P18 ?image .}\nVALUES ?operator { wd:Q319761 wd:Q790029 wd:Q5038449 wd:Q1035745 wd:Q7375001 wd:Q1420500 wd:Q1971174 wd:Q3400501 wd:Q4923796 wd:Q4966533 wd:Q5016926 wd:Q5038400 wd:Q5043224 wd:Q5064127 wd:Q5166758 wd:Q5256629 wd:Q16837157\nwd:Q5623821 wd:Q6083890 wd:Q16997658 wd:Q6901162 wd:Q6984500 wd:Q16998902 wd:Q7161994 wd:Q7236943 wd:Q7321391\nwd:Q5123523 wd:Q6980600 wd:Q7825688 wd:Q1954765 wd:Q2046319 wd:Q3112646 wd:Q5142752 wd:Q7592929 wd:Q6820686 wd:Q7161992 wd:Q5142753 wd:Q5590045 wd:Q16891916 wd:Q5142762 wd:Q5038488 wd:Q20713648 wd:Q4966531 wd:Q17986585 wd:Q16890510 wd:Q7909538 wd:Q8038115 wd:Q4898241 wd:Q4667178 wd:Q4761763 wd:Q5038490 wd:Q5197211 wd:Q30287465 wd:Q18343995 wd:Q17018314 wd:Q7373981 wd:Q18358583 }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}\nORDER BY ?operatorLabel ?sLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?s ?sLabel ?coor ?operator ?operatorLabel ?image ?layer WHERE {\n?s wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:library] ;\nwdt:[property:country] wd:[entity:United Kingdom] ;\nwdt:[property:coordinate location] ?coor ;\nwdt:[property:operator] ?operator ;\nOPTIONAL {?s wdt:[property:image] ?image .}\nVALUES ?operator { wd:[entity:Aberystwyth University] wd:[entity:Bangor University] wd:[entity:Cardiff Metropolitan University] wd:[entity:Cardiff University] wd:[entity:Royal Welsh College of Music & Drama] wd:[entity:Swansea University] wd:[entity:University of South Wales] wd:[entity:Wrexham University] wd:[entity:Blaenau Gwent County Borough Council] wd:[entity:Bridgend County Borough Council] wd:[entity:Caerphilly County Borough Council] wd:[entity:Cardiff Council] wd:[entity:Carmarthenshire County Council] wd:[entity:Ceredigion County Council] wd:[entity:Conwy County Borough Council] wd:[entity:Denbighshire County Council] wd:[entity:Flintshire County Council]\nwd:[entity:Gwynedd Council] wd:[entity:Isle of Anglesey County Council] wd:[entity:Merthyr Tydfil County Borough Council] wd:[entity:Monmouthshire County Council] wd:[entity:Neath Port Talbot County Borough Council] wd:[entity:Newport City Council] wd:[entity:Pembrokeshire County Council] wd:[entity:Powys County Council] wd:[entity:Rhondda Cynon Taf County Borough Council]\nwd:[entity:City and County of Swansea Council] wd:[entity:Natural Resources Wales] wd:[entity:Torfaen County Borough Council] wd:[entity:St Fagans National History Museum] wd:[entity:Museum Wales] wd:[entity:Welsh Government] wd:[entity:Coleg Gwent] wd:[entity:St David's Catholic College] wd:[entity:Merthyr Tydfil College] wd:[entity:Pembrokeshire College] wd:[entity:Coleg Ceredigion] wd:[entity:Gower College Swansea] wd:[entity:Grwp Llandrillo Menai] wd:[entity:Coleg Sir G\u00e2r] wd:[entity:Cardiff and Vale College] wd:[entity:NPTC Group] wd:[entity:Bridgend College] wd:[entity:Coleg y Cymoedd] wd:[entity:Coleg Cambria] wd:[entity:Vale of Glamorgan Council] wd:[entity:Wrexham County Borough Council] wd:[entity:Betsi Cadwaladr University Health Board] wd:[entity:Swansea Bay University Health Board] wd:[entity:Aneurin Bevan University Health Board] wd:[entity:Cardiff and Vale University Health Board] wd:[entity:Cwm Taf University Health Board] wd:Q30287465 wd:[entity:Powys Teaching Health Board] wd:[entity:Public Health Wales] wd:[entity:Royal College of Nursing] wd:[entity:Velindre NHS Trust] }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}\nORDER BY ?operatorLabel ?sLabel",
    "complexity": "complex"
  },
  {
    "id": "2572",
    "instruction": "What are the dates of death for victims of the 2022 Russian invasion of Ukraine?",
    "query": "SELECT ?item ?itemLabel ?date ?countryLabel ?image\nWHERE\n{\n{\nSELECT ?item ?date ?image (SAMPLE(?country2) AS ?country) WHERE {\n?item p:P1196/pq:P607/wdt:P361* wd:Q110999040.\nOPTIONAL{ ?item wdt:P570 ?date. }\nOPTIONAL{ ?item wdt:P27 ?country2. }\nOPTIONAL{ ?item wdt:P18 ?image. }\nMINUS{ ?item wdt:P27 wdt:Q15180. } #exclude USSR citizenship from the duplicates\n}\nGROUP BY ?item ?date ?image\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,uk,ru\" . }\n}\nORDER BY DESC(?date)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?date ?countryLabel ?image\nWHERE\n{\n{\nSELECT ?item ?date ?image (SAMPLE(?country2) AS ?country) WHERE {\n?item p:[property:manner of death]/pq:[property:conflict]/wdt:[property:part of]* wd:[entity:Russian invasion of Ukraine].\nOPTIONAL{ ?item wdt:[property:date of death] ?date. }\nOPTIONAL{ ?item wdt:[property:country of citizenship] ?country2. }\nOPTIONAL{ ?item wdt:[property:image] ?image. }\nMINUS{ ?item wdt:[property:country of citizenship] wdt:[entity:Soviet Union]. } #exclude USSR citizenship from the duplicates\n}\nGROUP BY ?item ?date ?image\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,uk,ru\" . }\n}\nORDER BY DESC(?date)",
    "complexity": "complex"
  },
  {
    "id": "2574",
    "instruction": "Find the audio clips of place names in Wales.",
    "query": "SELECT ?xLabel ?clip ?loc WHERE {\n{?x wdt:P131 wd:Q25 }\nUNION { ?x wdt:P131 ?pob . ?pob wdt:P131* wd:Q25 }\n?x wdt:P443 ?clip .\n?x wdt:P625 ?loc .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"cy\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?xLabel ?clip ?loc WHERE {\n{?x wdt:[property:located in the administrative territorial entity] wd:[entity:Wales] }\nUNION { ?x wdt:[property:located in the administrative territorial entity] ?pob . ?pob wdt:[property:located in the administrative territorial entity]* wd:[entity:Wales] }\n?x wdt:[property:pronunciation audio] ?clip .\n?x wdt:[property:coordinate location] ?loc .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"cy\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "1574",
    "instruction": "List the number of articles published in each Indian medical journal per year.",
    "query": "SELECT ?cid (STR(SAMPLE(?year)) AS ?year) (COUNT(*) AS ?count) ?journal WHERE {\nVALUES ?cid {wd:Q4767851 wd:Q6020763 wd:Q6020786 wd:Q6020785 wd:Q6020790\nwd:Q7753202 wd:Q6020793 wd:Q6020797 wd:Q6020800 wd:Q6020803\nwd:Q6020807 wd:Q6020816 wd:Q6020819 wd:Q6020821 wd:Q6020823\nwd:Q6020825 wd:Q6295323 wd:Q6295328 wd:Q6704257 wd:Q15710015\nwd:Q15710016 wd:Q15710030 wd:Q25099420 wd:Q25303369 wd:Q39048414}\n?article wdt:P31 wd:Q13442814;\nwdt:P1433 ?cid;\nwdt:P577 ?_date_of_pub.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\".\n?cid rdfs:label ?journal. }\nBIND ( YEAR(?_date_of_pub) AS ?year )\n}\nGROUP BY ?cid ?journal ?year\n#",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?cid (STR(SAMPLE(?year)) AS ?year) (COUNT(*) AS ?count) ?journal WHERE {\nVALUES ?cid {wd:[entity:Annals of Indian Academy of Neurology] wd:[entity:Indian Journal of Community Medicine] wd:[entity:Indian Journal of Medical Research] wd:[entity:Indian Journal of Medical Microbiology] wd:[entity:Indian Journal of Medical Sciences]\nwd:[entity:The National Medical Journal of India] wd:[entity:Indian Journal of Nephrology] wd:[entity:Indian Journal of Occupational and Environmental Medicine] wd:[entity:Indian Journal of Ophthalmology] wd:[entity:Indian Journal of Pathology & Microbiology]\nwd:[entity:Indian Journal of Pharmaceutical Sciences] wd:[entity:Indian Journal of Psychiatry] wd:[entity:Indian Journal of Psychological Medicine] wd:[entity:Indian Journal of Radiology and Imaging] wd:[entity:Indian Journal of Sexually Transmitted Diseases and AIDS]\nwd:[entity:Indian Journal of Urology] wd:[entity:Journal of Indian Association of Pediatric Surgeons] wd:[entity:Journal of Indian Society of Periodontology] wd:[entity:Lung India] wd:[entity:Indian Journal of Palliative Care]\nwd:[entity:Indian Journal of Pharmacology] wd:[entity:Neurology India] wd:[entity:Psychological Studies] wd:[entity:Journal of the Indian Academy of Applied Psychology] wd:[entity:National Council of Churches Review]}\n?article wdt:[property:instance of] wd:[entity:scholarly article];\nwdt:[property:published in] ?cid;\nwdt:[property:publication date] ?_date_of_pub.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\".\n?cid rdfs:label ?journal. }\nBIND ( YEAR(?_date_of_pub) AS ?year )\n}\nGROUP BY ?cid ?journal ?year\n#",
    "complexity": "complex"
  },
  {
    "id": "2113",
    "instruction": "List the number of pages per author for each year.",
    "query": "SELECT\n?year\n(SUM(?pages_per_author) AS ?number_of_pages)\n?researcher_label\nWHERE {\n{\nSELECT\n?researcher_label ?work ?year\n(SAMPLE(?pages) / COUNT(?researcher_of_paper) AS ?pages_per_author)\nWHERE {\n# Find authors associated with organization\nFILTER EXISTS { ?researcher wdt:P108 | wdt:P463 | (wdt:P1416 / wdt:P361*) wd:Q27639076 . }\n?work (wdt:P50|wdt:P2093) ?researcher_of_paper .\n# Disabled to only look on scholarly articles\n# ?work wdt:P31 wd:Q13442814 .\n?work wdt:P50 ?researcher .\n?work wdt:P1104 ?pages .\n?work wdt:P577 ?date .\nBIND(STR(YEAR(?date)) AS ?year)\n?researcher rdfs:label ?researcher_label . FILTER(LANG(?researcher_label) = 'en')\n}\nGROUP BY ?work ?researcher_label ?year\n}\n}\nGROUP BY ?year ?researcher_label\nORDER BY ?year",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT\n?year\n(SUM(?pages_per_author) AS ?number_of_pages)\n?researcher_label\nWHERE {\n{\nSELECT\n?researcher_label ?work ?year\n(SAMPLE(?pages) / COUNT(?researcher_of_paper) AS ?pages_per_author)\nWHERE {\n# Find authors associated with organization\nFILTER EXISTS { ?researcher wdt:[property:employer] | wdt:[property:member of] | (wdt:[property:affiliation] / wdt:[property:part of]*) wd:[entity:Research Institute of Text Analysis and Applications] . }\n?work (wdt:[property:author]|wdt:[property:author name string]) ?researcher_of_paper .\n# Disabled to only look on scholarly articles\n# ?work wdt:[property:instance of] wd:[entity:scholarly article] .\n?work wdt:[property:author] ?researcher .\n?work wdt:[property:number of pages] ?pages .\n?work wdt:[property:publication date] ?date .\nBIND(STR(YEAR(?date)) AS ?year)\n?researcher rdfs:label ?researcher_label . FILTER(LANG(?researcher_label) = 'en')\n}\nGROUP BY ?work ?researcher_label ?year\n}\n}\nGROUP BY ?year ?researcher_label\nORDER BY ?year",
    "complexity": "complex"
  },
  {
    "id": "38",
    "instruction": "List all the people that Oxford's landmarks are named after.",
    "query": "SELECT ?person ?personLabel (SAMPLE(?img) AS ?image) (SAMPLE(?loc) AS ?location) ?placeLabel WHERE {\n?place wdt:P131 wd:Q34217;\nwdt:P138 ?person FILTER (?person != wd:Q34217).\nOPTIONAL { ?place wdt:P625 ?coords }\nOPTIONAL { ?place p:P159/pq:P625 ?hqcoords }\nBIND (IF (BOUND(?coords), ?coords, ?hqcoords) AS ?loc)\nOPTIONAL { ?person wdt:P18 ?img }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} GROUP BY ?person ?personLabel ?placeLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?person ?personLabel (SAMPLE(?img) AS ?image) (SAMPLE(?loc) AS ?location) ?placeLabel WHERE {\n?place wdt:[property:located in the administrative territorial entity] wd:[entity:Oxford];\nwdt:[property:named after] ?person FILTER (?person != wd:[entity:Oxford]).\nOPTIONAL { ?place wdt:[property:coordinate location] ?coords }\nOPTIONAL { ?place p:[property:headquarters location]/pq:[property:coordinate location] ?hqcoords }\nBIND (IF (BOUND(?coords), ?coords, ?hqcoords) AS ?loc)\nOPTIONAL { ?person wdt:[property:image] ?img }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} GROUP BY ?person ?personLabel ?placeLabel",
    "complexity": "complex"
  },
  {
    "id": "2188",
    "instruction": "List all species of Mangifera and mango cultivars.",
    "query": "SELECT distinct ?butir ?nama ?deskripsi ?gambar WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"id\".\n?mangga rdfs:label ?nama.\n?mangga schema:description ?deskripsi.\n}\n{ ?mangga wdt:P171 wd:Q161807. BIND (?mangga AS ?butir) }\nUNION\n{ ?mangga wdt:P31 wd:Q27068180. BIND (?mangga AS ?butir) }\nOPTIONAL { ?mangga wdt:P18 ?gambar. }\n}\n#defaultView:ImageGrid",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT distinct ?butir ?nama ?deskripsi ?gambar WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"id\".\n?mangga rdfs:label ?nama.\n?mangga schema:description ?deskripsi.\n}\n{ ?mangga wdt:[property:parent taxon] wd:[entity:Mangifera]. BIND (?mangga AS ?butir) }\nUNION\n{ ?mangga wdt:[property:instance of] wd:[entity:mango cultivar]. BIND (?mangga AS ?butir) }\nOPTIONAL { ?mangga wdt:[property:image] ?gambar. }\n}\n#defaultView:ImageGrid",
    "complexity": "complex"
  }
]