[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "152",
    "instruction": "List all the people who were advised by someone who was also advised by Grigorios Choniades.",
    "query": "SELECT DISTINCT ?person2 ?person2Label ?person1 ?person1Label?p2birth WHERE {\nwd:Q22092846 wdt:P184* ?person2.\n?person1 wdt:P184* wd:Q3118446.\n?person2 wdt:P184 ?person1;\nwdt:P569 ?p2birth.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} ORDER BY DESC(?p2birth)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?person2 ?person2Label ?person1 ?person1Label?p2birth WHERE {\nwd:[entity:Sabrina Gonzalez Pasterski] wdt:[property:doctoral advisor]* ?person2.\n?person1 wdt:[property:doctoral advisor]* wd:[entity:Grigorios Choniades].\n?person2 wdt:[property:doctoral advisor] ?person1;\nwdt:[property:date of birth] ?p2birth.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} ORDER BY DESC(?p2birth)",
    "complexity": "complex"
  },
  {
    "id": "2373",
    "instruction": "List people who held a position like mayor but have no birth or death dates.",
    "query": "SELECT DISTINCT ?person (min(year(?start)) as ?from) (max(year(?end)) as ?to) (?to - ?from as ?span)\nWHERE {\n?person wdt:P31 wd:Q5 .\n?person p:P39 ?ps1 . ?ps1 ps:P39 ?position . ?position wdt:P279* wd:Q30185 . # for example they are a mayor\n?person p:P39 ?ps2 . ?ps2 pq:P580 ?start . ?ps2 pq:P582 ?end . # find start & end of all their other positions\nfilter(year(?end) < 1950) # avoid anyone recent\nfilter not exists { ?person wdt:P569 ?b }\nfilter not exists { ?person wdt:P570 ?d }\nfilter not exists { ?person wdt:P1317 ?fl }\nfilter not exists { ?person wdt:P2031 ?wps }\nfilter not exists { ?person wdt:P2032 ?wpe }\n} group by ?person",
    "annotated": "PREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT DISTINCT ?person (min(year(?start)) as ?from) (max(year(?end)) as ?to) (?to - ?from as ?span)\nWHERE {\n?person wdt:[property:instance of] wd:[entity:human] .\n?person p:[property:position held] ?ps1 . ?ps1 ps:[property:position held] ?position . ?position wdt:[property:subclass of]* wd:[entity:mayor] . # for example they are a mayor\n?person p:[property:position held] ?ps2 . ?ps2 pq:[property:start time] ?start . ?ps2 pq:[property:end time] ?end . # find start & end of all their other positions\nfilter(year(?end) < 1950) # avoid anyone recent\nfilter not exists { ?person wdt:[property:date of birth] ?b }\nfilter not exists { ?person wdt:[property:date of death] ?d }\nfilter not exists { ?person wdt:[property:floruit] ?fl }\nfilter not exists { ?person wdt:[property:work period (start)] ?wps }\nfilter not exists { ?person wdt:[property:work period (end)] ?wpe }\n} group by ?person",
    "complexity": "complex"
  },
  {
    "id": "1968",
    "instruction": "List all metro stations in Stockholm County with their coordinates and adjacent stations.",
    "query": "SELECT ?station ?stationLabel ?coords ?line ?layer ?rgb (SAMPLE(?image) AS ?image) (sample(?opening) as ?opening) WHERE {\n?station wdt:P31 wd:Q928830;\nwdt:P131* wd:Q104231;\nwdt:P625 ?coords;\np:P197 ?pred.\n?pred ps:P197 ?conn;\npq:P81 ?subwayLine.\nMINUS { ?pred pq:P582 [] }\nOPTIONAL { ?station wdt:P18 ?image }.\nOPTIONAL { ?station wdt:P1619 ?opening }.\n?conn wdt:P625 ?cds;\nwdt:P31 wd:Q928830.\nBIND(IF(xsd:double(?depth/10) = xsd:integer(?depth/10),?cds,\"\") as ?coords)\n?conn p:P625/psv:P625/wikibase:geoLatitude ?lat1 ; p:P625/psv:P625/wikibase:geoLongitude ?lon1 .\n?station p:P625/psv:P625/wikibase:geoLatitude ?lat2 ; p:P625/psv:P625/wikibase:geoLongitude ?lon2 .\nBIND(CONCAT('LINESTRING(', STR(?lon1), ' ', STR(?lat1), ',', STR(?lon2), ' ', STR(?lat2), ')') AS ?str) . BIND(STRDT(?str, geo:wktLiteral) AS ?line)\n?subwayLine wdt:P465 ?rgb .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"sv\". ?subwayLine rdfs:label ?layer. ?station rdfs:label ?stationLabel }\n}\nGROUP BY ?station ?stationLabel ?coords ?line ?layer ?rgb",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?station ?stationLabel ?coords ?line ?layer ?rgb (SAMPLE(?image) AS ?image) (sample(?opening) as ?opening) WHERE {\n?station wdt:[property:instance of] wd:[entity:metro station];\nwdt:[property:located in the administrative territorial entity]* wd:[entity:Stockholm County];\nwdt:[property:coordinate location] ?coords;\np:[property:adjacent station] ?pred.\n?pred ps:[property:adjacent station] ?conn;\npq:[property:connecting line] ?subwayLine.\nMINUS { ?pred pq:[property:end time] [] }\nOPTIONAL { ?station wdt:[property:image] ?image }.\nOPTIONAL { ?station wdt:[property:date of official opening] ?opening }.\n?conn wdt:[property:coordinate location] ?cds;\nwdt:[property:instance of] wd:[entity:metro station].\nBIND(IF(xsd:double(?depth/10) = xsd:integer(?depth/10),?cds,\"\") as ?coords)\n?conn p:[property:coordinate location]/psv:[property:coordinate location]/wikibase:geoLatitude ?lat1 ; p:[property:coordinate location]/psv:[property:coordinate location]/wikibase:geoLongitude ?lon1 .\n?station p:[property:coordinate location]/psv:[property:coordinate location]/wikibase:geoLatitude ?lat2 ; p:[property:coordinate location]/psv:[property:coordinate location]/wikibase:geoLongitude ?lon2 .\nBIND(CONCAT('LINESTRING(', STR(?lon1), ' ', STR(?lat1), ',', STR(?lon2), ' ', STR(?lat2), ')') AS ?str) . BIND(STRDT(?str, geo:wktLiteral) AS ?line)\n?subwayLine wdt:[property:sRGB color hex triplet] ?rgb .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"sv\". ?subwayLine rdfs:label ?layer. ?station rdfs:label ?stationLabel }\n}\nGROUP BY ?station ?stationLabel ?coords ?line ?layer ?rgb",
    "complexity": "complex"
  },
  {
    "id": "2445",
    "instruction": "How many new UK MPs were elected at each general election since 1870?",
    "query": "select (concat(str(year(?start)),\"-\",str(month(?start))) as ?date) (count(distinct ?item) as ?count)where\n{\n{ select distinct ?item (min(?incep) as ?start)\nwhere {\n?term wdt:P279 wd:Q16707842 . ?item p:P39 ?ps . ?ps ps:P39 ?term . ?term wdt:P571 ?incep .\n} group by ?item\n}\nfilter (year(?start) >= 1870)\n?item p:P39 ?ps . ?ps ps:P39 ?term . ?term wdt:P279 wd:Q16707842 . ?term wdt:P571 ?incep .\n?ps pq:P2715 ?elec . ?term wdt:P2715 ?elec .\n} group by ?start\n#defaultView:BarChart",
    "annotated": "PREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nselect (concat(str(year(?start)),\"-\",str(month(?start))) as ?date) (count(distinct ?item) as ?count)where\n{\n{ select distinct ?item (min(?incep) as ?start)\nwhere {\n?term wdt:[property:subclass of] wd:[entity:Member of Parliament] . ?item p:[property:position held] ?ps . ?ps ps:[property:position held] ?term . ?term wdt:[property:inception] ?incep .\n} group by ?item\n}\nfilter (year(?start) >= 1870)\n?item p:[property:position held] ?ps . ?ps ps:[property:position held] ?term . ?term wdt:[property:subclass of] wd:[entity:Member of Parliament] . ?term wdt:[property:inception] ?incep .\n?ps pq:[property:elected in] ?elec . ?term wdt:[property:elected in] ?elec .\n} group by ?start\n#defaultView:BarChart",
    "complexity": "complex"
  },
  {
    "id": "2646",
    "instruction": "Find famous people born on your birthday.",
    "query": "SELECT ?item ?articlename ?itemLabel ?itemDescription ?sl\nWHERE {\nVALUES ?dod {\"+1966-08-25\"^^xsd:dateTime}\n?dod ^wdt:P569 ?item .\n?item wikibase:sitelinks ?sl .\n?item ^schema:about ?article .\n?article schema:isPartOf <https://en.wikipedia.org/>;\nschema:name ?articlename .\nSERVICE wikibase:label\n{\nbd:serviceParam wikibase:language \"en\" .\n?item rdfs:label ?itemLabel .\n?item schema:description ?itemDescription .\n}\nBIND(REPLACE(?itemLabel, \"^.*(?<! [Vv][ao]n| [Dd][aeiu]| [Dd][e][lns]| [Ll][ae]) (?!([SJ]r\\\\.?|[XVI]+)$)\", \"\") AS ?sortname)\n} ORDER BY ASC(UCASE(?sortname)) ASC(UCASE(?itemLabel))",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?articlename ?itemLabel ?itemDescription ?sl\nWHERE {\nVALUES ?dod {\"+1966-08-25\"^^xsd:dateTime}\n?dod ^wdt:[property:date of birth] ?item .\n?item wikibase:sitelinks ?sl .\n?item ^schema:about ?article .\n?article schema:isPartOf <https://en.wikipedia.org/>;\nschema:name ?articlename .\nSERVICE wikibase:label\n{\nbd:serviceParam wikibase:language \"en\" .\n?item rdfs:label ?itemLabel .\n?item schema:description ?itemDescription .\n}\nBIND(REPLACE(?itemLabel, \"^.*(?<! [Vv][ao]n| [Dd][aeiu]| [Dd][e][lns]| [Ll][ae]) (?!([SJ]r\\\\.?|[XVI]+)$)\", \"\") AS ?sortname)\n} ORDER BY ASC(UCASE(?sortname)) ASC(UCASE(?itemLabel))",
    "complexity": "complex"
  },
  {
    "id": "896",
    "instruction": "What is the emergency phone number in each country?",
    "query": "SELECT ?emergencyNumber ?emergencyNumberLabel ?tel ?population ?countries WHERE {\n?emergencyNumber wdt:P31 wd:Q694554 .\nOPTIONAL{SELECT ?emergencyNumber (COUNT(?state) as ?countries) (SUM(?pop) as ?population) WHERE {\n?state wdt:P2852 ?emergencyNumber .\nOPTIONAL{?state wdt:P2046 ?pop} .\n?state wdt:P31/wdt:P279* wd:Q6256\n} GROUP BY ?emergencyNumber } .\nOPTIONAL{?emergencyNumber wdt:P1329 ?tel }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}\nORDER BY DESC(?population)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?emergencyNumber ?emergencyNumberLabel ?tel ?population ?countries WHERE {\n?emergencyNumber wdt:[property:instance of] wd:[entity:emergency telephone number] .\nOPTIONAL{SELECT ?emergencyNumber (COUNT(?state) as ?countries) (SUM(?pop) as ?population) WHERE {\n?state wdt:[property:emergency phone number] ?emergencyNumber .\nOPTIONAL{?state wdt:[property:area] ?pop} .\n?state wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:country]\n} GROUP BY ?emergencyNumber } .\nOPTIONAL{?emergencyNumber wdt:[property:phone number] ?tel }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}\nORDER BY DESC(?population)",
    "complexity": "complex"
  },
  {
    "id": "2027",
    "instruction": "List the ages of Tour de France winners.",
    "query": "SELECT ?Frantziako_Tourra ?Frantziako_TourraLabel ?urtea ?irabazle ?irabazleLabel ?adina WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?Frantziako_Tourra wdt:P31 wd:Q33881;\nwdt:P582 ?bukaera_data;\np:P1346 [ ps:P1346 ?irabazle; pq:P642 wd:Q20882667 ].\nBIND(YEAR(?bukaera_data) AS ?urtea)\n?irabazle wdt:P569 ?jaiotza_data.\nBIND((?bukaera_data - ?jaiotza_data) as ?adina_egunak)\nBIND(?adina_egunak/365.2425 AS ?adina_urteak).\nBIND(FLOOR(?adina_urteak) AS ?adina).\n}\nORDER by ASC (?urtea)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?Frantziako_Tourra ?Frantziako_TourraLabel ?urtea ?irabazle ?irabazleLabel ?adina WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?Frantziako_Tourra wdt:[property:instance of] wd:[entity:Tour de France];\nwdt:[property:end time] ?bukaera_data;\np:[property:winner] [ ps:[property:winner] ?irabazle; pq:[property:of] wd:[entity:overall winner general classification] ].\nBIND(YEAR(?bukaera_data) AS ?urtea)\n?irabazle wdt:[property:date of birth] ?jaiotza_data.\nBIND((?bukaera_data - ?jaiotza_data) as ?adina_egunak)\nBIND(?adina_egunak/365.2425 AS ?adina_urteak).\nBIND(FLOOR(?adina_urteak) AS ?adina).\n}\nORDER by ASC (?urtea)",
    "complexity": "complex"
  },
  {
    "id": "860",
    "instruction": "What is the average lifespan of people in different occupations?",
    "query": "SELECT ?occ ?occLabel ?avgAge ?avgBirthYear ?count WHERE {\n{\n# Group the people by their occupation and calculate age\nSELECT\n?occ\n(count(?p) as ?count)\n(round(avg(?birthYear)) as ?avgBirthYear)\n(avg(?deathYear - ?birthYear) as ?avgAge)\nWHERE {\n{\n# Get people with occupation + birth/death dates; combine multiple birth/death dates using avg\nSELECT\n?p\n?occ\n(avg(year(?birth)) as ?birthYear)\n(avg(year(?death)) as ?deathYear)\nWHERE {\n?p wdt:P31 wd:Q5 ;\nwdt:P106 ?occ ;\np:P569/psv:P569 [\nwikibase:timePrecision \"9\"^^xsd:integer ; # precision of at least year\nwikibase:timeValue ?birth ;\n] ;\np:P570/psv:P570 [\nwikibase:timePrecision \"9\"^^xsd:integer ; # precision of at least year\nwikibase:timeValue ?death ;\n] .\n}\nGROUP BY ?p ?occ\n}\n}\nGROUP BY ?occ\n}\nFILTER (?count > 300) # arbitrary number to weed out values with 'few' observations\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n}\nORDER BY ASC(?avgAge)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?occ ?occLabel ?avgAge ?avgBirthYear ?count WHERE {\n{\n# Group the people by their occupation and calculate age\nSELECT\n?occ\n(count(?p) as ?count)\n(round(avg(?birthYear)) as ?avgBirthYear)\n(avg(?deathYear - ?birthYear) as ?avgAge)\nWHERE {\n{\n# Get people with occupation + birth/death dates; combine multiple birth/death dates using avg\nSELECT\n?p\n?occ\n(avg(year(?birth)) as ?birthYear)\n(avg(year(?death)) as ?deathYear)\nWHERE {\n?p wdt:[property:instance of] wd:[entity:human] ;\nwdt:[property:occupation] ?occ ;\np:[property:date of birth]/psv:[property:date of birth] [\nwikibase:timePrecision \"9\"^^xsd:integer ; # precision of at least year\nwikibase:timeValue ?birth ;\n] ;\np:[property:date of death]/psv:[property:date of death] [\nwikibase:timePrecision \"9\"^^xsd:integer ; # precision of at least year\nwikibase:timeValue ?death ;\n] .\n}\nGROUP BY ?p ?occ\n}\n}\nGROUP BY ?occ\n}\nFILTER (?count > 300) # arbitrary number to weed out values with 'few' observations\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n}\nORDER BY ASC(?avgAge)",
    "complexity": "complex"
  },
  {
    "id": "1373",
    "instruction": "List families with a consistent occupation across five generations.",
    "query": "SELECT DISTINCT ?occupationLabel ?person1Label ?person2Label ?person3Label ?person4Label ?person5Label WHERE {\nwd:Q5 ^wdt:P31 ?person1, ?person2, ?person3, ?person4, ?person5.\n?person1 wdt:P22|wdt:P25 ?person2.\n?person2 wdt:P22|wdt:P25 ?person3.\n?person3 wdt:P22|wdt:P25 ?person4.\n?person4 wdt:P22|wdt:P25 ?person5.\n?occupation ^wdt:P106 ?person1, ?person2, ?person3, ?person4, ?person5.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?occupationLabel ?person1Label ?person2Label ?person3Label ?person4Label ?person5Label WHERE {\nwd:[entity:human] ^wdt:[property:instance of] ?person1, ?person2, ?person3, ?person4, ?person5.\n?person1 wdt:[property:father]|wdt:[property:mother] ?person2.\n?person2 wdt:[property:father]|wdt:[property:mother] ?person3.\n?person3 wdt:[property:father]|wdt:[property:mother] ?person4.\n?person4 wdt:[property:father]|wdt:[property:mother] ?person5.\n?occupation ^wdt:[property:occupation] ?person1, ?person2, ?person3, ?person4, ?person5.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "1903",
    "instruction": "What are the recommended units of measurement according to the SI Brochure 9th edition?",
    "query": "select\n?quantity (sample(?quantityLabel) as ?quantityLabel) (sample(?quantityDesc) as ?quantityDesc)\n?unit (sample(?unitLabel) as ?unitLabel) (sample(?unitDesc) as ?unitDesc)\n(group_concat(?unitSymbol; separator = \"; \") as ?unitSymbols)\n(sample(?unitStatus) as ?unitStatus)\nwhere {\nvalues ?source { wd:Q68977959 }\n?quantity wdt:P279+ wd:Q71550118 .\noptional { ?quantity rdfs:label ?quantityLabel . filter (lang(?quantityLabel) = \"en\") }\noptional { ?quantity schema:description ?quantityDesc . filter (lang(?quantityDesc) = \"en\") }\n?quantity p:P8111 ?quantityStatement .\n?quantityStatement prov:wasDerivedFrom [ pr:P248 ?source ] ; ps:P8111 ?unit .\noptional { ?unit rdfs:label ?unitLabel . filter (lang(?unitLabel) = \"en\") }\noptional { ?unit schema:description ?unitDesc . filter (lang(?unitDesc) = \"en\") }\noptional {\n?unit p:P5061 [ prov:wasDerivedFrom [ pr:P248 ?source ] ; ps:P5061 ?unitSymbol ] .\nfilter (lang(?unitSymbol) = \"en\")\n}\noptional { ?quantityStatement a ?bestRank . }\nbind (if(bound(?bestRank) && ?bestRank = wikibase:BestRank, \"<recommended>\", \"<accepted>\") as ?unitStatus)\n} group by ?quantity ?unit",
    "annotated": "PREFIX prov: <http://www.w3.org/ns/prov#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pr: <http://www.wikidata.org/prop/reference/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nselect\n?quantity (sample(?quantityLabel) as ?quantityLabel) (sample(?quantityDesc) as ?quantityDesc)\n?unit (sample(?unitLabel) as ?unitLabel) (sample(?unitDesc) as ?unitDesc)\n(group_concat(?unitSymbol; separator = \"; \") as ?unitSymbols)\n(sample(?unitStatus) as ?unitStatus)\nwhere {\nvalues ?source { wd:[entity:SI Brochure (9th edition): Concise summary] }\n?quantity wdt:[property:subclass of]+ wd:[entity:individual quantity] .\noptional { ?quantity rdfs:label ?quantityLabel . filter (lang(?quantityLabel) = \"en\") }\noptional { ?quantity schema:description ?quantityDesc . filter (lang(?quantityDesc) = \"en\") }\n?quantity p:[property:recommended unit of measurement] ?quantityStatement .\n?quantityStatement prov:wasDerivedFrom [ pr:[property:stated in] ?source ] ; ps:[property:recommended unit of measurement] ?unit .\noptional { ?unit rdfs:label ?unitLabel . filter (lang(?unitLabel) = \"en\") }\noptional { ?unit schema:description ?unitDesc . filter (lang(?unitDesc) = \"en\") }\noptional {\n?unit p:[property:unit symbol] [ prov:wasDerivedFrom [ pr:[property:stated in] ?source ] ; ps:[property:unit symbol] ?unitSymbol ] .\nfilter (lang(?unitSymbol) = \"en\")\n}\noptional { ?quantityStatement a ?bestRank . }\nbind (if(bound(?bestRank) && ?bestRank = wikibase:BestRank, \"<recommended>\", \"<accepted>\") as ?unitStatus)\n} group by ?quantity ?unit",
    "complexity": "complex"
  },
  {
    "id": "133",
    "instruction": "What are the administrative divisions of each country?",
    "query": "SELECT ?countryLabel ?divisiontype ?divisiontypeLabel (COUNT(?division) AS ?total) (COUNT(?bordered) AS ?with_borders) WHERE {\n?division wdt:P31 ?divisiontype.\n?divisiontype wdt:P279 wd:Q10864048;\nwdt:P17 ?country.\nOPTIONAL {?division wdt:P47 ?bordered. ?bordered wdt:P31 ?divisiontype}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} GROUP BY ?countryLabel ?divisiontype ?divisiontypeLabel\nORDER BY ?countryLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?countryLabel ?divisiontype ?divisiontypeLabel (COUNT(?division) AS ?total) (COUNT(?bordered) AS ?with_borders) WHERE {\n?division wdt:[property:instance of] ?divisiontype.\n?divisiontype wdt:[property:subclass of] wd:[entity:first-level administrative division];\nwdt:[property:country] ?country.\nOPTIONAL {?division wdt:[property:shares border with] ?bordered. ?bordered wdt:[property:instance of] ?divisiontype}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} GROUP BY ?countryLabel ?divisiontype ?divisiontypeLabel\nORDER BY ?countryLabel",
    "complexity": "complex"
  },
  {
    "id": "995",
    "instruction": "What are the closest pairs of capitals from UN member states within 500km?",
    "query": "SELECT DISTINCT ?country1Label ?capital1Label ?country2Label ?capital2Label ?distance WHERE {\n{\nSELECT ?country1 ?capital1 ?country2 ?capital2 ?distance WHERE {\n?country1 wdt:P31 wd:Q160016 .\nFILTER NOT EXISTS { ?country1 wdt:P576 ?x }\n?country1 wdt:P36 ?capital1 .\n?capital1 wdt:P625 ?coords1 .\n?country2 wdt:P31 wd:Q160016 .\nFILTER NOT EXISTS { ?country2 wdt:P576 ?x }\n?country2 wdt:P36 ?capital2 .\n?capital2 wdt:P625 ?coords2 .\nFILTER(xsd:string(?country1) < xsd:string(?country2))\nBIND(ROUND(geof:distance(?coords1, ?coords2)) AS ?distance) .\nFILTER (?distance<500)\n}\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n}\nORDER BY ?distance",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?country1Label ?capital1Label ?country2Label ?capital2Label ?distance WHERE {\n{\nSELECT ?country1 ?capital1 ?country2 ?capital2 ?distance WHERE {\n?country1 wdt:[property:instance of] wd:[entity:member states of the United Nations] .\nFILTER NOT EXISTS { ?country1 wdt:[property:dissolved, abolished or demolished date] ?x }\n?country1 wdt:[property:capital] ?capital1 .\n?capital1 wdt:[property:coordinate location] ?coords1 .\n?country2 wdt:[property:instance of] wd:[entity:member states of the United Nations] .\nFILTER NOT EXISTS { ?country2 wdt:[property:dissolved, abolished or demolished date] ?x }\n?country2 wdt:[property:capital] ?capital2 .\n?capital2 wdt:[property:coordinate location] ?coords2 .\nFILTER(xsd:string(?country1) < xsd:string(?country2))\nBIND(ROUND(geof:distance(?coords1, ?coords2)) AS ?distance) .\nFILTER (?distance<500)\n}\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n}\nORDER BY ?distance",
    "complexity": "complex"
  },
  {
    "id": "1309",
    "instruction": "Show a scatter plot of river lengths against their watershed areas.",
    "query": "SELECT ?river (SAMPLE(?length) AS ?length) (SAMPLE(?area) AS ?area) ?riverLabel WHERE {\n?river wdt:P31/wdt:P279* wd:Q355304;\np:P2043/psn:P2043/(wikibase:quantityAmount|wikibase\u03b2:quantityAmount) ?lengthInMetres;\np:P2053/psn:P2053/(wikibase:quantityAmount|wikibase\u03b2:quantityAmount) ?areaInSquareMetres.\nBIND(?lengthInMetres / 1000 AS ?length).\nBIND(?areaInSquareMetres / 1000000 AS ?area).\nFILTER(?length > 500).\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nGROUP BY ?river ?riverLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psn: <http://www.wikidata.org/prop/statement/value-normalized/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\nPREFIX wikibase\u03b2: <http://wikiba.se/ontology-beta#>\n\nSELECT ?river (SAMPLE(?length) AS ?length) (SAMPLE(?area) AS ?area) ?riverLabel WHERE {\n?river wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:watercourse];\np:[property:length]/psn:[property:length]/(wikibase:quantityAmount|wikibase\u03b2:quantityAmount) ?lengthInMetres;\np:[property:watershed area]/psn:[property:watershed area]/(wikibase:quantityAmount|wikibase\u03b2:quantityAmount) ?areaInSquareMetres.\nBIND(?lengthInMetres / 1000 AS ?length).\nBIND(?areaInSquareMetres / 1000000 AS ?area).\nFILTER(?length > 500).\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nGROUP BY ?river ?riverLabel",
    "complexity": "complex"
  },
  {
    "id": "257",
    "instruction": "What are the figurines in Ashmolean Museum?",
    "query": "SELECT ?item ?itemLabel ?inventory (YEAR(?earliest) AS ?from) (YEAR(?latest) AS ?to) WHERE {\n?item p:P195 [ps:P195 wd:Q636400; pq:P217 ?inventory].\n?item wdt:P31 wd:Q1066288; wdt:P973 ?url FILTER (STRSTARTS(STR(?url),\"http://jameelcentre\") ).\nOPTIONAL {?item p:P571 [pq:P1319 ?earliest; pq:P1326 ?latest] }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" .\n?item rdfs:label ?itemLabel }\n} ORDER BY ?from ?to ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?inventory (YEAR(?earliest) AS ?from) (YEAR(?latest) AS ?to) WHERE {\n?item p:[property:collection] [ps:[property:collection] wd:[entity:Ashmolean Museum]; pq:[property:inventory number] ?inventory].\n?item wdt:[property:instance of] wd:[entity:figurine]; wdt:[property:described at URL] ?url FILTER (STRSTARTS(STR(?url),\"http://jameelcentre\") ).\nOPTIONAL {?item p:[property:inception] [pq:[property:earliest date] ?earliest; pq:[property:latest date] ?latest] }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" .\n?item rdfs:label ?itemLabel }\n} ORDER BY ?from ?to ?itemLabel",
    "complexity": "complex"
  },
  {
    "id": "52",
    "instruction": "Find papers available online at eprints.whiterose.ac.uk without any content deliverer information.",
    "query": "SELECT ?item ?itemLabel WHERE {\n?item p:P953 ?s. ?s ps:P953 ?url FILTER (CONTAINS( STR(?url), \"eprints.whiterose.ac.uk\") )\nMINUS {?s pq:P3274 wd:Q24753667 }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel WHERE {\n?item p:[property:full work available at URL] ?s. ?s ps:[property:full work available at URL] ?url FILTER (CONTAINS( STR(?url), \"eprints.whiterose.ac.uk\") )\nMINUS {?s pq:[property:content deliverer] wd:[entity:White Rose Research Online] }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "293",
    "instruction": "List all astrolabes with their collection and creator information.",
    "query": "SELECT ?collectionLabel ?inv ?url ?creatorLabel WHERE {\n?item wdt:P31/wdt:P361? wd:Q164992.\n?item wdt:P195 ?collection; wdt:P217 ?inv.\nOPTIONAL{?item wdt:P170 ?creator}\nOPTIONAL {?item wdt:P973 ?url}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY ?creatorLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?collectionLabel ?inv ?url ?creatorLabel WHERE {\n?item wdt:[property:instance of]/wdt:[property:part of]? wd:[entity:astrolabe].\n?item wdt:[property:collection] ?collection; wdt:[property:inventory number] ?inv.\nOPTIONAL{?item wdt:[property:creator] ?creator}\nOPTIONAL {?item wdt:[property:described at URL] ?url}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY ?creatorLabel",
    "complexity": "complex"
  }
]