[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "1085",
    "instruction": "List the older siblings who died within a month before their younger sibling took office.",
    "query": "SELECT DISTINCT ?olderSibling ?olderSiblingLabel ?dateOfDeath ?youngerSiblingLabel ?startTime ?positionLabel WHERE {\n?olderSibling wdt:P31 wd:Q5;\nwdt:P569 ?dateOfBirth1;\nwdt:P570 ?dateOfDeath;\nwdt:P3373 ?youngerSibling.\n?youngerSibling wdt:P31 wd:Q5;\nwdt:P569 ?dateOfBirth2;\np:P39 [\nps:P39 ?position;\npq:P580 ?startTime\n].\nFILTER(?dateOfBirth1 < ?dateOfBirth2)\nFILTER(?dateOfDeath < ?startTime && (?startTime - \"P1M\"^^xsd:duration) < ?dateOfDeath)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY ASC(?startTime - ?dateOfDeath) ?startTime",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?olderSibling ?olderSiblingLabel ?dateOfDeath ?youngerSiblingLabel ?startTime ?positionLabel WHERE {\n?olderSibling wdt:[property:instance of] wd:[entity:human];\nwdt:[property:date of birth] ?dateOfBirth1;\nwdt:[property:date of death] ?dateOfDeath;\nwdt:[property:sibling] ?youngerSibling.\n?youngerSibling wdt:[property:instance of] wd:[entity:human];\nwdt:[property:date of birth] ?dateOfBirth2;\np:[property:position held] [\nps:[property:position held] ?position;\npq:[property:start time] ?startTime\n].\nFILTER(?dateOfBirth1 < ?dateOfBirth2)\nFILTER(?dateOfDeath < ?startTime && (?startTime - \"P1M\"^^xsd:duration) < ?dateOfDeath)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY ASC(?startTime - ?dateOfDeath) ?startTime",
    "complexity": "complex"
  },
  {
    "id": "1653",
    "instruction": "List all characters who died in Game of Thrones.",
    "query": "SELECT ?character ?characterLabel ?imgself ?imgactor ?killerLabel ?methodLabel ?genusLabel ?placeLabel ?episodeLabel WHERE {\n?character wdt:P1080 wd:Q2461698.\nOPTIONAL { ?character wdt:P509 ?method. }\nOPTIONAL { ?character wdt:P157 ?killer. }\nOPTIONAL { ?character wdt:P175 ?actor.\n?actor wdt:P18 ?imgactor.}\nOPTIONAL {?character wdt:P18 ?imgself.}\n?character p:P1196 ?statement.\n?statement ps:P1196 ?genus.\nOPTIONAL {?character wdt:P20 ?place}\nOPTIONAL {?statement prov:wasDerivedFrom [ pr:P248 ?episode ].}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,[AUTO_LANGUAGE],en\". }\n}\nORDER BY ?dod",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX prov: <http://www.w3.org/ns/prov#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pr: <http://www.wikidata.org/prop/reference/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?character ?characterLabel ?imgself ?imgactor ?killerLabel ?methodLabel ?genusLabel ?placeLabel ?episodeLabel WHERE {\n?character wdt:[property:from narrative universe] wd:[entity:World of Ice and Fire].\nOPTIONAL { ?character wdt:[property:cause of death] ?method. }\nOPTIONAL { ?character wdt:[property:killed by] ?killer. }\nOPTIONAL { ?character wdt:[property:performer] ?actor.\n?actor wdt:[property:image] ?imgactor.}\nOPTIONAL {?character wdt:[property:image] ?imgself.}\n?character p:[property:manner of death] ?statement.\n?statement ps:[property:manner of death] ?genus.\nOPTIONAL {?character wdt:[property:place of death] ?place}\nOPTIONAL {?statement prov:wasDerivedFrom [ pr:[property:stated in] ?episode ].}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,[AUTO_LANGUAGE],en\". }\n}\nORDER BY ?dod",
    "complexity": "complex"
  },
  {
    "id": "1606",
    "instruction": "List the fields of work of Austrian scientists with an ORCID ID.",
    "query": "SELECT DISTINCT ?researcharea ?researchareaLabel (count(?scientist) AS ?count) WHERE {\n{\n{\nSELECT * WHERE { #Scientists born in Austria\n?scientist wdt:P496 ?oricd.\n?scientist wdt:P19 ?geburtsort.\n?geburtsort wdt:P17 wd:Q40.\n?scientist wdt:P101 ?researcharea.\n}\n}\n}\nUNION\n{\n{\nSELECT * WHERE { #Scientists with Austrian citizenship\n?scientist wdt:P496 ?oricd.\n?scientist wdt:P27 wd:Q40.\n?scientist wdt:P101 ?researcharea.\n?scientist wdt:P101 ?researcharea.\n}\n}\n}\nUNION\n{\n{\nSELECT * WHERE { #Scientists with Austrian employer\n?scientist wdt:P496 ?oricd.\n?scientist wdt:P108 ?employer.\n?employer wdt:P17 wd:Q40.\n?scientist wdt:P101 ?researcharea.\n}\n}\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\ngroup by ?researcharea ?researchareaLabel\nORDER BY DESC((count(?scientist)))",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?researcharea ?researchareaLabel (count(?scientist) AS ?count) WHERE {\n{\n{\nSELECT * WHERE { #Scientists born in Austria\n?scientist wdt:[property:ORCID iD] ?oricd.\n?scientist wdt:[property:place of birth] ?geburtsort.\n?geburtsort wdt:[property:country] wd:[entity:Austria].\n?scientist wdt:[property:field of work] ?researcharea.\n}\n}\n}\nUNION\n{\n{\nSELECT * WHERE { #Scientists with Austrian citizenship\n?scientist wdt:[property:ORCID iD] ?oricd.\n?scientist wdt:[property:country of citizenship] wd:[entity:Austria].\n?scientist wdt:[property:field of work] ?researcharea.\n?scientist wdt:[property:field of work] ?researcharea.\n}\n}\n}\nUNION\n{\n{\nSELECT * WHERE { #Scientists with Austrian employer\n?scientist wdt:[property:ORCID iD] ?oricd.\n?scientist wdt:[property:employer] ?employer.\n?employer wdt:[property:country] wd:[entity:Austria].\n?scientist wdt:[property:field of work] ?researcharea.\n}\n}\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\ngroup by ?researcharea ?researchareaLabel\nORDER BY DESC((count(?scientist)))",
    "complexity": "complex"
  },
  {
    "id": "2024",
    "instruction": "List the municipalities in Spain and France that are sister cities with Basque Country.",
    "query": "SELECT DISTINCT * WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n{ ?item wdt:P31 wd:Q2074737. }\nUNION\n{ ?item wdt:P31 wd:Q484170. }\n?item (wdt:P131/(wdt:P131*)/^wdt:P527) wd:Q47588.\n?item wdt:P190 ?hiri_senidetuak.\n?item wdt:P625 ?coord1.\n?hiri_senidetuak wdt:P625 ?coord2.\n?item p:P625 [ ps:P625 []; psv:P625 [ wikibase:geoLongitude ?coord1lon; wikibase:geoLatitude ?coord1lat; ] ].\n?hiri_senidetuak p:P625 [ ps:P625 []; psv:P625 [ wikibase:geoLongitude ?coord2lon; wikibase:geoLatitude ?coord2lat; ] ].\nBIND(CONCAT('LINESTRING (', STR(?coord1lon), ' ', STR(?coord1lat), ',', STR(?coord2lon), ' ', STR(?coord2lat), ')') AS ?str) .\nBIND(STRDT(?str, geo:wktLiteral) AS ?line)\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT * WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n{ ?item wdt:[property:instance of] wd:[entity:municipality of Spain]. }\nUNION\n{ ?item wdt:[property:instance of] wd:[entity:commune of France]. }\n?item (wdt:[property:located in the administrative territorial entity]/(wdt:[property:located in the administrative territorial entity]*)/^wdt:[property:has part(s)]) wd:[entity:Basque Country].\n?item wdt:[property:twinned administrative body] ?hiri_senidetuak.\n?item wdt:[property:coordinate location] ?coord1.\n?hiri_senidetuak wdt:[property:coordinate location] ?coord2.\n?item p:[property:coordinate location] [ ps:[property:coordinate location] []; psv:[property:coordinate location] [ wikibase:geoLongitude ?coord1lon; wikibase:geoLatitude ?coord1lat; ] ].\n?hiri_senidetuak p:[property:coordinate location] [ ps:[property:coordinate location] []; psv:[property:coordinate location] [ wikibase:geoLongitude ?coord2lon; wikibase:geoLatitude ?coord2lat; ] ].\nBIND(CONCAT('LINESTRING (', STR(?coord1lon), ' ', STR(?coord1lat), ',', STR(?coord2lon), ' ', STR(?coord2lat), ')') AS ?str) .\nBIND(STRDT(?str, geo:wktLiteral) AS ?line)\n}",
    "complexity": "complex"
  },
  {
    "id": "228",
    "instruction": "What are the most notable manuscripts and their collections?",
    "query": "SELECT ?q ?qLabel (GROUP_CONCAT(DISTINCT ?collectionLabel; separator=\"; \") AS ?where) ?enwp (GROUP_CONCAT(DISTINCT ?langLabel; separator=\", \") AS ?languages) ?linkcount\nWHERE { {SELECT ?q (COUNT(?sitelink) AS ?linkcount) WHERE { ?q (wdt:P31/wdt:P279*) wd:Q87167. ?sitelink schema:about ?q }\nGROUP BY ?q }\n?q p:P195 ?s. ?s ps:P195 ?collection . MINUS {?s pq:P582 []}.\nMINUS {?s ps:P195 wd:Q1322278 }\nOPTIONAL{ ?q wdt:P407 ?lang }\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\".\n?q rdfs:label ?qLabel. ?collection rdfs:label ?collectionLabel . ?lang rdfs:label ?langLabel\n}\nOPTIONAL{?enwp schema:about ?q ; schema:isPartOf <https://en.wikipedia.org/> }\n# other props: inventory number; part of ; full work (P953); Commons cat; described at (P973)\n}\nGROUP BY ?q ?qLabel ?enwp ?linkcount\nORDER BY DESC(?linkcount)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?q ?qLabel (GROUP_CONCAT(DISTINCT ?collectionLabel; separator=\"; \") AS ?where) ?enwp (GROUP_CONCAT(DISTINCT ?langLabel; separator=\", \") AS ?languages) ?linkcount\nWHERE { {SELECT ?q (COUNT(?sitelink) AS ?linkcount) WHERE { ?q (wdt:[property:instance of]/wdt:[property:subclass of]*) wd:[entity:manuscript]. ?sitelink schema:about ?q }\nGROUP BY ?q }\n?q p:[property:collection] ?s. ?s ps:[property:collection] ?collection . MINUS {?s pq:[property:end time] []}.\nMINUS {?s ps:[property:collection] wd:[entity:Matenadaran] }\nOPTIONAL{ ?q wdt:[property:language of work or name] ?lang }\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\".\n?q rdfs:label ?qLabel. ?collection rdfs:label ?collectionLabel . ?lang rdfs:label ?langLabel\n}\nOPTIONAL{?enwp schema:about ?q ; schema:isPartOf <https://en.wikipedia.org/> }\n# other props: inventory number; part of ; full work (P953); Commons cat; described at (P973)\n}\nGROUP BY ?q ?qLabel ?enwp ?linkcount\nORDER BY DESC(?linkcount)",
    "complexity": "complex"
  },
  {
    "id": "1228",
    "instruction": "List the places on Mars and Moon named after Nobel Prize winners.",
    "query": "SELECT DISTINCT (sample(?place) as ?place) (sample(?img) as ?img) ?placeLabel ?motivation ?article ?NobelArticle WHERE {\n?laureate wdt:P2888 ?laureate_nobel_uri .\nFILTER (strStarts(str(?laureate_nobel_uri), \"http://data.nobelprize.org/resource/laureate/\"))\n{\n{?place wdt:P376 wd:Q111} #Mars\nUNION\n{?place wdt:P376 wd:Q405} #Moon\n}\n?place wdt:P138 ?laureate .\n# ?place wdt:P625 ?geo .\n?place wdt:P18 ?img.\nOPTIONAL {?article schema:about ?laureate .\n?article schema:isPartOf <https://en.wikipedia.org/>}\nOPTIONAL{?laureate wdt:P3188 ?Na}\nBIND (URI(CONCAT(\"https://www.nobelprize.org/nobel_prizes/\",?Na,\"-facts.html\")) AS ?NobelArticle)\nSERVICE <http://data.nobelprize.org/sparql> {\n?laureate_nobel_uri nobel:laureateAward / nobel:motivation ?motivation .\nFILTER (lang(?motivation) = 'en')\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,de,da,nl\". }\n} Group by ?placeLabel ?motivation ?article ?NobelArticle",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\nPREFIX nobel: <http://data.nobelprize.org/terms/>\n\nSELECT DISTINCT (sample(?place) as ?place) (sample(?img) as ?img) ?placeLabel ?motivation ?article ?NobelArticle WHERE {\n?laureate wdt:[property:exact match] ?laureate_nobel_uri .\nFILTER (strStarts(str(?laureate_nobel_uri), \"http://data.nobelprize.org/resource/laureate/\"))\n{\n{?place wdt:[property:located on astronomical body] wd:[entity:Mars]} #Mars\nUNION\n{?place wdt:[property:located on astronomical body] wd:[entity:Moon]} #Moon\n}\n?place wdt:[property:named after] ?laureate .\n# ?place wdt:[property:coordinate location] ?geo .\n?place wdt:[property:image] ?img.\nOPTIONAL {?article schema:about ?laureate .\n?article schema:isPartOf <https://en.wikipedia.org/>}\nOPTIONAL{?laureate wdt:[property:P3188] ?Na}\nBIND (URI(CONCAT(\"https://www.nobelprize.org/nobel_prizes/\",?Na,\"-facts.html\")) AS ?NobelArticle)\nSERVICE <http://data.nobelprize.org/sparql> {\n?laureate_nobel_uri nobel:laureateAward / nobel:motivation ?motivation .\nFILTER (lang(?motivation) = 'en')\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,de,da,nl\". }\n} Group by ?placeLabel ?motivation ?article ?NobelArticle",
    "complexity": "complex"
  },
  {
    "id": "1768",
    "instruction": "List all episodes of Detective Conan's Case Closed, including their publication dates and places.",
    "query": "SELECT ?tv_episode ?tv_episodeLabel ?ja_title ?romaji ?date ?placeLabel ?seasonLabel ?series WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?tv_episode wdt:P31 wd:Q21191270;\nwdt:P179 wd:Q5363072.\nOPTIONAL {\n?tv_episode p:P1476 ?title.\n?title ps:P1476 ?ja_title;\npq:P2125 ?romaji.\n}\nOPTIONAL {\n?tv_episode p:P577 ?publication_date_node.\n?publication_date_node ps:P577 ?date;\npq:P291 ?place.\n}\nOPTIONAL {\n?tv_episode p:P179 ?qual.\n?qual pq:P1545 ?series.\n}\nOPTIONAL { ?tv_episode wdt:P4908 ?season. }\n}\nORDER BY ?date",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?tv_episode ?tv_episodeLabel ?ja_title ?romaji ?date ?placeLabel ?seasonLabel ?series WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?tv_episode wdt:[property:instance of] wd:[entity:television series episode];\nwdt:[property:part of the series] wd:[entity:Case Closed].\nOPTIONAL {\n?tv_episode p:[property:title] ?title.\n?title ps:[property:title] ?ja_title;\npq:[property:Revised Hepburn romanization] ?romaji.\n}\nOPTIONAL {\n?tv_episode p:[property:publication date] ?publication_date_node.\n?publication_date_node ps:[property:publication date] ?date;\npq:[property:place of publication] ?place.\n}\nOPTIONAL {\n?tv_episode p:[property:part of the series] ?qual.\n?qual pq:[property:series ordinal] ?series.\n}\nOPTIONAL { ?tv_episode wdt:[property:season] ?season. }\n}\nORDER BY ?date",
    "complexity": "complex"
  },
  {
    "id": "1151",
    "instruction": "Show me the Milano metro stations on a map with their opening dates.",
    "query": "SELECT ?item ?itemLabel ?coord ?image ?minDate ?dateBin\nWHERE {\nBIND(\nIF((YEAR(?minDate)) < 1970, \"< 1970\",\nIF((YEAR(?minDate)) < 1980, \"1970 - 1979\",\nIF((YEAR(?minDate)) < 1990, \"1980 - 1989\",\nIF((YEAR(?minDate)) < 2000, \"1990 - 1999\",\nIF((YEAR(?minDate)) < 2010, \"2000 - 2009\",\n\"2010+\")))))\nAS ?dateBin)\n{\nSELECT ?item (MIN(?date) AS ?minDate) ?coord ?image WHERE {\n?item wdt:P361 wd:Q735559.\n?item wdt:P625 ?coord.\nOPTIONAL { ?item wdt:P18 ?image. }\nOPTIONAL { ?item wdt:P1619 ?d1. }\nOPTIONAL { ?item wdt:P571 ?d2. }\nBIND(IF(BOUND(?d1), ?d1, ?d2) AS ?date)\n}\nGROUP BY ?item ?coord ?image\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY ?minDate",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?coord ?image ?minDate ?dateBin\nWHERE {\nBIND(\nIF((YEAR(?minDate)) < 1970, \"< 1970\",\nIF((YEAR(?minDate)) < 1980, \"1970 - 1979\",\nIF((YEAR(?minDate)) < 1990, \"1980 - 1989\",\nIF((YEAR(?minDate)) < 2000, \"1990 - 1999\",\nIF((YEAR(?minDate)) < 2010, \"2000 - 2009\",\n\"2010+\")))))\nAS ?dateBin)\n{\nSELECT ?item (MIN(?date) AS ?minDate) ?coord ?image WHERE {\n?item wdt:[property:part of] wd:[entity:Milan Metro].\n?item wdt:[property:coordinate location] ?coord.\nOPTIONAL { ?item wdt:[property:image] ?image. }\nOPTIONAL { ?item wdt:[property:date of official opening] ?d1. }\nOPTIONAL { ?item wdt:[property:inception] ?d2. }\nBIND(IF(BOUND(?d1), ?d1, ?d2) AS ?date)\n}\nGROUP BY ?item ?coord ?image\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY ?minDate",
    "complexity": "complex"
  },
  {
    "id": "2544",
    "instruction": "List all objects related to Aurangzeb.",
    "query": "SELECT ?from ?fromLabel ?image1 ?to ?toLabel ?image2 ?edgeLabel\nWITH {\nSELECT ?start ?startimage ?image1 ?from ?prop ?coll WHERE {\nVALUES ?start {wd:Q485547 }. # Choose person to start with\n?start wdt:P18 ?startimage.\n?from ?rel ?start; wdt:P195 ?coll.\n?prop wikibase:directClaim ?rel ; a wikibase:Property.\nOPTIONAL {?from wdt:P18 ?image1}.\n} } as %core\nWHERE {\n{\nSELECT ?from ?image1 (?start AS ?to) (?startimage AS ?image2) (?prop AS ?edge) WHERE {\nINCLUDE %core.\n} ORDER BY ?coll # put objects from the same collection close together\n}\nUNION {\nSELECT ?from ?image1 (?coll AS ?to) ?image2 (wd:P195 AS ?edge) WHERE {\nINCLUDE %core.\nOPTIONAL {?coll wdt:P18 ?image2}.\n}\n} #UNION {\n# SELECT ?from ?image1 (?type AS ?to) (\"\" AS ?image2) (wd:P31 AS ?edge) WHERE {\n# INCLUDE %core.\n# ?from wdt:P31 ?type.\n# }\n#}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\".\n?from rdfs:label ?fromLabel. ?edge rdfs:label ?edgeLabel. ?to rdfs:label ?toLabel}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?from ?fromLabel ?image1 ?to ?toLabel ?image2 ?edgeLabel\nWITH {\nSELECT ?start ?startimage ?image1 ?from ?prop ?coll WHERE {\nVALUES ?start {wd:[entity:Aurangzeb] }. # Choose person to start with\n?start wdt:[property:image] ?startimage.\n?from ?rel ?start; wdt:[property:collection] ?coll.\n?prop wikibase:directClaim ?rel ; a wikibase:Property.\nOPTIONAL {?from wdt:[property:image] ?image1}.\n} } as %core\nWHERE {\n{\nSELECT ?from ?image1 (?start AS ?to) (?startimage AS ?image2) (?prop AS ?edge) WHERE {\nINCLUDE %core.\n} ORDER BY ?coll # put objects from the same collection close together\n}\nUNION {\nSELECT ?from ?image1 (?coll AS ?to) ?image2 (wd:[property:collection] AS ?edge) WHERE {\nINCLUDE %core.\nOPTIONAL {?coll wdt:[property:image] ?image2}.\n}\n} #UNION {\n# SELECT ?from ?image1 (?type AS ?to) (\"\" AS ?image2) (wd:[property:instance of] AS ?edge) WHERE {\n# INCLUDE %core.\n# ?from wdt:[property:instance of] ?type.\n# }\n#}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\".\n?from rdfs:label ?fromLabel. ?edge rdfs:label ?edgeLabel. ?to rdfs:label ?toLabel}\n}",
    "complexity": "complex"
  },
  {
    "id": "36",
    "instruction": "What are the recent publications by University of Oxford staff?",
    "query": "SELECT DISTINCT ?authorLabel ?publication ?publicationLabel ?date\nWHERE {\n{ ?author wdt:P108 wd:Q34433 } # Listed as employees of the university\nUNION { {?college wdt:P31 wd:Q2581649 } UNION { ?college wdt:P31 wd:Q3338504 }.\n?author wdt:P108 ?college } # Listed as employees of a college or hall\nMINUS{ ?author wdt:P570 ?date } # No death date\n?publication wdt:P50 ?author\nOPTIONAL { ?publication wdt:P577 ?date }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} ORDER BY DESC(?date)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?authorLabel ?publication ?publicationLabel ?date\nWHERE {\n{ ?author wdt:[property:employer] wd:[entity:University of Oxford] } # Listed as employees of the university\nUNION { {?college wdt:[property:instance of] wd:[entity:college of the University of Oxford] } UNION { ?college wdt:[property:instance of] wd:[entity:Permanent Private Hall] }.\n?author wdt:[property:employer] ?college } # Listed as employees of a college or hall\nMINUS{ ?author wdt:[property:date of death] ?date } # No death date\n?publication wdt:[property:author] ?author\nOPTIONAL { ?publication wdt:[property:publication date] ?date }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} ORDER BY DESC(?date)",
    "complexity": "complex"
  },
  {
    "id": "2149",
    "instruction": "List the occupations with the highest number of COVID-19 cases.",
    "query": "SELECT ?occupationLabel (COUNT(DISTINCT ?person) as ?count) WHERE {\n{?person wdt:P509 wd:Q84263196} # died of COVID-19\nUNION\n{?person wdt:P1050 wd:Q84263196} # diagnosed with COVID-19\n?person wdt:P106 ?occupation\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?occupationLabel\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?occupationLabel (COUNT(DISTINCT ?person) as ?count) WHERE {\n{?person wdt:[property:cause of death] wd:[entity:COVID-19]} # died of COVID-19\nUNION\n{?person wdt:[property:medical condition] wd:[entity:COVID-19]} # diagnosed with COVID-19\n?person wdt:[property:occupation] ?occupation\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?occupationLabel\nORDER BY DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "598",
    "instruction": "What are the interaction types in Wikipathways for a pathway with Identifier WP716?",
    "query": "SELECT DISTINCT ?interaction_type WHERE {\nVALUES ?wpid {\"WP716\"}\n?item wdt:P2410 ?wpid ;\nwdt:P2888 ?source_pathway .\nSERVICE <http://sparql.wikipathways.org/sparql> {\n?wp_pathway dc:identifier ?source_pathway .\n?s dcterms:isPartOf ?wp_pathway, ?interaction .\n?interaction rdf:type wp:Interaction .\n?interaction rdf:type ?interaction_type .\n?interaction wp:participants ?participants .\n}\n}",
    "annotated": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wp: <http://vocabularies.wikipathways.org/wp#>\nPREFIX dcterms: <http://purl.org/dc/terms/>\n\nSELECT DISTINCT ?interaction_type WHERE {\nVALUES ?wpid {\"WP716\"}\n?item wdt:[property:WikiPathways ID] ?wpid ;\nwdt:[property:exact match] ?source_pathway .\nSERVICE <http://sparql.wikipathways.org/sparql> {\n?wp_pathway dc:identifier ?source_pathway .\n?s dcterms:isPartOf ?wp_pathway, ?interaction .\n?interaction rdf:type wp:Interaction .\n?interaction rdf:type ?interaction_type .\n?interaction wp:participants ?participants .\n}\n}",
    "complexity": "complex"
  },
  {
    "id": "1888",
    "instruction": "What is the average stardate of all Star Trek episodes?",
    "query": "SELECT (AVG($stardate) as $average_stardate)\nWHERE\n{\n#star trek films\n{?item wdt:P31 wd:Q61283808.}\nUNION\n{?startrek wdt:P31 wd:Q62573441. #all star trek series\n?item wdt:P179 ?startrek.} #members of star trek series\n?item wdt:P1191 ?date. #get broadcast date (will create dupes if displayed)\n?item p:P840 [ pq:P4895 ?stardate ].\nMINUS { ?item wdt:P31 wd:Q21664088. } #exclude two parter entries\nOPTIONAL {?item wdt:P2047 ?duration.} #allow no durations to examine furtherdown\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?date)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT (AVG($stardate) as $average_stardate)\nWHERE\n{\n#star trek films\n{?item wdt:[property:instance of] wd:[entity:Star Trek film].}\nUNION\n{?startrek wdt:[property:instance of] wd:[entity:Star Trek series]. #all star trek series\n?item wdt:[property:part of the series] ?startrek.} #members of star trek series\n?item wdt:[property:date of first performance] ?date. #get broadcast date (will create dupes if displayed)\n?item p:[property:narrative location] [ pq:[property:time index] ?stardate ].\nMINUS { ?item wdt:[property:instance of] wd:[entity:two-part episode]. } #exclude two parter entries\nOPTIONAL {?item wdt:[property:duration] ?duration.} #allow no durations to examine furtherdown\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?date)",
    "complexity": "complex"
  },
  {
    "id": "2058",
    "instruction": "List the number of COVID-19 deaths for each month.",
    "query": "SELECT ?month ?year (count(*) as ?count) WHERE {\n?item wdt:P31 wd:Q5.\n?item (p:P570/psv:P570) ?timenode0.\n?timenode0 wikibase:timeValue ?time0.\n?timenode0 wikibase:timePrecision ?timeprecision0.\nFILTER('2019-01-01'^^xsd:dateTime <= ?time0 && ?time0 < '2021-12-31'^^xsd:dateTime).\nFILTER(?timeprecision0>=8)\n?item wdt:P570 ?time.\n?item wdt:P509 wd:Q84263196.\nbind(month(?time0) as ?month)\nbind(year(?time0) as ?year)\n}\ngroup by ?month ?year",
    "annotated": "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?month ?year (count(*) as ?count) WHERE {\n?item wdt:[property:instance of] wd:[entity:human].\n?item (p:[property:date of death]/psv:[property:date of death]) ?timenode0.\n?timenode0 wikibase:timeValue ?time0.\n?timenode0 wikibase:timePrecision ?timeprecision0.\nFILTER('2019-01-01'^^xsd:dateTime <= ?time0 && ?time0 < '2021-12-31'^^xsd:dateTime).\nFILTER(?timeprecision0>=8)\n?item wdt:[property:date of death] ?time.\n?item wdt:[property:cause of death] wd:[entity:COVID-19].\nbind(month(?time0) as ?month)\nbind(year(?time0) as ?year)\n}\ngroup by ?month ?year",
    "complexity": "complex"
  },
  {
    "id": "1173",
    "instruction": "List all Danish female athletes.",
    "query": "select ?count ?human ?humanLabel ?humanDescription\nWITH {\nSELECT ?human (COUNT(DISTINCT ?article) AS ?count) WHERE {\n?human wdt:P27 wd:Q35 .\n?human wdt:P106 / wdt:P279* wd:Q2066131 .\n?human wdt:P21 wd:Q6581072.\n?article schema:about ?human .\n}\nGROUP BY ?human\n} AS %results\nWHERE {\nINCLUDE %results\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"da,en\". }\n}\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nselect ?count ?human ?humanLabel ?humanDescription\nWITH {\nSELECT ?human (COUNT(DISTINCT ?article) AS ?count) WHERE {\n?human wdt:[property:country of citizenship] wd:[entity:Denmark] .\n?human wdt:[property:occupation] / wdt:[property:subclass of]* wd:[entity:athlete] .\n?human wdt:[property:sex or gender] wd:[entity:female].\n?article schema:about ?human .\n}\nGROUP BY ?human\n} AS %results\nWHERE {\nINCLUDE %results\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"da,en\". }\n}\nORDER BY DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "2146",
    "instruction": "What are the top-level administrative divisions in Germany?",
    "query": "SELECT DISTINCT ?region ?regionLabel ?pop ?ended\nWHERE {\n# Instance of first administrative division\n?region p:P31 ?stat.\n?stat a wikibase:BestRank.\nFILTER NOT EXISTS { ?stat pq:P582 []}\n?stat ps:P31/wdt:P279* wd:Q10864048.\n# ?region wdt:P31/wdt:P279* wd:Q10864048.\n#UNION { ?city wdt:P31/wdt:P279* wd:Q515. }\n?region wdt:P1082 ?pop.\n?region wdt:P150 ?regionContained.\n# only in Germany\n?region wdt:P17 wd:Q183.\nMINUS { ?region wdt:P576 ?x. } # remove region that has been disolved\n# remove region that is nowdays not a first level administrative region\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}\nORDER BY DESC(?pop)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?region ?regionLabel ?pop ?ended\nWHERE {\n# Instance of first administrative division\n?region p:[property:instance of] ?stat.\n?stat a wikibase:BestRank.\nFILTER NOT EXISTS { ?stat pq:[property:end time] []}\n?stat ps:[property:instance of]/wdt:[property:subclass of]* wd:[entity:first-level administrative division].\n# ?region wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:first-level administrative division].\n#UNION { ?city wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:city]. }\n?region wdt:[property:population] ?pop.\n?region wdt:[property:contains the administrative territorial entity] ?regionContained.\n# only in Germany\n?region wdt:[property:country] wd:[entity:Germany].\nMINUS { ?region wdt:[property:dissolved, abolished or demolished date] ?x. } # remove region that has been disolved\n# remove region that is nowdays not a first level administrative region\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}\nORDER BY DESC(?pop)",
    "complexity": "complex"
  }
]