[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "1197",
    "instruction": "List all locations in the UK that start with 'Llan' and show their coordinates.",
    "query": "SELECT DISTINCT ?item ?label ?coord WHERE {\n?item wdt:P17 wd:Q145.\n?item wdt:P625 ?coord.\n?item rdfs:label ?labelWithLanguage.\nBIND(STR(?labelWithLanguage) AS ?label)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\nFILTER(STRSTARTS(?labelWithLanguage, \"Llan\"))\nFILTER((LANG(?labelWithLanguage)) = \"en\")\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?label ?coord WHERE {\n?item wdt:[property:country] wd:[entity:United Kingdom].\n?item wdt:[property:coordinate location] ?coord.\n?item rdfs:label ?labelWithLanguage.\nBIND(STR(?labelWithLanguage) AS ?label)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\nFILTER(STRSTARTS(?labelWithLanguage, \"Llan\"))\nFILTER((LANG(?labelWithLanguage)) = \"en\")\n}",
    "complexity": "medium"
  },
  {
    "id": "1062",
    "instruction": "What events started in 2017 and ended in 2018?",
    "query": "SELECT ?item ?itemLabel ?start ?end ?durationInDays WHERE {\n?item wdt:P31/wdt:P279* wd:Q1656682;\np:P580/psv:P580 [ wikibase:timeValue ?start; wikibase:timePrecision ?startPrecision ];\np:P582/psv:P582 [ wikibase:timeValue ?end; wikibase:timePrecision ?endPrecision ].\nFILTER(\"2017-01-01\"^^xsd:dateTime <= ?start && ?start < \"2018-01-01\"^^xsd:dateTime)\nFILTER(\"2018-01-01\"^^xsd:dateTime <= ?end && ?end < \"2019-01-01\"^^xsd:dateTime)\nFILTER(?startPrecision >= 10 && ?endPrecision >= 10) # precision 10 = month\nBIND(?end - ?start AS ?durationInDays)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,fr\". }\n}\nORDER BY ASC(?durationInDays)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?start ?end ?durationInDays WHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:event];\np:[property:start time]/psv:[property:start time] [ wikibase:timeValue ?start; wikibase:timePrecision ?startPrecision ];\np:[property:end time]/psv:[property:end time] [ wikibase:timeValue ?end; wikibase:timePrecision ?endPrecision ].\nFILTER(\"2017-01-01\"^^xsd:dateTime <= ?start && ?start < \"2018-01-01\"^^xsd:dateTime)\nFILTER(\"2018-01-01\"^^xsd:dateTime <= ?end && ?end < \"2019-01-01\"^^xsd:dateTime)\nFILTER(?startPrecision >= 10 && ?endPrecision >= 10) # precision 10 = month\nBIND(?end - ?start AS ?durationInDays)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,fr\". }\n}\nORDER BY ASC(?durationInDays)",
    "complexity": "medium"
  },
  {
    "id": "1355",
    "instruction": "List all humans from France without a specified gender.",
    "query": "SELECT ?human ?humanLabel\nWHERE {\n?human wdt:P31 wd:Q5 .\n?human wdt:P27 wd:Q142 .\nMINUS { ?human p:P21 ?gender . }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\" . }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?human ?humanLabel\nWHERE {\n?human wdt:[property:instance of] wd:[entity:human] .\n?human wdt:[property:country of citizenship] wd:[entity:France] .\nMINUS { ?human p:[property:sex or gender] ?gender . }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\" . }\n}",
    "complexity": "medium"
  },
  {
    "id": "2654",
    "instruction": "Show me a map of tram depots in France.",
    "query": "SELECT DISTINCT ?site ?siteLabel ?coordinates ?image WHERE {\n?site (wdt:P31/(wdt:P279*)) wd:Q27028153;\nwdt:P17 wd:Q142;\nwdt:P625 ?coordinates.\nOPTIONAL { ?site wdt:P18 ?image. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?site ?siteLabel ?coordinates ?image WHERE {\n?site (wdt:[property:instance of]/(wdt:[property:subclass of]*)) wd:[entity:tram depot];\nwdt:[property:country] wd:[entity:France];\nwdt:[property:coordinate location] ?coordinates.\nOPTIONAL { ?site wdt:[property:image] ?image. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "2507",
    "instruction": "Find the birthplaces of individuals described in multiple encyclopedias.",
    "query": "SELECT ?koord ?item ?itemLabel WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?item wdt:P1296 ?GEC. hint:Prior hint:runFirst true.\n?item wdt:P1417 ?EB.\n?item wdt:P2924 ?GRE.\n?item wdt:P4342 ?norske.\n?item wdt:P31 wd:Q5.\n?item wdt:P19 ?jaio.\n?jaio wdt:P625 ?koord.\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX hint: <http://www.bigdata.com/queryHints#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?koord ?item ?itemLabel WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?item wdt:[property:Gran Enciclop\u00e8dia Catalana ID (former scheme)] ?GEC. hint:Prior hint:runFirst true.\n?item wdt:[property:Encyclop\u00e6dia Britannica Online ID] ?EB.\n?item wdt:[property:Great Russian Encyclopedia Online ID (old version)] ?GRE.\n?item wdt:[property:Store norske leksikon ID] ?norske.\n?item wdt:[property:instance of] wd:[entity:human].\n?item wdt:[property:place of birth] ?jaio.\n?jaio wdt:[property:coordinate location] ?koord.\n}",
    "complexity": "medium"
  },
  {
    "id": "1106",
    "instruction": "List the birthplaces of astronauts who have spent time in space.",
    "query": "SELECT ?astronautLabel ?timeinspace ?coordinates WHERE {\n?astronaut wdt:P31 wd:Q5 ;\nwdt:P19 ?birthPlace ;\nwdt:P2873 ?timeinspace .\n?birthPlace wdt:P625 ?coordinates .\nFILTER (?timeinspace >0)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?astronautLabel ?timeinspace ?coordinates WHERE {\n?astronaut wdt:[property:instance of] wd:[entity:human] ;\nwdt:[property:place of birth] ?birthPlace ;\nwdt:[property:time in space] ?timeinspace .\n?birthPlace wdt:[property:coordinate location] ?coordinates .\nFILTER (?timeinspace >0)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "449",
    "instruction": "What types of idioms does SPARQL use to exclude subsets?",
    "query": "SELECT ?item ?itemLabel WHERE {\nSERVICE wikibase:mwapi {\nbd:serviceParam wikibase:endpoint \"www.wikidata.org\";\nwikibase:api \"EntitySearch\";\nmwapi:search \"front matter\"; # Search for things named \"front matter\"\nmwapi:language \"en\".\n?item wikibase:apiOutputItem mwapi:item.\n}\nMINUS {\n?item wdt:P31 wd:Q13442814 . # but MINUS any of those things that are instances of scholarly article\n}\nSERVICE wikibase:label {bd:serviceParam wikibase:language \"en\".}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel WHERE {\nSERVICE wikibase:mwapi {\nbd:serviceParam wikibase:endpoint \"www.wikidata.org\";\nwikibase:api \"EntitySearch\";\nmwapi:search \"front matter\"; # Search for things named \"front matter\"\nmwapi:language \"en\".\n?item wikibase:apiOutputItem mwapi:item.\n}\nMINUS {\n?item wdt:[property:instance of] wd:[entity:scholarly article] . # but MINUS any of those things that are instances of scholarly article\n}\nSERVICE wikibase:label {bd:serviceParam wikibase:language \"en\".}\n}",
    "complexity": "medium"
  },
  {
    "id": "39",
    "instruction": "List all authors with profiles on English Wikisource.",
    "query": "SELECT ?person ?enws WHERE {\n?person wdt:P31 wd:Q5.\n?enws schema:about ?person;\nschema:isPartOf <https://en.wikisource.org/> FILTER CONTAINS(STR(?enws), \"Author:\")\n} ORDER BY ?enws",
    "annotated": "PREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?person ?enws WHERE {\n?person wdt:[property:instance of] wd:[entity:human].\n?enws schema:about ?person;\nschema:isPartOf <https://en.wikisource.org/> FILTER CONTAINS(STR(?enws), \"Author:\")\n} ORDER BY ?enws",
    "complexity": "medium"
  },
  {
    "id": "2143",
    "instruction": "List the paintings in Paris Musees that are now in public domain.",
    "query": "SELECT distinct ?oeuvre ?oeuvreLabel ?artisteLabel ?museeLabel WHERE {\n?oeuvre wdt:P31 wd:Q3305213.\n?oeuvre wdt:P195/wdt:P1416* wd:Q3365279.\n?oeuvre wdt:P195 ?musee.\n?oeuvre wdt:P571 ?date0.\n?oeuvre wdt:P170 ?artiste.\n?artiste wdt:P570 ?death .\nBIND(year(?death) AS ?deces)\nOPTIONAL{?oeuvre wdt:P217 ?inventaire.}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr, en\". }\nFILTER (?deces =1950)\n}\nORDER BY ?artiste",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT distinct ?oeuvre ?oeuvreLabel ?artisteLabel ?museeLabel WHERE {\n?oeuvre wdt:[property:instance of] wd:[entity:painting].\n?oeuvre wdt:[property:collection]/wdt:[property:affiliation]* wd:[entity:Paris Mus\u00e9es].\n?oeuvre wdt:[property:collection] ?musee.\n?oeuvre wdt:[property:inception] ?date0.\n?oeuvre wdt:[property:creator] ?artiste.\n?artiste wdt:[property:date of death] ?death .\nBIND(year(?death) AS ?deces)\nOPTIONAL{?oeuvre wdt:[property:inventory number] ?inventaire.}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr, en\". }\nFILTER (?deces =1950)\n}\nORDER BY ?artiste",
    "complexity": "medium"
  },
  {
    "id": "606",
    "instruction": "What software applications can write the most file formats?",
    "query": "SELECT ?app ?appLabel (COUNT(?format) AS ?count)\nWHERE {\n?app (p:P31/ps:P31/wdt:P279) wd:Q7397 .\n?app wdt:P1072 ?format .\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n}\nGROUP BY ?app ?appLabel\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?app ?appLabel (COUNT(?format) AS ?count)\nWHERE {\n?app (p:[property:instance of]/ps:[property:instance of]/wdt:[property:subclass of]) wd:[entity:software] .\n?app wdt:[property:readable file format] ?format .\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n}\nGROUP BY ?app ?appLabel\nORDER BY DESC(?count)",
    "complexity": "medium"
  },
  {
    "id": "1945",
    "instruction": "List all female Captains Regent of San Marino.",
    "query": "SELECT ?person ?personLabel ?start WHERE {\n?person wdt:P31 wd:Q5 ; wdt:P21 wd:Q6581072 ; p:P39 ?statement .\n?statement ps:P39 wd:Q258045 .\nOPTIONAL { ?statement pq:P580 ?start } .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY ?start",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?person ?personLabel ?start WHERE {\n?person wdt:[property:instance of] wd:[entity:human] ; wdt:[property:sex or gender] wd:[entity:female] ; p:[property:position held] ?statement .\n?statement ps:[property:position held] wd:[entity:Captain Regent of San Marino] .\nOPTIONAL { ?statement pq:[property:start time] ?start } .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY ?start",
    "complexity": "medium"
  },
  {
    "id": "1177",
    "instruction": "List all writers along with their signatures.",
    "query": "SELECT DISTINCT ?ecrivain ?ecrivainLabel ?nationaliteLabel ?dateNaissance ?dateMort ?lieuNaissanceLabel ?lieuDecesLabel ?signature WHERE {\n?ecrivain wdt:P106 wd:Q36180.\nOPTIONAL\n{\n?ecrivain wdt:P27 ?nationalite.\n?ecrivain wdt:P569 ?dateNaissance.\n?ecrivain wdt:P570 ?dateMort.\n?ecrivain wdt:P19 ?lieuNaissance.\n?ecrivain wdt:P20 ?lieuDeces.\n}\n?ecrivain wdt:P109 ?signature.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?ecrivain ?ecrivainLabel ?nationaliteLabel ?dateNaissance ?dateMort ?lieuNaissanceLabel ?lieuDecesLabel ?signature WHERE {\n?ecrivain wdt:[property:occupation] wd:[entity:writer].\nOPTIONAL\n{\n?ecrivain wdt:[property:country of citizenship] ?nationalite.\n?ecrivain wdt:[property:date of birth] ?dateNaissance.\n?ecrivain wdt:[property:date of death] ?dateMort.\n?ecrivain wdt:[property:place of birth] ?lieuNaissance.\n?ecrivain wdt:[property:place of death] ?lieuDeces.\n}\n?ecrivain wdt:[property:signature] ?signature.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "894",
    "instruction": "List the countries with the highest number of UNESCO World Heritage Sites.",
    "query": "SELECT distinct ?country ?countryLabel (count(?site) as ?sites)\nWHERE {\n?site wdt:P1435 wd:Q9259 .\n?site wdt:P17 ?country .\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n}\nGROUP BY ?country ?countryLabel\nORDER BY DESC(?sites)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT distinct ?country ?countryLabel (count(?site) as ?sites)\nWHERE {\n?site wdt:[property:heritage designation] wd:[entity:World Heritage Site] .\n?site wdt:[property:country] ?country .\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n}\nGROUP BY ?country ?countryLabel\nORDER BY DESC(?sites)",
    "complexity": "medium"
  },
  {
    "id": "1385",
    "instruction": "List languages by the number of people who speak them.",
    "query": "SELECT ?language ?languageLabel ?root ?rootLabel ?nspeakers WHERE {\n?language wdt:P31 wd:Q34770 .\n?language wdt:P279 ?root.\n?language wdt:P1098 ?nspeakers.\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n} ORDER BY ?nspeakers",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?language ?languageLabel ?root ?rootLabel ?nspeakers WHERE {\n?language wdt:[property:instance of] wd:[entity:language] .\n?language wdt:[property:subclass of] ?root.\n?language wdt:[property:number of speakers, writers, or signers] ?nspeakers.\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n} ORDER BY ?nspeakers",
    "complexity": "medium"
  },
  {
    "id": "1516",
    "instruction": "List fictional characters that are considered the same in a specific universe.",
    "query": "SELECT DISTINCT ?character1 ?character2 ?character1Label ?character2Label ?universeLabel WHERE {\nhint:Query hint:optimizer \"None\".\n?character1 wdt:P1080 ?universe;\nwdt:P460|^wdt:P460 ?character2.\n?character2 wdt:P1080 ?universe.\nFILTER(STR(?character1) < STR(?character2))\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY ?universeLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX hint: <http://www.bigdata.com/queryHints#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?character1 ?character2 ?character1Label ?character2Label ?universeLabel WHERE {\nhint:Query hint:optimizer \"None\".\n?character1 wdt:[property:from narrative universe] ?universe;\nwdt:[property:said to be the same as]|^wdt:[property:said to be the same as] ?character2.\n?character2 wdt:[property:from narrative universe] ?universe.\nFILTER(STR(?character1) < STR(?character2))\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY ?universeLabel",
    "complexity": "medium"
  },
  {
    "id": "961",
    "instruction": "List the people who were convicted of regicide.",
    "query": "SELECT DISTINCT ?regicide ?regicideLabel ?regicide_image ?victime ?victimeLabel ?titresLabel ?date_deces ?lieu_decesLabel ?cause_decesLabel ?victime_image WHERE {\n?regicide wdt:P31 wd:Q5 .\n?regicide wdt:P1399 wd:Q1475448 .\nOPTIONAL {?regicide wdt:P18 ?regicide_image . }\nOPTIONAL {\n?victime wdt:P157 ?regicide .\nOPTIONAL { ?victime wdt:P570 ?date_deces . }\nOPTIONAL { ?victime wdt:P20 ?lieu_deces . }\nOPTIONAL { ?victime wdt:P509 ?cause_deces . }\nOPTIONAL { ?victime wdt:P39 ?titres . }\nOPTIONAL { ?victime wdt:P18 ?victime_image . }\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\" . }\n} ORDER BY ?regicide",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?regicide ?regicideLabel ?regicide_image ?victime ?victimeLabel ?titresLabel ?date_deces ?lieu_decesLabel ?cause_decesLabel ?victime_image WHERE {\n?regicide wdt:[property:instance of] wd:[entity:human] .\n?regicide wdt:[property:convicted of] wd:[entity:regicide] .\nOPTIONAL {?regicide wdt:[property:image] ?regicide_image . }\nOPTIONAL {\n?victime wdt:[property:killed by] ?regicide .\nOPTIONAL { ?victime wdt:[property:date of death] ?date_deces . }\nOPTIONAL { ?victime wdt:[property:place of death] ?lieu_deces . }\nOPTIONAL { ?victime wdt:[property:cause of death] ?cause_deces . }\nOPTIONAL { ?victime wdt:[property:position held] ?titres . }\nOPTIONAL { ?victime wdt:[property:image] ?victime_image . }\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\" . }\n} ORDER BY ?regicide",
    "complexity": "medium"
  },
  {
    "id": "1090",
    "instruction": "List the countries with the highest number of sister cities in France.",
    "query": "SELECT ?country ?countryLabel (COUNT(?city) AS ?count)\nWHERE {\n?city wdt:P31 wd:Q484170 ; wdt:P190/wdt:P17 ?country .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n}\nGROUP BY ?country ?countryLabel\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?country ?countryLabel (COUNT(?city) AS ?count)\nWHERE {\n?city wdt:[property:instance of] wd:[entity:commune of France] ; wdt:[property:twinned administrative body]/wdt:[property:country] ?country .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n}\nGROUP BY ?country ?countryLabel\nORDER BY DESC(?count)",
    "complexity": "medium"
  },
  {
    "id": "1467",
    "instruction": "List people who were buried far away from where they died.",
    "query": "SELECT ?person ?dist WHERE {\n?person wdt:P20/wdt:P625 ?coord1 ; wdt:P119/wdt:P625 ?coord2 .\nBIND(geof:distance(?coord1, ?coord2) as ?dist)\nFILTER(?dist > 13000)\n}\nLIMIT 50",
    "annotated": "PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?person ?dist WHERE {\n?person wdt:[property:place of death]/wdt:[property:coordinate location] ?coord1 ; wdt:[property:place of burial]/wdt:[property:coordinate location] ?coord2 .\nBIND(geof:distance(?coord1, ?coord2) as ?dist)\nFILTER(?dist > 13000)\n}\nLIMIT 50",
    "complexity": "medium"
  },
  {
    "id": "1126",
    "instruction": "List software developed by individuals or organizations with archival materials at the Computer History Museum.",
    "query": "SELECT ?person ?personLabel ?software ?softwareLabel\nWHERE {\n?person wdt:P485 wd:Q964035 .\n?software wdt:P178 ?person.\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?person ?personLabel ?software ?softwareLabel\nWHERE {\n?person wdt:[property:archives at] wd:[entity:Computer History Museum] .\n?software wdt:[property:developer] ?person.\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n}",
    "complexity": "medium"
  },
  {
    "id": "2599",
    "instruction": "What are the corporate archives with their locations and addresses?",
    "query": "SELECT ?item ?itemLabel ?opened ?countryLabel ?coords ?website ?address\n{\n?item wdt:P31 wd:Q10605195 .\noptional { ?item wdt:P17 ?country . }\noptional { ?item wdt:P1619 ?opened . }\noptional { ?item wdt:P625 ?coords . }\noptional { ?item wdt:P856 ?website . }\noptional { ?item wdt:P6375 ?address . }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,de,fr,ja,it,sv\" }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?opened ?countryLabel ?coords ?website ?address\n{\n?item wdt:[property:instance of] wd:[entity:company archives] .\noptional { ?item wdt:[property:country] ?country . }\noptional { ?item wdt:[property:date of official opening] ?opened . }\noptional { ?item wdt:[property:coordinate location] ?coords . }\noptional { ?item wdt:[property:official website] ?website . }\noptional { ?item wdt:[property:street address] ?address . }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,de,fr,ja,it,sv\" }\n}",
    "complexity": "medium"
  },
  {
    "id": "109",
    "instruction": "Show me pictures of ancient Greek pottery styles.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?image WHERE {\n?item wdt:P31/wdt:P279? wd:Q738680; # instance of type of ancient Greek pottery\nwdt:P18 ?image\nMINUS {?item wdt:P1080 []} # exclude fictional (Pandora's Box)\nSERVICE wikibase:label {bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,el,fr,de,pl,uk\"}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?image WHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]? wd:[entity:pottery of ancient Greece]; # instance of type of ancient Greek pottery\nwdt:[property:image] ?image\nMINUS {?item wdt:[property:from narrative universe] []} # exclude fictional (Pandora's Box)\nSERVICE wikibase:label {bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,el,fr,de,pl,uk\"}\n}",
    "complexity": "medium"
  },
  {
    "id": "396",
    "instruction": "List all the children of Johann Sebastian Bach with his first wife, Maria Barbara.",
    "query": "SELECT ?class ?property ?classLabel ?propertyLabel WHERE {\nwd:Q875538 wdt:P279* ?class .\n?class wdt:P1963 ?property .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?class ?property ?classLabel ?propertyLabel WHERE {\nwd:[entity:public university] wdt:[property:subclass of]* ?class .\n?class wdt:[property:properties for this type] ?property .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "545",
    "instruction": "What are the names of countries and their capitals?",
    "query": "SELECT DISTINCT ?country ?countryLabel ?capital ?capitalLabel\nWHERE\n{\n?country wdt:P31 wd:Q3624078 .\n#not a former country\nFILTER NOT EXISTS {?country wdt:P31 wd:Q3024240}\n#and no an ancient civilisation (needed to exclude ancient Egypt)\nFILTER NOT EXISTS {?country wdt:P31 wd:Q28171280}\nOPTIONAL { ?country wdt:P36 ?capital } .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}\nORDER BY ?countryLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?country ?countryLabel ?capital ?capitalLabel\nWHERE\n{\n?country wdt:[property:instance of] wd:[entity:sovereign state] .\n#not a former country\nFILTER NOT EXISTS {?country wdt:[property:instance of] wd:[entity:historical country]}\n#and no an ancient civilisation (needed to exclude ancient Egypt)\nFILTER NOT EXISTS {?country wdt:[property:instance of] wd:[entity:ancient civilization]}\nOPTIONAL { ?country wdt:[property:capital] ?capital } .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}\nORDER BY ?countryLabel",
    "complexity": "medium"
  },
  {
    "id": "1661",
    "instruction": "List all partisans who died in Italy, organized by the year they passed away.",
    "query": "SELECT ?item ?itemLabel ?_coordinates ?_image ?death_placeLabel (year(?death_date) as ?year) WHERE {\n?item wdt:P106 wd:Q212948;\nwdt:P20/wdt:P17 wd:Q38;\nwdt:P20/wdt:P625 ?_coordinates; # their deathplace, specifically the coordinates of their birthplace\nwdt:P20 ?death_place;\np:P570/psv:P570 ?death_date_node .\n?death_date_node wikibase:timeValue ?death_date .\nOPTIONAL { ?item wdt:P18 ?_image }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" } # labels in English\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?_coordinates ?_image ?death_placeLabel (year(?death_date) as ?year) WHERE {\n?item wdt:[property:occupation] wd:[entity:partisan];\nwdt:[property:place of death]/wdt:[property:country] wd:[entity:Italy];\nwdt:[property:place of death]/wdt:[property:coordinate location] ?_coordinates; # their deathplace, specifically the coordinates of their birthplace\nwdt:[property:place of death] ?death_place;\np:[property:date of death]/psv:[property:date of death] ?death_date_node .\n?death_date_node wikibase:timeValue ?death_date .\nOPTIONAL { ?item wdt:[property:image] ?_image }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" } # labels in English\n}",
    "complexity": "medium"
  },
  {
    "id": "2440",
    "instruction": "List all students mentioned in 'Das Geistige Berlin' along with their teachers.",
    "query": "SELECT ?student ?studentLabel ?teacher ?teacherLabel ?edgeLabel ?rgb WHERE {\n?student p:P1066 ?studentStmt.\n?studentStmt ps:P1066 ?teacher;\nprov:wasDerivedFrom ?studentNode.\n?studentNode pr:P248 wd:Q109118295.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\nBIND(\"student of\" AS ?edgeLabel)\nBIND(\"cbcbcb\" AS ?rgb)\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX prov: <http://www.w3.org/ns/prov#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pr: <http://www.wikidata.org/prop/reference/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?student ?studentLabel ?teacher ?teacherLabel ?edgeLabel ?rgb WHERE {\n?student p:[property:student of] ?studentStmt.\n?studentStmt ps:[property:student of] ?teacher;\nprov:wasDerivedFrom ?studentNode.\n?studentNode pr:[property:stated in] wd:[entity:The intellectual Berlin. An encyclopedia about the intellectual live of Berlin].\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\nBIND(\"student of\" AS ?edgeLabel)\nBIND(\"cbcbcb\" AS ?rgb)\n}",
    "complexity": "medium"
  },
  {
    "id": "260",
    "instruction": "What objects in the Ashmolean Museum have names starting with 'Figure of' but don't depict anything?",
    "query": "SELECT ?item ?itemLabel ?url WHERE {\n?item wdt:P195 wd:Q636400; wdt:P973 ?url\nMINUS {?item wdt:P180 []}\n?item rdfs:label ?itemLabel filter( lang(?itemLabel)=\"en\" ) filter( CONTAINS(?itemLabel, \"igure of \") )\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?item ?itemLabel ?url WHERE {\n?item wdt:[property:collection] wd:[entity:Ashmolean Museum]; wdt:[property:described at URL] ?url\nMINUS {?item wdt:[property:depicts] []}\n?item rdfs:label ?itemLabel filter( lang(?itemLabel)=\"en\" ) filter( CONTAINS(?itemLabel, \"igure of \") )\n}",
    "complexity": "medium"
  }
]