[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "2448",
    "instruction": "What are the stops in Wilhelm Muller's travel route from Leipzig to Bad Schandau?",
    "query": "SELECT * WHERE {\nVALUES ?reisebericht {\nwd:Q109590352\n}\n?reisebericht rdfs:label ?reiseberichtLabel.\nFILTER((LANG(?reiseberichtLabel)) = \"de\")\n?reisebericht p:P921 ?schlagwortStmt.\n?schlagwortStmt ps:P921 ?ort1;\npq:P156 ?ort2;\nprov:wasDerivedFrom ?refNode.\n?refNode pr:P854 ?Volltext.\n?ort1 wdt:P625 ?coord1.\n?ort2 wdt:P625 ?coord2.\n?ort1 p:P625 _:b20.\n_:b20 ps:P625 _:b18;\npsv:P625 _:b19.\n_:b19 wikibase:geoLongitude ?coord1lon;\nwikibase:geoLatitude ?coord1lat.\n?ort2 p:P625 _:b23.\n_:b23 ps:P625 _:b21;\npsv:P625 _:b22.\n_:b22 wikibase:geoLongitude ?coord2lon;\nwikibase:geoLatitude ?coord2lat.\nBIND(CONCAT(\"LINESTRING (\", STR(?coord1lon), \" \", STR(?coord1lat), \",\", STR(?coord2lon), \" \", STR(?coord2lat), \")\") AS ?str)\nBIND(STRDT(?str, geo:wktLiteral) AS ?line)\n?ort1 rdfs:label ?ort1Label.\nFILTER((LANG(?ort1Label)) = \"de\")\n}",
    "annotated": "PREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX prov: <http://www.w3.org/ns/prov#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX pr: <http://www.wikidata.org/prop/reference/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT * WHERE {\nVALUES ?reisebericht {\nwd:[entity:Briefe an deutsche Freunde von einer Reise durch Italien \u00fcber Sachsen, B\u00f6hmen, und Oestreich, 1820 und 1821 geschrieben und als Skizzen zum Gem\u00e4lde unserer Zeit herausgegeben.]\n}\n?reisebericht rdfs:label ?reiseberichtLabel.\nFILTER((LANG(?reiseberichtLabel)) = \"de\")\n?reisebericht p:[property:main subject] ?schlagwortStmt.\n?schlagwortStmt ps:[property:main subject] ?ort1;\npq:[property:followed by] ?ort2;\nprov:wasDerivedFrom ?refNode.\n?refNode pr:[property:reference URL] ?Volltext.\n?ort1 wdt:[property:coordinate location] ?coord1.\n?ort2 wdt:[property:coordinate location] ?coord2.\n?ort1 p:[property:coordinate location] _:b20.\n_:b20 ps:[property:coordinate location] _:b18;\npsv:[property:coordinate location] _:b19.\n_:b19 wikibase:geoLongitude ?coord1lon;\nwikibase:geoLatitude ?coord1lat.\n?ort2 p:[property:coordinate location] _:b23.\n_:b23 ps:[property:coordinate location] _:b21;\npsv:[property:coordinate location] _:b22.\n_:b22 wikibase:geoLongitude ?coord2lon;\nwikibase:geoLatitude ?coord2lat.\nBIND(CONCAT(\"LINESTRING (\", STR(?coord1lon), \" \", STR(?coord1lat), \",\", STR(?coord2lon), \" \", STR(?coord2lat), \")\") AS ?str)\nBIND(STRDT(?str, geo:wktLiteral) AS ?line)\n?ort1 rdfs:label ?ort1Label.\nFILTER((LANG(?ort1Label)) = \"de\")\n}",
    "complexity": "complex"
  },
  {
    "id": "2559",
    "instruction": "What are the top 20 languages by number of lexemes in Wikidata?",
    "query": "SELECT ?language ?languageLabel ?lexemes ?withExternalId ?percent WITH {\nSELECT ?language (COUNT(*) AS ?count) { ?lexeme dct:language ?language }\nGROUP BY ?language\nORDER BY DESC(COUNT(*))\nLIMIT 20\n} AS %languages WITH {\nSELECT ?language ?lexemes ?withExternalId (ROUND(10000 / ?lexemes * ?withExternalId) / 100 AS ?percent) {\nSELECT ?language (COUNT(*) AS ?lexemes) (SUM(?hasExternalId) AS ?withExternalId) {\nINCLUDE %languages\n?lexeme dct:language ?language .\nBIND(IF(EXISTS {\n?property wdt:P31 wd:Q19847637 ; wikibase:directClaim ?wdt .\n?lexeme ?wdt [] .\n}, 1, 0) AS ?hasExternalId) .\n}\nGROUP BY ?language\n}\nGROUP BY ?language ?lexemes ?withExternalId\n} AS %stats WHERE {\nINCLUDE %stats\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}\nORDER BY DESC(?lexemes)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX dct: <http://purl.org/dc/terms/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?language ?languageLabel ?lexemes ?withExternalId ?percent WITH {\nSELECT ?language (COUNT(*) AS ?count) { ?lexeme dct:language ?language }\nGROUP BY ?language\nORDER BY DESC(COUNT(*))\nLIMIT 20\n} AS %languages WITH {\nSELECT ?language ?lexemes ?withExternalId (ROUND(10000 / ?lexemes * ?withExternalId) / 100 AS ?percent) {\nSELECT ?language (COUNT(*) AS ?lexemes) (SUM(?hasExternalId) AS ?withExternalId) {\nINCLUDE %languages\n?lexeme dct:language ?language .\nBIND(IF(EXISTS {\n?property wdt:[property:instance of] wd:[entity:Wikidata property for an identifier] ; wikibase:directClaim ?wdt .\n?lexeme ?wdt [] .\n}, 1, 0) AS ?hasExternalId) .\n}\nGROUP BY ?language\n}\nGROUP BY ?language ?lexemes ?withExternalId\n} AS %stats WHERE {\nINCLUDE %stats\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}\nORDER BY DESC(?lexemes)",
    "complexity": "complex"
  },
  {
    "id": "1483",
    "instruction": "List the top female scientists by citation count.",
    "query": "SELECT ?count ?author ?authorLabel\nWITH {\nSELECT (COUNT(?citing_work) AS ?count) ?author WHERE {\n?work wdt:P50 ?author .\n?author wdt:P21 wd:Q6581072 .\n?citing_work wdt:P2860 ?work\n}\nGROUP BY ?author\nORDER BY DESC(?count)\n# LIMIT 100\n} AS %result\nWHERE {\nINCLUDE %result\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?count ?author ?authorLabel\nWITH {\nSELECT (COUNT(?citing_work) AS ?count) ?author WHERE {\n?work wdt:[property:author] ?author .\n?author wdt:[property:sex or gender] wd:[entity:female] .\n?citing_work wdt:[property:cites work] ?work\n}\nGROUP BY ?author\nORDER BY DESC(?count)\n# LIMIT 100\n} AS %result\nWHERE {\nINCLUDE %result\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "243",
    "instruction": "List the creators of items in Ashmolean Museum and compare them with those in other museums.",
    "query": "SELECT DISTINCT ?creator ?creatorLabel ?creatorDescription ?enwp ?ash_items (COUNT(?other) as ?other) WHERE {\n{ SELECT ?creator ?enwp (COUNT(?item) AS ?ash_items) WHERE {\n?item wdt:P195 wd:Q636400; # collection: Ashmolean\nwdt:P170 ?creator FILTER (?creator != wd:Q4233718) # Exclude anonymous\nOPTIONAL { ?enwp schema:about ?creator; schema:isPartOf <https://en.wikipedia.org/> }\n} GROUP BY ?creator ?enwp\n}\n?other wdt:P170 ?creator MINUS {?other wdt:P195 wd:Q636400} # objects by same creator but not in Ashmolean\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} GROUP BY ?creator ?creatorLabel ?creatorDescription ?enwp ?ash_items\nORDER BY DESC(?ash_items) DESC(?other)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?creator ?creatorLabel ?creatorDescription ?enwp ?ash_items (COUNT(?other) as ?other) WHERE {\n{ SELECT ?creator ?enwp (COUNT(?item) AS ?ash_items) WHERE {\n?item wdt:[property:collection] wd:[entity:Ashmolean Museum]; # collection: Ashmolean\nwdt:[property:creator] ?creator FILTER (?creator != wd:[entity:anonymous]) # Exclude anonymous\nOPTIONAL { ?enwp schema:about ?creator; schema:isPartOf <https://en.wikipedia.org/> }\n} GROUP BY ?creator ?enwp\n}\n?other wdt:[property:creator] ?creator MINUS {?other wdt:[property:collection] wd:[entity:Ashmolean Museum]} # objects by same creator but not in Ashmolean\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} GROUP BY ?creator ?creatorLabel ?creatorDescription ?enwp ?ash_items\nORDER BY DESC(?ash_items) DESC(?other)",
    "complexity": "complex"
  },
  {
    "id": "864",
    "instruction": "What are the colors of chemical compounds?",
    "query": "SELECT ?rgb ?colorLabel (COUNT(?compound) AS ?count)\nWHERE\n{\n?compound wdt:P31 wd:Q11173;\nwdt:P462 ?color.\nOPTIONAL { ?color wdt:P465 ?rgb. }\nBIND(IF(BOUND(?rgb),?rgb,\"CCCCCC\") AS ?rgb).\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nGROUP BY ?rgb ?colorLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?rgb ?colorLabel (COUNT(?compound) AS ?count)\nWHERE\n{\n?compound wdt:[property:instance of] wd:[entity:chemical compound];\nwdt:[property:color] ?color.\nOPTIONAL { ?color wdt:[property:sRGB color hex triplet] ?rgb. }\nBIND(IF(BOUND(?rgb),?rgb,\"CCCCCC\") AS ?rgb).\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nGROUP BY ?rgb ?colorLabel",
    "complexity": "complex"
  },
  {
    "id": "2395",
    "instruction": "Show me a graph of Nobel Prize winners by gender.",
    "query": "SELECT ?men ?women ?award ?awardLabel\nWITH {\nSELECT (COUNT(?recipient_male) AS ?men) (COUNT(?recipient_female) AS ?women) ?award WHERE {\n?award wdt:P31 wd:Q11448906 .\n{\n?recipient_male wdt:P166 ?award .\n?recipient_male wdt:P21 wd:Q6581097 .\n}\nUNION\n{\n?recipient_female wdt:P166 ?award .\n?recipient_female wdt:P21 wd:Q6581072 .\n}\n}\nGROUP BY ?award\n} AS %result\nWHERE {\nINCLUDE %result\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,da,de,es,fr,jp,nl,no,ru,sv,zh\". }\n}\nORDER BY DESC(?men) DESC(?women)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?men ?women ?award ?awardLabel\nWITH {\nSELECT (COUNT(?recipient_male) AS ?men) (COUNT(?recipient_female) AS ?women) ?award WHERE {\n?award wdt:[property:instance of] wd:[entity:science award] .\n{\n?recipient_male wdt:[property:award received] ?award .\n?recipient_male wdt:[property:sex or gender] wd:[entity:male] .\n}\nUNION\n{\n?recipient_female wdt:[property:award received] ?award .\n?recipient_female wdt:[property:sex or gender] wd:[entity:female] .\n}\n}\nGROUP BY ?award\n} AS %result\nWHERE {\nINCLUDE %result\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,da,de,es,fr,jp,nl,no,ru,sv,zh\". }\n}\nORDER BY DESC(?men) DESC(?women)",
    "complexity": "complex"
  },
  {
    "id": "373",
    "instruction": "List all the women with their descriptions and birth years.",
    "query": "SELECT ?personLabel ?personDescription ?person ?enwp ?image (YEAR(?birthdate) AS ?birthyear) WHERE {\nVALUES ?person {wd:Q234816 wd:Q62530 wd:Q234421 wd:Q231549 wd:Q246135 wd:Q101638 wd:Q15994440 wd:Q230120 wd:Q260378 wd:Q1377789 wd:Q5322139 wd:Q254858 wd:Q6766368 wd:Q7259 wd:Q4949015 wd:Q47152 wd:Q272077 wd:Q198984 wd:Q1284275 wd:Q651786 wd:Q460152 wd:Q230507 wd:Q3263690 wd:Q270855 wd:Q5362637 wd:Q23620545 wd:Q27728558 wd:Q17892 wd:Q36322 wd:Q57286 wd:Q18576000 wd:Q7207 wd:Q45410399\n}\nOPTIONAL{ ?enwp schema:about ?person ; schema:isPartOf <https://en.wikipedia.org/> }\nOPTIONAL{ ?person wdt:P18 ?image }\nOPTIONAL{ ?person wdt:P569 ?birthdate }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY ?birthyear",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?personLabel ?personDescription ?person ?enwp ?image (YEAR(?birthdate) AS ?birthyear) WHERE {\nVALUES ?person {wd:[entity:Christine de Pizan] wd:[entity:Maria Sibylla Merian] wd:[entity:Mary Read] wd:[entity:Anne Bonny] wd:[entity:Mary Lacy] wd:[entity:Mary Wollstonecraft] wd:[entity:Mabel Purefoy FitzGerald] wd:[entity:Julia Margaret Cameron] wd:[entity:Victoria Woodhull] wd:[entity:Emily Hobhouse] wd:[entity:E. S. Drower] wd:[entity:Emily Davison] wd:[entity:Marjory Wardrop] wd:[entity:Ada Lovelace] wd:[entity:Mary Frith] wd:[entity:Mary Shelley] wd:[entity:Ise] wd:[entity:Ono no Komachi] wd:[entity:Saig\u016b no Ny\u014dgo] wd:[entity:Kodai no Kimi] wd:[entity:Nakatsukasa] wd:[entity:Saint Margaret of Scotland] wd:[entity:Louise Bourgeois Boursier] wd:[entity:Mary Toft] wd:[entity:Elizabeth Creed] wd:[entity:Sybil Pye] wd:[entity:Elizabeth Hunter Holt] wd:[entity:Sappho] wd:[entity:Jane Austen] wd:[entity:Fanny Mendelssohn] wd:[entity:Clara Mordan] wd:[entity:Elizabeth I of England] wd:[entity:Mary Ferrar]\n}\nOPTIONAL{ ?enwp schema:about ?person ; schema:isPartOf <https://en.wikipedia.org/> }\nOPTIONAL{ ?person wdt:[property:image] ?image }\nOPTIONAL{ ?person wdt:[property:date of birth] ?birthdate }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY ?birthyear",
    "complexity": "complex"
  },
  {
    "id": "1548",
    "instruction": "List all French settlements with names consisting of multiple words.",
    "query": "SELECT DISTINCT ?id WHERE { ?id wdt:P31/wdt:P279* wd:Q3624078; p:P463 ?memberOfStatement. ?memberOfStatement a wikibase:BestRank; ps:P463 wd:Q1065. MINUS { ?memberOfStatement pq:P582 ?endTime. } MINUS { ?id wdt:P576|wdt:P582 ?end. } }",
    "annotated": "PREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?id WHERE { ?id wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:sovereign state]; p:[property:member of] ?memberOfStatement. ?memberOfStatement a wikibase:BestRank; ps:[property:member of] wd:[entity:United Nations]. MINUS { ?memberOfStatement pq:[property:end time] ?endTime. } MINUS { ?id wdt:[property:dissolved, abolished or demolished date]|wdt:[property:end time] ?end. } }",
    "complexity": "complex"
  },
  {
    "id": "2759",
    "instruction": "List the names of lunar craters and their corresponding name holders' genders.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?itemDescription ?itemgpn ?ns ?nsLabel ?nsgLabel\nWHERE {\n?item wdt:P31/wdt:P279* wd:Q1348589.\n?item wdt:P2824 ?itemgpn.\n?item wdt:P138 ?ns.\n?ns wdt:P21 ?nsg\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?itemDescription ?itemgpn ?ns ?nsLabel ?nsgLabel\nWHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:lunar crater].\n?item wdt:[property:Gazetteer of Planetary Nomenclature ID] ?itemgpn.\n?item wdt:[property:named after] ?ns.\n?ns wdt:[property:sex or gender] ?nsg\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "630",
    "instruction": "List all the presidents of the United States and their spouses.",
    "query": "SELECT ?p ?pLabel ?ppicture ?w ?wLabel ?wpicture WHERE {\nBIND(wd:Q30 AS ?country)\n?country (p:P6/ps:P6) ?p.\n?p wdt:P26 ?w.\nOPTIONAL {\n?p wdt:P18 ?ppicture.\n?w wdt:P18 ?wpicture.\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?p ?pLabel ?ppicture ?w ?wLabel ?wpicture WHERE {\nBIND(wd:[entity:United States of America] AS ?country)\n?country (p:[property:head of government]/ps:[property:head of government]) ?p.\n?p wdt:[property:spouse] ?w.\nOPTIONAL {\n?p wdt:[property:image] ?ppicture.\n?w wdt:[property:image] ?wpicture.\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "2535",
    "instruction": "List the names of female chefs who run three-Michelin-star restaurants.",
    "query": "SELECT ?chef ?chefLabel ?restaurant ?restaurantLabel WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?restaurant wdt:P31 wd:Q11707;\np:P166 ?awardStatement.\n?awardStatement ps:P166 wd:Q20824563.\nFILTER(NOT EXISTS { ?awardStatement pq:P582 _:b26. })\n{\n?chef p:P108 ?employerStatement.\n?employerStatement ps:P108 ?restaurant;\npq:P39 wd:Q3499072.\n}\nUNION\n{\n?restaurant wdt:P1037 ?chef.\n?chef wdt:P106 wd:Q3499072.\n}\nUNION {\n?restaurant wdt:P127 ?chef.\n?chef wdt:P106 wd:Q3499072.\n}\n?chef wdt:P21 wd:Q6581072.\n?awardStatement pq:P1114 3.\n}\nLIMIT 100",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?chef ?chefLabel ?restaurant ?restaurantLabel WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?restaurant wdt:[property:instance of] wd:[entity:restaurant];\np:[property:award received] ?awardStatement.\n?awardStatement ps:[property:award received] wd:[entity:Michelin star].\nFILTER(NOT EXISTS { ?awardStatement pq:[property:end time] _:b26. })\n{\n?chef p:[property:employer] ?employerStatement.\n?employerStatement ps:[property:employer] ?restaurant;\npq:[property:position held] wd:[entity:chef].\n}\nUNION\n{\n?restaurant wdt:[property:director / manager] ?chef.\n?chef wdt:[property:occupation] wd:[entity:chef].\n}\nUNION {\n?restaurant wdt:[property:owned by] ?chef.\n?chef wdt:[property:occupation] wd:[entity:chef].\n}\n?chef wdt:[property:sex or gender] wd:[entity:female].\n?awardStatement pq:[property:quantity] 3.\n}\nLIMIT 100",
    "complexity": "complex"
  },
  {
    "id": "129",
    "instruction": "What are the names of parks owned by National Trust in the UK?",
    "query": "SELECT ?park ?parkLabel (SAMPLE(?coord) AS ?coord) (SAMPLE(?image) AS ?image) ?web WHERE {\n?park wdt:P127 wd:Q333515.\nMINUS {?park wdt:P31/wdt:P279* wd:Q4502142} # Remove artworks\nOPTIONAL { ?park wdt:P625 ?coord }\nOPTIONAL { ?park wdt:P18 ?image }\nOPTIONAL { ?park wdt:P856 ?web }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} GROUP BY ?park ?parkLabel ?web\nORDER BY ?parkLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?park ?parkLabel (SAMPLE(?coord) AS ?coord) (SAMPLE(?image) AS ?image) ?web WHERE {\n?park wdt:[property:owned by] wd:[entity:National Trust].\nMINUS {?park wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:visual artwork]} # Remove artworks\nOPTIONAL { ?park wdt:[property:coordinate location] ?coord }\nOPTIONAL { ?park wdt:[property:image] ?image }\nOPTIONAL { ?park wdt:[property:official website] ?web }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} GROUP BY ?park ?parkLabel ?web\nORDER BY ?parkLabel",
    "complexity": "complex"
  },
  {
    "id": "2291",
    "instruction": "How many Nigerians have sitelinks on Wikidata?",
    "query": "SELECT DISTINCT ?item ?itemLabel ?genderLabel ?linkcount WHERE {\n?item wdt:P31 wd:Q5;\nwdt:P21 ?gender;\nwdt:P27 wd:Q1033;\nwikibase:sitelinks ?linkcount.\nFILTER(?linkcount > 0 )\nOPTIONAL { ?item wdt:P734 ?lastname. }\nOPTIONAL { ?item wdt:P569 ?birthdate. }\nOPTIONAL { ?item wdt:P570 ?deathdate. }\nOPTIONAL { ?item wdt:P27 ?nationality. }\nOPTIONAL { ?item wdt:P106 ?occupation. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\".\n?item rdfs:label ?itemLabel.\n?gender rdfs:label ?genderLabel.\n}\n}\nORDER BY (?itemLabel)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?genderLabel ?linkcount WHERE {\n?item wdt:[property:instance of] wd:[entity:human];\nwdt:[property:sex or gender] ?gender;\nwdt:[property:country of citizenship] wd:[entity:Nigeria];\nwikibase:sitelinks ?linkcount.\nFILTER(?linkcount > 0 )\nOPTIONAL { ?item wdt:[property:family name] ?lastname. }\nOPTIONAL { ?item wdt:[property:date of birth] ?birthdate. }\nOPTIONAL { ?item wdt:[property:date of death] ?deathdate. }\nOPTIONAL { ?item wdt:[property:country of citizenship] ?nationality. }\nOPTIONAL { ?item wdt:[property:occupation] ?occupation. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\".\n?item rdfs:label ?itemLabel.\n?gender rdfs:label ?genderLabel.\n}\n}\nORDER BY (?itemLabel)",
    "complexity": "complex"
  },
  {
    "id": "698",
    "instruction": "List the anonymous painters whose works are related to other famous painters.",
    "query": "SELECT ?creatorqualifierLabel (COUNT(?creatorqualifier) AS ?count) WHERE {\n?item wdt:P31 wd:Q3305213 .\n?item wdt:P170 wd:Q4233718 .\nOPTIONAL { ?item p:P170 ?creatorstatement .\n?creatorstatement rdf:type wikibase:BestRank .\n?creatorstatement ?qualifier ?creatorqualifier .\n?qualifierproperty wikibase:qualifier ?qualifier }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n} GROUP BY ?creatorqualifierLabel\nHAVING (?count > 2)\nLIMIT 20000",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?creatorqualifierLabel (COUNT(?creatorqualifier) AS ?count) WHERE {\n?item wdt:[property:instance of] wd:[entity:painting] .\n?item wdt:[property:creator] wd:[entity:anonymous] .\nOPTIONAL { ?item p:[property:creator] ?creatorstatement .\n?creatorstatement rdf:type wikibase:BestRank .\n?creatorstatement ?qualifier ?creatorqualifier .\n?qualifierproperty wikibase:qualifier ?qualifier }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n} GROUP BY ?creatorqualifierLabel\nHAVING (?count > 2)\nLIMIT 20000",
    "complexity": "complex"
  },
  {
    "id": "2015",
    "instruction": "List the UK MPs who lived the longest after leaving office since 1900.",
    "query": "SELECT ?item ?itemLabel ?time ?end_causeLabel ?latest_mp ?dob1 ?dod1\nWITH {\nSELECT ?item (MAX(?end_time) AS ?latest_mp) (MAX(?dod) AS ?dod1) (MAX(?dob) AS ?dob1) WHERE {\nOPTIONAL {?item wdt:P570 ?dod} .\n?item p:P39 ?mp_stmt .\n?mp_stmt ps:P39 ?mp .\n?mp wdt:P279 wd:Q16707842 .\n?mp_stmt pq:P582 ?end_time .\nFILTER(year(?end_time) > 1899) .\nOPTIONAL {?item wdt:P569 ?dob}\n} GROUP BY ?item\n} AS %mps\nWHERE {\nINCLUDE %mps .\n?item p:P39 ?mp_stmt .\n?mp_stmt pq:P582 ?latest_mp .\n?mp_stmt pq:P1534 ?end_cause .\nBIND(COALESCE(?dod1, now()) AS ?date) .\nBIND (((?date - ?latest_mp) / 365.24) AS ?time) .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY DESC(?time)\nLIMIT 200",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?time ?end_causeLabel ?latest_mp ?dob1 ?dod1\nWITH {\nSELECT ?item (MAX(?end_time) AS ?latest_mp) (MAX(?dod) AS ?dod1) (MAX(?dob) AS ?dob1) WHERE {\nOPTIONAL {?item wdt:[property:date of death] ?dod} .\n?item p:[property:position held] ?mp_stmt .\n?mp_stmt ps:[property:position held] ?mp .\n?mp wdt:[property:subclass of] wd:[entity:Member of Parliament] .\n?mp_stmt pq:[property:end time] ?end_time .\nFILTER(year(?end_time) > 1899) .\nOPTIONAL {?item wdt:[property:date of birth] ?dob}\n} GROUP BY ?item\n} AS %mps\nWHERE {\nINCLUDE %mps .\n?item p:[property:position held] ?mp_stmt .\n?mp_stmt pq:[property:end time] ?latest_mp .\n?mp_stmt pq:[property:end cause] ?end_cause .\nBIND(COALESCE(?dod1, now()) AS ?date) .\nBIND (((?date - ?latest_mp) / 365.24) AS ?time) .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY DESC(?time)\nLIMIT 200",
    "complexity": "complex"
  },
  {
    "id": "1011",
    "instruction": "List the countries with the highest number of cities named after saints.",
    "query": "SELECT ?country ?countryLabel (COUNT(DISTINCT ?city) AS ?count) WHERE {\n?city wdt:P31/wdt:P279* wd:Q486972;\nwdt:P17 ?country;\nwdt:P138 [ wdt:P411 wd:Q43115 ].\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nGROUP BY ?country ?countryLabel\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?country ?countryLabel (COUNT(DISTINCT ?city) AS ?count) WHERE {\n?city wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:human settlement];\nwdt:[property:country] ?country;\nwdt:[property:named after] [ wdt:[property:canonization status] wd:[entity:saint] ].\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nGROUP BY ?country ?countryLabel\nORDER BY DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "2795",
    "instruction": "What are the different skills involved in football?",
    "query": "SELECT DISTINCT ?item ?label_es ?label_en ?label_pt_br ?namedAfter ?namedAfterLabel ?image WHERE {\n?item wdt:P279* wd:Q115690264 .\nOPTIONAL { ?item wdt:P18 ?image . }\nOPTIONAL {?item wdt:P138 ?namedAfter }\nOPTIONAL {?item rdfs:label ?label_es .\nFILTER (LANG(?label_es) = \"es\")\n}\nOPTIONAL{\n?item rdfs:label ?label_en .\nFILTER (LANG(?label_en) = \"en\")\n}\nOPTIONAL {\n?item rdfs:label ?label_pt_br .\nFILTER (LANG(?label_pt_br) = \"pt-br\")\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?label_es ?label_en ?label_pt_br ?namedAfter ?namedAfterLabel ?image WHERE {\n?item wdt:[property:subclass of]* wd:[entity:association football skill] .\nOPTIONAL { ?item wdt:[property:image] ?image . }\nOPTIONAL {?item wdt:[property:named after] ?namedAfter }\nOPTIONAL {?item rdfs:label ?label_es .\nFILTER (LANG(?label_es) = \"es\")\n}\nOPTIONAL{\n?item rdfs:label ?label_en .\nFILTER (LANG(?label_en) = \"en\")\n}\nOPTIONAL {\n?item rdfs:label ?label_pt_br .\nFILTER (LANG(?label_pt_br) = \"pt-br\")\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "233",
    "instruction": "What languages are used in manuscripts?",
    "query": "SELECT ?lang ?langLabel ?langDescription (COUNT(DISTINCT ?q) AS ?mcount)\nWHERE {\n?q (wdt:P31/wdt:P279*) wd:Q87167.\n?q p:P195 ?s. ?s ps:P195 ?collection . MINUS {?s pq:P582 []}.\nMINUS { ?s ps:P195 wd:Q1322278 }\n?q wdt:P407 ?lang\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\"\n}\n}\nGROUP BY ?lang ?langLabel ?langDescription\nORDER BY UCASE(?langLabel)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?lang ?langLabel ?langDescription (COUNT(DISTINCT ?q) AS ?mcount)\nWHERE {\n?q (wdt:[property:instance of]/wdt:[property:subclass of]*) wd:[entity:manuscript].\n?q p:[property:collection] ?s. ?s ps:[property:collection] ?collection . MINUS {?s pq:[property:end time] []}.\nMINUS { ?s ps:[property:collection] wd:[entity:Matenadaran] }\n?q wdt:[property:language of work or name] ?lang\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\"\n}\n}\nGROUP BY ?lang ?langLabel ?langDescription\nORDER BY UCASE(?langLabel)",
    "complexity": "complex"
  },
  {
    "id": "1673",
    "instruction": "List European Union member states with a street named after them in Rennes.",
    "query": "SELECT ?country ?countryLabel ?street ?streetLabel ?image WHERE {\n?country wdt:P31 wd:Q3624078 ; wdt:P463 wd:Q458 .\nOPTIONAL {\n?street wdt:P31/wdt:P279* wd:Q83620 ; wdt:P131 wd:Q647 ; wdt:P138 ?country .\nOPTIONAL { ?street wdt:P18 ?image } .\n} .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],fr\" . }\n}\nORDER BY ?countryLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?country ?countryLabel ?street ?streetLabel ?image WHERE {\n?country wdt:[property:instance of] wd:[entity:sovereign state] ; wdt:[property:member of] wd:[entity:European Union] .\nOPTIONAL {\n?street wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:thoroughfare] ; wdt:[property:located in the administrative territorial entity] wd:[entity:Rennes] ; wdt:[property:named after] ?country .\nOPTIONAL { ?street wdt:[property:image] ?image } .\n} .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],fr\" . }\n}\nORDER BY ?countryLabel",
    "complexity": "complex"
  }
]