[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "1666",
    "instruction": "Show me the birthplaces of UK MPs and their constituencies on a map with different colors for each party.",
    "query": "SELECT ?mp ?mpLabel ?image ?pob ?pobLabel ?pobCoords ?con ?conLabel ?conCoords ?line ?rgb ?layer WHERE {\n$mp wdt:P19 ?pob .\nOPTIONAL { ?mp wdt:P18 ?image .}\n?pob wdt:P625 ?pobCoords .\n?pob p:P625 [ ps:P625 []; psv:P625 [ wikibase:geoLongitude ?poblon; wikibase:geoLatitude ?poblat; ] ].\n$mp p:P39 ?mpstmt .\n?mpstmt ps:P39 wd:Q30524710 .\n?mpstmt pq:P768 ?con .\n?con wdt:P625 ?conCoords .\n?con p:P625 [\nps:P625 [];\npsv:P625 [\nwikibase:geoLongitude ?conlon;\nwikibase:geoLatitude ?conlat;\n]\n].\nMINUS {?mpstmt pq:P582 ?e }\n?mpstmt pq:P4100 ?party .\n?party wdt:P465 ?rgb .\n?party rdfs:label ?layer .\nFILTER (LANG(?layer) = \"en\")\nBIND(CONCAT('LINESTRING (', STR(?poblon), ' ', STR(?poblat), ',', STR(?conlon), ' ', STR(?conlat), ')') AS ?str) .\nBIND(STRDT(?str, geo:wktLiteral) AS ?line)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?mp ?mpLabel ?image ?pob ?pobLabel ?pobCoords ?con ?conLabel ?conCoords ?line ?rgb ?layer WHERE {\n$mp wdt:[property:place of birth] ?pob .\nOPTIONAL { ?mp wdt:[property:image] ?image .}\n?pob wdt:[property:coordinate location] ?pobCoords .\n?pob p:[property:coordinate location] [ ps:[property:coordinate location] []; psv:[property:coordinate location] [ wikibase:geoLongitude ?poblon; wikibase:geoLatitude ?poblat; ] ].\n$mp p:[property:position held] ?mpstmt .\n?mpstmt ps:[property:position held] wd:[entity:member of the 57th Parliament of the United Kingdom] .\n?mpstmt pq:[property:electoral district] ?con .\n?con wdt:[property:coordinate location] ?conCoords .\n?con p:[property:coordinate location] [\nps:[property:coordinate location] [];\npsv:[property:coordinate location] [\nwikibase:geoLongitude ?conlon;\nwikibase:geoLatitude ?conlat;\n]\n].\nMINUS {?mpstmt pq:[property:end time] ?e }\n?mpstmt pq:[property:parliamentary group] ?party .\n?party wdt:[property:sRGB color hex triplet] ?rgb .\n?party rdfs:label ?layer .\nFILTER (LANG(?layer) = \"en\")\nBIND(CONCAT('LINESTRING (', STR(?poblon), ' ', STR(?poblat), ',', STR(?conlon), ' ', STR(?conlat), ')') AS ?str) .\nBIND(STRDT(?str, geo:wktLiteral) AS ?line)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "1525",
    "instruction": "List the earliest works created by women with images on Commons.",
    "query": "SELECT ?artist ?artistLabel ?art ?artLabel ?image ?date WHERE {\n{\nSELECT ?artist ?art (SAMPLE(?image) AS ?image) (MIN(?date) AS ?date) WHERE {\n?art wdt:P170 ?artist;\nwdt:P18 ?image;\nwdt:P571 ?date.\n?artist wdt:P31 wd:Q5.\n{ ?artist wdt:P21 wd:Q6581072. } UNION { ?artist wdt:P21 wd:Q1052281. } # using ?artist wdt:P21/wdt:P279? wd:Q6581072 instead would be nice, but is unfortunately too inefficient\n}\nGROUP BY ?artist ?art\nORDER BY ASC(?date)\nLIMIT 1000\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY SHA256(CONCAT(STR(NOW()), STR(?art))) # simulate random order - ORDER BY RAND() doesn't have the desired effect\nLIMIT 100",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?artist ?artistLabel ?art ?artLabel ?image ?date WHERE {\n{\nSELECT ?artist ?art (SAMPLE(?image) AS ?image) (MIN(?date) AS ?date) WHERE {\n?art wdt:[property:creator] ?artist;\nwdt:[property:image] ?image;\nwdt:[property:inception] ?date.\n?artist wdt:[property:instance of] wd:[entity:human].\n{ ?artist wdt:[property:sex or gender] wd:[entity:female]. } UNION { ?artist wdt:[property:sex or gender] wd:[entity:trans woman]. } # using ?artist wdt:[property:sex or gender]/wdt:[property:subclass of]? wd:[entity:female] instead would be nice, but is unfortunately too inefficient\n}\nGROUP BY ?artist ?art\nORDER BY ASC(?date)\nLIMIT 1000\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY SHA256(CONCAT(STR(NOW()), STR(?art))) # simulate random order - ORDER BY RAND() doesn't have the desired effect\nLIMIT 100",
    "complexity": "complex"
  },
  {
    "id": "244",
    "instruction": "List people associated with items in the Ashmolean Museum.",
    "query": "SELECT ?person ?personLabel ?personDescription (SAMPLE(?image) AS ?img) (COUNT(?item) AS ?count) (YEAR(SAMPLE(?time)) AS ?year) WHERE {\n?item wdt:P195 wd:Q636400; wdt:P973 ?url FILTER (STRSTARTS(STR(?url),\"http://jameelcentre\") ).\n?item ?prop ?person.\n?person wdt:P31 wd:Q5.\nOPTIONAL {?person wdt:P18 ?image}\nOPTIONAL {?person wdt:P569 ?birth}\nOPTIONAL {?person wdt:P1317 ?fl}\nOPTIONAL {?person wdt:P2348/wdt:P580 ?erastart}\nBIND(IF(BOUND(?birth), ?birth, IF(BOUND(?fl), ?fl, ?erastart) ) AS ?time).\nSERVICE wikibase:label {bd:serviceParam wikibase:language \"en\"}\n} GROUP BY ?person ?personLabel ?personDescription ORDER BY ?year",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?person ?personLabel ?personDescription (SAMPLE(?image) AS ?img) (COUNT(?item) AS ?count) (YEAR(SAMPLE(?time)) AS ?year) WHERE {\n?item wdt:[property:collection] wd:[entity:Ashmolean Museum]; wdt:[property:described at URL] ?url FILTER (STRSTARTS(STR(?url),\"http://jameelcentre\") ).\n?item ?prop ?person.\n?person wdt:[property:instance of] wd:[entity:human].\nOPTIONAL {?person wdt:[property:image] ?image}\nOPTIONAL {?person wdt:[property:date of birth] ?birth}\nOPTIONAL {?person wdt:[property:floruit] ?fl}\nOPTIONAL {?person wdt:[property:time period]/wdt:[property:start time] ?erastart}\nBIND(IF(BOUND(?birth), ?birth, IF(BOUND(?fl), ?fl, ?erastart) ) AS ?time).\nSERVICE wikibase:label {bd:serviceParam wikibase:language \"en\"}\n} GROUP BY ?person ?personLabel ?personDescription ORDER BY ?year",
    "complexity": "complex"
  },
  {
    "id": "923",
    "instruction": "List actors who have worked with director Tony Scott, along with the number of films they appeared in.",
    "query": "SELECT ?actor ?actorLabel ?FilmCount WHERE {\n{\nSELECT ?actor (COUNT(?film) AS ?FilmCount) WHERE {\n?film wdt:P57 wd:Q193648.\n?film wdt:P161 ?actor.\n}\nGROUP BY ?actor\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nORDER BY DESC(?FilmCount)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?actor ?actorLabel ?FilmCount WHERE {\n{\nSELECT ?actor (COUNT(?film) AS ?FilmCount) WHERE {\n?film wdt:[property:director] wd:[entity:Tony Scott].\n?film wdt:[property:cast member] ?actor.\n}\nGROUP BY ?actor\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nORDER BY DESC(?FilmCount)",
    "complexity": "complex"
  },
  {
    "id": "681",
    "instruction": "List all fictional characters born or deceased in the current decade.",
    "query": "SELECT DISTINCT ?character ?characterLabel ?birth ?death WITH {\n  # Fictional character subclasses as a named subquery\n  SELECT ?fictiontype WHERE {\n    ?fictiontype wdt:P279* wd:Q95074. hint:Prior hint:gearing \"forward\".\n  }\n} AS %i\nWHERE\n{\n  INCLUDE %i\n  ?character wdt:P31 ?fictiontype.\n  # Date of birth\n  { ?character wdt:P569 ?birth . }\n  # Date of death\n  UNION { ?character wdt:P570 ?death . }\n  # Get actual decade to compare with dates\n  BIND(xsd:integer(YEAR(NOW())/10) as ?actual_decade).\n  # Only show characters born or deceased in the current decade\n  FILTER(xsd:integer(YEAR(?birth)/10) = ?actual_decade || xsd:integer(YEAR(?death)/10) = ?actual_decade)\n  SERVICE wikibase:label {\n    bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" .\n  }\n} ORDER BY ?birth ?death",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX hint: <http://www.bigdata.com/queryHints#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?character ?characterLabel ?birth ?death WITH {\n  # Fictional character subclasses as a named subquery\n  SELECT ?fictiontype WHERE {\n    ?fictiontype wdt:[property:subclass of]* wd:[entity:fictional character]. hint:Prior hint:gearing \"forward\".\n  }\n} AS %i\nWHERE\n{\n  INCLUDE %i\n  ?character wdt:[property:instance of] ?fictiontype.\n  # Date of birth\n  { ?character wdt:[property:date of birth] ?birth . }\n  # Date of death\n  UNION { ?character wdt:[property:date of death] ?death . }\n  # Get actual decade to compare with dates\n  BIND(xsd:integer(YEAR(NOW())/10) as ?actual_decade).\n  # Only show characters born or deceased in the current decade\n  FILTER(xsd:integer(YEAR(?birth)/10) = ?actual_decade || xsd:integer(YEAR(?death)/10) = ?actual_decade)\n  SERVICE wikibase:label {\n    bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" .\n  }\n} ORDER BY ?birth ?death",
    "complexity": "complex"
  },
  {
    "id": "788",
    "instruction": "What are the battles that took place in a specific location?",
    "query": "SELECT ?item ?itemLabel ?location ?locationL ?coords ?partof ?partofL ?pointintime ?starttime ?endtime WHERE {\n?item wdt:P31/wdt:P279* wd:Q178561 .\nOPTIONAL {\n?item wdt:P276 ?location .\n?location rdfs:label ?locationL filter (lang(?locationL) = \"en\") .\nOPTIONAL { ?location wdt:P625 ?coords . }\n}\nOPTIONAL {\n?item wdt:P361 ?partof .\n?partof rdfs:label ?partofL filter (lang(?partofL) = \"en\") .\n}\nOPTIONAL { ?item wdt:P585 ?pointintime . }\nOPTIONAL { ?item wdt:P580 ?starttime . }\nOPTIONAL { ?item wdt:P582 ?endtime . }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} ORDER BY ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?location ?locationL ?coords ?partof ?partofL ?pointintime ?starttime ?endtime WHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:battle] .\nOPTIONAL {\n?item wdt:[property:location] ?location .\n?location rdfs:label ?locationL filter (lang(?locationL) = \"en\") .\nOPTIONAL { ?location wdt:[property:coordinate location] ?coords . }\n}\nOPTIONAL {\n?item wdt:[property:part of] ?partof .\n?partof rdfs:label ?partofL filter (lang(?partofL) = \"en\") .\n}\nOPTIONAL { ?item wdt:[property:point in time] ?pointintime . }\nOPTIONAL { ?item wdt:[property:start time] ?starttime . }\nOPTIONAL { ?item wdt:[property:end time] ?endtime . }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} ORDER BY ?itemLabel",
    "complexity": "complex"
  },
  {
    "id": "402",
    "instruction": "List all books written by Q35610, including their titles, illustrators, publishers, and publication dates if available.",
    "query": "SELECT\n?president ?presidentLabel\n?termStart ?termEnd\n?spouse\n?relationshipStart ?relationshipEnd\nWHERE {\n?president wdt:P31 wd:Q5 .\n?president p:P39 ?position_held_statement .\n?position_held_statement ps:P39 wd:Q11696 .\n?position_held_statement pq:P580 ?termStart .\n# current presiden will always miss it\nOPTIONAL {\n?position_held_statement pq:P582 ?termEnd\n}\n# spouse is optional\nOPTIONAL {\n?president p:P26 ?spouseStatement .\n?spouseStatement ps:P26 ?spouse .\n?spouseStatement pq:P580 ?relationshipStart .\n# current spouse will always miss it\nOPTIONAL {\n?spouseStatement pq:P582 ?relationshipEnd\n}\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY ?termStart ?relationshipStart",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT\n?president ?presidentLabel\n?termStart ?termEnd\n?spouse\n?relationshipStart ?relationshipEnd\nWHERE {\n?president wdt:[property:instance of] wd:[entity:human] .\n?president p:[property:position held] ?position_held_statement .\n?position_held_statement ps:[property:position held] wd:[entity:President of the United States] .\n?position_held_statement pq:[property:start time] ?termStart .\n# current presiden will always miss it\nOPTIONAL {\n?position_held_statement pq:[property:end time] ?termEnd\n}\n# spouse is optional\nOPTIONAL {\n?president p:[property:spouse] ?spouseStatement .\n?spouseStatement ps:[property:spouse] ?spouse .\n?spouseStatement pq:[property:start time] ?relationshipStart .\n# current spouse will always miss it\nOPTIONAL {\n?spouseStatement pq:[property:end time] ?relationshipEnd\n}\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY ?termStart ?relationshipStart",
    "complexity": "complex"
  },
  {
    "id": "1709",
    "instruction": "List French female writers whose works are in the public domain.",
    "query": "SELECT ?autrice ?autriceLabel ?lieuNaissance ?lieuNaissanceLabel ?lieuMort ?lieuMortLabel (MIN(?img) AS ?image) ?prenomLabel (MIN(?idIsni) as ?isni) ?idBnf (MIN(?n) AS ?naissance) (MAX(?m) AS ?mort) WHERE {\n?autrice wdt:P106 wd:Q36180.\n?autrice wdt:P21 wd:Q6581072.\n?autrice wdt:P570 ?m.\n{ ?autrice wdt:P1412 wd:Q150. }\nUNION\n{ ?autrice wdt:P1412 wd:Q1473289. }\nOPTIONAL { ?autrice wdt:P569 ?n.}\nOPTIONAL { ?autrice wdt:P19 ?lieuNaissance.}\nOPTIONAL { ?autrice wdt:P20 ?lieuMort.}\nOPTIONAL { ?autrice wdt:P18 ?img. }\nOPTIONAL { ?autrice wdt:P735 ?prenom. }\nOPTIONAL { ?autrice wdt:P213 ?idIsni. }\nOPTIONAL { ?autrice wdt:P268 ?idBnf. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],fr,en\". }\nFILTER((YEAR(?m)) < 1949)\n}\nGROUP BY ?autrice ?autriceLabel ?lieuNaissance ?lieuNaissanceLabel ?lieuMort ?lieuMortLabel ?image ?prenomLabel ?isni ?idBnf ?mort ?naissance\nORDER BY DESC(?naissance)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?autrice ?autriceLabel ?lieuNaissance ?lieuNaissanceLabel ?lieuMort ?lieuMortLabel (MIN(?img) AS ?image) ?prenomLabel (MIN(?idIsni) as ?isni) ?idBnf (MIN(?n) AS ?naissance) (MAX(?m) AS ?mort) WHERE {\n?autrice wdt:[property:occupation] wd:[entity:writer].\n?autrice wdt:[property:sex or gender] wd:[entity:female].\n?autrice wdt:[property:date of death] ?m.\n{ ?autrice wdt:[property:languages spoken, written or signed] wd:[entity:French]. }\nUNION\n{ ?autrice wdt:[property:languages spoken, written or signed] wd:[entity:Middle French]. }\nOPTIONAL { ?autrice wdt:[property:date of birth] ?n.}\nOPTIONAL { ?autrice wdt:[property:place of birth] ?lieuNaissance.}\nOPTIONAL { ?autrice wdt:[property:place of death] ?lieuMort.}\nOPTIONAL { ?autrice wdt:[property:image] ?img. }\nOPTIONAL { ?autrice wdt:[property:given name] ?prenom. }\nOPTIONAL { ?autrice wdt:[property:sex or gender]3 ?idIsni. }\nOPTIONAL { ?autrice wdt:[property:Biblioth\u00e8que nationale de France ID] ?idBnf. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],fr,en\". }\nFILTER((YEAR(?m)) < 1949)\n}\nGROUP BY ?autrice ?autriceLabel ?lieuNaissance ?lieuNaissanceLabel ?lieuMort ?lieuMortLabel ?image ?prenomLabel ?isni ?idBnf ?mort ?naissance\nORDER BY DESC(?naissance)",
    "complexity": "complex"
  },
  {
    "id": "1072",
    "instruction": "List languages that use multiple writing systems.",
    "query": "SELECT ?language ?languageLabel (COUNT(?writingSystem) AS ?count) (GROUP_CONCAT(?writingSystemLabel; separator = \", \") AS ?writingSystems) WITH {\nSELECT ?language WHERE {\n?language p:P282/ps:P282 ?writingSystem.\n}\nGROUP BY ?language\nHAVING(COUNT(?writingSystem) > 1)\n} AS %languages WHERE {\nINCLUDE %languages.\n?language p:P282/ps:P282 ?writingSystem.\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\".\n?language rdfs:label ?languageLabel.\n?writingSystem rdfs:label ?writingSystemLabel.\n}\n}\nGROUP BY ?language ?languageLabel\nHAVING(?count > 1)\nORDER BY DESC(?count) ASC(?languageLabel)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?language ?languageLabel (COUNT(?writingSystem) AS ?count) (GROUP_CONCAT(?writingSystemLabel; separator = \", \") AS ?writingSystems) WITH {\nSELECT ?language WHERE {\n?language p:[property:writing system]/ps:[property:writing system] ?writingSystem.\n}\nGROUP BY ?language\nHAVING(COUNT(?writingSystem) > 1)\n} AS %languages WHERE {\nINCLUDE %languages.\n?language p:[property:writing system]/ps:[property:writing system] ?writingSystem.\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\".\n?language rdfs:label ?languageLabel.\n?writingSystem rdfs:label ?writingSystemLabel.\n}\n}\nGROUP BY ?language ?languageLabel\nHAVING(?count > 1)\nORDER BY DESC(?count) ASC(?languageLabel)",
    "complexity": "complex"
  },
  {
    "id": "962",
    "instruction": "What is the most common birthday in the United States?",
    "query": "SELECT ?day (COUNT(DISTINCT ?person) AS ?count)\nWHERE\n{\n?person wdt:P31 wd:Q5;\nwdt:P27 wd:Q30;\np:P569/psv:P569 [ wikibase:timeValue ?day; wikibase:timePrecision 11 ].\n}\nGROUP BY ?day\nORDER BY DESC(?count)\nLIMIT 10",
    "annotated": "PREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?day (COUNT(DISTINCT ?person) AS ?count)\nWHERE\n{\n?person wdt:[property:instance of] wd:[entity:human];\nwdt:[property:country of citizenship] wd:[entity:United States of America];\np:[property:date of birth]/psv:[property:date of birth] [ wikibase:timeValue ?day; wikibase:timePrecision 11 ].\n}\nGROUP BY ?day\nORDER BY DESC(?count)\nLIMIT 10",
    "complexity": "complex"
  },
  {
    "id": "143",
    "instruction": "List all types of fictional characters in Wikidata.",
    "query": "SELECT ?type ?typeLabel (COUNT(?character) AS ?count)\nWHERE {\n?character wdt:P31 ?type.\n?type wdt:P279* wd:Q95074\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} GROUP BY ?type ?typeLabel ORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?type ?typeLabel (COUNT(?character) AS ?count)\nWHERE {\n?character wdt:[property:instance of] ?type.\n?type wdt:[property:subclass of]* wd:[entity:fictional character]\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} GROUP BY ?type ?typeLabel ORDER BY DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "646",
    "instruction": "Show me the locations of churches in Kirchenkreis Wittenberg on a map.",
    "query": "SELECT ?item ?itemLabel ?pbLabel (SAMPLE(?cat) AS ?cat) (SAMPLE(?coord) AS ?coord) (SAMPLE(?img) AS ?img)\nWHERE {\nwd:Q75849591 wdt:P527 [ wdt:P527 ?item; wdt:P361 ?pb ].\n?pb wdt:P31 wd:Q76598130.\n?item wdt:P625 ?coord.\nOPTIONAL { ?item wdt:P373 ?cat. }\nOPTIONAL { ?item wdt:P18 ?img. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"de\". }\n} GROUP BY ?item ?itemLabel ?pbLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?pbLabel (SAMPLE(?cat) AS ?cat) (SAMPLE(?coord) AS ?coord) (SAMPLE(?img) AS ?img)\nWHERE {\nwd:[entity:Churches in Kirchenkreis Wittenberg] wdt:[property:has part(s)] [ wdt:[property:has part(s)] ?item; wdt:[property:part of] ?pb ].\n?pb wdt:[property:instance of] wd:[entity:parish area of EKMD].\n?item wdt:[property:coordinate location] ?coord.\nOPTIONAL { ?item wdt:[property:Commons category] ?cat. }\nOPTIONAL { ?item wdt:[property:image] ?img. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"de\". }\n} GROUP BY ?item ?itemLabel ?pbLabel",
    "complexity": "complex"
  },
  {
    "id": "1576",
    "instruction": "List all airports and railway stations named after fictional characters or literary works.",
    "query": "select distinct ?item ?itemLabel ?typeLabel ?countryLabel ?subjectLabel ?namesakeLabel ?namesake\nwhere\n{\n?item wdt:P31 ?type . # item is ...\n{ ?type wdt:P279* wd:Q20977775 } union # an airport (defined broadly)\n{ ?type wdt:P279* wd:Q55488 } # or a rail station (ditto)\n?item wdt:P138 ?namesake . # item is named after something\n?namesake wdt:P31 ?subject . # namesake is ...\n{ ?subject wdt:P279* wd:Q95074 } union # a fictional character\n# (definition here excludes deities & biblical figures)\n{ ?subject wdt:P279* wd:Q7725634 } union # or a literary work\n{ ?subject wdt:P279* wd:Q7725310 } # or a series of works\noptional { ?item wdt:P17 ?country } . # what country is the something in?\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n} order by ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nselect distinct ?item ?itemLabel ?typeLabel ?countryLabel ?subjectLabel ?namesakeLabel ?namesake\nwhere\n{\n?item wdt:[property:instance of] ?type . # item is ...\n{ ?type wdt:[property:subclass of]* wd:[entity:air transport infrastructure] } union # an airport (defined broadly)\n{ ?type wdt:[property:subclass of]* wd:[entity:railway station] } # or a rail station (ditto)\n?item wdt:[property:named after] ?namesake . # item is named after something\n?namesake wdt:[property:instance of] ?subject . # namesake is ...\n{ ?subject wdt:[property:subclass of]* wd:[entity:fictional character] } union # a fictional character\n# (definition here excludes deities & biblical figures)\n{ ?subject wdt:[property:subclass of]* wd:[entity:literary work] } union # or a literary work\n{ ?subject wdt:[property:subclass of]* wd:[entity:series of creative works] } # or a series of works\noptional { ?item wdt:[property:country] ?country } . # what country is the something in?\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n} order by ?itemLabel",
    "complexity": "complex"
  },
  {
    "id": "2470",
    "instruction": "Find the locations of mass graves from the Spanish Civil War on a map.",
    "query": "SELECT ?hobi_komun ?hobi_komunLabel ?lat ?lon ?coord ?pertsona_hilak WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?hobi_komun wdt:P31 wd:Q734271;\nwdt:P607 wd:Q10859;\np:P625 _:b5.\n_:b5 psv:P625 _:b4.\n_:b4 wikibase:geoLatitude ?lat;\nwikibase:geoLongitude ?lon;\nwikibase:geoGlobe ?globe.\n_:b5 ps:P625 ?coord.\n?hobi_komun wdt:P1120 ?pertsona_hilak.\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?hobi_komun ?hobi_komunLabel ?lat ?lon ?coord ?pertsona_hilak WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?hobi_komun wdt:[property:instance of] wd:[entity:mass grave];\nwdt:[property:conflict] wd:[entity:Spanish Civil War];\np:[property:coordinate location] _:b5.\n_:b5 psv:[property:coordinate location] _:b4.\n_:b4 wikibase:geoLatitude ?lat;\nwikibase:geoLongitude ?lon;\nwikibase:geoGlobe ?globe.\n_:b5 ps:[property:coordinate location] ?coord.\n?hobi_komun wdt:[property:number of deaths] ?pertsona_hilak.\n}",
    "complexity": "complex"
  },
  {
    "id": "1068",
    "instruction": "List countries that do not have any rivers.",
    "query": "SELECT ?country ?countryLabel WITH {\nSELECT DISTINCT ?country WHERE {\n?river wdt:P31/wdt:P279* wd:Q4022;\nwdt:P17 ?country.\n}\n} AS %countriesWithRivers WHERE {\n?country wdt:P31 wd:Q160016.\nMINUS { INCLUDE %countriesWithRivers. }\nMINUS { ?country wdt:P31/wdt:P279* wd:Q19953632. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY ?countryLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?country ?countryLabel WITH {\nSELECT DISTINCT ?country WHERE {\n?river wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:river];\nwdt:[property:country] ?country.\n}\n} AS %countriesWithRivers WHERE {\n?country wdt:[property:instance of] wd:[entity:member states of the United Nations].\nMINUS { INCLUDE %countriesWithRivers. }\nMINUS { ?country wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:former administrative territorial entity]. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY ?countryLabel",
    "complexity": "complex"
  },
  {
    "id": "2618",
    "instruction": "List all candidates participating in the French legislative elections.",
    "query": "SELECT ?item ?itemLabel ?circo ?circoLabel (COUNT(*) AS ?count) WHERE {\n?item wdt:P31 wd:Q5;\np:P3602 ?statement.\n?statement ps:P3602 wd:Q106253677.\nOPTIONAL { ?statement pq:P768 ?circo. }\n?sitelink schema:about ?item.\nFILTER (SUBSTR(str(?sitelink), 11, 15) = \".wikipedia.org/\") .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr,en\". }\n}\nGROUP BY ?item ?itemLabel ?circo ?circoLabel\nORDER BY DESC (?count)\nLIMIT 100",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?circo ?circoLabel (COUNT(*) AS ?count) WHERE {\n?item wdt:[property:instance of] wd:[entity:human];\np:[property:candidacy in election] ?statement.\n?statement ps:[property:candidacy in election] wd:[entity:2022 French legislative election].\nOPTIONAL { ?statement pq:[property:electoral district] ?circo. }\n?sitelink schema:about ?item.\nFILTER (SUBSTR(str(?sitelink), 11, 15) = \".wikipedia.org/\") .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr,en\". }\n}\nGROUP BY ?item ?itemLabel ?circo ?circoLabel\nORDER BY DESC (?count)\nLIMIT 100",
    "complexity": "complex"
  },
  {
    "id": "1991",
    "instruction": "List the richest LGBTQ+ individuals according to Wikidata.",
    "query": "SELECT ?person ?personLabel ?netWorthUSD ?orientationLabel ?genderLabel WHERE {\n?person wdt:P31 wd:Q5;\np:P2218/psv:P2218 [\nwikibase:quantityAmount ?netWorthUSD;\nwikibase:quantityUnit wd:Q4917\n].\nOPTIONAL {\n?person wdt:P91 ?orientation.\n?orientation wdt:P279* wd:Q339014.\n}\nOPTIONAL {\n?person wdt:P21 ?gender.\nFILTER(?gender NOT IN (wd:Q6581097, wd:Q6581072))\n}\nFILTER(BOUND(?orientation) || BOUND(?gender))\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?netWorthUSD)\nLIMIT 50",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?person ?personLabel ?netWorthUSD ?orientationLabel ?genderLabel WHERE {\n?person wdt:[property:instance of] wd:[entity:human];\np:[property:net worth]/psv:[property:net worth] [\nwikibase:quantityAmount ?netWorthUSD;\nwikibase:quantityUnit wd:[entity:United States dollar]\n].\nOPTIONAL {\n?person wdt:[property:sexual orientation] ?orientation.\n?orientation wdt:[property:subclass of]* wd:[entity:non-heterosexuality].\n}\nOPTIONAL {\n?person wdt:[property:sex or gender] ?gender.\nFILTER(?gender NOT IN (wd:[entity:male], wd:[entity:female]))\n}\nFILTER(BOUND(?orientation) || BOUND(?gender))\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?netWorthUSD)\nLIMIT 50",
    "complexity": "complex"
  },
  {
    "id": "1571",
    "instruction": "List the number of Indian films directed and written by the same person, categorized by language.",
    "query": "SELECT ?cid (str(SAMPLE(?year)) AS ?year ) (COUNT(*) AS ?count) ?cause WHERE {\n?pid wdt:P31 wd:Q11424.\n?pid wdt:P364 ?cid.\n?pid wdt:P495 wd:Q668.\n?pid wdt:P57 ?dir;\nwdt:P58 ?prod.\nFILTER(?dir = ?prod).\nOPTIONAL {\n?cid rdfs:label ?cause.\nFILTER((LANG(?cause)) = \"en\")\n}\n?pid wdt:P577 ?_date_of_death.\nBIND ( YEAR(?_date_of_death) AS ?year )\nFILTER( BOUND(?cause) )\nFILTER( BOUND(?year) )\nFILTER( ?year > 1983 )\n}\nGROUP BY ?cid ?cause ?year\n#",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?cid (str(SAMPLE(?year)) AS ?year ) (COUNT(*) AS ?count) ?cause WHERE {\n?pid wdt:[property:instance of] wd:[entity:film].\n?pid wdt:[property:original language of film or TV show] ?cid.\n?pid wdt:[property:country of origin] wd:[entity:India].\n?pid wdt:[property:director] ?dir;\nwdt:[property:screenwriter] ?prod.\nFILTER(?dir = ?prod).\nOPTIONAL {\n?cid rdfs:label ?cause.\nFILTER((LANG(?cause)) = \"en\")\n}\n?pid wdt:[property:director]7 ?_date_of_death.\nBIND ( YEAR(?_date_of_death) AS ?year )\nFILTER( BOUND(?cause) )\nFILTER( BOUND(?year) )\nFILTER( ?year > 1983 )\n}\nGROUP BY ?cid ?cause ?year\n#",
    "complexity": "complex"
  }
]