[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "2585",
    "instruction": "Find information about Elizabeth Keckley's profession.",
    "query": "SELECT ?item1 ?image ?item1Label ?item2 ?image2 ?item2Label ?edgeLabel WHERE {\nVALUES ?item1 {wd:Q28873655 wd:Q169390 wd:Q4184 wd:Q1344 wd:Q189729 wd:Q63490060 wd:Q2858869 wd:Q109026069 wd:Q148584 wd:Q3073495 wd:Q105096136 wd:Q5363058 wd:Q105095679 wd:Q215062 wd:Q91 wd:Q200539 wd:Q98534768 wd:Q7725634}\nVALUES ?item2 {wd:Q28873655 wd:Q169390 wd:Q4184 wd:Q1344 wd:Q189729 wd:Q63490060 wd:Q2858869 wd:Q109026069 wd:Q148584 wd:Q3073495 wd:Q105096136 wd:Q5363058 wd:Q105095679 wd:Q215062 wd:Q91 wd:Q200539 wd:Q98534768 wd:Q7725634}\n?item1 ?prop ?item2.\n?edge ?dummy ?prop ; rdf:type wikibase:Property\nOPTIONAL {?item1 wdt:P18 ?image}\nOPTIONAL {?item2 wdt:P18 ?image2}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item1 ?image ?item1Label ?item2 ?image2 ?item2Label ?edgeLabel WHERE {\nVALUES ?item1 {wd:[entity:dressmaking] wd:[entity:abolitionism] wd:[entity:autobiography] wd:[entity:opera] wd:[entity:Philip Glass] wd:[entity:Elizabeth Keckley] wd:[entity:Appomattox] wd:[entity:Pair of stars and stripes slippers attributed to Elizabeth Keckley] wd:[entity:National Museum of American History] wd:[entity:National Museum of African American History and Culture] wd:[entity:Ladies' Contraband Relief Association] wd:[entity:Elizabeth Keckley] wd:[entity:Mary Lincoln's Dress] wd:[entity:Mary Todd Lincoln] wd:[entity:Abraham Lincoln] wd:[entity:dress] wd:[entity:Behind the Scenes] wd:[entity:literary work]}\nVALUES ?item2 {wd:[entity:dressmaking] wd:[entity:abolitionism] wd:[entity:autobiography] wd:[entity:opera] wd:[entity:Philip Glass] wd:[entity:Elizabeth Keckley] wd:[entity:Appomattox] wd:[entity:Pair of stars and stripes slippers attributed to Elizabeth Keckley] wd:[entity:National Museum of American History] wd:[entity:National Museum of African American History and Culture] wd:[entity:Ladies' Contraband Relief Association] wd:[entity:Elizabeth Keckley] wd:[entity:Mary Lincoln's Dress] wd:[entity:Mary Todd Lincoln] wd:[entity:Abraham Lincoln] wd:[entity:dress] wd:[entity:Behind the Scenes] wd:[entity:literary work]}\n?item1 ?prop ?item2.\n?edge ?dummy ?prop ; rdf:type wikibase:Property\nOPTIONAL {?item1 wdt:[property:image] ?image}\nOPTIONAL {?item2 wdt:[property:image] ?image2}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "85",
    "instruction": "List all types of instances on English Wikisource with their count.",
    "query": "SELECT ?type ?typeLabel (COUNT(?ws) as ?count) (COUNT(?date) as ?have_date)\nWHERE {\n?article schema:about ?ws;\nschema:isPartOf <https://en.wikisource.org/>.\n?ws wdt:P31 ?type\nOPTIONAL {?ws wdt:P577 ?date}\nMINUS {?type wdt:P279+ wd:Q17442446}\nMINUS {?type wdt:P279 wd:Q14204246}\nMINUS {?type wdt:P279+ wd:Q17379835}\nOPTIONAL {?type rdfs:label ?typeLabel filter(lang(?typeLabel) = \"en\") }\n} GROUP BY ?type ?typeLabel\nORDER BY DESC(?count)",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?type ?typeLabel (COUNT(?ws) as ?count) (COUNT(?date) as ?have_date)\nWHERE {\n?article schema:about ?ws;\nschema:isPartOf <https://en.wikisource.org/>.\n?ws wdt:[property:instance of] ?type\nOPTIONAL {?ws wdt:[property:publication date] ?date}\nMINUS {?type wdt:[property:subclass of]+ wd:[entity:Wikimedia internal item]}\nMINUS {?type wdt:[property:subclass of] wd:[entity:Wikimedia project page]}\nMINUS {?type wdt:[property:subclass of]+ wd:[entity:Wikimedia page outside the main knowledge tree]}\nOPTIONAL {?type rdfs:label ?typeLabel filter(lang(?typeLabel) = \"en\") }\n} GROUP BY ?type ?typeLabel\nORDER BY DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "1049",
    "instruction": "List the streets in Paris named after countries.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?placeLabel ?countryLabel ?coords WHERE {\n?item wdt:P31/wdt:P279* wd:Q294440 ;\nwdt:P131/wdt:P131 wd:Q90 ;\nwdt:P138 ?place .\n?place wdt:P625 ?coords ;\nwdt:P1376 ?country .\n?country wdt:P31 wd:Q3624078 .\nFILTER NOT EXISTS { ?country wdt:P576 ?x }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\" . }\n} ORDER BY ?placeLabel ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?placeLabel ?countryLabel ?coords WHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:public space] ;\nwdt:[property:located in the administrative territorial entity]/wdt:[property:located in the administrative territorial entity] wd:[entity:Paris] ;\nwdt:[property:named after] ?place .\n?place wdt:[property:coordinate location] ?coords ;\nwdt:[property:capital of] ?country .\n?country wdt:[property:instance of] wd:[entity:sovereign state] .\nFILTER NOT EXISTS { ?country wdt:[property:dissolved, abolished or demolished date] ?x }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\" . }\n} ORDER BY ?placeLabel ?itemLabel",
    "complexity": "complex"
  },
  {
    "id": "27",
    "instruction": "List the colleges of University of Oxford with their notable alumni.",
    "query": "SELECT ?college ?collegeLabel (COUNT(DISTINCT ?alum) AS ?count)\nWHERE {\n{?college wdt:P31 wd:Q2581649} UNION {?college wdt:P31 wd:Q3338504}. # college or private hall\n?alum wdt:P69 ?college.\nMINUS { ?alum wdt:P31 wd:Q15632617 } # Exclude fictional people\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\".\n?college rdfs:label ?collegeLabel }\n} GROUP BY ?college ?collegeLabel\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?college ?collegeLabel (COUNT(DISTINCT ?alum) AS ?count)\nWHERE {\n{?college wdt:[property:instance of] wd:[entity:college of the University of Oxford]} UNION {?college wdt:[property:instance of] wd:[entity:Permanent Private Hall]}. # college or private hall\n?alum wdt:[property:educated at] ?college.\nMINUS { ?alum wdt:[property:instance of] wd:[entity:fictional human] } # Exclude fictional people\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\".\n?college rdfs:label ?collegeLabel }\n} GROUP BY ?college ?collegeLabel\nORDER BY DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "1967",
    "instruction": "What is the age of each US president and vice-president when they left office?",
    "query": "SELECT ?person ?personLabel (MAX(?end_or_now) as ?last_date) (MAX(?age_end_or_now) as ?age_at_date) (?when - YEAR(?last_date) as ?years_alive_since) ?dob ?dod ?when ?age\n{\nVALUES ?office { wd:Q11699 wd:Q11696 }\n?st ps:P39 ?office .\n?person wdt:P31 wd:Q5; p:P39 ?st .\nOPTIONAL { ?st pq:P582 ?e }\nBIND( COALESCE(?e, NOW() ) as ?end_or_now)\n?person wdt:P569 ?dob .\nOPTIONAL { ?person wdt:P570 ?dod } .\nBIND( COALESCE( YEAR( ?dod) , YEAR(NOW()) ) as ?when )\nBIND( ?when - YEAR(?dob) as ?age)\nBIND(YEAR(?end_or_now)-YEAR(?dob) as ?age_end_or_now)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}\nGROUP BY ?person ?personLabel ?dob ?dod ?age ?when\nORDER BY DESC(?age)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?person ?personLabel (MAX(?end_or_now) as ?last_date) (MAX(?age_end_or_now) as ?age_at_date) (?when - YEAR(?last_date) as ?years_alive_since) ?dob ?dod ?when ?age\n{\nVALUES ?office { wd:[entity:Vice President of the United States] wd:[entity:President of the United States] }\n?st ps:[property:position held] ?office .\n?person wdt:[property:instance of] wd:[entity:human]; p:[property:position held] ?st .\nOPTIONAL { ?st pq:[property:end time] ?e }\nBIND( COALESCE(?e, NOW() ) as ?end_or_now)\n?person wdt:[property:date of birth] ?dob .\nOPTIONAL { ?person wdt:[property:date of death] ?dod } .\nBIND( COALESCE( YEAR( ?dod) , YEAR(NOW()) ) as ?when )\nBIND( ?when - YEAR(?dob) as ?age)\nBIND(YEAR(?end_or_now)-YEAR(?dob) as ?age_end_or_now)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}\nGROUP BY ?person ?personLabel ?dob ?dod ?age ?when\nORDER BY DESC(?age)",
    "complexity": "complex"
  },
  {
    "id": "1127",
    "instruction": "What are the most common eponyms of French departments?",
    "query": "SELECT DISTINCT ?eponym ?eponymLabel (count(?item) AS ?count) WHERE {\n?item wdt:P31/wdt:P279* wd:Q6465 ;\nwdt:P138 ?eponym .\nFILTER NOT EXISTS { ?item wdt:P576 ?x }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n}\nGROUP BY ?eponym ?eponymLabel\nHAVING (?count >= 2)\nORDER BY DESC(?count) ?eponymLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?eponym ?eponymLabel (count(?item) AS ?count) WHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:department of France] ;\nwdt:[property:named after] ?eponym .\nFILTER NOT EXISTS { ?item wdt:[property:dissolved, abolished or demolished date] ?x }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n}\nGROUP BY ?eponym ?eponymLabel\nHAVING (?count >= 2)\nORDER BY DESC(?count) ?eponymLabel",
    "complexity": "complex"
  },
  {
    "id": "2351",
    "instruction": "How many featured articles on fr.wikipedia.org are about males and females?",
    "query": "SELECT ?gender ?genderLabel (COUNT(*) AS ?count) WHERE {\nSERVICE wikibase:mwapi {\nbd:serviceParam wikibase:endpoint \"fr.wikipedia.org\";\nwikibase:api \"Generator\";\nmwapi:generator \"categorymembers\";\nmwapi:gcmtitle \"Categorie:Article de qualite\";\nmwapi:gcmprop \"title\".\n?item wikibase:apiOutputItem mwapi:item.\n?title wikibase:apiOutput mwapi:title .\n?namespace wikibase:apiOutput \"@ns\" .\n}\nFILTER (?namespace = \"0\")\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?item wdt:P31 wd:Q5;\nwdt:P21 ?gender.\n}\nGROUP BY ?gender ?genderLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?gender ?genderLabel (COUNT(*) AS ?count) WHERE {\nSERVICE wikibase:mwapi {\nbd:serviceParam wikibase:endpoint \"fr.wikipedia.org\";\nwikibase:api \"Generator\";\nmwapi:generator \"categorymembers\";\nmwapi:gcmtitle \"Categorie:Article de qualite\";\nmwapi:gcmprop \"title\".\n?item wikibase:apiOutputItem mwapi:item.\n?title wikibase:apiOutput mwapi:title .\n?namespace wikibase:apiOutput \"@ns\" .\n}\nFILTER (?namespace = \"0\")\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?item wdt:[property:instance of] wd:[entity:human];\nwdt:[property:sex or gender] ?gender.\n}\nGROUP BY ?gender ?genderLabel",
    "complexity": "complex"
  },
  {
    "id": "1162",
    "instruction": "What are the largest administrative divisions by area?",
    "query": "SELECT DISTINCT ?item ?itemLabel ?countryLabel ?area ?population WHERE {\n?item wdt:P31/wdt:P279* wd:Q10864048 ; # first-level subdivision\nwdt:P17 ?country ; # country\np:P2046/psv:P2046 [ # area\nwikibase:quantityAmount ?baseArea;\nwikibase:quantityUnit [\np:P2370/psv:P2370 [\nwikibase:quantityAmount ?unitArea;\nwikibase:quantityUnit wd:Q25343\n]\n]\n] ;\nwdt:P1082 ?population . # population\nBIND(ROUND(?baseArea * ?unitArea / 1000000) AS ?area) .\nFILTER ( ?area >= 400000 )\nFILTER NOT EXISTS { ?item wdt:P576 ?x } # filter dissolved subdivisions\nFILTER NOT EXISTS { ?country wdt:P576 ?x } # filter dissolved countries\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n}\nORDER BY DESC(?area)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?countryLabel ?area ?population WHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:first-level administrative division] ; # first-level subdivision\nwdt:[property:country] ?country ; # country\np:[property:area]/psv:[property:area] [ # area\nwikibase:quantityAmount ?baseArea;\nwikibase:quantityUnit [\np:[property:conversion to SI unit]/psv:[property:conversion to SI unit] [\nwikibase:quantityAmount ?unitArea;\nwikibase:quantityUnit wd:[entity:square metre]\n]\n]\n] ;\nwdt:[property:population] ?population . # population\nBIND(ROUND(?baseArea * ?unitArea / 1000000) AS ?area) .\nFILTER ( ?area >= 400000 )\nFILTER NOT EXISTS { ?item wdt:[property:dissolved, abolished or demolished date] ?x } # filter dissolved subdivisions\nFILTER NOT EXISTS { ?country wdt:[property:dissolved, abolished or demolished date] ?x } # filter dissolved countries\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n}\nORDER BY DESC(?area)",
    "complexity": "complex"
  },
  {
    "id": "135",
    "instruction": "Show me a global map of national parks with their coordinates.",
    "query": "SELECT ?park ?countryLabel ?parkLabel ?coord (SAMPLE(?image) AS ?image) ?web WHERE {\n?park wdt:P31/wdt:P279* wd:Q46169; wdt:P625 ?coord.\nOPTIONAL {?park wdt:P18 ?image}\nOPTIONAL {?park wdt:P856 ?web}\nOPTIONAL {?park wdt:P17 ?country}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} GROUP BY ?park ?countryLabel ?parkLabel ?coord ?web",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?park ?countryLabel ?parkLabel ?coord (SAMPLE(?image) AS ?image) ?web WHERE {\n?park wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:national park]; wdt:[property:coordinate location] ?coord.\nOPTIONAL {?park wdt:[property:image] ?image}\nOPTIONAL {?park wdt:[property:official website] ?web}\nOPTIONAL {?park wdt:[property:country] ?country}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} GROUP BY ?park ?countryLabel ?parkLabel ?coord ?web",
    "complexity": "complex"
  },
  {
    "id": "2047",
    "instruction": "How many Irish Statutory Instruments were published between 1948 and 2020?",
    "query": "SELECT ?part (STR(YEAR(?pit)) AS ?year) (COUNT(*) AS ?counts)\nWHERE\n{\n?item wdt:P31 wd:Q100532807.\n?item wdt:P179 ?part.\n?part wdt:P1001 wd:Q27;\nwdt:P585 ?pit.\n}\nGROUP BY ?part ?partLabel ?pit",
    "annotated": "PREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?part (STR(YEAR(?pit)) AS ?year) (COUNT(*) AS ?counts)\nWHERE\n{\n?item wdt:[property:instance of] wd:[entity:Irish Statutory Instrument].\n?item wdt:[property:part of the series] ?part.\n?part wdt:[property:applies to jurisdiction] wd:[entity:Republic of Ireland];\nwdt:[property:point in time] ?pit.\n}\nGROUP BY ?part ?partLabel ?pit",
    "complexity": "complex"
  },
  {
    "id": "1436",
    "instruction": "List all countries with their total number of sister cities.",
    "query": "SELECT ?country ?countryLabel ?cityCount WITH {\nSELECT ?country (COUNT(?sisterCity) AS ?cityCount) WHERE {\n?city wdt:P17 ?country;\nwdt:P190 ?sisterCity.\n}\nGROUP BY ?country\n} AS %results WHERE {\nINCLUDE %results.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?cityCount)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?country ?countryLabel ?cityCount WITH {\nSELECT ?country (COUNT(?sisterCity) AS ?cityCount) WHERE {\n?city wdt:[property:country] ?country;\nwdt:[property:twinned administrative body] ?sisterCity.\n}\nGROUP BY ?country\n} AS %results WHERE {\nINCLUDE %results.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?cityCount)",
    "complexity": "complex"
  },
  {
    "id": "963",
    "instruction": "List all places named after Polish citizens.",
    "query": "SELECT ?item ?itemLabel ?person ?personLabel ?coords WHERE {\n{\n?item wdt:P138 ?person.\n?item wdt:P625 ?coords.\n?person wdt:P27 wd:Q36.\n}\nUNION\n{\n?item wdt:P138 ?person.\n?item wdt:P625 ?coords.\n?person wdt:P19 ?place.\n?place wdt:P17 wd:Q36.\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?person ?personLabel ?coords WHERE {\n{\n?item wdt:[property:named after] ?person.\n?item wdt:[property:coordinate location] ?coords.\n?person wdt:[property:country of citizenship] wd:[entity:Poland].\n}\nUNION\n{\n?item wdt:[property:named after] ?person.\n?item wdt:[property:coordinate location] ?coords.\n?person wdt:[property:place of birth] ?place.\n?place wdt:[property:country] wd:[entity:Poland].\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "1241",
    "instruction": "Find Nobel Prize winners without a LIBRIS ID.",
    "query": "SELECT DISTINCT ?article ?NobelArticle ?SELIBR ?VIAF WHERE {\n?laureate p:P166 ?awardStat.\n?nobelPrize wdt:P31 wd:Q7191 . # Nobelprize\n?awardStat ps:P166 ?nobelPrize . # ... that has the value Nobel Prize )\nminus {?laureate wdt:P906 ?librisID}\nOPTIONAL {?laureate wdt:P214 ?VIAFID}\nBIND (URI(CONCAT(\"https://viaf.org/viaf/\",?VIAFID)) AS ?VIAF)\nOPTIONAL {?article schema:about ?laureate .\n?article schema:isPartOf <https://sv.wikipedia.org/>}\nOPTIONAL {?article schema:about ?laureate .\n?article schema:isPartOf <https://en.wikipedia.org/>}\nOPTIONAL{?laureate wdt:P3188 ?Na}\nBIND (URI(CONCAT(\"https://www.nobelprize.org/nobel_prizes/\",?Na,\"-facts.html\")) AS ?NobelArticle)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,de,da,nl\". }\n} Group by ?place ?img ?twitter ?motivation ?article ?NobelArticle ?coord22 ?SELIBR ?VIAF",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?article ?NobelArticle ?SELIBR ?VIAF WHERE {\n?laureate p:[property:award received] ?awardStat.\n?nobelPrize wdt:[property:instance of] wd:[entity:Nobel Prize] . # Nobelprize\n?awardStat ps:[property:award received] ?nobelPrize . # ... that has the value Nobel Prize )\nminus {?laureate wdt:[property:SELIBR ID] ?librisID}\nOPTIONAL {?laureate wdt:[property:VIAF ID] ?VIAFID}\nBIND (URI(CONCAT(\"https://viaf.org/viaf/\",?VIAFID)) AS ?VIAF)\nOPTIONAL {?article schema:about ?laureate .\n?article schema:isPartOf <https://sv.wikipedia.org/>}\nOPTIONAL {?article schema:about ?laureate .\n?article schema:isPartOf <https://en.wikipedia.org/>}\nOPTIONAL{?laureate wdt:[property:[property:instance of]88] ?Na}\nBIND (URI(CONCAT(\"https://www.nobelprize.org/nobel_prizes/\",?Na,\"-facts.html\")) AS ?NobelArticle)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,de,da,nl\". }\n} Group by ?place ?img ?twitter ?motivation ?article ?NobelArticle ?coord22 ?SELIBR ?VIAF",
    "complexity": "complex"
  },
  {
    "id": "1320",
    "instruction": "List fictional items that are named after real-world objects.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?itemDescription ?namedAfterLabel ?namedAfterDescription WHERE {\n?item wdt:P31/wdt:P279* wd:Q14897293;\nwdt:P138 ?namedAfter.\nMINUS { ?namedAfter wdt:P31/wdt:P279* wd:Q14897293. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?itemDescription ?namedAfterLabel ?namedAfterDescription WHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:fictional entity];\nwdt:[property:named after] ?namedAfter.\nMINUS { ?namedAfter wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:fictional entity]. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "1",
    "instruction": "What are the Wikidata properties excluding external IDs?",
    "query": "SELECT ?id ?idLabel ?idDescription ?new{\n?id wikibase:directClaim ?pid .\nminus{?id wikibase:propertyType wikibase:ExternalId}\nBIND(Replace(STR(?id),\"http://www.wikidata.org/entity/P\",\" \") as ?new)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}\nORDER BY DESC(xsd:integer(?new))",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?id ?idLabel ?idDescription ?new{\n?id wikibase:directClaim ?pid .\nminus{?id wikibase:propertyType wikibase:ExternalId}\nBIND(Replace(STR(?id),\"http://www.wikidata.org/entity/P\",\" \") as ?new)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}\nORDER BY DESC(xsd:integer(?new))",
    "complexity": "complex"
  },
  {
    "id": "2289",
    "instruction": "Find French companies without SIREN IDs and rank them by the number of sitelinks.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?itemDescription ?siegeLabel ?secteurLabel ?search WHERE {\n?item (wdt:P31/(wdt:P279*)) wd:Q6881511;\nwdt:P17 wd:Q142;\nrdfs:label ?itemLabel;\nwikibase:sitelinks ?sitelinks.\nFILTER((LANG(?itemLabel)) = \"fr\")\nOPTIONAL { ?item wdt:P159 ?siege. }\nOPTIONAL { ?item wdt:P452 ?secteur. }\nMINUS { ?item wdt:P576 _:b10. }\nMINUS { ?item wdt:P1616 _:b11. }\nBIND(URI(CONCAT(\" https://annuaire-entreprises.data.gouv.fr/rechercher?terme=\", ENCODE_FOR_URI(?itemLabel))) AS ?search)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\". }\n}\nORDER BY DESC (?sitelinks)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?itemDescription ?siegeLabel ?secteurLabel ?search WHERE {\n?item (wdt:[property:instance of]/(wdt:[property:subclass of]*)) wd:[entity:enterprise];\nwdt:[property:country] wd:[entity:France];\nrdfs:label ?itemLabel;\nwikibase:sitelinks ?sitelinks.\nFILTER((LANG(?itemLabel)) = \"fr\")\nOPTIONAL { ?item wdt:[property:headquarters location] ?siege. }\nOPTIONAL { ?item wdt:[property:industry] ?secteur. }\nMINUS { ?item wdt:[property:dissolved, abolished or demolished date] _:b10. }\nMINUS { ?item wdt:[property:SIREN number] _:b11. }\nBIND(URI(CONCAT(\" https://annuaire-entreprises.data.gouv.fr/rechercher?terme=\", ENCODE_FOR_URI(?itemLabel))) AS ?search)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\". }\n}\nORDER BY DESC (?sitelinks)",
    "complexity": "complex"
  },
  {
    "id": "1530",
    "instruction": "What is the number of disasters that occurred on a specific date?",
    "query": "SELECT (?q AS ?Date) (SUM(?mon) AS ?Mon) (SUM(?tue) AS ?Tue) (SUM(?wed) AS ?Wed) (SUM(?thu) AS ?Thu) (SUM(?fri) AS ?Fri) (SUM(?sat) AS ?Sat) (SUM(?sun) AS ?Sun) (COUNT(?start_time) AS ?Tot) WHERE {\n{\n?disaster wdt:P31/wdt:P279* wd:Q3839081 ;\np:P580 ?start_time_stm . # find the date multi-day disasters started\n?start_time_stm ps:P580 ?start_time .\n?start_time_stm psv:P580 ?start_time_node .\n?start_time_node wikibase:timePrecision ?tp . FILTER(?tp=11)\n}\nUNION\n{\n?disaster wdt:P31/wdt:P279* wd:Q3839081 ;\np:P585 ?start_time_stm . # find all those which have \"point in time\" (ie one-day events)\n?start_time_stm ps:P585 ?start_time .\n?start_time_stm psv:P585 ?start_time_node .\n?start_time_node wikibase:timePrecision ?tp . FILTER(?tp=11)\n}\n# this beautiful bit of code finds all the relevant days of the week\n# using https://cs.wikipedia.org/wiki/Algoritmus_pro_v%C3%BDpo%C4%8Det_dne_v_t%C3%BDdnu#Zeller%C5%AFv_algoritmus\nBIND( DAY( ?start_time ) AS ?q ) .\nBIND( MONTH( ?start_time ) + IF( MONTH( ?start_time ) < 3, 12, 0 ) AS ?m ) .\nBIND( YEAR( ?start_time ) - IF( MONTH( ?start_time ) < 3, 1, 0 ) AS ?_year ) .\nBIND( ?_year - FLOOR( ?_year / 100 ) * 100 AS ?K ) . # modulo\nBIND( FLOOR( YEAR( ?start_time ) / 100 ) AS ?J ) .\nBIND( ?q + FLOOR( 13 * ( ?m + 1 ) / 5 ) + ?K + FLOOR( ?K / 4 ) + FLOOR( ?J / 4 ) - 2 * ?J AS ?_h ) .\nBIND( ?_h - FLOOR( ?_h / 7 ) * 7 AS ?weekday) . # modulo, 0 is Saturday\nBIND(IF(?weekday=2,1,0) AS ?mon)\nBIND(IF(?weekday=3,1,0) AS ?tue)\nBIND(IF(?weekday=4,1,0) AS ?wed)\nBIND(IF(?weekday=5,1,0) AS ?thu)\nBIND(IF(?weekday=6,1,0) AS ?fri)\nBIND(IF(?weekday=0,1,0) AS ?sat)\nBIND(IF(?weekday=1,1,0) AS ?sun)\n}\nGROUP BY ?q\nORDER BY ?Date",
    "annotated": "PREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT (?q AS ?Date) (SUM(?mon) AS ?Mon) (SUM(?tue) AS ?Tue) (SUM(?wed) AS ?Wed) (SUM(?thu) AS ?Thu) (SUM(?fri) AS ?Fri) (SUM(?sat) AS ?Sat) (SUM(?sun) AS ?Sun) (COUNT(?start_time) AS ?Tot) WHERE {\n{\n?disaster wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:disaster] ;\np:[property:start time] ?start_time_stm . # find the date multi-day disasters started\n?start_time_stm ps:[property:start time] ?start_time .\n?start_time_stm psv:[property:start time] ?start_time_node .\n?start_time_node wikibase:timePrecision ?tp . FILTER(?tp=11)\n}\nUNION\n{\n?disaster wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:disaster] ;\np:[property:point in time] ?start_time_stm . # find all those which have \"point in time\" (ie one-day events)\n?start_time_stm ps:[property:point in time] ?start_time .\n?start_time_stm psv:[property:point in time] ?start_time_node .\n?start_time_node wikibase:timePrecision ?tp . FILTER(?tp=11)\n}\n# this beautiful bit of code finds all the relevant days of the week\n# using https://cs.wikipedia.org/wiki/Algoritmus_pro_v%C3%BDpo%C4%8Det_dne_v_t%C3%BDdnu#Zeller%C5%AFv_algoritmus\nBIND( DAY( ?start_time ) AS ?q ) .\nBIND( MONTH( ?start_time ) + IF( MONTH( ?start_time ) < 3, 12, 0 ) AS ?m ) .\nBIND( YEAR( ?start_time ) - IF( MONTH( ?start_time ) < 3, 1, 0 ) AS ?_year ) .\nBIND( ?_year - FLOOR( ?_year / 100 ) * 100 AS ?K ) . # modulo\nBIND( FLOOR( YEAR( ?start_time ) / 100 ) AS ?J ) .\nBIND( ?q + FLOOR( 13 * ( ?m + 1 ) / 5 ) + ?K + FLOOR( ?K / 4 ) + FLOOR( ?J / 4 ) - 2 * ?J AS ?_h ) .\nBIND( ?_h - FLOOR( ?_h / 7 ) * 7 AS ?weekday) . # modulo, 0 is Saturday\nBIND(IF(?weekday=2,1,0) AS ?mon)\nBIND(IF(?weekday=3,1,0) AS ?tue)\nBIND(IF(?weekday=4,1,0) AS ?wed)\nBIND(IF(?weekday=5,1,0) AS ?thu)\nBIND(IF(?weekday=6,1,0) AS ?fri)\nBIND(IF(?weekday=0,1,0) AS ?sat)\nBIND(IF(?weekday=1,1,0) AS ?sun)\n}\nGROUP BY ?q\nORDER BY ?Date",
    "complexity": "complex"
  },
  {
    "id": "535",
    "instruction": "How many Wikipedia articles are linked to each language for items with a specific UK artist ID?",
    "query": "SELECT ?lang (COUNT(DISTINCT ?article) AS ?count) WHERE {\nhint:Query hint:optimizer \"None\".\n?item wdt:P1367 ?yp_id .\n?article schema:about ?item . # find articles about things with a BBC 'Your paintings' artist identifier\n?article schema:isPartOf / wikibase:wikiGroup \"wikipedia\" . # only Wikipedias articles\nhint:Prior hint:gearing \"forward\" .\n# This hint says to search the property chain above from left to right (\"forward\"),\n# i.e. it is checked if each previously found value for ?article is linked to a Wikipedia.\n# The default (\"reverse\") would be to search it from right to left, i.e. find all Wikipedia\n# articles first, and then select the intersection with the previously found values of ?article.\n?article schema:inLanguage ?lang .\n} GROUP BY ?lang\nORDER BY DESC (?count)",
    "annotated": "PREFIX hint: <http://www.bigdata.com/queryHints#>\nPREFIX schema: <http://schema.org/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?lang (COUNT(DISTINCT ?article) AS ?count) WHERE {\nhint:Query hint:optimizer \"None\".\n?item wdt:[property:Art UK artist ID] ?yp_id .\n?article schema:about ?item . # find articles about things with a BBC 'Your paintings' artist identifier\n?article schema:isPartOf / wikibase:wikiGroup \"wikipedia\" . # only Wikipedias articles\nhint:Prior hint:gearing \"forward\" .\n# This hint says to search the property chain above from left to right (\"forward\"),\n# i.e. it is checked if each previously found value for ?article is linked to a Wikipedia.\n# The default (\"reverse\") would be to search it from right to left, i.e. find all Wikipedia\n# articles first, and then select the intersection with the previously found values of ?article.\n?article schema:inLanguage ?lang .\n} GROUP BY ?lang\nORDER BY DESC (?count)",
    "complexity": "complex"
  }
]