[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "2361",
    "instruction": "What are the most common predicates used in non-scholarly articles with a large number of statements?",
    "query": "SELECT ?item ?itemLabel ?statements ?property ?propertyLabel ?predicateCount WITH {\nSELECT ?statements WHERE { # get numbers from 1k to 10k\n?nn wdt:P31 wd:Q21199; wdt:P1181 ?statements .\nFILTER (?statements >= 1000 && ?statements <= 10000)\n} } AS %numbers\nWITH { SELECT ?item ?statements WHERE { # get items having that many statements; exclude scholarly articles\nINCLUDE %numbers\nBIND(xsd:integer(?statements) as ?b)\n?item wikibase:statements ?b.\nFILTER NOT EXISTS {?item wdt:P31 wd:Q13442814 .}\n} } as %items\nWITH { SELECT ?item ?statements ?property (COUNT(?predicate) as ?predicateCount) WHERE { # get & count claims for the items\nINCLUDE %items\n?item ?predicate [].\n?property wikibase:claim ?predicate .\n} GROUP BY ?item ?statements ?property } as %counts\nWITH { SELECT ?item (MAX(?predicateCount) AS ?maxcount) {\nINCLUDE %counts\n} GROUP BY ?item } AS %maxCounts\nWHERE {\n# filter for ?predicateCount = ?maxcount to try to identify most-used predicates per item. (It's a bit of a kludge but...)\nINCLUDE %counts\nINCLUDE %maxCounts\nFILTER (?predicateCount = ?maxcount)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} order by desc(?statements)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?statements ?property ?propertyLabel ?predicateCount WITH {\nSELECT ?statements WHERE { # get numbers from 1k to 10k\n?nn wdt:[property:instance of] wd:[entity:natural number]; wdt:[property:numeric value] ?statements .\nFILTER (?statements >= 1000 && ?statements <= 10000)\n} } AS %numbers\nWITH { SELECT ?item ?statements WHERE { # get items having that many statements; exclude scholarly articles\nINCLUDE %numbers\nBIND(xsd:integer(?statements) as ?b)\n?item wikibase:statements ?b.\nFILTER NOT EXISTS {?item wdt:[property:instance of] wd:[entity:scholarly article] .}\n} } as %items\nWITH { SELECT ?item ?statements ?property (COUNT(?predicate) as ?predicateCount) WHERE { # get & count claims for the items\nINCLUDE %items\n?item ?predicate [].\n?property wikibase:claim ?predicate .\n} GROUP BY ?item ?statements ?property } as %counts\nWITH { SELECT ?item (MAX(?predicateCount) AS ?maxcount) {\nINCLUDE %counts\n} GROUP BY ?item } AS %maxCounts\nWHERE {\n# filter for ?predicateCount = ?maxcount to try to identify most-used predicates per item. (It's a bit of a kludge but...)\nINCLUDE %counts\nINCLUDE %maxCounts\nFILTER (?predicateCount = ?maxcount)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} order by desc(?statements)",
    "complexity": "complex"
  },
  {
    "id": "1395",
    "instruction": "List the top 100 works with the most citations, along with their labels and citation counts.",
    "query": "SELECT ?work ?workLabel ?count WITH {\nSELECT ?work (COUNT(*) AS ?count) WHERE {\n?work wdt:P2860 [].\n}\nGROUP BY ?work\nORDER BY DESC(?count)\nLIMIT 100\n} AS %works WHERE {\nINCLUDE %works.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?work ?workLabel ?count WITH {\nSELECT ?work (COUNT(*) AS ?count) WHERE {\n?work wdt:[property:cites work] [].\n}\nGROUP BY ?work\nORDER BY DESC(?count)\nLIMIT 100\n} AS %works WHERE {\nINCLUDE %works.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nORDER BY DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "348",
    "instruction": "Find the non-EMLO identifiers for people with an EMLO Person ID.",
    "query": "SELECT ?emlo ?idlabel ?value WITH {\nSELECT DISTINCT ?item ?emlo WHERE {\n?item wdt:P1802 ?emlo\n}\n} AS %subquery WHERE {\nINCLUDE %subquery .\n?id wikibase:propertyType wikibase:ExternalId; wikibase:claim ?p; wikibase:statementProperty ?ps; wdt:P31/wdt:P279* wd:Q19595382 FILTER( ?id != wd:P1802 ).\n?item ?p [ ?ps ?value ] .\n?id rdfs:label ?idlabel FILTER (lang(?idlabel) = \"en\").\n} ORDER BY ?idlabel",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?emlo ?idlabel ?value WITH {\nSELECT DISTINCT ?item ?emlo WHERE {\n?item wdt:[property:Early Modern Letters Online person ID] ?emlo\n}\n} AS %subquery WHERE {\nINCLUDE %subquery .\n?id wikibase:propertyType wikibase:ExternalId; wikibase:claim ?p; wikibase:statementProperty ?ps; wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:Wikidata property for authority control for people] FILTER( ?id != wd:[property:Early Modern Letters Online person ID] ).\n?item ?p [ ?ps ?value ] .\n?id rdfs:label ?idlabel FILTER (lang(?idlabel) = \"en\").\n} ORDER BY ?idlabel",
    "complexity": "complex"
  },
  {
    "id": "1833",
    "instruction": "Show me the updated chart of COVID-19 infections and deaths reported by WHO.",
    "query": "SELECT ?date (MAX(?count) AS ?max_count) ?measureLabel\nWHERE {\nBIND(wd:Q81068910 AS ?outbreak).\n{\nBIND(wd:Q166231 AS ?measure).\n?outbreak p:P1603 ?cases.\n?cases prov:wasDerivedFrom/pr:P248/wdt:P50 wd:Q7817.\n?cases pqv:P585/wikibase:timeValue ?date.\n?cases psv:P1603/wikibase:quantityAmount ?count.\n?cases psv:P1603/wikibase:quantityAmount ?infection_count.\n} UNION {\nBIND(wd:Q4 AS ?measure).\n?outbreak p:P1120 ?deaths.\n?deaths prov:wasDerivedFrom/pr:P248/wdt:P50 wd:Q7817.\n?deaths pqv:P585/wikibase:timeValue ?date.\n?deaths psv:P1120/wikibase:quantityAmount ?count.\n?deaths psv:P1120/wikibase:quantityAmount ?death_count.\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?date ?measureLabel\nORDER BY ASC(?date) DESC(?measure)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX prov: <http://www.w3.org/ns/prov#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pqv: <http://www.wikidata.org/prop/qualifier/value/>\nPREFIX pr: <http://www.wikidata.org/prop/reference/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?date (MAX(?count) AS ?max_count) ?measureLabel\nWHERE {\nBIND(wd:[entity:COVID-19 pandemic] AS ?outbreak).\n{\nBIND(wd:[entity:infection] AS ?measure).\n?outbreak p:[property:number of cases] ?cases.\n?cases prov:wasDerivedFrom/pr:[property:stated in]/wdt:[property:author] wd:[entity:World Health Organization].\n?cases pqv:[property:point in time]/wikibase:timeValue ?date.\n?cases psv:[property:number of cases]/wikibase:quantityAmount ?count.\n?cases psv:[property:number of cases]/wikibase:quantityAmount ?infection_count.\n} UNION {\nBIND(wd:[entity:death] AS ?measure).\n?outbreak p:[property:number of deaths] ?deaths.\n?deaths prov:wasDerivedFrom/pr:[property:stated in]/wdt:[property:author] wd:[entity:World Health Organization].\n?deaths pqv:[property:point in time]/wikibase:timeValue ?date.\n?deaths psv:[property:number of deaths]/wikibase:quantityAmount ?count.\n?deaths psv:[property:number of deaths]/wikibase:quantityAmount ?death_count.\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?date ?measureLabel\nORDER BY ASC(?date) DESC(?measure)",
    "complexity": "complex"
  },
  {
    "id": "2571",
    "instruction": "What are the properties that describe Art UK artworks?",
    "query": "SELECT ?prop ?propLabel ?item_count ?stmt_count ?samp ?sampLabel ?valLabel\nWITH {\nSELECT ?prop (COUNT(DISTINCT ?item) AS ?item_count) (COUNT(DISTINCT ?stmt) AS ?stmt_count) (SAMPLE(?item) AS ?samp) (SAMPLE(?value) AS ?val) WHERE {\nhint:Query hint:optimizer \"None\" .\n?item wdt:P1679 ?yp_id .\n?item ?p ?stmt .\n?prop wikibase:claim ?p .\n?prop wikibase:statementProperty ?ps .\n?stmt ?ps ?value .\n} GROUP BY ?prop\n} AS %counts\nWHERE {\nINCLUDE %counts .\nMINUS {\nVALUES ?identifier {wd:Q19847637 wd:Q18614948} . # Wikidata property representing a unique identifier, Wikidata property for authority control\n?prop wdt:P31/wdt:P279* ?identifier .\n}\n?prop rdfs:label ?prop_label . FILTER(lang(?prop_label) = 'en') .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY DESC(?item_count) DESC(?stmt_count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX hint: <http://www.bigdata.com/queryHints#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?prop ?propLabel ?item_count ?stmt_count ?samp ?sampLabel ?valLabel\nWITH {\nSELECT ?prop (COUNT(DISTINCT ?item) AS ?item_count) (COUNT(DISTINCT ?stmt) AS ?stmt_count) (SAMPLE(?item) AS ?samp) (SAMPLE(?value) AS ?val) WHERE {\nhint:Query hint:optimizer \"None\" .\n?item wdt:[property:Art UK artwork ID] ?yp_id .\n?item ?p ?stmt .\n?prop wikibase:claim ?p .\n?prop wikibase:statementProperty ?ps .\n?stmt ?ps ?value .\n} GROUP BY ?prop\n} AS %counts\nWHERE {\nINCLUDE %counts .\nMINUS {\nVALUES ?identifier {wd:[entity:Wikidata property for an identifier] wd:[entity:Wikidata property for authority control]} . # Wikidata property representing a unique identifier, Wikidata property for authority control\n?prop wdt:[property:instance of]/wdt:[property:subclass of]* ?identifier .\n}\n?prop rdfs:label ?prop_label . FILTER(lang(?prop_label) = 'en') .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY DESC(?item_count) DESC(?stmt_count)",
    "complexity": "complex"
  },
  {
    "id": "1087",
    "instruction": "List all Vienna districts that do not have a tram line connecting them.",
    "query": "SELECT DISTINCT ?districtALabel ?districtBLabel WHERE {\n?districtA wdt:P31 wd:Q261023;\nwdt:P1545 ?districtANr.\n?districtB wdt:P31 wd:Q261023;\nwdt:P1545 ?districtBNr.\n?districtA wdt:P47 ?districtB.\nFILTER NOT EXISTS {\n?line wdt:P361 wd:Q129612;\nwdt:P131 ?districtA, ?districtB.\n}\nFILTER (?districtANr < ?districtBNr)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE]\". }\n}\nORDER BY xsd:integer(?districtANr) xsd:integer(?districtBNr)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?districtALabel ?districtBLabel WHERE {\n?districtA wdt:[property:instance of] wd:[entity:district of Vienna];\nwdt:[property:series ordinal] ?districtANr.\n?districtB wdt:[property:instance of] wd:[entity:district of Vienna];\nwdt:[property:series ordinal] ?districtBNr.\n?districtA wdt:[property:shares border with] ?districtB.\nFILTER NOT EXISTS {\n?line wdt:[property:part of] wd:[entity:tram transport in Vienna];\nwdt:[property:located in the administrative territorial entity] ?districtA, ?districtB.\n}\nFILTER (?districtANr < ?districtBNr)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE]\". }\n}\nORDER BY xsd:integer(?districtANr) xsd:integer(?districtBNr)",
    "complexity": "complex"
  },
  {
    "id": "1176",
    "instruction": "List the top 10 items with the most sitelinks.",
    "query": "SELECT ?item ?sitelinks WHERE {\n?item wikibase:sitelinks ?sitelinks. hint:Prior hint:rangeSafe true. # https://wiki.blazegraph.com/wiki/index.php/QueryHints\nFILTER(?sitelinks >= 75) # arbitrary limit to optimize the query by removing most items (assuming that the desired results will have more statements than this)\nMINUS {\n?article schema:isPartOf <https://ca.wikipedia.org/>;\nschema:about ?item.\n}\nMINUS { ?item wdt:P31/wdt:P279* wd:Q17442446. } # remove templates etc.\n}\nORDER BY DESC(?sitelinks)\nLIMIT 10",
    "annotated": "PREFIX hint: <http://www.bigdata.com/queryHints#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?sitelinks WHERE {\n?item wikibase:sitelinks ?sitelinks. hint:Prior hint:rangeSafe true. # https://wiki.blazegraph.com/wiki/index.php/QueryHints\nFILTER(?sitelinks >= 75) # arbitrary limit to optimize the query by removing most items (assuming that the desired results will have more statements than this)\nMINUS {\n?article schema:isPartOf <https://ca.wikipedia.org/>;\nschema:about ?item.\n}\nMINUS { ?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:Wikimedia internal item]. } # remove templates etc.\n}\nORDER BY DESC(?sitelinks)\nLIMIT 10",
    "complexity": "complex"
  },
  {
    "id": "1308",
    "instruction": "List all species with a higher number of females than males.",
    "query": "SELECT ?taxon ?taxonLabel (SUM(?male) AS ?maleCount) (SUM(?female) AS ?femaleCount) WHERE {\n?taxon wdt:P31 wd:Q16521.\n?item wdt:P31 ?taxon.\nOPTIONAL { ?item wdt:P21 wd:Q44148. BIND(1 AS ?male). }\nOPTIONAL { ?item wdt:P21 wd:Q43445. BIND(1 AS ?female). }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nGROUP BY ?taxon ?taxonLabel\nHAVING(?femaleCount > ?maleCount)\nORDER BY DESC(?femaleCount - ?maleCount)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?taxon ?taxonLabel (SUM(?male) AS ?maleCount) (SUM(?female) AS ?femaleCount) WHERE {\n?taxon wdt:[property:instance of] wd:[entity:taxon].\n?item wdt:[property:instance of] ?taxon.\nOPTIONAL { ?item wdt:[property:sex or gender] wd:[entity:male organism]. BIND(1 AS ?male). }\nOPTIONAL { ?item wdt:[property:sex or gender] wd:[entity:female organism]. BIND(1 AS ?female). }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nGROUP BY ?taxon ?taxonLabel\nHAVING(?femaleCount > ?maleCount)\nORDER BY DESC(?femaleCount - ?maleCount)",
    "complexity": "complex"
  },
  {
    "id": "2148",
    "instruction": "What are the most popular mathematical theorems based on Wikipedia articles?",
    "query": "SELECT ?theorem ?theoremLabel (COUNT(DISTINCT ?article) AS ?wikipedia) ?sitelinks {\n?theorem wdt:P31/wdt:P279* wd:Q65943 ; wikibase:sitelinks ?sitelinks .\n?article schema:about ?theorem ; schema:isPartOf [ wikibase:wikiGroup \"wikipedia\" ] .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" . }\n}\nGROUP BY ?theorem ?theoremLabel ?sitelinks\nORDER BY DESC(?wikipedia)\nLIMIT 100",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?theorem ?theoremLabel (COUNT(DISTINCT ?article) AS ?wikipedia) ?sitelinks {\n?theorem wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:theorem] ; wikibase:sitelinks ?sitelinks .\n?article schema:about ?theorem ; schema:isPartOf [ wikibase:wikiGroup \"wikipedia\" ] .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" . }\n}\nGROUP BY ?theorem ?theoremLabel ?sitelinks\nORDER BY DESC(?wikipedia)\nLIMIT 100",
    "complexity": "complex"
  },
  {
    "id": "1603",
    "instruction": "Show me a map of all libraries worldwide.",
    "query": "SELECT DISTINCT ?library ?libraryLabel (SAMPLE(?coords) AS ?coords)\n(SAMPLE(?image) AS ?image) ?website ?layer WHERE {\n?library wdt:P31 ?type .?type wdt:P279* wd:Q7075 . ?library wdt:P625 ?coords\nOPTIONAL {?library wdt:P18 ?image}\nOPTIONAL {?library wdt:P856 ?website}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\".\n?library rdfs:label ?libraryLabel. ?type rdfs:label ?layer }\n} GROUP BY ?library ?libraryLabel ?website ?layer\nORDER BY UCASE(?layer)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?library ?libraryLabel (SAMPLE(?coords) AS ?coords)\n(SAMPLE(?image) AS ?image) ?website ?layer WHERE {\n?library wdt:[property:instance of] ?type .?type wdt:[property:subclass of]* wd:[entity:library] . ?library wdt:[property:coordinate location] ?coords\nOPTIONAL {?library wdt:[property:image] ?image}\nOPTIONAL {?library wdt:[property:official website] ?website}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\".\n?library rdfs:label ?libraryLabel. ?type rdfs:label ?layer }\n} GROUP BY ?library ?libraryLabel ?website ?layer\nORDER BY UCASE(?layer)",
    "complexity": "complex"
  },
  {
    "id": "2110",
    "instruction": "List the number of wiki pages about objects in the Bardo National Museum, categorized by language.",
    "query": "SELECT ?lang (COUNT(?sujet) AS ?compte) WHERE {\n?page schema:about ?sujet .\n?page schema:isPartOf ?wiki .\n?page schema:inLanguage ?lang .\n?sujet wdt:P195/wdt:P361* wd:Q1429003 .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?lang",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?lang (COUNT(?sujet) AS ?compte) WHERE {\n?page schema:about ?sujet .\n?page schema:isPartOf ?wiki .\n?page schema:inLanguage ?lang .\n?sujet wdt:[property:collection]/wdt:[property:part of]* wd:[entity:Bardo National Museum] .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?lang",
    "complexity": "complex"
  },
  {
    "id": "200",
    "instruction": "What places did the Sibthorp and Bauer expedition visit without recorded coordinates?",
    "query": "SELECT ?loc ?locLabel (SAMPLE(?coords) AS ?latlong) WHERE {\nwd:Q52496052 wdt:P276 ?loc.\nMINUS {?loc wdt:P625 ?coords}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} GROUP BY ?loc ?locLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?loc ?locLabel (SAMPLE(?coords) AS ?latlong) WHERE {\nwd:[entity:Sibthorp and Bauer expedition] wdt:[property:location] ?loc.\nMINUS {?loc wdt:[property:coordinate location] ?coords}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} GROUP BY ?loc ?locLabel",
    "complexity": "complex"
  },
  {
    "id": "438",
    "instruction": "Find all Wikidata properties without Afrikaans labels.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?itemDescription\nWHERE {\n?item wdt:P31/wdt:P279* wd:Q18616576 .\nMINUS { ?item wdt:P31/wdt:P279* wd:Q19847637 .}\nFILTER(NOT EXISTS {\n?item rdfs:label ?lang_label.\nFILTER(LANG(?lang_label) = \"af\")\n})\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,nl,fr,de,it,es,no,pt\". }\n}\nORDER BY ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?itemDescription\nWHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:Wikidata property] .\nMINUS { ?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:Wikidata property for an identifier] .}\nFILTER(NOT EXISTS {\n?item rdfs:label ?lang_label.\nFILTER(LANG(?lang_label) = \"af\")\n})\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,nl,fr,de,it,es,no,pt\". }\n}\nORDER BY ?itemLabel",
    "complexity": "complex"
  },
  {
    "id": "282",
    "instruction": "How many language labels are available for things with a Japan Search Name ID?",
    "query": "SELECT ?languageLabel ?count WHERE {\n{SELECT ?langcode (COUNT(?label) as ?count) WHERE {\n?thing wdt:P6698 ?jpsid; rdfs:label ?label.\nBIND(lang(?label) AS ?langcode)\n} GROUP BY ?langcode }\n?language wdt:P218 ?langcode\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?languageLabel ?count WHERE {\n{SELECT ?langcode (COUNT(?label) as ?count) WHERE {\n?thing wdt:[property:Japan Search name ID] ?jpsid; rdfs:label ?label.\nBIND(lang(?label) AS ?langcode)\n} GROUP BY ?langcode }\n?language wdt:[property:ISO 639-1 code] ?langcode\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "2604",
    "instruction": "What are the drainage basins of rivers in Scotland?",
    "query": "SELECT DISTINCT ?layer ?layerLabel ?dot ?dotLabel ?coord\nWITH {\nSELECT DISTINCT ?somethingelse ?sea WHERE {\n{?somethingelse wdt:P131/wdt:P131 wd:Q22 .} hint:Prior hint:runFirst true.\n?somethingelse wdt:P403|wdt:P201 ?sea .\n}\n} as %i\nWITH {\nSELECT ?sea ?layer WHERE {\nINCLUDE %i .\nFILTER NOT EXISTS {\n?sea wdt:P31/wdt:P279* wd:Q355304 . hint:Prior hint:gearing \"forward\". # exclude watercourse\nFILTER NOT EXISTS {?sea wdt:P31 wd:Q47053. } # unless estuary,\nFILTER NOT EXISTS {?sea wdt:P31 wd:Q1210950. } # or channel\n}\nFILTER NOT EXISTS {?sea wdt:P403?/wdt:P31/wdt:P279* wd:Q23397 . hint:Prior hint:gearing \"forward\". } # lake\n?sea ^wdt:P403|^wdt:P201 ?layer. # ?layer is the river before the sea\n?layer wdt:P131/wdt:P131 wd:Q22 . hint:Prior hint:gearing \"forward\".\n}\n} as %j\nWHERE {\nINCLUDE %j\n{?layer (^wdt:P403|^wdt:P201|wdt:P200)*/(^wdt:P177|^wdt:P206)? ?dot. }\n?dot wdt:P625|((p:P885|p:P403|p:P200|p:P201)/pq:P625) ?coord .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX hint: <http://www.bigdata.com/queryHints#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?layer ?layerLabel ?dot ?dotLabel ?coord\nWITH {\nSELECT DISTINCT ?somethingelse ?sea WHERE {\n{?somethingelse wdt:[property:located in the administrative territorial entity]/wdt:[property:located in the administrative territorial entity] wd:[entity:Scotland] .} hint:Prior hint:runFirst true.\n?somethingelse wdt:[property:mouth of the watercourse]|wdt:[property:outflows] ?sea .\n}\n} as %i\nWITH {\nSELECT ?sea ?layer WHERE {\nINCLUDE %i .\nFILTER NOT EXISTS {\n?sea wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:watercourse] . hint:Prior hint:gearing \"forward\". # exclude watercourse\nFILTER NOT EXISTS {?sea wdt:[property:instance of] wd:[entity:estuary]. } # unless estuary,\nFILTER NOT EXISTS {?sea wdt:[property:instance of] wd:[entity:channel]. } # or channel\n}\nFILTER NOT EXISTS {?sea wdt:[property:mouth of the watercourse]?/wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:lake] . hint:Prior hint:gearing \"forward\". } # lake\n?sea ^wdt:[property:mouth of the watercourse]|^wdt:[property:outflows] ?layer. # ?layer is the river before the sea\n?layer wdt:[property:located in the administrative territorial entity]/wdt:[property:located in the administrative territorial entity] wd:[entity:Scotland] . hint:Prior hint:gearing \"forward\".\n}\n} as %j\nWHERE {\nINCLUDE %j\n{?layer (^wdt:[property:mouth of the watercourse]|^wdt:[property:outflows]|wdt:[property:inflows])*/(^wdt:[property:crosses]|^wdt:[property:located in or next to body of water])? ?dot. }\n?dot wdt:[property:coordinate location]|((p:[property:origin of the watercourse]|p:[property:mouth of the watercourse]|p:[property:inflows]|p:[property:outflows])/pq:[property:coordinate location]) ?coord .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "1027",
    "instruction": "List all brands owned by The Coca-Cola Company, PepsiCo, and Mars, Incorporated.",
    "query": "SELECT ?brand ?brandLabel (SAMPLE(?image) AS ?image) ?linkTo WHERE {\nVALUES ?company {\nwd:Q3295867\nwd:Q334800\nwd:Q695087\n}\n{\n?brand (wdt:P749|wdt:P127)+ ?company.\n?brand wdt:P749|wdt:P127 ?linkTo.\nOPTIONAL { ?brand wdt:P18|wdt:P154 ?image. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n} UNION {\nBIND(?company AS ?brand).\nBIND(?brand AS ?linkTo).\n?company rdfs:label ?brandLabel.\nFILTER(LANG(?brandLabel) = \"en\").\nOPTIONAL { ?company wdt:P18|wdt:P154 ?image. }\n}\n}\nGROUP BY ?brand ?brandLabel ?linkTo",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?brand ?brandLabel (SAMPLE(?image) AS ?image) ?linkTo WHERE {\nVALUES ?company {\nwd:[entity:The Coca-Cola Company]\nwd:[entity:PepsiCo]\nwd:[entity:Mars, Incorporated]\n}\n{\n?brand (wdt:[property:parent organization]|wdt:[property:owned by])+ ?company.\n?brand wdt:[property:parent organization]|wdt:[property:owned by] ?linkTo.\nOPTIONAL { ?brand wdt:[property:image]|wdt:[property:logo image] ?image. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n} UNION {\nBIND(?company AS ?brand).\nBIND(?brand AS ?linkTo).\n?company rdfs:label ?brandLabel.\nFILTER(LANG(?brandLabel) = \"en\").\nOPTIONAL { ?company wdt:[property:image]|wdt:[property:logo image] ?image. }\n}\n}\nGROUP BY ?brand ?brandLabel ?linkTo",
    "complexity": "complex"
  },
  {
    "id": "813",
    "instruction": "List all assemblies sorted by the number of seats they have.",
    "query": "SELECT DISTINCT ?item ?title ?seats ?jurisdiction (YEAR(?inception) AS ?start) (YEAR(?dissolution) AS ?end) WHERE {\n?item wdt:P31/wdt:P279* wd:Q1752346 .\nOPTIONAL { ?item wdt:P1342 ?seats . }\nOPTIONAL {\n?item wdt:P1001 ?j .\n?j rdfs:label ?jurisdiction filter (lang(?jurisdiction) = \"en\") .\n}\nOPTIONAL { ?item wdt:P571 ?inception . }\nOPTIONAL { ?item wdt:P576 ?dissolution . }\nOPTIONAL { ?item rdfs:label ?title filter (lang(?title) = \"en\") . }\n} ORDER BY DESC(?seats) ?title",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT DISTINCT ?item ?title ?seats ?jurisdiction (YEAR(?inception) AS ?start) (YEAR(?dissolution) AS ?end) WHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:assembly] .\nOPTIONAL { ?item wdt:[property:number of seats] ?seats . }\nOPTIONAL {\n?item wdt:[property:applies to jurisdiction] ?j .\n?j rdfs:label ?jurisdiction filter (lang(?jurisdiction) = \"en\") .\n}\nOPTIONAL { ?item wdt:[property:inception] ?inception . }\nOPTIONAL { ?item wdt:[property:dissolved, abolished or demolished date] ?dissolution . }\nOPTIONAL { ?item rdfs:label ?title filter (lang(?title) = \"en\") . }\n} ORDER BY DESC(?seats) ?title",
    "complexity": "complex"
  },
  {
    "id": "1880",
    "instruction": "List all Welsh hospitals, health centers, and doctors' surgeries.",
    "query": "SELECT ?s ?sLabel ?coor ?operator ?operatorLabel ?layer ?capacity ?locationLabel\nWHERE {\n?s wdt:P31/wdt:P279* wd:Q4260475 ;\nwdt:P625 ?coor ;\nwdt:P137 ?operator ;\nOPTIONAL {?s wdt:P18 ?image .}\n?s wdt:P31 ?type .\nVALUES ?operator { wd:Q4898241 wd:Q2756337 wd:Q18343995 wd:Q5038490 wd:Q5197211 wd:Q4667178 wd:Q4761763 }\nBIND(\nIF(?type = wd:Q1402739, \"Field Hospital\",\nIF(?type = wd:Q569500, \"Community Health Centre\",\nIF(?type = wd:Q16917, \"Hospital\",\nIF(?type = wd:Q718966, \"Doctor's Surgery\",\n\"\")))) AS ?layer).\nminus {?s wdt:P31 wd:Q64578911 .}\nminus {?s wdt:P31 wd:Q4287745 .}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?s ?sLabel ?coor ?operator ?operatorLabel ?layer ?capacity ?locationLabel\nWHERE {\n?s wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:medical facility] ;\nwdt:[property:coordinate location] ?coor ;\nwdt:[property:operator] ?operator ;\nOPTIONAL {?s wdt:[property:image] ?image .}\n?s wdt:[property:instance of] ?type .\nVALUES ?operator { wd:[entity:Betsi Cadwaladr University Health Board] wd:[entity:Hywel Dda University Health Board] wd:[entity:Powys Teaching Health Board] wd:[entity:Cardiff and Vale University Health Board] wd:[entity:Cwm Taf University Health Board] wd:[entity:Swansea Bay University Health Board] wd:[entity:Aneurin Bevan University Health Board] }\nBIND(\nIF(?type = wd:[entity:field hospital], \"Field Hospital\",\nIF(?type = wd:[entity:community health center], \"Community Health Centre\",\nIF(?type = wd:[entity:hospital], \"Hospital\",\nIF(?type = wd:[entity:doctor's office], \"Doctor's Surgery\",\n\"\")))) AS ?layer).\nminus {?s wdt:[property:instance of] wd:[entity:former hospital] .}\nminus {?s wdt:[property:instance of] wd:[entity:medical organization] .}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}",
    "complexity": "complex"
  },
  {
    "id": "2349",
    "instruction": "List all museums within a 70 km radius of Dresden.",
    "query": "SELECT ?item ?itemLabel ?coordinate ?bild WHERE {\nwd:Q1731 wdt:P625 ?Center. # Lage von Dresden\nSERVICE wikibase:around {\n?item wdt:P625 ?coordinate.\nbd:serviceParam wikibase:center ?Center.\nbd:serviceParam wikibase:radius \"70\". # 70 Kilometer around\n}\nFILTER(EXISTS { ?item (wdt:P31/wdt:P279*) wd:Q33506. }) # nur Museen\noptional { ?item wdt:P18 ?bild }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"de,en,[AUTO_LANGUAGE]\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?coordinate ?bild WHERE {\nwd:[entity:Dresden] wdt:[property:coordinate location] ?Center. # Lage von Dresden\nSERVICE wikibase:around {\n?item wdt:[property:coordinate location] ?coordinate.\nbd:serviceParam wikibase:center ?Center.\nbd:serviceParam wikibase:radius \"70\". # 70 Kilometer around\n}\nFILTER(EXISTS { ?item (wdt:[property:instance of]/wdt:[property:subclass of]*) wd:[entity:museum]. }) # nur Museen\noptional { ?item wdt:[property:image] ?bild }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"de,en,[AUTO_LANGUAGE]\". }\n}",
    "complexity": "complex"
  }
]