[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "169",
    "instruction": "List all non-CBDB IDs associated with entities that have a CBDB ID.",
    "query": "SELECT ?cbdb ?idlabel ?value WITH {\nSELECT DISTINCT ?item ?cbdb WHERE {\n?item wdt:P497 ?cbdb\n}\n} AS %subquery WHERE {\nINCLUDE %subquery .\n?id wikibase:propertyType wikibase:ExternalId; wikibase:claim ?p; wikibase:statementProperty ?ps; wdt:P31/wdt:P279* wd:Q19595382 FILTER( ?id != wd:P497 ).\n?item ?p [ ?ps ?value ] .\n?id rdfs:label ?idlabel FILTER (lang(?idlabel) = \"en\").\n} ORDER BY ?idlabel",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?cbdb ?idlabel ?value WITH {\nSELECT DISTINCT ?item ?cbdb WHERE {\n?item wdt:[property:CBDB ID] ?cbdb\n}\n} AS %subquery WHERE {\nINCLUDE %subquery .\n?id wikibase:propertyType wikibase:ExternalId; wikibase:claim ?p; wikibase:statementProperty ?ps; wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:Wikidata property for authority control for people] FILTER( ?id != wd:[property:CBDB ID] ).\n?item ?p [ ?ps ?value ] .\n?id rdfs:label ?idlabel FILTER (lang(?idlabel) = \"en\").\n} ORDER BY ?idlabel",
    "complexity": "complex"
  },
  {
    "id": "616",
    "instruction": "List the top 20 people who have discovered the most asteroids in our solar system.",
    "query": "SELECT ?discoverer ?discovererLabel ?count\nWITH {\nSELECT ?discoverer (COUNT(?asteroid) AS ?count)\nWHERE {\n?asteroid wdt:P31 wd:Q3863;\nwdt:P61 ?discoverer .\n}\nGROUP BY ?discoverer\nORDER BY DESC(?count)\nLIMIT 20\n} AS %i\nWHERE {\nINCLUDE %i\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" . }\n}\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?discoverer ?discovererLabel ?count\nWITH {\nSELECT ?discoverer (COUNT(?asteroid) AS ?count)\nWHERE {\n?asteroid wdt:[property:instance of] wd:[entity:asteroid];\nwdt:[property:discoverer or inventor] ?discoverer .\n}\nGROUP BY ?discoverer\nORDER BY DESC(?count)\nLIMIT 20\n} AS %i\nWHERE {\nINCLUDE %i\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" . }\n}\nORDER BY DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "235",
    "instruction": "What materials are used to create manuscripts?",
    "query": "SELECT ?material ?l ?d (COUNT(DISTINCT ?q) AS ?mcount)\nWHERE {\n?q (wdt:P31/wdt:P279*) wd:Q87167.\n?q p:P195 ?s. ?s ps:P195 ?collection . MINUS {?s pq:P582 []}.\nMINUS { ?s ps:P195 wd:Q1322278 }\n?q wdt:P186 ?material\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\".\n?material rdfs:label ?l; schema:description ?d\n}\n}\nGROUP BY ?material ?l ?d",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?material ?l ?d (COUNT(DISTINCT ?q) AS ?mcount)\nWHERE {\n?q (wdt:[property:instance of]/wdt:[property:subclass of]*) wd:[entity:manuscript].\n?q p:[property:collection] ?s. ?s ps:[property:collection] ?collection . MINUS {?s pq:[property:end time] []}.\nMINUS { ?s ps:[property:collection] wd:[entity:Matenadaran] }\n?q wdt:[property:made from material] ?material\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\".\n?material rdfs:label ?l; schema:description ?d\n}\n}\nGROUP BY ?material ?l ?d",
    "complexity": "complex"
  },
  {
    "id": "1767",
    "instruction": "Show me a map of Indian districts with literacy rates in 2011.",
    "query": "SELECT ?d ?dLabel ?shape ?ratio ?rgb WHERE {\n?d wdt:P31 wd:Q1149652; p:P6499 ?litpopstmt ; p:P6498 ?illitpopstmt ; wdt:P3896 ?shape.\n?litpopstmt ps:P6499 ?litpop ; pq:P585 \"+2011-01-01T00:00:00Z\"^^xsd:dateTime.\n?illitpopstmt ps:P6498 ?illitpop ; pq:P585 \"+2011-01-01T00:00:00Z\"^^xsd:dateTime.\nBIND(xsd:integer(?illitpop)/xsd:integer(?litpop) AS ?ratio)\nBIND(IF(?ratio < 0.2, \"00008b\", IF(?ratio < 0.4, \"006400\", IF(?ratio < 0.6, \"008000\", IF(?ratio < 0.8, \"32cd32\", IF(?ratio < 1, \"7fff00\", IF(?ratio < 1.2, \"ffa500\", IF(?ratio < 1.4, \"ff6347\", \"ff0000\"))))))) AS ?rgb)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?d ?dLabel ?shape ?ratio ?rgb WHERE {\n?d wdt:[property:instance of] wd:[entity:district of India]; p:[property:literate population] ?litpopstmt ; p:[property:illiterate population] ?illitpopstmt ; wdt:[property:geoshape] ?shape.\n?litpopstmt ps:[property:literate population] ?litpop ; pq:[property:point in time] \"+2011-01-01T00:00:00Z\"^^xsd:dateTime.\n?illitpopstmt ps:[property:illiterate population] ?illitpop ; pq:[property:point in time] \"+2011-01-01T00:00:00Z\"^^xsd:dateTime.\nBIND(xsd:integer(?illitpop)/xsd:integer(?litpop) AS ?ratio)\nBIND(IF(?ratio < 0.2, \"00008b\", IF(?ratio < 0.4, \"006400\", IF(?ratio < 0.6, \"008000\", IF(?ratio < 0.8, \"32cd32\", IF(?ratio < 1, \"7fff00\", IF(?ratio < 1.2, \"ffa500\", IF(?ratio < 1.4, \"ff6347\", \"ff0000\"))))))) AS ?rgb)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "1519",
    "instruction": "List all train and subway stations in the Basque Country.",
    "query": "SELECT ?train_station ?coordinate_location ?layer WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"eu\". }\n?train_station (wdt:P31/wdt:P279*) wd:Q719456.\n{ ?train_station wdt:P361 wd:Q10862037. }\nUNION\n{ ?train_station wdt:P361 wd:Q123955. }\nUNION\n{ ?train_station wdt:P361 wd:Q149274. }\nUNION\n{ ?train_station wdt:P361 wd:Q2946410. }\nUNION\n{ ?train_station wdt:P81 wd:Q43283383. }\nUNION\n{ ?train_station wdt:P361 wd:Q3239365. }\nUNION\n{ ?train_station wdt:P81 wd:Q43283518. }\nUNION\n{ ?train_station wdt:P81 wd:Q43325427. }\nMINUS { ?train_station (wdt:P131/wdt:P131) wd:Q55180. }\nMINUS { ?train_station (wdt:P131/wdt:P131) wd:Q55271. }\n?train_station wdt:P625 ?coordinate_location.\n?train_station wdt:P81 ?connecting_line.\nMINUS { ?connecting_line wdt:P81 wd:Q5852245. }\nMINUS { ?connecting_line wdt:P81 wd:Q801991. }\n?connecting_line rdfs:label ?layer.\nFILTER((LANG(?layer)) = \"eu\")\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?train_station ?coordinate_location ?layer WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"eu\". }\n?train_station (wdt:[property:instance of]/wdt:[property:subclass of]*) wd:Q719456.\n{ ?train_station wdt:[property:part of] wd:[entity:Bilbao rail network]. }\nUNION\n{ ?train_station wdt:[property:part of] wd:[entity:Euskotren Tranbia]. }\nUNION\n{ ?train_station wdt:[property:part of] wd:[entity:Euskotren Trena]. }\nUNION\n{ ?train_station wdt:[property:part of] wd:[entity:Cercan\u00edas San Sebasti\u00e1n]. }\nUNION\n{ ?train_station wdt:[property:connecting line] wd:[entity:25 (Renfe)]. }\nUNION\n{ ?train_station wdt:[property:part of] wd:[entity:Bayonne\u2013Saint-Jean-Pied-de-Port railway]. }\nUNION\n{ ?train_station wdt:[property:connecting line] wd:[entity:26 (Renfe)]. }\nUNION\n{ ?train_station wdt:[property:connecting line] wd:[entity:Hendaia-Baiona trenbidea]. }\nMINUS { ?train_station (wdt:[property:located in the administrative territorial entity]/wdt:[property:located in the administrative territorial entity]) wd:[entity:Zaragoza Province]. }\nMINUS { ?train_station (wdt:[property:located in the administrative territorial entity]/wdt:[property:located in the administrative territorial entity]) wd:[entity:Province of Burgos]. }\n?train_station wdt:[property:coordinate location] ?coordinate_location.\n?train_station wdt:[property:connecting line] ?connecting_line.\nMINUS { ?connecting_line wdt:[property:connecting line] wd:[entity:Madrid\u2013Hendaya railway line]. }\nMINUS { ?connecting_line wdt:[property:connecting line] wd:[entity:Bordeaux\u2013Irun railway]. }\n?connecting_line rdfs:label ?layer.\nFILTER((LANG(?layer)) = \"eu\")\n}",
    "complexity": "complex"
  },
  {
    "id": "1889",
    "instruction": "Find the ancestors of Boris Johnson and Jesus who are also descendants of George I and Abraham.",
    "query": "SELECT DISTINCT ?person ?personLabel ?personImage ?parent ?parentLabel ?parentImage WITH {\nSELECT ?person WHERE {\n{SELECT DISTINCT ?person WHERE {\nVALUES $ANCESTOR { wd:Q130805 wd:Q9181 } # George I & Abraham\n$ANCESTOR wdt:P40* ?person .\n}}\nVALUES $DESCENDANT { wd:Q180589 wd:Q302 } # Boris Johnson & Jesus\n?person wdt:P40* $DESCENDANT .\n} } AS %person\nWITH {SELECT ?parent WHERE {\nINCLUDE %person\nBIND(?person AS ?parent)\n} } AS %parent\nWHERE {\nINCLUDE %person\nINCLUDE %parent\n?parent wdt:P40 ?person .\nOPTIONAL {?person wdt:P18 ?personImage}\nOPTIONAL {?parent wdt:P18 ?parentImage}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?person ?personLabel ?personImage ?parent ?parentLabel ?parentImage WITH {\nSELECT ?person WHERE {\n{SELECT DISTINCT ?person WHERE {\nVALUES $ANCESTOR { wd:[entity:George I of Great Britain] wd:[entity:Abraham] } # George I & Abraham\n$ANCESTOR wdt:[property:child]* ?person .\n}}\nVALUES $DESCENDANT { wd:[entity:Boris Johnson] wd:[entity:Jesus] } # Boris Johnson & Jesus\n?person wdt:[property:child]* $DESCENDANT .\n} } AS %person\nWITH {SELECT ?parent WHERE {\nINCLUDE %person\nBIND(?person AS ?parent)\n} } AS %parent\nWHERE {\nINCLUDE %person\nINCLUDE %parent\n?parent wdt:[property:child] ?person .\nOPTIONAL {?person wdt:[property:image] ?personImage}\nOPTIONAL {?parent wdt:[property:image] ?parentImage}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "2619",
    "instruction": "List all individuals with the first name Elisabeth or Elizabeth.",
    "query": "SELECT ?item ?itemLabel ?itemDescription (COUNT(*) AS ?count) WHERE {\nVALUES ?target {\nwd:Q385468\nwd:Q17524931\nwd:Q18093037\n}\n?item wdt:P31 wd:Q5;\np:P735 ?statement.\n?statement ps:P735 ?target.\nOPTIONAL { ?statement pq:P1545 ?rank. }\nBIND(IF(BOUND(?rank),?rank, 0) AS ?rank2)\nFILTER(xsd:integer(?rank2) < xsd:integer(2))\n?sitelink schema:about ?item.\nFILTER (SUBSTR(str(?sitelink), 11, 15) = \".wikipedia.org/\") .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr,en\". }\n}\nGROUP BY ?item ?itemLabel ?itemDescription\nORDER BY DESC (?count)\nLIMIT 100",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?itemDescription (COUNT(*) AS ?count) WHERE {\nVALUES ?target {\nwd:[entity:Elizabeth]\nwd:[entity:Elisabeth]\nwd:[entity:\u00c9lisabeth]\n}\n?item wdt:[property:instance of] wd:[entity:human];\np:[property:given name] ?statement.\n?statement ps:[property:given name] ?target.\nOPTIONAL { ?statement pq:[property:series ordinal] ?rank. }\nBIND(IF(BOUND(?rank),?rank, 0) AS ?rank2)\nFILTER(xsd:integer(?rank2) < xsd:integer(2))\n?sitelink schema:about ?item.\nFILTER (SUBSTR(str(?sitelink), 11, 15) = \".wikipedia.org/\") .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr,en\". }\n}\nGROUP BY ?item ?itemLabel ?itemDescription\nORDER BY DESC (?count)\nLIMIT 100",
    "complexity": "complex"
  },
  {
    "id": "1806",
    "instruction": "Show me a list of paintings related to Haarlem.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?image WHERE {\n?item wdt:P31 wd:Q3305213 .\n?item wdt:P180/wdt:P131 wd:Q9920 .\n?item wdt:P18 ?image .\nBIND(MD5(CONCAT(str(?item),str(RAND()))) as ?random)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\"}\n} ORDER BY ?random\nLIMIT 100",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?image WHERE {\n?item wdt:[property:instance of] wd:[entity:painting] .\n?item wdt:[property:image]0/wdt:[property:located in the administrative territorial entity] wd:[entity:Haarlem] .\n?item wdt:[property:image] ?image .\nBIND(MD5(CONCAT(str(?item),str(RAND()))) as ?random)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\"}\n} ORDER BY ?random\nLIMIT 100",
    "complexity": "complex"
  },
  {
    "id": "1065",
    "instruction": "What is the average length of movies by genre and release year?",
    "query": "SELECT ?year (AVG(?durationInMinutes) AS ?avgDurationInMinutes) ?genreLabel WHERE {\n{\nSELECT ?genre WHERE {\n?film wdt:P31/wdt:P279* wd:Q11424;\nwdt:P136 ?genre.\n}\nGROUP BY ?genre\nORDER BY DESC(COUNT(DISTINCT ?film))\nLIMIT 25\n}\n?film wdt:P31/wdt:P279* wd:Q11424;\nwdt:P577 ?date;\np:P2047/psn:P2047/wikibase:quantityAmount ?durationInSeconds;\nwdt:P136 ?genre.\nFILTER(?durationInMinutes < 60*24) # I take the editorial liberty to exclude these films (some stupidly long documentaries), because they just absurdly skew the averages\nBIND(STR(YEAR(?date)) AS ?year)\nBIND(?durationInSeconds/60 AS ?durationInMinutes)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?year ?genreLabel\nHAVING(COUNT(DISTINCT ?film) >= 10)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psn: <http://www.wikidata.org/prop/statement/value-normalized/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?year (AVG(?durationInMinutes) AS ?avgDurationInMinutes) ?genreLabel WHERE {\n{\nSELECT ?genre WHERE {\n?film wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:film];\nwdt:[property:genre] ?genre.\n}\nGROUP BY ?genre\nORDER BY DESC(COUNT(DISTINCT ?film))\nLIMIT 25\n}\n?film wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:film];\nwdt:[property:publication date] ?date;\np:[property:duration]/psn:[property:duration]/wikibase:quantityAmount ?durationInSeconds;\nwdt:[property:genre] ?genre.\nFILTER(?durationInMinutes < 60*24) # I take the editorial liberty to exclude these films (some stupidly long documentaries), because they just absurdly skew the averages\nBIND(STR(YEAR(?date)) AS ?year)\nBIND(?durationInSeconds/60 AS ?durationInMinutes)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?year ?genreLabel\nHAVING(COUNT(DISTINCT ?film) >= 10)",
    "complexity": "complex"
  },
  {
    "id": "1362",
    "instruction": "List all countries that have never participated in a world war.",
    "query": "SELECT DISTINCT ?country ?countryLabel WHERE {\n# \"country\" (sovereign state and UN member)\n?country p:P31/ps:P31 wd:Q3624078;\nwdt:P463 wd:Q1065.\n# not participant of any world war\nMINUS {\n?worldWar wdt:P31 wd:Q103495;\nwdt:P710/wdt:P527? ?country.\n}\n# extant\nMINUS { ?country wdt:P576|wdt:P582 ?end. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?country ?countryLabel WHERE {\n# \"country\" (sovereign state and UN member)\n?country p:[property:instance of]/ps:[property:instance of] wd:[entity:sovereign state];\nwdt:[property:member of] wd:[entity:United Nations].\n# not participant of any world war\nMINUS {\n?worldWar wdt:[property:instance of] wd:[entity:world war];\nwdt:[property:participant]/wdt:[property:has part(s)]? ?country.\n}\n# extant\nMINUS { ?country wdt:[property:dissolved, abolished or demolished date]|wdt:[property:end time] ?end. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "2286",
    "instruction": "Show me a map of council areas in Scotland.",
    "query": "select ?item ?itemLabel ?coords ?elseLabel (?elseLabel as ?layer)\nwith { select ?item ?else ?coords where {\n?item wdt:P131 ?else .\n?else wdt:P31 wd:Q15060255 .\n?item wdt:P625 ?coords .\n} } as %i\nwhere\n{\ninclude %i\nfilter not exists { ?item wdt:P131 ?else2 . {?else2 wdt:P31 wd:Q15060255 .} UNION {?else2 wdt:P131* wd:Q21. hint:Prior hint:gearing \"forward\".} UNION {?else2 wdt:P131* wd:Q26. hint:Prior hint:gearing \"forward\".} filter(str(?else2) != str(?else)) }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\".\n?else rdfs:label ?elseLabel.\n?item rdfs:label ?itemLabel .}\n}\n#defaultView:Map",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX hint: <http://www.bigdata.com/queryHints#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nselect ?item ?itemLabel ?coords ?elseLabel (?elseLabel as ?layer)\nwith { select ?item ?else ?coords where {\n?item wdt:[property:located in the administrative territorial entity] ?else .\n?else wdt:[property:instance of] wd:[entity:Scottish council area] .\n?item wdt:[property:coordinate location] ?coords .\n} } as %i\nwhere\n{\ninclude %i\nfilter not exists { ?item wdt:[property:located in the administrative territorial entity] ?else2 . {?else2 wdt:[property:instance of] wd:[entity:Scottish council area] .} UNION {?else2 wdt:[property:located in the administrative territorial entity]* wd:[entity:England]. hint:Prior hint:gearing \"forward\".} UNION {?else2 wdt:[property:located in the administrative territorial entity]* wd:[entity:Northern Ireland]. hint:Prior hint:gearing \"forward\".} filter(str(?else2) != str(?else)) }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\".\n?else rdfs:label ?elseLabel.\n?item rdfs:label ?itemLabel .}\n}\n#defaultView:Map",
    "complexity": "complex"
  },
  {
    "id": "252",
    "instruction": "List all the places associated with Ono no Komachi.",
    "query": "SELECT DISTINCT (SUBSTR(STR(?place),32) as ?link) ?propertyLabel ?placeLabel\nWHERE {\nwd:Q198984 ?prop ?place. ?place wdt:P625 [].\n?property ?ref ?prop; rdf:type wikibase:Property.\nSERVICE wikibase:label {bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\"}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT (SUBSTR(STR(?place),32) as ?link) ?propertyLabel ?placeLabel\nWHERE {\nwd:[entity:Ono no Komachi] ?prop ?place. ?place wdt:[property:coordinate location] [].\n?property ?ref ?prop; rdf:type wikibase:Property.\nSERVICE wikibase:label {bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\"}\n}",
    "complexity": "complex"
  },
  {
    "id": "1297",
    "instruction": "List all Italian communes with names ending in -ago, -ate, or -asco.",
    "query": "SELECT DISTINCT ?item ?label ?coord ?rgb WHERE {\n?item wdt:P17 wd:Q38.\n?item wdt:P31 wd:Q747074.\n?item wdt:P625 ?coord.\n?item rdfs:label ?labelWithLanguage.\nBIND(STR(?labelWithLanguage) AS ?label)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"it\". }\nFILTER(STRENDS(?labelWithLanguage, \"ago\") || STRENDS(?labelWithLanguage, \"ate\") || STRENDS(?labelWithLanguage, \"asco\"))\nFILTER((LANG(?labelWithLanguage)) = \"it\")\nBIND(\nIF(STRENDS(?labelWithLanguage, \"ago\"), \"CC3333\",\nIF(STRENDS(?labelWithLanguage, \"ate\"), \"33AACC\",\nIF(STRENDS(?labelWithLanguage, \"asco\"), \"AA33CC\",\n\"\"))) AS ?rgb).\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?label ?coord ?rgb WHERE {\n?item wdt:[property:country] wd:[entity:Italy].\n?item wdt:[property:instance of] wd:[entity:commune of Italy].\n?item wdt:[property:coordinate location] ?coord.\n?item rdfs:label ?labelWithLanguage.\nBIND(STR(?labelWithLanguage) AS ?label)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"it\". }\nFILTER(STRENDS(?labelWithLanguage, \"ago\") || STRENDS(?labelWithLanguage, \"ate\") || STRENDS(?labelWithLanguage, \"asco\"))\nFILTER((LANG(?labelWithLanguage)) = \"it\")\nBIND(\nIF(STRENDS(?labelWithLanguage, \"ago\"), \"CC3333\",\nIF(STRENDS(?labelWithLanguage, \"ate\"), \"33AACC\",\nIF(STRENDS(?labelWithLanguage, \"asco\"), \"AA33CC\",\n\"\"))) AS ?rgb).\n}",
    "complexity": "complex"
  },
  {
    "id": "2244",
    "instruction": "List all types of things with IIIF links in Wikidata, along with their counts.",
    "query": "SELECT ?typeLabel (COUNT(?thing) AS ?count) WHERE {\n?thing wdt:P6108 ?iiif; wdt:P31 ?type\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} GROUP BY ?typeLabel\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?typeLabel (COUNT(?thing) AS ?count) WHERE {\n?thing wdt:[property:IIIF manifest URL] ?iiif; wdt:[property:instance of] ?type\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} GROUP BY ?typeLabel\nORDER BY DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "2737",
    "instruction": "Show me a map of Finistere with the birthplaces of women marked.",
    "query": "SELECT ?personne ?personneLabel ?locLabel ?coord ?rgb WHERE {\n?personne wdt:P31 wd:Q5 ;\nwdt:P21 wd:Q6581072 ;\nwdt:P19 ?loc .\n?loc wdt:P131* wd:Q3389 ; wdt:P625 ?coord .\nOPTIONAL { ?personne wdt:P18 ?image }\nBIND(IF(BOUND(?image),\"60BB00\",\"666666\") AS ?rgb).\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?personne ?personneLabel ?locLabel ?coord ?rgb WHERE {\n?personne wdt:[property:instance of] wd:[entity:human] ;\nwdt:[property:sex or gender] wd:[entity:female] ;\nwdt:[property:place of birth] ?loc .\n?loc wdt:[property:located in the administrative territorial entity]* wd:[entity:Finist\u00e8re] ; wdt:[property:coordinate location] ?coord .\nOPTIONAL { ?personne wdt:[property:image] ?image }\nBIND(IF(BOUND(?image),\"60BB00\",\"666666\") AS ?rgb).\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "2541",
    "instruction": "How many lexeme pairs exist between different languages?",
    "query": "SELECT\n?language1 ?language1Label ?language2 ?language2Label\n?number_of_lexemes\nWITH {\nSELECT ?language1 ?language2 (COUNT(*) AS ?number_of_lexemes) {\n[] ^wdt:P5137 / ^ontolex:sense ?lexeme1, ?lexeme2 .\nFILTER (?lexeme1 != ?lexeme2)\n?lexeme1 dct:language ?language1 .\n?lexeme2 dct:language ?language2 .\nFILTER (?language1 != ?language2)\nFILTER (STR(?language1) > STR(?language2))\n}\nGROUP BY ?language1 ?language2\nORDER BY DESC(?number_of_lexemes)\nLIMIT 100\n} AS %result\n{\nINCLUDE %result\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?number_of_lexemes)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX dct: <http://purl.org/dc/terms/>\nPREFIX ontolex: <http://www.w3.org/ns/lemon/ontolex#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT\n?language1 ?language1Label ?language2 ?language2Label\n?number_of_lexemes\nWITH {\nSELECT ?language1 ?language2 (COUNT(*) AS ?number_of_lexemes) {\n[] ^wdt:[property:item for this sense] / ^ontolex:sense ?lexeme1, ?lexeme2 .\nFILTER (?lexeme1 != ?lexeme2)\n?lexeme1 dct:language ?language1 .\n?lexeme2 dct:language ?language2 .\nFILTER (?language1 != ?language2)\nFILTER (STR(?language1) > STR(?language2))\n}\nGROUP BY ?language1 ?language2\nORDER BY DESC(?number_of_lexemes)\nLIMIT 100\n} AS %result\n{\nINCLUDE %result\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?number_of_lexemes)",
    "complexity": "complex"
  },
  {
    "id": "965",
    "instruction": "What is the average gestation period of different genera?",
    "query": "SELECT ?genus (AVG(?period) AS ?period) (SAMPLE(?label) AS ?genusLabel) (SAMPLE(?rgb) AS ?rgb)\nWHERE\n{\n{\nBIND(\"en\" AS ?language).\n# find species with gestation period and convert to seconds (SI base unit)\n?species p:P3063/psv:P3063 [\nwikibase:quantityAmount ?basePeriod;\nwikibase:quantityUnit [\np:P2370/psv:P2370 [\nwikibase:quantityAmount ?unitPeriod;\nwikibase:quantityUnit wd:Q11574\n]\n]\n].\n# convert back to days\nBIND((?basePeriod * ?unitPeriod)/(60*60*24) AS ?period).\n# find genus\n?species wdt:P171* ?genus.\n?genus wdt:P105 wd:Q34740.\n# find a good label - trivial name, else label, else \"<no name>\"\nOPTIONAL {\n?genus wdt:P1843 ?trivialName.\nFILTER(LANG(?trivialName) = ?language).\n}\nOPTIONAL {\n?genus rdfs:label ?genusLabel.\nFILTER(LANG(?genusLabel) = ?language).\n}\nBIND(IF(BOUND(?trivialName),?trivialName,IF(BOUND(?genusLabel),?genusLabel,\"<no name>\")) AS ?label).\n# find order\n?genus wdt:P171* ?order.\n?order wdt:P105 wd:Q36602.\n# choose \"random but deterministic\" color per order; you can play around with \"-\" (can be any string) to find a pleasing resulting color distribution\nBIND(UCASE(SUBSTR(SHA256(CONCAT(\"-\", STR(?order))), 0, 6)) AS ?rgb).\n}\nUNION\n{\n# add scale\nVALUES (?genus ?period ?label) {\n(wd:Q23387 7 \"week\"@en)\n(wd:Q5151 30.436875 \"month\"@en)\n(wd:Q1643308 91.310625 \"3 months\"@en)\n(wd:Q2269240 182.62125 \"6 months\"@en)\n(wd:Q577 365.2425 \"year\"@en)\n}\nBIND(\"CCCCCC\" AS ?rgb).\n}\n}\nGROUP BY ?genus",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?genus (AVG(?period) AS ?period) (SAMPLE(?label) AS ?genusLabel) (SAMPLE(?rgb) AS ?rgb)\nWHERE\n{\n{\nBIND(\"en\" AS ?language).\n# find species with gestation period and convert to seconds (SI base unit)\n?species p:[property:gestation period]/psv:[property:gestation period] [\nwikibase:quantityAmount ?basePeriod;\nwikibase:quantityUnit [\np:[property:conversion to SI unit]/psv:[property:conversion to SI unit] [\nwikibase:quantityAmount ?unitPeriod;\nwikibase:quantityUnit wd:[entity:second]\n]\n]\n].\n# convert back to days\nBIND((?basePeriod * ?unitPeriod)/(60*60*24) AS ?period).\n# find genus\n?species wdt:[property:parent taxon]* ?genus.\n?genus wdt:[property:taxon rank] wd:[entity:genus].\n# find a good label - trivial name, else label, else \"<no name>\"\nOPTIONAL {\n?genus wdt:[property:taxon common name] ?trivialName.\nFILTER(LANG(?trivialName) = ?language).\n}\nOPTIONAL {\n?genus rdfs:label ?genusLabel.\nFILTER(LANG(?genusLabel) = ?language).\n}\nBIND(IF(BOUND(?trivialName),?trivialName,IF(BOUND(?genusLabel),?genusLabel,\"<no name>\")) AS ?label).\n# find order\n?genus wdt:[property:parent taxon]* ?order.\n?order wdt:[property:taxon rank] wd:[entity:order].\n# choose \"random but deterministic\" color per order; you can play around with \"-\" (can be any string) to find a pleasing resulting color distribution\nBIND(UCASE(SUBSTR(SHA256(CONCAT(\"-\", STR(?order))), 0, 6)) AS ?rgb).\n}\nUNION\n{\n# add scale\nVALUES (?genus ?period ?label) {\n(wd:[entity:week] 7 \"week\"@en)\n(wd:[entity:month] 30.436875 \"month\"@en)\n(wd:[entity:quarter] 91.310625 \"3 months\"@en)\n(wd:[entity:academic term] 182.62125 \"6 months\"@en)\n(wd:[entity:year] 365.2425 \"year\"@en)\n}\nBIND(\"CCCCCC\" AS ?rgb).\n}\n}\nGROUP BY ?genus",
    "complexity": "complex"
  },
  {
    "id": "1166",
    "instruction": "Show me a map of nearby items with Catalan labels but no French labels.",
    "query": "SELECT ?item ?itemLabel ?location WHERE {\nSERVICE wikibase:around {\n?item wdt:P625 ?location.\nbd:serviceParam wikibase:center \"[AUTO_COORDINATES]\";\nwikibase:radius \"1\";\nwikibase:distance ?dist.\n}\n?item rdfs:label ?itemLabel.\nFILTER(LANG(?itemLabel) = \"ca\")\nFILTER NOT EXISTS {\n?item rdfs:label ?frLabel.\nFILTER(LANG(?frLabel) = \"fr\")\n}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?location WHERE {\nSERVICE wikibase:around {\n?item wdt:[property:coordinate location] ?location.\nbd:serviceParam wikibase:center \"[AUTO_COORDINATES]\";\nwikibase:radius \"1\";\nwikibase:distance ?dist.\n}\n?item rdfs:label ?itemLabel.\nFILTER(LANG(?itemLabel) = \"ca\")\nFILTER NOT EXISTS {\n?item rdfs:label ?frLabel.\nFILTER(LANG(?frLabel) = \"fr\")\n}\n}",
    "complexity": "complex"
  }
]