[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "654",
    "instruction": "How many Academy Awards are given out per category?",
    "query": "SELECT ?awardCount ?award ?awardLabel WHERE {\n{\nSELECT (COUNT(?award) AS ?awardCount) ?award\nWHERE\n{\n{\nSELECT (SAMPLE(?human) AS ?human) ?award ?awardWork (SAMPLE(?director) AS ?director) (SAMPLE(?awardEdition) AS ?awardEdition) (SAMPLE(?time) AS ?time) WHERE {\n?award wdt:P31 wd:Q19020 . # All items that are instance of(P31) of Academy awards (Q19020)\n{\n?human p:P166 ?awardStat . # Humans with an awarded(P166) statement\n?awardStat ps:P166 ?award . # ... that has any of the values of ?award\n?awardStat pq:P805 ?awardEdition . # Get the award edition (which is \"subject of\" XXth Academy Awards)\n?awardStat pq:P1686 ?awardWork . # The work they have been awarded for\n?human wdt:P31 wd:Q5 . # Humans\n} UNION {\n?awardWork wdt:P31 wd:Q11424 . # Films\n?awardWork p:P166 ?awardStat . # ... with an awarded(P166) statement\n?awardStat ps:P166 ?award . # ... that has any of the values of ?award\n?awardStat pq:P805 ?awardEdition . # Get the award edition (which is \"subject of\" XXth Academy Awards)\n}\nOPTIONAL {\n?awardEdition wdt:P585 ?time . # the \"point of time\" of the Academy Award\n?awardWork wdt:P57 ?director .\n}\n}\nGROUP BY ?awardWork ?award # We only want every movie once for a category (a 'random' person is selected)\n}\n} GROUP BY ?award\nORDER BY ASC(?awardCount)\n}\nSERVICE wikibase:label { # ... include the labels\nbd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" .\n}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?awardCount ?award ?awardLabel WHERE {\n{\nSELECT (COUNT(?award) AS ?awardCount) ?award\nWHERE\n{\n{\nSELECT (SAMPLE(?human) AS ?human) ?award ?awardWork (SAMPLE(?director) AS ?director) (SAMPLE(?awardEdition) AS ?awardEdition) (SAMPLE(?time) AS ?time) WHERE {\n?award wdt:[property:instance of] wd:[entity:Academy Awards] . # All items that are instance of([property:instance of]) of Academy awards ([entity:Academy Awards])\n{\n?human p:[property:award received] ?awardStat . # Humans with an awarded([property:award received]) statement\n?awardStat ps:[property:award received] ?award . # ... that has any of the values of ?award\n?awardStat pq:[property:statement is subject of] ?awardEdition . # Get the award edition (which is \"subject of\" XXth Academy Awards)\n?awardStat pq:[property:for work] ?awardWork . # The work they have been awarded for\n?human wdt:[property:instance of] wd:[entity:human] . # Humans\n} UNION {\n?awardWork wdt:[property:instance of] wd:[entity:film] . # Films\n?awardWork p:[property:award received] ?awardStat . # ... with an awarded([property:award received]) statement\n?awardStat ps:[property:award received] ?award . # ... that has any of the values of ?award\n?awardStat pq:[property:statement is subject of] ?awardEdition . # Get the award edition (which is \"subject of\" XXth Academy Awards)\n}\nOPTIONAL {\n?awardEdition wdt:[property:point in time] ?time . # the \"point of time\" of the Academy Award\n?awardWork wdt:[property:director] ?director .\n}\n}\nGROUP BY ?awardWork ?award # We only want every movie once for a category (a 'random' person is selected)\n}\n} GROUP BY ?award\nORDER BY ASC(?awardCount)\n}\nSERVICE wikibase:label { # ... include the labels\nbd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" .\n}\n}",
    "complexity": "complex"
  },
  {
    "id": "2623",
    "instruction": "List all food items named after a place in the UK.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?place ?placeLabel ?coords ?img ?layer WHERE {\n?item wdt:P31?/wdt:P279* wd:Q2095 .\n?item wdt:P138 ?place .\n?place wdt:P17 wd:Q145 .\n?place wdt:P131 [] .\nOPTIONAL {?place wdt:P625 ?coords} .\nOPTIONAL {?item wdt:P18 ?img} .\nOPTIONAL {?item wdt:P31?/wdt:P279* wd:Q10943 . BIND (wd:Q10943 AS ?type)} .\nOPTIONAL {?item wdt:P31?/wdt:P279* wd:Q3314483 . BIND (wd:Q3314483 AS ?type)} .\nOPTIONAL {?item wdt:P31?/wdt:P279* wd:Q40050 . BIND (wd:Q40050 AS ?type)} .\nOPTIONAL {BIND (wd:Q2095 AS ?type)} .\nOPTIONAL {?type rdfs:label ?layer . FILTER(lang(?layer) = 'en')}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?place ?placeLabel ?coords ?img ?layer WHERE {\n?item wdt:[property:instance of]?/wdt:[property:subclass of]* wd:[entity:food] .\n?item wdt:[property:named after] ?place .\n?place wdt:[property:country] wd:[entity:United Kingdom] .\n?place wdt:[property:located in the administrative territorial entity] [] .\nOPTIONAL {?place wdt:[property:coordinate location] ?coords} .\nOPTIONAL {?item wdt:[property:image] ?img} .\nOPTIONAL {?item wdt:[property:instance of]?/wdt:[property:subclass of]* wd:[entity:cheese] . BIND (wd:[entity:cheese] AS ?type)} .\nOPTIONAL {?item wdt:[property:instance of]?/wdt:[property:subclass of]* wd:[entity:fruit] . BIND (wd:[entity:fruit] AS ?type)} .\nOPTIONAL {?item wdt:[property:instance of]?/wdt:[property:subclass of]* wd:[entity:drink] . BIND (wd:[entity:drink] AS ?type)} .\nOPTIONAL {BIND (wd:[entity:food] AS ?type)} .\nOPTIONAL {?type rdfs:label ?layer . FILTER(lang(?layer) = 'en')}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY ?itemLabel",
    "complexity": "complex"
  },
  {
    "id": "1915",
    "instruction": "List all railway stations in the West Highlands of Scotland and their connections.",
    "query": "SELECT * WHERE {\n?comm1 p:P31/ps:P31/wdt:P279* wd:Q55488 ; wdt:P17 wd:Q145 ; wdt:P625 ?coord1 ; wdt:P197 ?comm2 .\nMINUS { ?comm1 p:P31 [ ps:P31 wd:Q55488 ; pq:P582 [] ] } .\nMINUS { ?comm2 p:P31 [ ps:P31 wd:Q55488 ; pq:P582 [] ] } .\nMINUS { ?comm1 p:P31 [ ps:P31 wd:Q928830 ] } .\nMINUS { ?comm2 p:P31 [ ps:P31 wd:Q928830 ] } .\n?comm2 wdt:P625 ?coord2 .\n?comm1 p:P625 [ ps:P625 []; psv:P625 [ wikibase:geoLongitude ?coord1lon; wikibase:geoLatitude ?coord1lat; ] ] .\n?comm2 p:P625 [ ps:P625 []; psv:P625 [ wikibase:geoLongitude ?coord2lon; wikibase:geoLatitude ?coord2lat; ] ] .\nBIND(CONCAT('LINESTRING (', STR(?coord1lon), ' ', STR(?coord1lat), ',', STR(?coord2lon), ' ', STR(?coord2lat), ')') AS ?str) .\nBIND(STRDT(?str, geo:wktLiteral) AS ?line) .\n}",
    "annotated": "PREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT * WHERE {\n?comm1 p:[property:instance of]/ps:[property:instance of]/wdt:[property:subclass of]* wd:[entity:railway station] ; wdt:[property:country] wd:[entity:United Kingdom] ; wdt:[property:coordinate location] ?coord1 ; wdt:[property:adjacent station] ?comm2 .\nMINUS { ?comm1 p:[property:instance of] [ ps:[property:instance of] wd:[entity:railway station] ; pq:[property:end time] [] ] } .\nMINUS { ?comm2 p:[property:instance of] [ ps:[property:instance of] wd:[entity:railway station] ; pq:[property:end time] [] ] } .\nMINUS { ?comm1 p:[property:instance of] [ ps:[property:instance of] wd:[entity:metro station] ] } .\nMINUS { ?comm2 p:[property:instance of] [ ps:[property:instance of] wd:[entity:metro station] ] } .\n?comm2 wdt:[property:coordinate location] ?coord2 .\n?comm1 p:[property:coordinate location] [ ps:[property:coordinate location] []; psv:[property:coordinate location] [ wikibase:geoLongitude ?coord1lon; wikibase:geoLatitude ?coord1lat; ] ] .\n?comm2 p:[property:coordinate location] [ ps:[property:coordinate location] []; psv:[property:coordinate location] [ wikibase:geoLongitude ?coord2lon; wikibase:geoLatitude ?coord2lat; ] ] .\nBIND(CONCAT('LINESTRING (', STR(?coord1lon), ' ', STR(?coord1lat), ',', STR(?coord2lon), ' ', STR(?coord2lat), ')') AS ?str) .\nBIND(STRDT(?str, geo:wktLiteral) AS ?line) .\n}",
    "complexity": "complex"
  },
  {
    "id": "989",
    "instruction": "Find the first person born after Alfred Nobel's death who won a Nobel Prize.",
    "query": "SELECT ?awardee ?awardeeLabel ?awardeeBorn ?awarded ?prizeLabel WHERE {\nwd:Q23810 wdt:P570 ?nobelDied.\n?awardee wdt:P31 wd:Q5;\nwdt:P569 ?awardeeBorn.\n?prize wdt:P279 wd:Q7191.\nFILTER(?awardeeBorn > ?nobelDied).\n{\n# awardee has award received: nobel prize with point in time\n?awardee p:P166 [\nps:P166/wdt:P31? ?prize;\npq:P585 ?awarded\n].\n} UNION {\n# nobel prize has winner: awardee with point in time\n?prize p:P1346 [\nps:P1346 ?awardee;\npq:P585 ?awarded\n].\n} UNION {\n# awardee has award received: <year> nobel prize\n?awardee wdt:P166 ?yearPrize.\n?yearPrize wdt:P31 ?prize;\nwdt:P585 ?awarded.\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nORDER BY ?awarded\nLIMIT 1",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?awardee ?awardeeLabel ?awardeeBorn ?awarded ?prizeLabel WHERE {\nwd:[entity:Alfred Nobel] wdt:[property:date of death] ?nobelDied.\n?awardee wdt:[property:instance of] wd:[entity:human];\nwdt:[property:date of birth] ?awardeeBorn.\n?prize wdt:[property:subclass of] wd:[entity:Nobel Prize].\nFILTER(?awardeeBorn > ?nobelDied).\n{\n# awardee has award received: nobel prize with point in time\n?awardee p:[property:award received] [\nps:[property:award received]/wdt:[property:instance of]? ?prize;\npq:[property:point in time] ?awarded\n].\n} UNION {\n# nobel prize has winner: awardee with point in time\n?prize p:[property:winner] [\nps:[property:winner] ?awardee;\npq:[property:point in time] ?awarded\n].\n} UNION {\n# awardee has award received: <year> nobel prize\n?awardee wdt:[property:award received] ?yearPrize.\n?yearPrize wdt:[property:instance of] ?prize;\nwdt:[property:point in time] ?awarded.\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nORDER BY ?awarded\nLIMIT 1",
    "complexity": "complex"
  },
  {
    "id": "1407",
    "instruction": "List the cities where famous Viennese composers were born, died or lived.",
    "query": "SELECT ?id WHERE { ?composition wdt:P86 ?composer; wdt:P826 ?tonality. ?composer wdt:P19|wdt:P20|wdt:P551 ?id. } GROUP BY ?id ?idLabel ORDER BY DESC(COUNT(DISTINCT ?composer))",
    "annotated": "PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?id WHERE { ?composition wdt:[property:composer] ?composer; wdt:[property:tonality] ?tonality. ?composer wdt:[property:place of birth]|wdt:[property:place of death]|wdt:[property:residence] ?id. } GROUP BY ?id ?idLabel ORDER BY DESC(COUNT(DISTINCT ?composer))",
    "complexity": "complex"
  },
  {
    "id": "1700",
    "instruction": "List all places in Canada without an English name.",
    "query": "SELECT ?item (SAMPLE(?label) AS ?label) (SAMPLE(?coords) AS ?coords) (GROUP_CONCAT(?lang) AS ?langs) (COUNT(DISTINCT ?label) as ?desccount)\nWHERE {\n?item wdt:P17 wd:Q16 .\n?item wdt:P625 ?coords.\nFILTER NOT EXISTS {\n?item rdfs:label ?englishLabel .\nFILTER(LANGMATCHES(LANG(?englishLabel),\"EN\"))\n} .\n?item rdfs:label ?label\nBIND (LANG(?label) AS ?lang)\n} GROUP BY ?item\nORDER BY DESC(?desccount)",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?item (SAMPLE(?label) AS ?label) (SAMPLE(?coords) AS ?coords) (GROUP_CONCAT(?lang) AS ?langs) (COUNT(DISTINCT ?label) as ?desccount)\nWHERE {\n?item wdt:[property:country] wd:[entity:Canada] .\n?item wdt:[property:coordinate location] ?coords.\nFILTER NOT EXISTS {\n?item rdfs:label ?englishLabel .\nFILTER(LANGMATCHES(LANG(?englishLabel),\"EN\"))\n} .\n?item rdfs:label ?label\nBIND (LANG(?label) AS ?lang)\n} GROUP BY ?item\nORDER BY DESC(?desccount)",
    "complexity": "complex"
  },
  {
    "id": "1264",
    "instruction": "What are the coordinates of London Underground stations?",
    "query": "SELECT DISTINCT ?coordinates ?line ?item ?itemLabel ?connectLabel ?image ?opening ?rgb\nWITH {\nSELECT ?item (SAMPLE(?coordinates) AS ?coordinates) (SAMPLE(?image) AS ?image) (sample(?lat1) as ?lat1) (sample(?lon1) as ?lon1) (sample(?opening) as ?opening) WHERE {\n?item wdt:P31 wd:Q14562709 .\n?item wdt:P625 ?coordinates .\n?item p:P625 / psv:P625 / wikibase:geoLatitude ?lat1 .\n?item p:P625 / psv:P625 / wikibase:geoLongitude ?lon1 .\nOPTIONAL { ?item wdt:P18 ?image }.\nOPTIONAL { ?item wdt:P1619 ?opening }.\n} GROUP BY ?item\n} AS %stations\nWITH {\nSELECT ?nextstation (sample(?lat2) as ?lat2) (sample(?lon2) as ?lon2) WHERE {\n?nextstation wdt:P31 wd:Q14562709 .\n?nextstation p:P625 / psv:P625 / wikibase:geoLatitude ?lat2 .\n?nextstation p:P625 / psv:P625 / wikibase:geoLongitude ?lon2 .\n} GROUP BY ?nextstation\n} AS %nextstations\nWITH {\nSELECT ?line ?connect ?rgb WHERE {\nINCLUDE %stations .\nINCLUDE %nextstations .\n?item p:P197 ?nextstationstatement .\n?nextstationstatement ps:P197 ?nextstation .\n?nextstationstatement pq:P81 ?connect . ?connect wdt:P361 wd:Q20075 .\n?connect wdt:P465 ?rgb .\nFILTER(STR(?item) < STR(?nextstation)) .\nBIND(CONCAT('LINESTRING (', STR(?lon1), ' ', STR(?lat1), ',', STR(?lon2), ' ', STR(?lat2), ')') AS ?str) .\nBIND(STRDT(?str, geo:wktLiteral) AS ?line)\n}\n} AS %lines\nWHERE {\n{ INCLUDE %stations } UNION { INCLUDE %lines } .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?coordinates ?line ?item ?itemLabel ?connectLabel ?image ?opening ?rgb\nWITH {\nSELECT ?item (SAMPLE(?coordinates) AS ?coordinates) (SAMPLE(?image) AS ?image) (sample(?lat1) as ?lat1) (sample(?lon1) as ?lon1) (sample(?opening) as ?opening) WHERE {\n?item wdt:[property:instance of] wd:[entity:London Underground station] .\n?item wdt:[property:coordinate location] ?coordinates .\n?item p:[property:coordinate location] / psv:[property:coordinate location] / wikibase:geoLatitude ?lat1 .\n?item p:[property:coordinate location] / psv:[property:coordinate location] / wikibase:geoLongitude ?lon1 .\nOPTIONAL { ?item wdt:[property:image] ?image }.\nOPTIONAL { ?item wdt:[property:date of official opening] ?opening }.\n} GROUP BY ?item\n} AS %stations\nWITH {\nSELECT ?nextstation (sample(?lat2) as ?lat2) (sample(?lon2) as ?lon2) WHERE {\n?nextstation wdt:[property:instance of] wd:[entity:London Underground station] .\n?nextstation p:[property:coordinate location] / psv:[property:coordinate location] / wikibase:geoLatitude ?lat2 .\n?nextstation p:[property:coordinate location] / psv:[property:coordinate location] / wikibase:geoLongitude ?lon2 .\n} GROUP BY ?nextstation\n} AS %nextstations\nWITH {\nSELECT ?line ?connect ?rgb WHERE {\nINCLUDE %stations .\nINCLUDE %nextstations .\n?item p:[property:adjacent station] ?nextstationstatement .\n?nextstationstatement ps:[property:adjacent station] ?nextstation .\n?nextstationstatement pq:[property:connecting line] ?connect . ?connect wdt:[property:part of] wd:[entity:London Underground] .\n?connect wdt:[property:sRGB color hex triplet] ?rgb .\nFILTER(STR(?item) < STR(?nextstation)) .\nBIND(CONCAT('LINESTRING (', STR(?lon1), ' ', STR(?lat1), ',', STR(?lon2), ' ', STR(?lat2), ')') AS ?str) .\nBIND(STRDT(?str, geo:wktLiteral) AS ?line)\n}\n} AS %lines\nWHERE {\n{ INCLUDE %stations } UNION { INCLUDE %lines } .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "2269",
    "instruction": "What are some popular locked-room mystery books?",
    "query": "SELECT DISTINCT ?item ?itemLabel ?itemDescription (YEAR(?d) as ?published) ?authorLabel ?title\nWHERE\n{\n?item p:P136/ps:P136 wd:Q1141200 .\nOPTIONAL { ?item wdt:P577 ?d }\nOPTIONAL { ?item wdt:P50 ?author }\nOPTIONAL { ?item wdt:P1476 ?title }\nFILTER NOT EXISTS { ?item wdt:P577 ?d2 . FILTER(?d2 < ?d && BOUND(?d) && BOUND(?d2) ) }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}\nORDER BY ?published",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?itemDescription (YEAR(?d) as ?published) ?authorLabel ?title\nWHERE\n{\n?item p:[property:genre]/ps:[property:genre] wd:[entity:locked room mystery] .\nOPTIONAL { ?item wdt:[property:publication date] ?d }\nOPTIONAL { ?item wdt:[property:author] ?author }\nOPTIONAL { ?item wdt:[property:title] ?title }\nFILTER NOT EXISTS { ?item wdt:[property:publication date] ?d2 . FILTER(?d2 < ?d && BOUND(?d) && BOUND(?d2) ) }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}\nORDER BY ?published",
    "complexity": "complex"
  },
  {
    "id": "241",
    "instruction": "List all manuscripts of the Quran with their inventory numbers and collection labels.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?collectionLabel ?inventory ?url ?image WHERE {\n{?item wdt:P1574 wd:Q428 } UNION { ?item wdt:P1574/wdt:P31 wd:Q234262 } # Exemplar of Quran or of an individual Sura\n?item p:P217 [ps:P217 ?inventory; pq:P195 ?collection]\nOPTIONAL {?item wdt:P973 ?url}\nOPTIONAL {?item wdt:P18 ?image}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} ORDER BY ?collectionLabel ?inventory",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?collectionLabel ?inventory ?url ?image WHERE {\n{?item wdt:[property:exemplar of] wd:[entity:Qur\u2019an] } UNION { ?item wdt:[property:exemplar of]/wdt:[property:instance of] wd:[entity:surah] } # Exemplar of Quran or of an individual Sura\n?item p:[property:inventory number] [ps:[property:inventory number] ?inventory; pq:[property:collection] ?collection]\nOPTIONAL {?item wdt:[property:described at URL] ?url}\nOPTIONAL {?item wdt:[property:image] ?image}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} ORDER BY ?collectionLabel ?inventory",
    "complexity": "complex"
  },
  {
    "id": "1150",
    "instruction": "List all people with an ORCID ID along with their birthplaces.",
    "query": "SELECT DISTINCT ?person ?personLabel ?place ?placeLabel ?coord\nWITH {\nSELECT ?person ?place ?coord WHERE {\n?person wdt:P19 ?place ;\nwdt:P496 ?orcid .\n?place wdt:P625 ?coord .\n}\n} AS %results\nWHERE {\nINCLUDE %results\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?person ?personLabel ?place ?placeLabel ?coord\nWITH {\nSELECT ?person ?place ?coord WHERE {\n?person wdt:[property:place of birth] ?place ;\nwdt:[property:ORCID iD] ?orcid .\n?place wdt:[property:coordinate location] ?coord .\n}\n} AS %results\nWHERE {\nINCLUDE %results\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "691",
    "instruction": "List all versions of The Scream artwork.",
    "query": "SELECT\n?item\n(SAMPLE (?itemL) AS ?title)\n(SAMPLE (?y) AS ?year)\n(SAMPLE (?typeL) AS ?type)\n(group_concat(DISTINCT ?materialL ; separator = \", \") as ?materials)\n(SAMPLE (?collectionL) AS ?collection)\n(SAMPLE (?img) AS ?image)\n{\nSELECT ?item ?itemL (YEAR(?date) AS ?y) ?typeL ?collectionL ?img ?materialL\nWHERE {\n?item wdt:P179 wd:Q471379 .\n?item wdt:P18 ?img .\n?item wdt:P571 ?date .\n?item wdt:P31 ?instance .\n?item rdfs:label ?itemL FILTER (lang(?itemL) = \"en\").\n?instance rdfs:label ?typeL FILTER (lang(?typeL) = \"en\").\nOPTIONAL {\n?item wdt:P195 ?collection .\n?collection rdfs:label ?collectionL FILTER (lang(?collectionL) = \"en\").\n}\nOPTIONAL {\n?item wdt:P186 ?material .\n?material rdfs:label ?materialL FILTER (lang(?materialL) = \"en\").\n}\n}\n}\nGROUP BY ?item\nORDER BY ?year ?item ?itemLabel",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT\n?item\n(SAMPLE (?itemL) AS ?title)\n(SAMPLE (?y) AS ?year)\n(SAMPLE (?typeL) AS ?type)\n(group_concat(DISTINCT ?materialL ; separator = \", \") as ?materials)\n(SAMPLE (?collectionL) AS ?collection)\n(SAMPLE (?img) AS ?image)\n{\nSELECT ?item ?itemL (YEAR(?date) AS ?y) ?typeL ?collectionL ?img ?materialL\nWHERE {\n?item wdt:[property:part of the series] wd:[entity:The Scream] .\n?item wdt:[property:image] ?img .\n?item wdt:[property:inception] ?date .\n?item wdt:[property:instance of] ?instance .\n?item rdfs:label ?itemL FILTER (lang(?itemL) = \"en\").\n?instance rdfs:label ?typeL FILTER (lang(?typeL) = \"en\").\nOPTIONAL {\n?item wdt:[property:collection] ?collection .\n?collection rdfs:label ?collectionL FILTER (lang(?collectionL) = \"en\").\n}\nOPTIONAL {\n?item wdt:[property:image]6 ?material .\n?material rdfs:label ?materialL FILTER (lang(?materialL) = \"en\").\n}\n}\n}\nGROUP BY ?item\nORDER BY ?year ?item ?itemLabel",
    "complexity": "complex"
  },
  {
    "id": "236",
    "instruction": "Find the coordinates of manuscript collections on a map.",
    "query": "SELECT ?link ?collectionLabel ?coords\nWHERE {\n{SELECT DISTINCT ?collection ?coords WHERE {?q (wdt:P31/wdt:P279*) wd:Q87167;\nwdt:P195 ?collection .\n?collection wdt:P625 ?coords.\n} }\nBIND (URI(CONCAT(\"/collection/\",SUBSTR(STR(?collection),32))) AS ?link).\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?link ?collectionLabel ?coords\nWHERE {\n{SELECT DISTINCT ?collection ?coords WHERE {?q (wdt:[property:instance of]/wdt:[property:subclass of]*) wd:[entity:manuscript];\nwdt:[property:collection] ?collection .\n?collection wdt:[property:coordinate location] ?coords.\n} }\nBIND (URI(CONCAT(\"/collection/\",SUBSTR(STR(?collection),32))) AS ?link).\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}",
    "complexity": "complex"
  },
  {
    "id": "1996",
    "instruction": "List all female mathematicians born or died on this day.",
    "query": "SELECT ?person ?personLabel ?dob ?dod WHERE {\nBIND(NOW() as $today)\nBIND(YEAR($today) AS $today_year)\nBIND(MONTH($today) AS $today_month)\nBIND(DAY($today) AS $today_day)\n?person wdt:P31 wd:Q5.\n?person wdt:P21 wd:Q6581072 .\nOPTIONAL { ?person wdt:P569 ?dob }\nOPTIONAL { ?person wdt:P570 ?dod }\n?person wdt:P106 wd:Q170790 .\nFILTER( $today_month = MONTH(?dob) && $today_day = DAY(?dob) || $today_month = MONTH(?dod) && $today_day = DAY(?dod) )\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?person ?personLabel ?dob ?dod WHERE {\nBIND(NOW() as $today)\nBIND(YEAR($today) AS $today_year)\nBIND(MONTH($today) AS $today_month)\nBIND(DAY($today) AS $today_day)\n?person wdt:[property:instance of] wd:[entity:human].\n?person wdt:[property:sex or gender] wd:[entity:female] .\nOPTIONAL { ?person wdt:[property:date of birth] ?dob }\nOPTIONAL { ?person wdt:[property:date of death] ?dod }\n?person wdt:[property:occupation] wd:[entity:mathematician] .\nFILTER( $today_month = MONTH(?dob) && $today_day = DAY(?dob) || $today_month = MONTH(?dod) && $today_day = DAY(?dod) )\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "1788",
    "instruction": "List the constituencies where the party of the MP changed between 2017 and 2019 UK general elections.",
    "query": "SELECT ?seat ?seatLabel ?party2017Label ?party2019Label ?mp2017 ?mp2017Label ?mp2019 ?mp2019Label ?article WHERE {\n?mp2017 p:P39 ?mp2017stmt.\n?mp2017stmt pq:P4100 ?party2017;\npq:P2715 wd:Q25052149;\npq:P768 ?seat.\n?mp2019 p:P39 ?mp2019stmt.\n?mp2019stmt pq:P4100 ?party2019;\npq:P2715 wd:Q30173038;\npq:P768 ?seat.\nFILTER(?party2019 != ?party2017)\nMINUS {\nVALUES ?LabourVariant {wd:Q9630 wd:Q6467393}\nVALUES ?LabourVariant1 {wd:Q9630 wd:Q6467393}\n?mp2017stmt pq:P4100 ?LabourVariant . ?mp2019stmt pq:P4100 ?LabourVariant1\n}.\nOPTIONAL {\n?article schema:about ?mp2019 .\n?article schema:isPartOf <https://en.wikipedia.org/>.\nBIND('Y' AS ?art)\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY (?seatLabel)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?seat ?seatLabel ?party2017Label ?party2019Label ?mp2017 ?mp2017Label ?mp2019 ?mp2019Label ?article WHERE {\n?mp2017 p:[property:position held] ?mp2017stmt.\n?mp2017stmt pq:[property:parliamentary group] ?party2017;\npq:[property:elected in] wd:[entity:2017 United Kingdom general election];\npq:[property:electoral district] ?seat.\n?mp2019 p:[property:position held] ?mp2019stmt.\n?mp2019stmt pq:[property:parliamentary group] ?party2019;\npq:[property:elected in] wd:[entity:2019 United Kingdom general election];\npq:[property:electoral district] ?seat.\nFILTER(?party2019 != ?party2017)\nMINUS {\nVALUES ?LabourVariant {wd:[entity:Labour Party] wd:[entity:Labour Co-operative]}\nVALUES ?LabourVariant1 {wd:[entity:Labour Party] wd:[entity:Labour Co-operative]}\n?mp2017stmt pq:[property:parliamentary group] ?LabourVariant . ?mp2019stmt pq:[property:parliamentary group] ?LabourVariant1\n}.\nOPTIONAL {\n?article schema:about ?mp2019 .\n?article schema:isPartOf <https://en.wikipedia.org/>.\nBIND('Y' AS ?art)\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY (?seatLabel)",
    "complexity": "complex"
  },
  {
    "id": "2521",
    "instruction": "List all Irish female scientists without a Wikipedia page.",
    "query": "SELECT ?item ?itemLabel ?occLabel WHERE {\n?item wdt:P31 wd:Q5;\nwdt:P27 wd:Q27;\nwdt:P21 wd:Q6581072;\nwdt:P106/wdt:P279* wd:Q901 .\nMINUS { ?article schema:about ?item }\nOPTIONAL { ?item wdt:P106 ?occ }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?occLabel WHERE {\n?item wdt:[property:instance of] wd:[entity:human];\nwdt:[property:country of citizenship] wd:[entity:Republic of Ireland];\nwdt:[property:sex or gender] wd:[entity:female];\nwdt:[property:occupation]/wdt:[property:country of citizenship]9* wd:[entity:scientist] .\nMINUS { ?article schema:about ?item }\nOPTIONAL { ?item wdt:[property:occupation] ?occ }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  }
]