[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "2054",
    "instruction": "List the most popular variations of 'Susanne' in each country.",
    "query": "SELECT ?country ?nameLabel ?shape ?layer WITH {\nSELECT ?item ?name ?country where {\nvalues ?name {\nwd:Q14936808\nwd:Q1183757\nwd:Q1440465\nwd:Q7648632\nwd:Q7648707\nwd:Q13138161\nwd:Q14936073\nwd:Q14936243\nwd:Q14936686\nwd:Q14936925\nwd:Q14937153\nwd:Q16281769\nwd:Q18061334\nwd:Q18067250\nwd:Q18067716\nwd:Q18067726\nwd:Q18067736\nwd:Q18067785\nwd:Q18067790\nwd:Q18199125\nwd:Q19368856\nwd:Q62595789\nwd:Q78165638\nwd:Q94368759\nwd:Q97120482\n} .\n?item wdt:P735 ?name .\n?item wdt:P19/wdt:P17 ?country .\n} LIMIT 40000\n} AS %data WITH {\nSELECT ?country ?name (COUNT(?item) AS ?pocet) {\nINCLUDE %data .\n} GROUP BY ?country ?name\n} AS %counts WITH {\nSELECT ?country (MAX(?pocet) AS ?max) {\nINCLUDE %counts .\n} GROUP BY ?country\n} AS %best WHERE {\nINCLUDE %counts .\nINCLUDE %best .\nFILTER( ?max = ?pocet ) .\n?name rdfs:label ?nameLabel filter(lang(?nameLabel)=\"en\").\n?country wdt:P3896 ?shape .\nBIND((?nameLabel) as ?layer ).\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?country ?nameLabel ?shape ?layer WITH {\nSELECT ?item ?name ?country where {\nvalues ?name {\nwd:[entity:Susanna]\nwd:[entity:Zsuzsa]\nwd:[entity:Sanna]\nwd:[entity:Susann]\nwd:[entity:Susannah]\nwd:[entity:Suzanne]\nwd:[entity:Susana]\nwd:[entity:Susan]\nwd:[entity:Susanne]\nwd:[entity:Zuzana]\nwd:[entity:Zsuzsanna]\nwd:[entity:Sue]\nwd:[entity:Zuzanna]\nwd:[entity:Suzan]\nwd:[entity:Susie]\nwd:[entity:Suzie]\nwd:[entity:Susi]\nwd:[entity:Suzette]\nwd:[entity:Suzi]\nwd:[entity:Susy]\nwd:[entity:Sanni]\nwd:[entity:Susagna]\nwd:[entity:Zsuzs\u00e1nna]\nwd:[entity:Suzann]\nwd:[entity:Suzannah]\n} .\n?item wdt:[property:given name] ?name .\n?item wdt:[property:place of birth]/wdt:[property:country] ?country .\n} LIMIT 40000\n} AS %data WITH {\nSELECT ?country ?name (COUNT(?item) AS ?pocet) {\nINCLUDE %data .\n} GROUP BY ?country ?name\n} AS %counts WITH {\nSELECT ?country (MAX(?pocet) AS ?max) {\nINCLUDE %counts .\n} GROUP BY ?country\n} AS %best WHERE {\nINCLUDE %counts .\nINCLUDE %best .\nFILTER( ?max = ?pocet ) .\n?name rdfs:label ?nameLabel filter(lang(?nameLabel)=\"en\").\n?country wdt:[property:geoshape] ?shape .\nBIND((?nameLabel) as ?layer ).\n}",
    "complexity": "complex"
  },
  {
    "id": "968",
    "instruction": "List all French communes with multiple railway stations.",
    "query": "SELECT ?place ?placeLabel (count(?item) as ?count) WHERE {\n?item wdt:P31 wd:Q55488 .\n?item wdt:P131* ?place .\n?place wdt:P31/wdt:P131* wd:Q484170 .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\" . }\n}\nGROUP BY ?place ?placeLabel\nHAVING (?count > 1)\nORDER BY DESC(?count) ?placeLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?place ?placeLabel (count(?item) as ?count) WHERE {\n?item wdt:[property:instance of] wd:[entity:railway station] .\n?item wdt:[property:located in the administrative territorial entity]* ?place .\n?place wdt:[property:instance of]/wdt:[property:located in the administrative territorial entity]* wd:[entity:commune of France] .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\" . }\n}\nGROUP BY ?place ?placeLabel\nHAVING (?count > 1)\nORDER BY DESC(?count) ?placeLabel",
    "complexity": "complex"
  },
  {
    "id": "1494",
    "instruction": "List cities with the most world premieres of works.",
    "query": "SELECT ?city ?cityLabel ?count WHERE {\n{\nSELECT ?city (COUNT(DISTINCT ?performance) AS ?count) WHERE {\n?work p:P1191 ?performance.\n?performance pq:P276 ?location. hint:Prior hint:runFirst true.\n?location wdt:P276?/wdt:P131* ?city.\n?city p:P31/ps:P31/wdt:P279* wd:Q515.\n}\nGROUP BY ?city\nHAVING(?count > 1)\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?count) ?cityLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX hint: <http://www.bigdata.com/queryHints#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?city ?cityLabel ?count WHERE {\n{\nSELECT ?city (COUNT(DISTINCT ?performance) AS ?count) WHERE {\n?work p:[property:date of first performance] ?performance.\n?performance pq:[property:location] ?location. hint:Prior hint:runFirst true.\n?location wdt:[property:location]?/wdt:[property:located in the administrative territorial entity]* ?city.\n?city p:[property:instance of]/ps:[property:instance of]/wdt:[property:subclass of]* wd:[entity:city].\n}\nGROUP BY ?city\nHAVING(?count > 1)\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?count) ?cityLabel",
    "complexity": "complex"
  },
  {
    "id": "1668",
    "instruction": "Show me a global map of dams and their locations.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?geo ?type WHERE {\n{ ?item wdt:P31*/wdt:P279* wd:Q12323 . }\nUNION\n{ ?item wdt:P31*/wdt:P279* wd:Q131681 . }\n?item wdt:P625 ?geo .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?geo ?type WHERE {\n{ ?item wdt:[property:instance of]*/wdt:[property:subclass of]* wd:[entity:dam] . }\nUNION\n{ ?item wdt:[property:instance of]*/wdt:[property:subclass of]* wd:[entity:reservoir] . }\n?item wdt:[property:coordinate location] ?geo .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "1486",
    "instruction": "List the mountains in Switzerland sorted by their elevation above sea level.",
    "query": "SELECT ?item ?itemLabel ?coord ?height ?layer ?image WHERE { ?item wdt:P31 wd:Q8502. ?item wdt:P625 ?coord. ?item wdt:P17 wd:Q39. ?item wdt:P2044 ?height . BIND( IF(?height < 1000, \"<1000 metres\", IF(?height < 2000, \"1000 - 2000 metres\", IF(?height < 3000, \"2000 - 3000 metres\", IF(?height < 4000, \"3000 - 4000 metres\", \"> 4000 metres\")))) AS ?layer). OPTIONAL {?item wdt:P18 ?image.}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". } }",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?coord ?height ?layer ?image WHERE { ?item wdt:[property:instance of] wd:[entity:mountain]. ?item wdt:[property:coordinate location] ?coord. ?item wdt:[property:country] wd:[entity:Switzerland]. ?item wdt:[property:elevation above sea level] ?height . BIND( IF(?height < 1000, \"<1000 metres\", IF(?height < 2000, \"1000 - 2000 metres\", IF(?height < 3000, \"2000 - 3000 metres\", IF(?height < 4000, \"3000 - 4000 metres\", \"> 4000 metres\")))) AS ?layer). OPTIONAL {?item wdt:[property:image] ?image.}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". } }",
    "complexity": "complex"
  },
  {
    "id": "1489",
    "instruction": "List the first letters of non-free software names.",
    "query": "SELECT ?character (COUNT(DISTINCT ?item) AS ?count) WHERE {\n?item wdt:P31/wdt:P279* wd:Q7397.\nMINUS { ?item p:P31/ps:P31/wdt:P279* wd:Q341. }\nMINUS { ?item wdt:P275/(wdt:P31|wdt:P279)* wd:Q3943414. }\n?item rdfs:label ?label.\nFILTER(LANG(?label) = \"en\")\nBIND(UCASE(SUBSTR(?label, 1, 1)) AS ?character)\n}\nGROUP BY ?character",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?character (COUNT(DISTINCT ?item) AS ?count) WHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:software].\nMINUS { ?item p:[property:instance of]/ps:[property:instance of]/wdt:[property:subclass of]* wd:[entity:free software]. }\nMINUS { ?item wdt:[property:copyright license]/(wdt:[property:instance of]|wdt:[property:subclass of])* wd:[entity:free software license]. }\n?item rdfs:label ?label.\nFILTER(LANG(?label) = \"en\")\nBIND(UCASE(SUBSTR(?label, 1, 1)) AS ?character)\n}\nGROUP BY ?character",
    "complexity": "complex"
  },
  {
    "id": "2037",
    "instruction": "List all Norwegian politicians who have been part of at least three political parties.",
    "query": "SELECT ?personLabel (COUNT(?parti) AS ?partiC) WHERE {\n?person wdt:P102 ?parti;\nwdt:P27 wd:Q20.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"nb,en\" }\n}\nGROUP BY ?personLabel\nHAVING (?partiC > 2)\nORDER BY DESC (?partiC)\nLIMIT 100",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?personLabel (COUNT(?parti) AS ?partiC) WHERE {\n?person wdt:[property:member of political party] ?parti;\nwdt:[property:country of citizenship] wd:[entity:Norway].\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"nb,en\" }\n}\nGROUP BY ?personLabel\nHAVING (?partiC > 2)\nORDER BY DESC (?partiC)\nLIMIT 100",
    "complexity": "complex"
  },
  {
    "id": "1609",
    "instruction": "List all female science fiction authors who write in German.",
    "query": "SELECT DISTINCT ?author ?authorLabel ?dateOfBirth ?dateOfDeath WHERE {\n?author wdt:P31 wd:Q5;\nwdt:P21/wdt:P279* wd:Q6581072.\n# speaks/writes German, or citizen of Germany, Austria or Liechtenstein (since \"languages spoken, written or signed\" alone is not very complete; Swiss citizenship would probably include too many French- or Italian-writing authors)\n{\n?author wdt:P1412 wd:Q188.\n} UNION {\nVALUES ?country { wd:Q183 wd:Q40 wd:Q347 }\n?author wdt:P27 ?country.\n}\n# genre science fiction, or occupation science fiction author, or genre science fiction as qualifier on occupation author statement\n{\n?author wdt:P136/wdt:P279* wd:Q24925.\n} UNION {\n?author wdt:P106/wdt:P279* wd:Q28225718.\n} UNION {\n?author p:P106 [\na wikibase:BestRank;\nps:P106/wdt:P279* wd:Q482980;\npq:P136/wdt:P279* wd:Q24925\n].\n}\nOPTIONAL { ?author wdt:P569 ?dateOfBirth. }\nOPTIONAL { ?author wdt:P570 ?dateOfDeath. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?author ?authorLabel ?dateOfBirth ?dateOfDeath WHERE {\n?author wdt:[property:instance of] wd:[entity:human];\nwdt:[property:sex or gender]/wdt:[property:subclass of]* wd:[entity:female].\n# speaks/writes German, or citizen of Germany, Austria or Liechtenstein (since \"languages spoken, written or signed\" alone is not very complete; Swiss citizenship would probably include too many French- or Italian-writing authors)\n{\n?author wdt:[property:languages spoken, written or signed] wd:[entity:German].\n} UNION {\nVALUES ?country { wd:[entity:Germany] wd:[entity:Austria] wd:[entity:Liechtenstein] }\n?author wdt:[property:country of citizenship] ?country.\n}\n# genre science fiction, or occupation science fiction author, or genre science fiction as qualifier on occupation author statement\n{\n?author wdt:[property:genre]/wdt:[property:subclass of]* wd:[entity:science fiction].\n} UNION {\n?author wdt:[property:occupation]/wdt:[property:subclass of]* wd:[entity:science fiction author].\n} UNION {\n?author p:[property:occupation] [\na wikibase:BestRank;\nps:[property:occupation]/wdt:[property:subclass of]* wd:[entity:author];\npq:[property:genre]/wdt:[property:subclass of]* wd:[entity:science fiction]\n].\n}\nOPTIONAL { ?author wdt:[property:date of birth] ?dateOfBirth. }\nOPTIONAL { ?author wdt:[property:date of death] ?dateOfDeath. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "2000",
    "instruction": "List British MPs who have a son- or daughter-in-law also serving as an MP.",
    "query": "SELECT DISTINCT ?item2 ?item2Label ?item1 ?item1Label WHERE {\nVALUES ?mp {wd:Q16707842 wd:Q18015642 wd:Q18018860} .\nVALUES ?mp2 {wd:Q16707842 wd:Q18015642 wd:Q18018860} .\n?item1 wdt:P39 ?mp .\n?item1 wdt:P26 ?spouse .\n?spouse wdt:P22|wdt:P25 ?item2 .\n?item2 wdt:P39 ?mp2 .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY ?item2Label ?item1Label",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item2 ?item2Label ?item1 ?item1Label WHERE {\nVALUES ?mp {wd:[entity:Member of Parliament] wd:[entity:Member of Parliament of Great Britain] wd:[entity:Member of Parliament in the Parliament of England]} .\nVALUES ?mp2 {wd:[entity:Member of Parliament] wd:[entity:Member of Parliament of Great Britain] wd:[entity:Member of Parliament in the Parliament of England]} .\n?item1 wdt:[property:position held] ?mp .\n?item1 wdt:[property:spouse] ?spouse .\n?spouse wdt:[property:father]|wdt:[property:mother] ?item2 .\n?item2 wdt:[property:position held] ?mp2 .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY ?item2Label ?item1Label",
    "complexity": "complex"
  },
  {
    "id": "2513",
    "instruction": "What is the most common day of the month for UK by-elections since 1880?",
    "query": "select (concat(str(?day), \"/\", str(?month)) as ?date) (count(distinct ?ps) as ?count)\nwhere {\n?MP p:P39 ?ps . ?ps ps:P39 ?term . ?term wdt:P279 wd:Q16707842 .\n?ps pq:P2715 ?election .\n?ps pq:P580 ?elected .\n?election wdt:P31* wd:Q7864918 .\nbind(day(?elected) as ?day) . bind(month(?elected) as ?month) .\nfilter(year(?elected) >= 1880) .\n} group by ?day ?month order by desc(?count)",
    "annotated": "PREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nselect (concat(str(?day), \"/\", str(?month)) as ?date) (count(distinct ?ps) as ?count)\nwhere {\n?MP p:[property:position held] ?ps . ?ps ps:[property:position held] ?term . ?term wdt:[property:subclass of] wd:[entity:Member of Parliament] .\n?ps pq:[property:elected in] ?election .\n?ps pq:[property:start time] ?elected .\n?election wdt:[property:instance of]* wd:[entity:UK Parliamentary by-election] .\nbind(day(?elected) as ?day) . bind(month(?elected) as ?month) .\nfilter(year(?elected) >= 1880) .\n} group by ?day ?month order by desc(?count)",
    "complexity": "complex"
  },
  {
    "id": "1076",
    "instruction": "List all Disney animated movies with their narrative locations.",
    "query": "SELECT ?movie ?movieLabel ?narrative_location ?narrative_locationLabel ?coordinates ?company WHERE {\n?movie wdt:P840 ?narrative_location ;\nwdt:P31 wd:Q29168811 ;\nwdt:P272 ?company .\n?company wdt:P127* wd:Q7414 .\n?narrative_location wdt:P625 ?coordinates .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?movie ?movieLabel ?narrative_location ?narrative_locationLabel ?coordinates ?company WHERE {\n?movie wdt:[property:narrative location] ?narrative_location ;\nwdt:[property:instance of] wd:[entity:animated feature film] ;\nwdt:[property:production company] ?company .\n?company wdt:[property:owned by]* wd:[entity:The Walt Disney Company] .\n?narrative_location wdt:[property:coordinate location] ?coordinates .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "2355",
    "instruction": "List the classes used as value constraints for properties.",
    "query": "SELECT ?class ?classLabel (COUNT(*) AS ?count) WHERE {\n?property p:P2302 ?statement.\n?statement ps:P2302 wd:Q21510865;\npq:P2308 ?class ;\npq:P2309 [] .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?class ?classLabel\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?class ?classLabel (COUNT(*) AS ?count) WHERE {\n?property p:[property:property constraint] ?statement.\n?statement ps:[property:property constraint] wd:[entity:value-type constraint];\npq:[property:class] ?class ;\npq:[property:relation] [] .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?class ?classLabel\nORDER BY DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "2365",
    "instruction": "List all local authorities in England that are currently active.",
    "query": "SELECT ?LALabel ?official_website WHERE {\n#find all instances of a non-metropolitan county, district, unitary authority or metropolitan borough council\n{?LA wdt:P31 wd:Q769603.\n}\nUNION {?LA wdt:P31 wd:Q1187580.\n}\nUNION {?LA wdt:P31 wd:Q1136601.\n}\nUNION {?LA wdt:P31 wd:Q19414242.}\n#get all things these are instances of & then get end date for that (i.e. LA is current)\nOPTIONAL {?LA p:P31 ?type.\n?type pq:P582 ?end_date.}\n#get website\nOPTIONAL { ?LA wdt:P856 ?official_website. }\n#deduplicate (assumes LA cannot be isntance of both these things at same time)\nOPTIONAL { ?LA wdt:P31 ?instance_of. }\nFILTER((((?instance_of = wd:Q1187580) || (?instance_of = wd:Q1136601)) || (?instance_of = wd:Q769603)) || (?instance_of = wd:Q19414242))\n#create value ?test_date. If instance statement had an end date use it, if not use today\nBIND(IF(BOUND(?end_date),?end_date,NOW()) AS ?test_date).\n#only show LAs with test date today or in future (this means we will show local authorities that exist but are planned to cease in the future)\nFILTER(?test_date >= NOW()) .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }}\nORDER BY (?LALabel)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?LALabel ?official_website WHERE {\n#find all instances of a non-metropolitan county, district, unitary authority or metropolitan borough council\n{?LA wdt:[property:instance of] wd:[entity:non-metropolitan county].\n}\nUNION {?LA wdt:[property:instance of] wd:[entity:non-metropolitan district].\n}\nUNION {?LA wdt:[property:instance of] wd:[entity:unitary authority area in England].\n}\nUNION {?LA wdt:[property:instance of] wd:[entity:metropolitan borough council].}\n#get all things these are instances of & then get end date for that (i.e. LA is current)\nOPTIONAL {?LA p:[property:instance of] ?type.\n?type pq:[property:end time] ?end_date.}\n#get website\nOPTIONAL { ?LA wdt:[property:official website] ?official_website. }\n#deduplicate (assumes LA cannot be isntance of both these things at same time)\nOPTIONAL { ?LA wdt:[property:instance of] ?instance_of. }\nFILTER((((?instance_of = wd:[entity:non-metropolitan district]) || (?instance_of = wd:[entity:unitary authority area in England])) || (?instance_of = wd:[entity:non-metropolitan county])) || (?instance_of = wd:[entity:metropolitan borough council]))\n#create value ?test_date. If instance statement had an end date use it, if not use today\nBIND(IF(BOUND(?end_date),?end_date,NOW()) AS ?test_date).\n#only show LAs with test date today or in future (this means we will show local authorities that exist but are planned to cease in the future)\nFILTER(?test_date >= NOW()) .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }}\nORDER BY (?LALabel)",
    "complexity": "complex"
  },
  {
    "id": "992",
    "instruction": "List national flags that feature stars or constellations.",
    "query": "SELECT ?flag ?depicted ?flagLabel ?depictedLabel ?image WHERE {\n?flag wdt:P31/wdt:P279* wd:Q186516;\nwdt:P180 ?depicted.\nVALUES ?astronomical { wd:Q8928 wd:Q523 } ?depicted wdt:P31?/wdt:P279* ?astronomical.\nOPTIONAL { ?flag wdt:P18 ?image. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nORDER BY ?flagLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?flag ?depicted ?flagLabel ?depictedLabel ?image WHERE {\n?flag wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:national flag];\nwdt:[property:image]0 ?depicted.\nVALUES ?astronomical { wd:[entity:constellation] wd:[entity:star] } ?depicted wdt:[property:instance of]?/wdt:[property:subclass of]* ?astronomical.\nOPTIONAL { ?flag wdt:[property:image] ?image. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nORDER BY ?flagLabel",
    "complexity": "complex"
  },
  {
    "id": "2811",
    "instruction": "How many sitelinks redirect to other pages on each wiki?",
    "query": "SELECT ?project ?total_redirects ?intentional_redirects ?pct_intentional ?other_redirects ?pct_other\nWHERE {\n{\nSELECT ?project (COUNT(DISTINCT ?intentional_sitelink) AS ?intentional_redirects) (COUNT(DISTINCT ?other_sitelink) AS ?other_redirects) WHERE {\n{\n?intentional_sitelink schema:isPartOf ?project; wikibase:badge wd:Q70894304 .\n} UNION {\n?other_sitelink schema:isPartOf ?project; wikibase:badge wd:Q70893996 .\n}\n} GROUP BY ?project\n}\nBIND (?intentional_redirects + ?other_redirects AS ?total_redirects) .\nBIND ((ROUND(1000.0 * ?intentional_redirects / ?total_redirects) / 10.0) AS ?pct_intentional) .\nBIND ((ROUND(1000.0 * ?other_redirects / ?total_redirects) / 10.0) AS ?pct_other) .\n} ORDER BY DESC(?total_redirects)",
    "annotated": "PREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?project ?total_redirects ?intentional_redirects ?pct_intentional ?other_redirects ?pct_other\nWHERE {\n{\nSELECT ?project (COUNT(DISTINCT ?intentional_sitelink) AS ?intentional_redirects) (COUNT(DISTINCT ?other_sitelink) AS ?other_redirects) WHERE {\n{\n?intentional_sitelink schema:isPartOf ?project; wikibase:badge wd:[entity:intentional sitelink to redirect] .\n} UNION {\n?other_sitelink schema:isPartOf ?project; wikibase:badge wd:[entity:sitelink to redirect] .\n}\n} GROUP BY ?project\n}\nBIND (?intentional_redirects + ?other_redirects AS ?total_redirects) .\nBIND ((ROUND(1000.0 * ?intentional_redirects / ?total_redirects) / 10.0) AS ?pct_intentional) .\nBIND ((ROUND(1000.0 * ?other_redirects / ?total_redirects) / 10.0) AS ?pct_other) .\n} ORDER BY DESC(?total_redirects)",
    "complexity": "complex"
  },
  {
    "id": "1532",
    "instruction": "What properties are most commonly used with 'no value' statements?",
    "query": "SELECT ?property ?propertyLabel ?count WHERE {\n{\nSELECT ?property (COUNT(?statement) AS ?count) WHERE {\n?property a wikibase:Property;\n# wikibase:claim ?p;\nwikibase:novalue ?wdno.\n# ?entity ?p ?statement.\n?statement a ?wdno. # note: if lines 7 and 9 are commented, ?statement may also be an entity with a truthy \"no value\" statement\n}\nGROUP BY ?property\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?property ?propertyLabel ?count WHERE {\n{\nSELECT ?property (COUNT(?statement) AS ?count) WHERE {\n?property a wikibase:Property;\n# wikibase:claim ?p;\nwikibase:novalue ?wdno.\n# ?entity ?p ?statement.\n?statement a ?wdno. # note: if lines 7 and 9 are commented, ?statement may also be an entity with a truthy \"no value\" statement\n}\nGROUP BY ?property\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "432",
    "instruction": "Find items related to OpenStreetMap without a main subject.",
    "query": "SELECT DISTINCT ?item ?itemLabel\nWHERE {\nhint:Query hint:optimizer \"None\".\nSERVICE wikibase:mwapi {\nbd:serviceParam wikibase:api \"Search\";\nwikibase:endpoint \"www.wikidata.org\";\nmwapi:srsearch \"OpenStreetMap haswbstatement:P31=Q13442814\".\n?title wikibase:apiOutput mwapi:title.\n}\nBIND(IRI(CONCAT(STR(wd:), ?title)) AS ?item)\nFILTER NOT EXISTS { ?item wdt:P921 wd:Q936. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX hint: <http://www.bigdata.com/queryHints#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel\nWHERE {\nhint:Query hint:optimizer \"None\".\nSERVICE wikibase:mwapi {\nbd:serviceParam wikibase:api \"Search\";\nwikibase:endpoint \"www.wikidata.org\";\nmwapi:srsearch \"OpenStreetMap haswbstatement:[property:instance of]=Q13442814\".\n?title wikibase:apiOutput mwapi:title.\n}\nBIND(IRI(CONCAT(STR(wd:), ?title)) AS ?item)\nFILTER NOT EXISTS { ?item wdt:[property:main subject] wd:[entity:OpenStreetMap]. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "300",
    "instruction": "List all Astrolabes with missing labels in languages other than English.",
    "query": "SELECT (SUBSTR(STR(?q),32) AS ?wdq) (CONCAT(\"L\",?astrolabe_lang) AS ?lang) ?astrolabe_label WHERE {\n{SELECT ?astrolabe_lang ?astrolabe_label WHERE {\nwd:Q164992 rdfs:label ?astrolabe_label. BIND(lang(?astrolabe_label) AS ?astrolabe_lang)\n}\n}\n?q rdfs:label \"Astrolabe\"@en.\nFILTER(NOT EXISTS {\n?q rdfs:label ?label.\nFILTER(LANG(?label) = ?astrolabe_lang)\n})\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\n\nSELECT (SUBSTR(STR(?q),32) AS ?wdq) (CONCAT(\"L\",?astrolabe_lang) AS ?lang) ?astrolabe_label WHERE {\n{SELECT ?astrolabe_lang ?astrolabe_label WHERE {\nwd:[entity:astrolabe] rdfs:label ?astrolabe_label. BIND(lang(?astrolabe_label) AS ?astrolabe_lang)\n}\n}\n?q rdfs:label \"Astrolabe\"@en.\nFILTER(NOT EXISTS {\n?q rdfs:label ?label.\nFILTER(LANG(?label) = ?astrolabe_lang)\n})\n}",
    "complexity": "complex"
  },
  {
    "id": "2590",
    "instruction": "List the longest nouns in Swedish and German languages from Wikidata.",
    "query": "SELECT DISTINCT ?l ?word ?len WHERE {\n{\n{\n?l rdf:type ontolex:LexicalEntry;\ndct:language wd:Q9027;\nwikibase:lemma ?word.\n}\nUNION\n{\n?l rdf:type ontolex:LexicalEntry;\ndct:language wd:Q188;\nwikibase:lemma ?word.\n}\n}\nBIND(STRLEN(?word) AS ?len)\n?l wikibase:lexicalCategory wd:Q1084.\n}\nORDER BY DESC (?len)\nLIMIT 1000",
    "annotated": "PREFIX dct: <http://purl.org/dc/terms/>\nPREFIX ontolex: <http://www.w3.org/ns/lemon/ontolex#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?l ?word ?len WHERE {\n{\n{\n?l rdf:type ontolex:LexicalEntry;\ndct:language wd:[entity:Swedish];\nwikibase:lemma ?word.\n}\nUNION\n{\n?l rdf:type ontolex:LexicalEntry;\ndct:language wd:[entity:German];\nwikibase:lemma ?word.\n}\n}\nBIND(STRLEN(?word) AS ?len)\n?l wikibase:lexicalCategory wd:[entity:noun].\n}\nORDER BY DESC (?len)\nLIMIT 1000",
    "complexity": "complex"
  },
  {
    "id": "1050",
    "instruction": "List the streets in Paris named after battles.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?battleLabel (YEAR(?time) AS ?year) WHERE {\n?item wdt:P31/wdt:P279* wd:Q294440 ;\nwdt:P131 ?arrondissement ;\nwdt:P138 ?battle .\n?arrondissement wdt:P131 wd:Q90 .\n?battle wdt:P31 wd:Q178561 .\nOPTIONAL { ?battle wdt:P585|wdt:P580 ?time }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\" . }\n} ORDER BY ?year ?battleLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?battleLabel (YEAR(?time) AS ?year) WHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:public space] ;\nwdt:[property:located in the administrative territorial entity] ?arrondissement ;\nwdt:[property:named after] ?battle .\n?arrondissement wdt:[property:located in the administrative territorial entity] wd:[entity:Paris] .\n?battle wdt:[property:instance of] wd:[entity:battle] .\nOPTIONAL { ?battle wdt:[property:point in time]|wdt:[property:start time] ?time }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\" . }\n} ORDER BY ?year ?battleLabel",
    "complexity": "complex"
  },
  {
    "id": "1515",
    "instruction": "List the individuals who received the Time Person of the Year award in two consecutive years.",
    "query": "SELECT ?person ?personLabel WHERE {\n?person wdt:P31 wd:Q5;\np:P166 [\nps:P166 wd:Q207826;\npq:P585 ?pointInTime1\n];\np:P166 [\nps:P166 wd:Q207826;\npq:P585 ?pointInTime2\n].\nFILTER(YEAR(?pointInTime1) = YEAR(?pointInTime2) + 1)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?person ?personLabel WHERE {\n?person wdt:[property:instance of] wd:[entity:human];\np:[property:award received] [\nps:[property:award received] wd:[entity:Time Person of the Year];\npq:[property:point in time] ?pointInTime1\n];\np:[property:award received] [\nps:[property:award received] wd:[entity:Time Person of the Year];\npq:[property:point in time] ?pointInTime2\n].\nFILTER(YEAR(?pointInTime1) = YEAR(?pointInTime2) + 1)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  }
]