[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "637",
    "instruction": "What are the suicide attacks that occurred in different locations?",
    "query": "SELECT ?h ?hLabel ?location (CONCAT(\"injured: \",str(?injured)) as ?injuredl) (concat(\"dead: \",str(?dead)) as ?deadl) ?date ?image\nWHERE\n{\n?h wdt:P31 ?attack.\nvalues (?attack) {\n(wd:Q18493502)\n(wd:Q217327)\n}\nOPTIONAL { ?h wdt:P1339 ?injured . }\nOPTIONAL { ?h wdt:P1120 ?dead. }\nOPTIONAL { ?h wdt:P276?/wdt:P625 ?location }\nOPTIONAL { ?h wdt:P585 ?date }\nOPTIONAL { ?h wdt:P18 ?image }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?h ?hLabel ?location (CONCAT(\"injured: \",str(?injured)) as ?injuredl) (concat(\"dead: \",str(?dead)) as ?deadl) ?date ?image\nWHERE\n{\n?h wdt:[property:instance of] ?attack.\nvalues (?attack) {\n(wd:[entity:suicide bombing])\n(wd:[entity:suicide attack])\n}\nOPTIONAL { ?h wdt:[property:number of injured] ?injured . }\nOPTIONAL { ?h wdt:[property:number of deaths] ?dead. }\nOPTIONAL { ?h wdt:[property:location]?/wdt:[property:coordinate location] ?location }\nOPTIONAL { ?h wdt:[property:point in time] ?date }\nOPTIONAL { ?h wdt:[property:image] ?image }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}",
    "complexity": "medium"
  },
  {
    "id": "1975",
    "instruction": "List all the famous trees around the world.",
    "query": "SELECT ?item ?itemLabel ?geo WHERE {\n?item wdt:P31 wd:Q811534;\nwdt:P625 ?geo .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?geo WHERE {\n?item wdt:[property:instance of] wd:[entity:remarkable tree];\nwdt:[property:coordinate location] ?geo .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "1566",
    "instruction": "List all rivers in Spanish whose names start with 'Guad'.",
    "query": "SELECT ?item ?itemLabel ?countryLabel WHERE {\n?item wdt:P31 wd:Q4022 ;\nrdfs:label ?itemLabel;\nOPTIONAL { ?item wdt:P17 ?country . ?country rdfs:label ?countryLabel . FILTER (lang(?countryLabel) = \"fr\") }\nFILTER (lang(?itemLabel) = \"es\") .\nFILTER regex (?itemLabel, \"^Guad\") .\n}\nORDER BY ?itemLabel ?countryLabel",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?item ?itemLabel ?countryLabel WHERE {\n?item wdt:[property:instance of] wd:[entity:river] ;\nrdfs:label ?itemLabel;\nOPTIONAL { ?item wdt:[property:country] ?country . ?country rdfs:label ?countryLabel . FILTER (lang(?countryLabel) = \"fr\") }\nFILTER (lang(?itemLabel) = \"es\") .\nFILTER regex (?itemLabel, \"^Guad\") .\n}\nORDER BY ?itemLabel ?countryLabel",
    "complexity": "medium"
  },
  {
    "id": "2651",
    "instruction": "Show me a map of the birthplaces of ASM Clermont Auvergne players.",
    "query": "SELECT ?item ?itemLabel ?lieu ?date ?coord ?layer ?img WHERE {\n?item wdt:P54 wd:Q297901 ;\nwdt:P19 ?lieu ;\nwdt:P569 ?date .\n?lieu wdt:P625 ?coord .\nOPTIONAL { ?item wdt:P18 ?img }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\nBIND ( CONCAT(\"Annees \",STR(FLOOR(YEAR(?date)/10)),\"0\") AS ?layer )\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?lieu ?date ?coord ?layer ?img WHERE {\n?item wdt:[property:member of sports team] wd:[entity:ASM Clermont Auvergne] ;\nwdt:[property:place of birth] ?lieu ;\nwdt:[property:date of birth] ?date .\n?lieu wdt:[property:coordinate location] ?coord .\nOPTIONAL { ?item wdt:[property:image] ?img }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\nBIND ( CONCAT(\"Annees \",STR(FLOOR(YEAR(?date)/10)),\"0\") AS ?layer )\n}",
    "complexity": "medium"
  },
  {
    "id": "1950",
    "instruction": "List all items named after enslaved people.",
    "query": "SELECT ?item ?itemLabel ?slave ?slaveLabel (SAMPLE(?image) AS ?image) ?coords WHERE {\n?slave wdt:P3716|wdt:P106 wd:Q12773225.\n?item wdt:P138|wdt:P180|wdt:P547 ?slave .\nOPTIONAL { ?item wdt:P18 ?image. }\nOPTIONAL { ?item wdt:P625 ?coords. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" } .\n}\nGROUP BY ?item ?itemLabel ?slave ?slaveLabel ?coords\nLIMIT 10000",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?slave ?slaveLabel (SAMPLE(?image) AS ?image) ?coords WHERE {\n?slave wdt:[property:social classification]|wdt:[property:occupation] wd:[entity:enslaved person].\n?item wdt:[property:named after]|wdt:[property:image]0|wdt:[property:commemorates] ?slave .\nOPTIONAL { ?item wdt:[property:image] ?image. }\nOPTIONAL { ?item wdt:[property:coordinate location] ?coords. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" } .\n}\nGROUP BY ?item ?itemLabel ?slave ?slaveLabel ?coords\nLIMIT 10000",
    "complexity": "medium"
  },
  {
    "id": "2465",
    "instruction": "List the people depicted in Jacques-Louis David's 1804 painting 'Le Sacre de Napoleon'.",
    "query": "SELECT ?img ?depeint ?depeintLabel ?depeintDescription WHERE {\nwd:Q1231009 wdt:P180 ?depeint .\n?depeint wdt:P31 wd:Q5 ; wdt:P18 ?img\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?img ?depeint ?depeintLabel ?depeintDescription WHERE {\nwd:[entity:The Coronation of Napoleon] wdt:[property:image]0 ?depeint .\n?depeint wdt:[property:instance of] wd:[entity:human] ; wdt:[property:image] ?img\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "242",
    "instruction": "What types of items are in the Ashmolean Museum's collection?",
    "query": "SELECT ?type ?typeLabel (COUNT(?item) AS ?count) WHERE {\n?item wdt:P195 wd:Q636400;\nwdt:P31 ?type.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} GROUP BY ?type ?typeLabel ORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?type ?typeLabel (COUNT(?item) AS ?count) WHERE {\n?item wdt:[property:collection] wd:[entity:Ashmolean Museum];\nwdt:[property:instance of] ?type.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} GROUP BY ?type ?typeLabel ORDER BY DESC(?count)",
    "complexity": "medium"
  },
  {
    "id": "2766",
    "instruction": "List all Twitter usernames with their corresponding Mastodon addresses.",
    "query": "SELECT ?item ?itemLabel ?Mastodon_address ?Twitter_username WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?item wdt:P4033 ?Mastodon_address.\n?item wdt:P2002 ?Twitter_username.\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?Mastodon_address ?Twitter_username WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?item wdt:[property:Mastodon address] ?Mastodon_address.\n?item wdt:[property:Twitter (X) username] ?Twitter_username.\n}",
    "complexity": "medium"
  },
  {
    "id": "787",
    "instruction": "List all natural numbers with their corresponding values.",
    "query": "SELECT ?item ?itemLabel ?value WHERE {\n?item wdt:P31 wd:Q21199 .\nOPTIONAL { ?item wdt:P1181 ?value }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} ORDER BY ?value ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?value WHERE {\n?item wdt:[property:instance of] wd:[entity:natural number] .\nOPTIONAL { ?item wdt:[property:numeric value] ?value }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} ORDER BY ?value ?itemLabel",
    "complexity": "medium"
  },
  {
    "id": "1997",
    "instruction": "List the collections with the most artworks by Pablo Picasso.",
    "query": "SELECT ?collection ?collectionLabel (COUNT(*) AS ?count) WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],es\". }\n?thing wdt:P170 wd:Q5593.\nOPTIONAL { ?thing wdt:P195 ?collection. }\n}\nGROUP BY ?collection ?collectionLabel\nORDER BY DESC (?count)\nLIMIT 300",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?collection ?collectionLabel (COUNT(*) AS ?count) WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],es\". }\n?thing wdt:[property:creator] wd:[entity:Pablo Picasso].\nOPTIONAL { ?thing wdt:[property:collection] ?collection. }\n}\nGROUP BY ?collection ?collectionLabel\nORDER BY DESC (?count)\nLIMIT 300",
    "complexity": "medium"
  },
  {
    "id": "1562",
    "instruction": "List all authors who contributed to the development of writing systems and alphabets.",
    "query": "SELECT DISTINCT ?author ?authorLabel ?image ?date WHERE {\n?author wdt:P279+|wdt:P31/wdt:P279* wd:Q8192 .\n?author wdt:P571 ?date .\nOPTIONAL {?author wdt:P18 ?image . }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en, it, de, es, fr\" }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?author ?authorLabel ?image ?date WHERE {\n?author wdt:[property:subclass of]+|wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:writing system] .\n?author wdt:[property:inception] ?date .\nOPTIONAL {?author wdt:[property:image] ?image . }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en, it, de, es, fr\" }\n}",
    "complexity": "medium"
  },
  {
    "id": "1944",
    "instruction": "List all papers from ESWC 2020 with their corresponding video lectures.",
    "query": "SELECT ?paper ?paperLabel ?video WHERE {\n?paper wdt:P1433 wd:Q95688968 .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\nOPTIONAL {?paper wdt:P973 ?video .}\n} ORDER BY ?paperLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?paper ?paperLabel ?video WHERE {\n?paper wdt:[property:published in] wd:[entity:The Semantic Web: 17th International Conference, ESWC 2020, Heraklion, Crete, Greece, May 31\u2013June 4, 2020, Proceedings] .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\nOPTIONAL {?paper wdt:[property:described at URL] ?video .}\n} ORDER BY ?paperLabel",
    "complexity": "medium"
  },
  {
    "id": "383",
    "instruction": "What is the official Russian name of Saint Petersburg?",
    "query": "SELECT ?value ?startDate ?endDate # ?r\nWHERE\n{\nwd:Q656 p:P1448 ?s.\n?s ps:P1448 ?value.\n?s pq:P580 ?startDate.\n?s pq:P582 ?endDate.\nFILTER(LANG(?value) = \"ru\")\n}",
    "annotated": "PREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\n\nSELECT ?value ?startDate ?endDate # ?r\nWHERE\n{\nwd:[entity:Saint Petersburg] p:[property:official name] ?s.\n?s ps:[property:official name] ?value.\n?s pq:[property:start time] ?startDate.\n?s pq:[property:end time] ?endDate.\nFILTER(LANG(?value) = \"ru\")\n}",
    "complexity": "medium"
  },
  {
    "id": "1396",
    "instruction": "List the female directors who have won the Palme d'Or award.",
    "query": "SELECT ?directorLabel ?filmLabel (YEAR(?date) AS ?year) WHERE {\n?film wdt:P31 wd:Q11424 ;\nwdt:P57 ?director ;\np:P166 ?statement.\n?statement ps:P166 wd:Q179808 ;\npq:P585 ?date .\n?director wdt:P21 wd:Q6581072 .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?directorLabel ?filmLabel (YEAR(?date) AS ?year) WHERE {\n?film wdt:[property:instance of] wd:[entity:film] ;\nwdt:[property:director] ?director ;\np:[property:award received] ?statement.\n?statement ps:[property:award received] wd:[entity:Palme d'Or] ;\npq:[property:point in time] ?date .\n?director wdt:[property:sex or gender] wd:[entity:female] .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n}",
    "complexity": "medium"
  },
  {
    "id": "2232",
    "instruction": "List all deceased individuals with verified Twitter accounts.",
    "query": "SELECT ?humanLabel ?handle ?death ?statement WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?human wdt:P31 wd:Q5. # all people\n?human wdt:P570 ?death. # who have a death date\n?human wdt:P2002 ?handle. # and a twitter account\n?human p:P2002 ?statement.\n?statement pq:P1552 wd:Q28378282. # which is accessible\n}\nLIMIT 10000",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?humanLabel ?handle ?death ?statement WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?human wdt:[property:instance of] wd:[entity:human]. # all people\n?human wdt:[property:date of death] ?death. # who have a death date\n?human wdt:[property:Twitter (X) username] ?handle. # and a twitter account\n?human p:[property:Twitter (X) username] ?statement.\n?statement pq:[property:has characteristic] wd:[entity:verified account or profile]. # which is accessible\n}\nLIMIT 10000",
    "complexity": "medium"
  },
  {
    "id": "334",
    "instruction": "List the recipients of letters addressed to EE entities.",
    "query": "SELECT ?recipient ?recipientLabel ?letter ?letterLabel ?ws\nWHERE {\n?letter wdt:P1817 ?recipient.\n?recipient wdt:P3429 []\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\nOPTIONAL {?ws schema:about ?letter; schema:isPartOf <https://en.wikisource.org/> }\n} ORDER BY ?recipientLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?recipient ?recipientLabel ?letter ?letterLabel ?ws\nWHERE {\n?letter wdt:[property:addressee] ?recipient.\n?recipient wdt:[property:Electronic Enlightenment ID] []\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\nOPTIONAL {?ws schema:about ?letter; schema:isPartOf <https://en.wikisource.org/> }\n} ORDER BY ?recipientLabel",
    "complexity": "medium"
  },
  {
    "id": "852",
    "instruction": "List the birthplaces of astronauts along with their images.",
    "query": "SELECT ?astronaut ?astronautLabel ?image ?birthdate ?birthplace ?coord WHERE {\n?astronaut ?x1 wd:Q11631;\nwdt:P18 ?image;\nwdt:P569 ?birthdate;\nwdt:P19 ?birthplace.\n?birthplace wdt:P625 ?coord\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nORDER BY DESC(?birthdate)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?astronaut ?astronautLabel ?image ?birthdate ?birthplace ?coord WHERE {\n?astronaut ?x1 wd:[entity:astronaut];\nwdt:[property:image] ?image;\nwdt:[property:date of birth] ?birthdate;\nwdt:[property:place of birth] ?birthplace.\n?birthplace wdt:[property:coordinate location] ?coord\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nORDER BY DESC(?birthdate)",
    "complexity": "medium"
  },
  {
    "id": "2063",
    "instruction": "List the occupations of people who died from COVID-19, ranked by frequency.",
    "query": "SELECT ?occupationLabel (COUNT (*) AS ?count) WHERE {\n?person wdt:P31 wd:Q5 .\n?person wdt:P509 wd:Q84263196 .\n?person wdt:P106 ?occupation .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGroup BY ?occupationLabel\nORDER BY desc( ?count)\nLIMIT 100",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?occupationLabel (COUNT (*) AS ?count) WHERE {\n?person wdt:[property:instance of] wd:[entity:human] .\n?person wdt:[property:cause of death] wd:[entity:COVID-19] .\n?person wdt:[property:occupation] ?occupation .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGroup BY ?occupationLabel\nORDER BY desc( ?count)\nLIMIT 100",
    "complexity": "medium"
  },
  {
    "id": "1292",
    "instruction": "List all the famous bryologists along with their birth dates.",
    "query": "SELECT distinct ?event ?eventLabel ?date ?location ?image WHERE {\n?event wdt:P106 wd:Q16334507 ;\nwdt:P569 ?date .\nOPTIONAL {?event wdt:P18 ?image .}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en, fr, de, it, es\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT distinct ?event ?eventLabel ?date ?location ?image WHERE {\n?event wdt:[property:occupation] wd:[entity:bryologist] ;\nwdt:[property:date of birth] ?date .\nOPTIONAL {?event wdt:[property:image] ?image .}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en, fr, de, it, es\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "666",
    "instruction": "List the birthplaces of famous German poets.",
    "query": "SELECT ?subj ?subjLabel ?place ?placeLabel ?coord ?birthyear\nWHERE {\n?subj wdt:P106 wd:Q49757 .\n?subj wdt:P19 ?place .\n?place wdt:P17 wd:Q183 .\n?place wdt:P625 ?coord .\nOPTIONAL { ?subj wdt:P569 ?dob }\nBIND(YEAR(?dob) as ?birthyear)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?subj ?subjLabel ?place ?placeLabel ?coord ?birthyear\nWHERE {\n?subj wdt:[property:occupation] wd:[entity:poet] .\n?subj wdt:[property:place of birth] ?place .\n?place wdt:[property:country] wd:[entity:Germany] .\n?place wdt:[property:coordinate location] ?coord .\nOPTIONAL { ?subj wdt:[property:date of birth] ?dob }\nBIND(YEAR(?dob) as ?birthyear)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}",
    "complexity": "medium"
  },
  {
    "id": "2749",
    "instruction": "List all UK chancellors along with their tenure duration.",
    "query": "SELECT ?chancellorLabel ?chancellor ?start_time ?end_time ?days_in_office ?replacesLabel ?replacedbyLabel WHERE {\n?chancellor p:P39 ?term.\n?term ps:P39 wd:Q531471 .\nOPTIONAL { ?term pq:P580 ?start_time. }\nOPTIONAL { ?term pq:P582 ?end_time. }\nOPTIONAL { ?term pq:P1365 ?replaces. }\nOPTIONAL { ?term pq:P1366 ?replacedby. }\nBIND(FLOOR((?end_time - ?start_time)) AS ?days_in_office).\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\".\n}\n}\nORDER BY ?days_in_office",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?chancellorLabel ?chancellor ?start_time ?end_time ?days_in_office ?replacesLabel ?replacedbyLabel WHERE {\n?chancellor p:[property:position held] ?term.\n?term ps:[property:position held] wd:[entity:Chancellor of the Exchequer] .\nOPTIONAL { ?term pq:[property:start time] ?start_time. }\nOPTIONAL { ?term pq:[property:end time] ?end_time. }\nOPTIONAL { ?term pq:[property:replaces] ?replaces. }\nOPTIONAL { ?term pq:[property:replaced by] ?replacedby. }\nBIND(FLOOR((?end_time - ?start_time)) AS ?days_in_office).\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\".\n}\n}\nORDER BY ?days_in_office",
    "complexity": "medium"
  },
  {
    "id": "1303",
    "instruction": "List the birthplaces of people who have won Academy Awards.",
    "query": "SELECT DISTINCT ?personLabel ?koord WHERE {\n?person wdt:P166/wdt:P31* wd:Q19020 .\n?person wdt:P19 ?jaiolekua.\n?jaiolekua wdt:P625 ?koord.\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?personLabel ?koord WHERE {\n?person wdt:[property:award received]/wdt:[property:instance of]* wd:[entity:Academy Awards] .\n?person wdt:[property:place of birth] ?jaiolekua.\n?jaiolekua wdt:[property:coordinate location] ?koord.\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n}",
    "complexity": "medium"
  },
  {
    "id": "1095",
    "instruction": "Find the names of female Members of Parliament in the UK who have parents or grandparents that were also MPs.",
    "query": "SELECT ?mpLabel ?ancestorLabel\nWHERE {\n?mp wdt:P39 wd:Q16707842 ; #subject is/was a UK MP\nwdt:P21 wd:Q6581072 ; #subject is female\n(wdt:P25|wdt:P22)+ ?ancestor . #find subject's ancestors\n?ancestor wdt:P39 wd:Q16707842 . #ancestor was/is a UK MP\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?mpLabel ?ancestorLabel\nWHERE {\n?mp wdt:[property:position held] wd:[entity:Member of Parliament] ; #subject is/was a UK MP\nwdt:[property:sex or gender] wd:[entity:female] ; #subject is female\n(wdt:[property:mother]|wdt:[property:father])+ ?ancestor . #find subject's ancestors\n?ancestor wdt:[property:position held] wd:[entity:Member of Parliament] . #ancestor was/is a UK MP\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}",
    "complexity": "medium"
  },
  {
    "id": "800",
    "instruction": "List all the places where Pablo Picasso's artworks are located.",
    "query": "SELECT ?label ?coord ?subj WHERE {\n?subj wdt:P170 wd:Q5593 .\nOPTIONAL {?subj wdt:P276 ?loc .\n?loc wdt:P625 ?coord } .\n?subj rdfs:label ?label filter (lang(?label) = \"en\")\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?label ?coord ?subj WHERE {\n?subj wdt:[property:creator] wd:[entity:Pablo Picasso] .\nOPTIONAL {?subj wdt:[property:location] ?loc .\n?loc wdt:[property:coordinate location] ?coord } .\n?subj rdfs:label ?label filter (lang(?label) = \"en\")\n}",
    "complexity": "medium"
  },
  {
    "id": "2341",
    "instruction": "List public organizations that provide online platforms for citizen's initiatives.",
    "query": "SELECT ?org ?orgLabel ?url (SAMPLE(?coord) as ?coord) ?layer WHERE {\n?org wdt:P9732 ?url .\n?org wdt:P17 ?layer .\n?org wdt:P276?/wdt:P625 ?coord .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nGROUP BY ?org ?orgLabel ?layer ?url",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?org ?orgLabel ?url (SAMPLE(?coord) as ?coord) ?layer WHERE {\n?org wdt:[property:citizen's initiatives URL] ?url .\n?org wdt:[property:country] ?layer .\n?org wdt:[property:location]?/wdt:[property:coordinate location] ?coord .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nGROUP BY ?org ?orgLabel ?layer ?url",
    "complexity": "medium"
  },
  {
    "id": "861",
    "instruction": "List all breweries in Germany along with their coordinates.",
    "query": "select ?breweryLabel ?breweryDescription ?coord WHERE {\n?brewery wdt:P31/wdt:P279* wd:Q131734 ;\nwdt:P17 wd:Q183 ;\nwdt:P625 ?coord .\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en, de\" .\n}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nselect ?breweryLabel ?breweryDescription ?coord WHERE {\n?brewery wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:brewery] ;\nwdt:[property:country] wd:[entity:Germany] ;\nwdt:[property:coordinate location] ?coord .\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en, de\" .\n}\n}",
    "complexity": "medium"
  },
  {
    "id": "1741",
    "instruction": "List all waterfalls that do not have a drainage basin.",
    "query": "SELECT ?waterfall ?waterfallLabel ?coord WHERE {\n?waterfall wdt:P31 wd:Q34038;\nwdt:P625 ?coord.\nMINUS { ?waterfall wdt:P4614 ?range. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?waterfall ?waterfallLabel ?coord WHERE {\n?waterfall wdt:[property:instance of] wd:[entity:waterfall];\nwdt:[property:coordinate location] ?coord.\nMINUS { ?waterfall wdt:[property:drainage basin] ?range. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "284",
    "instruction": "List all paintings without English labels but with a Commons Category.",
    "query": "SELECT ?item ?category WHERE {\n?item wdt:P31 wd:Q3305213; wdt:P373 ?category\nMINUS{ ?item rdfs:label ?itemLabel FILTER (lang(?itemLabel)=\"en\") }\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?item ?category WHERE {\n?item wdt:[property:instance of] wd:[entity:painting]; wdt:[property:Commons category] ?category\nMINUS{ ?item rdfs:label ?itemLabel FILTER (lang(?itemLabel)=\"en\") }\n}",
    "complexity": "medium"
  },
  {
    "id": "2210",
    "instruction": "List all research papers published in The Weta entomology journal.",
    "query": "SELECT ?scholarly_article ?title WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?scholarly_article wdt:P31 wd:Q13442814;\nwdt:P1433 wd:Q21385466.\nOPTIONAL { }\nOPTIONAL { ?scholarly_article wdt:P1476 ?title. }\n}\nLIMIT 1000",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?scholarly_article ?title WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?scholarly_article wdt:[property:instance of] wd:[entity:scholarly article];\nwdt:[property:published in] wd:[entity:The W\u0113t\u0101].\nOPTIONAL { }\nOPTIONAL { ?scholarly_article wdt:[property:title] ?title. }\n}\nLIMIT 1000",
    "complexity": "medium"
  },
  {
    "id": "2679",
    "instruction": "Show me a map of New Zealand graduates with their employer's coordinates.",
    "query": "SELECT DISTINCT ?person ?personLabel ?coord WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE]\". }\n{\nSELECT DISTINCT ?person WHERE {\n?person wdt:P5008 wd:Q111645234.\n}\n}\nOPTIONAL {?person wdt:P108/wdt:P625 ?coord. }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?person ?personLabel ?coord WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE]\". }\n{\nSELECT DISTINCT ?person WHERE {\n?person wdt:[property:on focus list of Wikimedia project] wd:[entity:NZThesisProject].\n}\n}\nOPTIONAL {?person wdt:[property:employer]/wdt:[property:coordinate location] ?coord. }\n}",
    "complexity": "medium"
  },
  {
    "id": "927",
    "instruction": "List authors born in Edinburgh and their famous books.",
    "query": "select ?writer ?writerLabel ?work ?workLabel\nwhere {\n?writer wdt:P19 wd:Q23436 .\n?writer wdt:P106 wd:Q36180 .\nOPTIONAL{?writer wdt:P800 ?work }.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nselect ?writer ?writerLabel ?work ?workLabel\nwhere {\n?writer wdt:[property:place of birth] wd:[entity:Edinburgh] .\n?writer wdt:[property:occupation] wd:[entity:writer] .\nOPTIONAL{?writer wdt:[property:notable work] ?work }.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}",
    "complexity": "medium"
  }
]