[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "2067",
    "instruction": "How many Harvard Law graduates died between 1850 and 1900?",
    "query": "SELECT ?year (COUNT(?person) as ?count)\nWHERE\n{\n?person wdt:P31 wd:Q5;\nwdt:P69 wd:Q49122;\np:P570/psv:P570 [\nwikibase:timeValue ?date ;\n] .\nBIND(STR(YEAR(?date)) as ?year).\nfilter (?date > \"1850-01-01\"^^xsd:dateTime && ?date < \"1950-01-01\"^^xsd:dateTime)\n}\nGROUP BY ?year",
    "annotated": "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?year (COUNT(?person) as ?count)\nWHERE\n{\n?person wdt:[property:instance of] wd:[entity:human];\nwdt:[property:educated at] wd:[entity:Harvard Law School];\np:[property:date of death]/psv:[property:date of death] [\nwikibase:timeValue ?date ;\n] .\nBIND(STR(YEAR(?date)) as ?year).\nfilter (?date > \"1850-01-01\"^^xsd:dateTime && ?date < \"1950-01-01\"^^xsd:dateTime)\n}\nGROUP BY ?year",
    "complexity": "medium"
  },
  {
    "id": "2720",
    "instruction": "Show me a map of ancient Roman theaters and amphitheaters.",
    "query": "SELECT ?theatreLabel ?coords\nWHERE {\n{?theatre wdt:P31/wdt:P279* wd:Q7362268 . }\nUNION\n{?theatre wdt:P31/wdt:P279* wd:Q19757 . }\n?theatre wdt:P625 ?coords .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"de\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?theatreLabel ?coords\nWHERE {\n{?theatre wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:Roman amphitheatre] . }\nUNION\n{?theatre wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:Roman theatre] . }\n?theatre wdt:[property:coordinate location] ?coords .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"de\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "1352",
    "instruction": "List all Roman amphitheatres on Wikidata, grouped by country.",
    "query": "SELECT ?item ?itemLabel ?countryLabel ?RomanPlaceLabel ?placeLabel ?image ?coords WHERE {\n?item wdt:P31 wd:Q7362268 ;\nwdt:P17 ?country .\nOPTIONAL { ?item wdt:P18 ?image }\nOPTIONAL { ?item wdt:P131 ?place }\nOPTIONAL { ?item wdt:P373 ?RomanPlace }\nOPTIONAL { ?item wdt:P625 ?coords }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} ORDER BY ?countryLabel ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?countryLabel ?RomanPlaceLabel ?placeLabel ?image ?coords WHERE {\n?item wdt:[property:instance of] wd:[entity:Roman amphitheatre] ;\nwdt:[property:country] ?country .\nOPTIONAL { ?item wdt:[property:image] ?image }\nOPTIONAL { ?item wdt:[property:located in the administrative territorial entity] ?place }\nOPTIONAL { ?item wdt:[property:Commons category] ?RomanPlace }\nOPTIONAL { ?item wdt:[property:coordinate location] ?coords }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} ORDER BY ?countryLabel ?itemLabel",
    "complexity": "medium"
  },
  {
    "id": "1128",
    "instruction": "What are the most popular painting titles in English?",
    "query": "SELECT ?itemLabel (COUNT(?item) as ?count) WHERE {\n?item wdt:P31 wd:Q3305213 .\n?item rdfs:label ?itemLabel .\nFILTER (lang(?itemLabel)=\"en\")\n} GROUP BY ?itemLabel\nORDER BY DESC(?count)",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?itemLabel (COUNT(?item) as ?count) WHERE {\n?item wdt:[property:instance of] wd:[entity:painting] .\n?item rdfs:label ?itemLabel .\nFILTER (lang(?itemLabel)=\"en\")\n} GROUP BY ?itemLabel\nORDER BY DESC(?count)",
    "complexity": "medium"
  },
  {
    "id": "2670",
    "instruction": "List all rugby union players with more than one Wikipedia page.",
    "query": "SELECT ?item ?itemLabel ?nb WHERE {\n?item wdt:P106 wd:Q14089670 ;\nwikibase:sitelinks ?nb .\nFILTER ( ?nb > 1 )\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?nb WHERE {\n?item wdt:[property:occupation] wd:[entity:rugby union player] ;\nwikibase:sitelinks ?nb .\nFILTER ( ?nb > 1 )\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "2764",
    "instruction": "List the filmi music composers with their composition count.",
    "query": "SELECT ?composerLabel (COUNT(?item) as ?count) WHERE {\n?item wdt:P31 wd:Q105543609 .\n?item wdt:P136 wd:Q544440 .\n?item wdt:P86 ?composer .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}\nGROUP BY ?composerLabel\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?composerLabel (COUNT(?item) as ?count) WHERE {\n?item wdt:[property:instance of] wd:[entity:musical work/composition] .\n?item wdt:[property:genre] wd:[entity:filmi music] .\n?item wdt:[property:composer] ?composer .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}\nGROUP BY ?composerLabel\nORDER BY DESC(?count)",
    "complexity": "medium"
  },
  {
    "id": "1054",
    "instruction": "List all paintings of the Eiffel Tower created by Robert Delaunay.",
    "query": "SELECT ?item ?itemLabel ?collectionLabel ?image WHERE {\n?item wdt:P170 wd:Q33978 ;\nwdt:P180 wd:Q243 .\nOPTIONAL { ?item wdt:P195 ?collection . }\nOPTIONAL { ?item wdt:P18 ?image }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} ORDER BY ?collectionLabel ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?collectionLabel ?image WHERE {\n?item wdt:[property:creator] wd:[entity:Robert Delaunay] ;\nwdt:[property:image]0 wd:[entity:Eiffel Tower] .\nOPTIONAL { ?item wdt:[property:collection] ?collection . }\nOPTIONAL { ?item wdt:[property:image] ?image }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} ORDER BY ?collectionLabel ?itemLabel",
    "complexity": "medium"
  },
  {
    "id": "1672",
    "instruction": "List all Swedish words with usage examples but no sense definitions.",
    "query": "SELECT ?l ?lemma ?example WHERE {\n?l a ontolex:LexicalEntry ; dct:language ?language ;\nwikibase:lemma ?lemma .\n?language wdt:P218 'sv'.\n?l wdt:P5831 ?example.\nFILTER NOT EXISTS {?l ontolex:sense ?sense }\n}\nORDER BY ?lemma",
    "annotated": "PREFIX dct: <http://purl.org/dc/terms/>\nPREFIX ontolex: <http://www.w3.org/ns/lemon/ontolex#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?l ?lemma ?example WHERE {\n?l a ontolex:LexicalEntry ; dct:language ?language ;\nwikibase:lemma ?lemma .\n?language wdt:[property:ISO 639-1 code] 'sv'.\n?l wdt:[property:usage example] ?example.\nFILTER NOT EXISTS {?l ontolex:sense ?sense }\n}\nORDER BY ?lemma",
    "complexity": "medium"
  },
  {
    "id": "1079",
    "instruction": "List all movie theaters in Berlin.",
    "query": "SELECT ?ct ?item ?itemLabel ?itemDescription ?bezirkLabel ?ortsteilLabel ?addressLabel ?image WHERE {\n?item wdt:P131+ wd:Q64.\n?item wdt:P31 wd:Q41253.\n?item wdt:P18 ?image .\nOPTIONAL { ?item wdt:P4129 ?ct. }\nOPTIONAL { ?item wdt:P131 ?bezirk . }\nOPTIONAL { ?item wdt:P276 ?ortsteil . }\nOPTIONAL { ?item wdt:P969 ?address . }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"de,de\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?ct ?item ?itemLabel ?itemDescription ?bezirkLabel ?ortsteilLabel ?addressLabel ?image WHERE {\n?item wdt:[property:located in the administrative territorial entity]+ wd:[entity:Berlin].\n?item wdt:[property:instance of] wd:[entity:movie theater].\n?item wdt:[property:image] ?image .\nOPTIONAL { ?item wdt:[property:Cinema Treasures ID] ?ct. }\nOPTIONAL { ?item wdt:[property:located in the administrative territorial entity] ?bezirk . }\nOPTIONAL { ?item wdt:[property:location] ?ortsteil . }\nOPTIONAL { ?item wdt:[property:P969] ?address . }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"de,de\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "1178",
    "instruction": "What are the key discoveries made in our Solar System?",
    "query": "select DISTINCT ?sLabel ?s ?legendLabel ?date ?image WHERE {\n?s wdt:P361|wdt:P397/wdt:P361 wd:Q544 . #Solar System }\n?s wdt:P575 ?date ; #discovery\nwdt:P18 ?image .\n?s p:P18 ?imgstatement .\nOPTIONAL {?imgstatement pq:P642 ?legend .}\nSERVICE wikibase:label\n{ bd:serviceParam wikibase:language \"en, fr, de, it\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nselect DISTINCT ?sLabel ?s ?legendLabel ?date ?image WHERE {\n?s wdt:[property:part of]|wdt:[property:parent astronomical body]/wdt:[property:part of] wd:[entity:Solar System] . #Solar System }\n?s wdt:[property:time of discovery or invention] ?date ; #discovery\nwdt:[property:image] ?image .\n?s p:[property:image] ?imgstatement .\nOPTIONAL {?imgstatement pq:[property:of] ?legend .}\nSERVICE wikibase:label\n{ bd:serviceParam wikibase:language \"en, fr, de, it\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "603",
    "instruction": "What are the different types of computer file formats?",
    "query": "SELECT DISTINCT ?idExtension ?extension ?mediaType ?idExtensionLabel\nWHERE\n{\n?idExtension wdt:P31 wd:Q235557\n; wdt:P1195 ?extension .\nOPTIONAL { ?idExtension wdt:P1163 ?mediaType }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}\nORDER BY ?extension ?mediaType",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?idExtension ?extension ?mediaType ?idExtensionLabel\nWHERE\n{\n?idExtension wdt:[property:instance of] wd:[entity:file format]\n; wdt:[property:file extension] ?extension .\nOPTIONAL { ?idExtension wdt:[property:media type] ?mediaType }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}\nORDER BY ?extension ?mediaType",
    "complexity": "medium"
  },
  {
    "id": "2687",
    "instruction": "How many items in Wikidata have a certain number of statements?",
    "query": "SELECT ?statements (count(*) as ?countz)\nWHERE\n{\n?item wikibase:statements ?statements\n} group by ?statements order by desc(?countz)",
    "annotated": "PREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?statements (count(*) as ?countz)\nWHERE\n{\n?item wikibase:statements ?statements\n} group by ?statements order by desc(?countz)",
    "complexity": "medium"
  },
  {
    "id": "2224",
    "instruction": "Show me a map of plantations in Surinam that no longer exist.",
    "query": "select distinct ?item ?itemLabel (sample(?image) as ?imageFile) ?coord where {\n?item wdt:P31 wd:Q188913;\nwdt:P17 wd:Q7646305;\nwdt:P625 ?coord.\noptional { ?item wdt:P18 ?image. }\nservice wikibase:label { bd:serviceParam wikibase:language \"en,nl\". }\n} group by ?item ?itemLabel ?image ?coord",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nselect distinct ?item ?itemLabel (sample(?image) as ?imageFile) ?coord where {\n?item wdt:[property:instance of] wd:[entity:plantation];\nwdt:[property:country] wd:[entity:Surinam];\nwdt:[property:coordinate location] ?coord.\noptional { ?item wdt:[property:image] ?image. }\nservice wikibase:label { bd:serviceParam wikibase:language \"en,nl\". }\n} group by ?item ?itemLabel ?image ?coord",
    "complexity": "medium"
  },
  {
    "id": "1859",
    "instruction": "List all countries that do not have the letter 'a' in their names.",
    "query": "SELECT ?country ?countryLabel WHERE {\n?country wdt:P31 wd:Q3624078 . # sovereign state\n?country rdfs:label ?countryLabel .\nfilter(!regex(?countryLabel, 'a')) .\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?country ?countryLabel WHERE {\n?country wdt:[property:instance of] wd:[entity:sovereign state] . # sovereign state\n?country rdfs:label ?countryLabel .\nfilter(!regex(?countryLabel, 'a')) .\n}",
    "complexity": "medium"
  },
  {
    "id": "1504",
    "instruction": "What are the different levels of education in France?",
    "query": "SELECT ?level ?levelLabel ?partOfLabel ?same ?sameLabel\nWHERE {\n?level p:P31 [ rdf:type wikibase:BestRank ; ps:P31 wd:Q42606026 ; pq:P1545 ?order ] . # niveau de scolarite\n?level wdt:P17 wd:Q142 . # France\n?level wdt:P361 ?partOf .\nOPTIONAL { ?level wdt:P460 ?same . ?same wdt:P17 wd:Q30 . } . # equivalent USA\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr,en\" . }\n}\nORDER BY xsd:integer(?order)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?level ?levelLabel ?partOfLabel ?same ?sameLabel\nWHERE {\n?level p:[property:instance of] [ rdf:type wikibase:BestRank ; ps:[property:instance of] wd:[entity:level of education in France] ; pq:[property:series ordinal] ?order ] . # niveau de scolarite\n?level wdt:[property:country] wd:[entity:France] . # France\n?level wdt:[property:part of] ?partOf .\nOPTIONAL { ?level wdt:[property:said to be the same as] ?same . ?same wdt:[property:country] wd:[entity:United States of America] . } . # equivalent USA\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr,en\" . }\n}\nORDER BY xsd:integer(?order)",
    "complexity": "medium"
  },
  {
    "id": "939",
    "instruction": "List all free softwares with their corresponding licenses.",
    "query": "SELECT DISTINCT ?Soft ?SoftLabel ?LicenceLabel WHERE {\n?Soft (wdt:P31/wdt:P279*) wd:Q341.\n?Soft wdt:P275 ?Licence.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?Soft ?SoftLabel ?LicenceLabel WHERE {\n?Soft (wdt:[property:instance of]/wdt:[property:subclass of]*) wd:[entity:free software].\n?Soft wdt:[property:copyright license] ?Licence.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "779",
    "instruction": "List all xkcd comics in order of their issue number.",
    "query": "SELECT DISTINCT ?episode ?episodeLabel ?number WHERE {\n?episode wdt:P31 wd:Q838795 .\n?episode wdt:P361 wd:Q13915 .\n?episode wdt:P433 ?number .\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n} ORDER BY xsd:integer(?number)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?episode ?episodeLabel ?number WHERE {\n?episode wdt:[property:instance of] wd:[entity:comic strip] .\n?episode wdt:[property:part of] wd:[entity:xkcd] .\n?episode wdt:[property:issue] ?number .\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n} ORDER BY xsd:integer(?number)",
    "complexity": "medium"
  },
  {
    "id": "624",
    "instruction": "How many statements are associated with each DOI?",
    "query": "SELECT ?doi (COUNT (?entry) as ?entries)\n{\n?entry ?p ?statement .\n?statement prov:wasDerivedFrom/pr:P248/wdt:P356 ?doi .\n}\nGROUP BY ?doi\nORDER BY DESC(?entries)",
    "annotated": "PREFIX prov: <http://www.w3.org/ns/prov#>\nPREFIX pr: <http://www.wikidata.org/prop/reference/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?doi (COUNT (?entry) as ?entries)\n{\n?entry ?p ?statement .\n?statement prov:wasDerivedFrom/pr:[property:stated in]/wdt:[property:DOI] ?doi .\n}\nGROUP BY ?doi\nORDER BY DESC(?entries)",
    "complexity": "medium"
  },
  {
    "id": "380",
    "instruction": "What humans were born in 2015?",
    "query": "SELECT ?person ?personLabel ?dob\nWHERE\n{\n?person wdt:P31 wd:Q5;\nwdt:P569 ?dob.\nFILTER(\"2015-01-01\"^^xsd:dateTime <= ?dob && ?dob < \"2016-01-01\"^^xsd:dateTime)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?person ?personLabel ?dob\nWHERE\n{\n?person wdt:[property:instance of] wd:[entity:human];\nwdt:[property:date of birth] ?dob.\nFILTER(\"2015-01-01\"^^xsd:dateTime <= ?dob && ?dob < \"2016-01-01\"^^xsd:dateTime)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "1003",
    "instruction": "Find streets in Paris named after doctors.",
    "query": "SELECT DISTINCT ?voie ?voieLabel ?photo ?coord WHERE {\n?voie (wdt:P31/wdt:P279*) wd:Q83620.\n?voie wdt:P131 ?arrdt.\n?arrdt wdt:P31 wd:Q702842.\n?arrdt wdt:P131 wd:Q90.\n?voie wdt:P138 ?odonyme.\n?odonyme (wdt:P106/wdt:P279*) wd:Q39631.\n?voie wdt:P625 ?coord.\nOPTIONAL { ?odonyme wdt:P18 ?photo. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?voie ?voieLabel ?photo ?coord WHERE {\n?voie (wdt:[property:instance of]/wdt:[property:subclass of]*) wd:[entity:thoroughfare].\n?voie wdt:[property:located in the administrative territorial entity] ?arrdt.\n?arrdt wdt:[property:instance of] wd:[entity:municipal arrondissement].\n?arrdt wdt:[property:located in the administrative territorial entity] wd:[entity:Paris].\n?voie wdt:[property:named after] ?odonyme.\n?odonyme (wdt:[property:occupation]/wdt:[property:subclass of]*) wd:[entity:physician].\n?voie wdt:[property:coordinate location] ?coord.\nOPTIONAL { ?odonyme wdt:[property:image] ?photo. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "1876",
    "instruction": "List all physical quantities with their defining formulas.",
    "query": "select\n?quantity\n(sample(?label) as ?label)\n(sample(?desc) as ?desc)\n(sample(?symbol) as ?symbol)\n?formula\n(\nstrdt(\nconcat(\n\"<math><mtable columnalign=left>\",\ngroup_concat(?symbolAndLabel),\n\"</mtable></math>\"\n),\n<http://www.w3.org/1998/Math/MathML>\n) as ?otherSymbols\n)\nwhere {\n?quantity wdt:P279+ wd:Q71550118 .\noptional { ?quantity rdfs:label ?label . filter (lang(?label) = \"en\") }\noptional { ?quantity schema:description ?desc . filter (lang(?desc) = \"en\") }\n?quantity wdt:P2534 ?formula .\n?quantity wdt:P7235 ?symbol .\n{\nselect distinct * where {\n?quantity p:P4934 [ pq:P7235 ?otherSymbol ; ps:P4934 / rdfs:label ?otherLabel ] .\nfilter (lang(?otherLabel) = \"en\")\nbind (\nconcat(\n\"<mrow>\",\nstr(?otherSymbol), \"<mtext>\", \": \", ?otherLabel, \"</mtext>\",\n\"</mrow>\"\n) as ?symbolAndLabel\n)\n}\n}\n}\ngroup by ?quantity ?formula\nlimit 500",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nselect\n?quantity\n(sample(?label) as ?label)\n(sample(?desc) as ?desc)\n(sample(?symbol) as ?symbol)\n?formula\n(\nstrdt(\nconcat(\n\"<math><mtable columnalign=left>\",\ngroup_concat(?symbolAndLabel),\n\"</mtable></math>\"\n),\n<http://www.w3.org/1998/Math/MathML>\n) as ?otherSymbols\n)\nwhere {\n?quantity wdt:[property:subclass of]+ wd:[entity:individual quantity] .\noptional { ?quantity rdfs:label ?label . filter (lang(?label) = \"en\") }\noptional { ?quantity schema:description ?desc . filter (lang(?desc) = \"en\") }\n?quantity wdt:[property:defining formula] ?formula .\n?quantity wdt:[property:in defining formula] ?symbol .\n{\nselect distinct * where {\n?quantity p:[property:calculated from] [ pq:[property:in defining formula] ?otherSymbol ; ps:[property:calculated from] / rdfs:label ?otherLabel ] .\nfilter (lang(?otherLabel) = \"en\")\nbind (\nconcat(\n\"<mrow>\",\nstr(?otherSymbol), \"<mtext>\", \": \", ?otherLabel, \"</mtext>\",\n\"</mrow>\"\n) as ?symbolAndLabel\n)\n}\n}\n}\ngroup by ?quantity ?formula\nlimit 500",
    "complexity": "complex"
  },
  {
    "id": "2046",
    "instruction": "List items that are named after other items in a chain of six.",
    "query": "SELECT ?item1 ?item1Label ?item2Label ?item3Label ?item4Label ?item5Label ?item6Label WHERE {\n?item1 wdt:P138 ?item2 .\n?item2 wdt:P138 ?item3 .\n?item3 wdt:P138 ?item4 .\n?item4 wdt:P138 ?item5 .\n?item5 wdt:P138 ?item6 .\nFILTER (?item1 != ?item2 && ?item2 != ?item3 && ?item3 != ?item4 && ?item4 != ?item5 && ?item5 != ?item6) .\nFILTER (?item1 != ?item3 && ?item2 != ?item4 && ?item3 != ?item5 && ?item4 != ?item6) .\nFILTER (?item1 != ?item4 && ?item2 != ?item5 && ?item3 != ?item6) .\nFILTER (?item1 != ?item5 && ?item2 != ?item6) .\nFILTER (?item1 != ?item6) .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,de,fr\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item1 ?item1Label ?item2Label ?item3Label ?item4Label ?item5Label ?item6Label WHERE {\n?item1 wdt:[property:named after] ?item2 .\n?item2 wdt:[property:named after] ?item3 .\n?item3 wdt:[property:named after] ?item4 .\n?item4 wdt:[property:named after] ?item5 .\n?item5 wdt:[property:named after] ?item6 .\nFILTER (?item1 != ?item2 && ?item2 != ?item3 && ?item3 != ?item4 && ?item4 != ?item5 && ?item5 != ?item6) .\nFILTER (?item1 != ?item3 && ?item2 != ?item4 && ?item3 != ?item5 && ?item4 != ?item6) .\nFILTER (?item1 != ?item4 && ?item2 != ?item5 && ?item3 != ?item6) .\nFILTER (?item1 != ?item5 && ?item2 != ?item6) .\nFILTER (?item1 != ?item6) .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,de,fr\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "2134",
    "instruction": "Find locations in Sweden with their coordinates and elevation above sea level.",
    "query": "SELECT ?x ?xLabel ?description ?x_coords ?rgb WITH {\nSELECT ?data ?x ?x_coords WHERE {\n?x p:P2044/psn:P2044 [\nwikibase:quantityAmount ?data\n] .\n?x wdt:P625 ?x_coords .\n?x wdt:P17 wd:Q34 .\n# ?x wdt:P131+ [ wdt:P31 wd:Q15979307 ] .\n}\n} AS %data\n# determine the max and min values (used to calculate the spread)\nWITH {\nSELECT (MAX(?data) AS ?max_data) (MIN(?data) AS ?min_data) WHERE {\nINCLUDE %data\n}} AS %min_max\nWHERE {\nINCLUDE %data\nINCLUDE %min_max\n?x rdfs:label ?xLabel. FILTER (LANG(?xLabel) = \"sv\") .\nBIND (CONCAT(\"Hojd over havsnivan for \", ?xLabel, \" ar omkring \", STR(ROUND(?data)), \" meter\" ) AS ?description)\nBIND ( ?max_data - ?min_data AS ?spread )\nBIND (255 - xsd:integer( 255 * (?data - ?min_data) / ?spread) AS ?green ) # 255 -> 0\nBIND ( FLOOR (?green / 16) AS ?green_1 )\nBIND ( COALESCE(\nIF(?green_1 < 10, STR(?green_1), 1/0),\nIF(?green_1 = 10, \"a\", 1/0),\nIF(?green_1 = 11, \"b\", 1/0),\nIF(?green_1 = 12, \"c\", 1/0),\nIF(?green_1 = 13, \"d\", 1/0),\nIF(?green_1 = 14, \"e\", 1/0),\nIF(?green_1 = 15, \"f\", 1/0),\n\"ERROR\"\n) AS ?green_hex1 )\nBIND (FLOOR(?green - (16 * xsd:integer( ?green / 16 ))) AS ?green_2)\nBIND ( COALESCE(\nIF(?green_2 < 10, STR(?green_2), 1/0),\nIF(?green_2 = 10, \"a\", 1/0),\nIF(?green_2 = 11, \"b\", 1/0),\nIF(?green_2 = 12, \"c\", 1/0),\nIF(?green_2 = 13, \"d\", 1/0),\nIF(?green_2 = 14, \"e\", 1/0),\nIF(?green_2 = 15, \"f\", 1/0),\n\"ERROR\"\n) AS ?green_hex2 )\nBIND (CONCAT(STR(?green_hex1), STR(?green_hex2)) AS ?green_hex )\nBIND (CONCAT(\"00\", STR(?green_hex), \"00\") AS ?rgb)\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psn: <http://www.wikidata.org/prop/statement/value-normalized/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?x ?xLabel ?description ?x_coords ?rgb WITH {\nSELECT ?data ?x ?x_coords WHERE {\n?x p:[property:elevation above sea level]/psn:[property:elevation above sea level] [\nwikibase:quantityAmount ?data\n] .\n?x wdt:[property:coordinate location] ?x_coords .\n?x wdt:[property:country] wd:[entity:Sweden] .\n# ?x wdt:[property:located in the administrative territorial entity]+ [ wdt:[property:instance of] wd:[entity:principal area of Wales] ] .\n}\n} AS %data\n# determine the max and min values (used to calculate the spread)\nWITH {\nSELECT (MAX(?data) AS ?max_data) (MIN(?data) AS ?min_data) WHERE {\nINCLUDE %data\n}} AS %min_max\nWHERE {\nINCLUDE %data\nINCLUDE %min_max\n?x rdfs:label ?xLabel. FILTER (LANG(?xLabel) = \"sv\") .\nBIND (CONCAT(\"Hojd over havsnivan for \", ?xLabel, \" ar omkring \", STR(ROUND(?data)), \" meter\" ) AS ?description)\nBIND ( ?max_data - ?min_data AS ?spread )\nBIND (255 - xsd:integer( 255 * (?data - ?min_data) / ?spread) AS ?green ) # 255 -> 0\nBIND ( FLOOR (?green / 16) AS ?green_1 )\nBIND ( COALESCE(\nIF(?green_1 < 10, STR(?green_1), 1/0),\nIF(?green_1 = 10, \"a\", 1/0),\nIF(?green_1 = 11, \"b\", 1/0),\nIF(?green_1 = 12, \"c\", 1/0),\nIF(?green_1 = 13, \"d\", 1/0),\nIF(?green_1 = 14, \"e\", 1/0),\nIF(?green_1 = 15, \"f\", 1/0),\n\"ERROR\"\n) AS ?green_hex1 )\nBIND (FLOOR(?green - (16 * xsd:integer( ?green / 16 ))) AS ?green_2)\nBIND ( COALESCE(\nIF(?green_2 < 10, STR(?green_2), 1/0),\nIF(?green_2 = 10, \"a\", 1/0),\nIF(?green_2 = 11, \"b\", 1/0),\nIF(?green_2 = 12, \"c\", 1/0),\nIF(?green_2 = 13, \"d\", 1/0),\nIF(?green_2 = 14, \"e\", 1/0),\nIF(?green_2 = 15, \"f\", 1/0),\n\"ERROR\"\n) AS ?green_hex2 )\nBIND (CONCAT(STR(?green_hex1), STR(?green_hex2)) AS ?green_hex )\nBIND (CONCAT(\"00\", STR(?green_hex), \"00\") AS ?rgb)\n}",
    "complexity": "complex"
  },
  {
    "id": "2784",
    "instruction": "List the top 100 languages by the number of Wikidata property labels translated.",
    "query": "SELECT ?language_code ?count WITH {\nSELECT ?language_code (COUNT(*) AS ?count) WHERE {\n?property wikibase:propertyType ?propertyType .\n?property rdfs:label ?lang_label.\nBIND (LANG(?lang_label) AS ?language_code)\n} GROUP BY ?language_code\n} AS %RESULTS {\nINCLUDE %RESULTS\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?language_code ?count WITH {\nSELECT ?language_code (COUNT(*) AS ?count) WHERE {\n?property wikibase:propertyType ?propertyType .\n?property rdfs:label ?lang_label.\nBIND (LANG(?lang_label) AS ?language_code)\n} GROUP BY ?language_code\n} AS %RESULTS {\nINCLUDE %RESULTS\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY DESC(?count)",
    "complexity": "complex"
  }
]