[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "2813",
    "instruction": "List all places in Rennes named after someone or something.",
    "query": "SELECT ?loc ?locLabel ?item ?itemLabel ?coord ?layer WHERE {\n?loc wdt:P131 wd:Q647 ;\nwdt:P138 ?item .\n?item wdt:P31 ?type ; wdt:P625 ?coord .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\".\n?type rdfs:label ?layer }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?loc ?locLabel ?item ?itemLabel ?coord ?layer WHERE {\n?loc wdt:[property:located in the administrative territorial entity] wd:[entity:Rennes] ;\nwdt:[property:named after] ?item .\n?item wdt:[property:instance of] ?type ; wdt:[property:coordinate location] ?coord .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\".\n?type rdfs:label ?layer }\n}",
    "complexity": "medium"
  },
  {
    "id": "2310",
    "instruction": "List the characteristics that people use to describe themselves.",
    "query": "SELECT ?property ?propertyLabel ?predicate ?value ?valueLabel WHERE {\n?property ?predicate ?value .\n?property wikibase:directClaim ?predicate .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?property ?propertyLabel ?predicate ?value ?valueLabel WHERE {\n?property ?predicate ?value .\n?property wikibase:directClaim ?predicate .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "31",
    "instruction": "List all female graduates from Pembroke College, Oxford.",
    "query": "SELECT ?person ?personLabel ?personDescription ?englishwp WHERE {\n?person wdt:P31 wd:Q5; # human\nwdt:P21 wd:Q6581072; # sex or gender: female\nwdt:P69 wd:Q82606. # Educated at Pembroke College, Oxford\nOPTIONAL {?englishwp schema:about ?person; schema:isPartOf <https://en.wikipedia.org/> } # English Wikipedia page\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY ?personLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?person ?personLabel ?personDescription ?englishwp WHERE {\n?person wdt:[property:instance of] wd:[entity:human]; # human\nwdt:[property:sex or gender] wd:[entity:female]; # sex or gender: female\nwdt:[property:educated at] wd:[entity:Pembroke College]. # Educated at Pembroke College, Oxford\nOPTIONAL {?englishwp schema:about ?person; schema:isPartOf <https://en.wikipedia.org/> } # English Wikipedia page\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY ?personLabel",
    "complexity": "medium"
  },
  {
    "id": "1905",
    "instruction": "Show me the locations of hospitals and health centers in Argentina on a map.",
    "query": "SELECT ?CentrosSalud ?CentrosSaludLabel ?typeOf ?typeOfLabel ?coordenadas ?ubicaci_n ?ubicaci_nLabel ?imagen ?sitelinkES\nWHERE {\n{?CentrosSalud wdt:P31 wd:Q16917.}\nUNION {?CentrosSalud wdt:P31 wd:Q569500.}\n?CentrosSalud wdt:P17 wd:Q414.\n?CentrosSalud wdt:P31 ?typeOf\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],es\". }\nOPTIONAL {?CentrosSalud wdt:P625 ?coordenadas.}\nOPTIONAL {?CentrosSalud wdt:P18 ?imagen.}\nOPTIONAL { ?sitelinkES schema:isPartOf <https://es.wikipedia.org/>;\nschema:about ?CentrosSalud.\n}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?CentrosSalud ?CentrosSaludLabel ?typeOf ?typeOfLabel ?coordenadas ?ubicaci_n ?ubicaci_nLabel ?imagen ?sitelinkES\nWHERE {\n{?CentrosSalud wdt:[property:instance of] wd:[entity:hospital].}\nUNION {?CentrosSalud wdt:[property:instance of] wd:[entity:community health center].}\n?CentrosSalud wdt:[property:country] wd:[entity:Argentina].\n?CentrosSalud wdt:[property:instance of] ?typeOf\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],es\". }\nOPTIONAL {?CentrosSalud wdt:[property:coordinate location] ?coordenadas.}\nOPTIONAL {?CentrosSalud wdt:[property:image] ?imagen.}\nOPTIONAL { ?sitelinkES schema:isPartOf <https://es.wikipedia.org/>;\nschema:about ?CentrosSalud.\n}\n}",
    "complexity": "medium"
  },
  {
    "id": "2761",
    "instruction": "List the birth years of the winners of the last eight U.S. presidential elections.",
    "query": "SELECT ?hLabel ?presidentLabel (YEAR(?birthday) as ?birthYear) WHERE {\n?h wdt:P31 wd:Q47566; # instance of (P31) U.S. presidential election (Q47566)\nwdt:P585 ?electionDate; # point in time (P585)\nwdt:P991 ?president. # successful candidate (P991)\n?president wdt:P569 ?birthday # date of birth (P569)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY ?electionDate",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?hLabel ?presidentLabel (YEAR(?birthday) as ?birthYear) WHERE {\n?h wdt:[property:instance of] wd:[entity:United States presidential election]; # instance of ([property:instance of]) U.S. presidential election ([entity:United States presidential election])\nwdt:[property:point in time] ?electionDate; # point in time ([property:point in time])\nwdt:[property:successful candidate] ?president. # successful candidate ([property:successful candidate])\n?president wdt:[property:date of birth] ?birthday # date of birth ([property:date of birth])\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY ?electionDate",
    "complexity": "medium"
  },
  {
    "id": "2043",
    "instruction": "List the highest mountains in Switzerland along with their elevations.",
    "query": "SELECT ?item ?itemLabel ?coord ?elev ?prom ?picture WHERE {\n?item (p:P2044/psn:P2044/wikibase:quantityAmount) ?elev;\nwdt:P625 ?coord;\nwdt:P17 wd:Q39;\nwdt:P2660 ?prom;\nwdt:P18 ?picture.\nFILTER(?prom > 100)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nORDER BY DESC (?prom)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psn: <http://www.wikidata.org/prop/statement/value-normalized/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?coord ?elev ?prom ?picture WHERE {\n?item (p:[property:elevation above sea level]/psn:[property:elevation above sea level]/wikibase:quantityAmount) ?elev;\nwdt:[property:coordinate location] ?coord;\nwdt:[property:country] wd:[entity:Switzerland];\nwdt:[property:topographic prominence] ?prom;\nwdt:[property:image] ?picture.\nFILTER(?prom > 100)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nORDER BY DESC (?prom)",
    "complexity": "medium"
  },
  {
    "id": "1004",
    "instruction": "What are the moons of trans-Neptunian objects?",
    "query": "SELECT DISTINCT ?sat ?satLabel ?planet ?planetLabel WHERE {\n?sat wdt:P397 ?planet .\n?planet wdt:P196/wdt:P279* wd:Q6592 .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}\nORDER BY ?planetLabel ?satLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?sat ?satLabel ?planet ?planetLabel WHERE {\n?sat wdt:[property:parent astronomical body] ?planet .\n?planet wdt:[property:minor planet group]/wdt:[property:subclass of]* wd:[entity:trans-Neptunian object] .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}\nORDER BY ?planetLabel ?satLabel",
    "complexity": "medium"
  },
  {
    "id": "2065",
    "instruction": "List the grave plots by gender at Pere Lachaise Cemetery.",
    "query": "SELECT ?groupLabel (?groupLabel as ?layer) ?article ?person ?personLabel ?personDescription ?coord ?pic ?picGrave\nWHERE {\n?person wdt:P119 wd:Q311; #Place of burial\np:P119 [\npq:P965 ?graveplot;\npq:P625 ?coord].\nOPTIONAL{ ?person wdt:P18 ?pic .} # If we have an illustration\nOPTIONAL{ ?person wdt:P1442 ?picGrave .} # If we have a picture of the grave\nOPTIONAL {\n?article schema:about ?person .\n?article schema:inLanguage \"fr\" .\n?article schema:isPartOf <https://fr.wikipedia.org/> .\n}\nOPTIONAL { ?person wdt:P21 ?group .} # Occupation in Layer\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr, en\" .}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?groupLabel (?groupLabel as ?layer) ?article ?person ?personLabel ?personDescription ?coord ?pic ?picGrave\nWHERE {\n?person wdt:[property:place of burial] wd:[entity:P\u00e8re Lachaise Cemetery]; #Place of burial\np:[property:place of burial] [\npq:[property:burial plot reference] ?graveplot;\npq:[property:coordinate location] ?coord].\nOPTIONAL{ ?person wdt:[property:image] ?pic .} # If we have an illustration\nOPTIONAL{ ?person wdt:[property:image of grave] ?picGrave .} # If we have a picture of the grave\nOPTIONAL {\n?article schema:about ?person .\n?article schema:inLanguage \"fr\" .\n?article schema:isPartOf <https://fr.wikipedia.org/> .\n}\nOPTIONAL { ?person wdt:[property:sex or gender] ?group .} # Occupation in Layer\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr, en\" .}\n}",
    "complexity": "medium"
  },
  {
    "id": "781",
    "instruction": "List all places named after someone with the surname Lincoln.",
    "query": "SELECT ?whichLincoln ?whichLincolnLabel ?place ?placeLabel ?cc WHERE {\n?place wdt:P17 ?country .\n?country wdt:P984 ?cc\nFILTER(CONTAINS(?placeLabel, 'Lincoln')) .\nFILTER(CONTAINS(?whichLincolnLabel, 'Lincoln')) .\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n?place rdfs:label ?placeLabel .\n}\n?place wdt:P138 ?whichLincoln\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n?whichLincoln rdfs:label ?whichLincolnLabel .\n}\n} ORDER BY ?whichLincolnLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?whichLincoln ?whichLincolnLabel ?place ?placeLabel ?cc WHERE {\n?place wdt:[property:country] ?country .\n?country wdt:[property:IOC country code] ?cc\nFILTER(CONTAINS(?placeLabel, 'Lincoln')) .\nFILTER(CONTAINS(?whichLincolnLabel, 'Lincoln')) .\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n?place rdfs:label ?placeLabel .\n}\n?place wdt:[property:named after] ?whichLincoln\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n?whichLincoln rdfs:label ?whichLincolnLabel .\n}\n} ORDER BY ?whichLincolnLabel",
    "complexity": "medium"
  },
  {
    "id": "73",
    "instruction": "List all art exhibitions with their locations and dates.",
    "query": "SELECT DISTINCT ?item ?name ?place ?coord ?start ?end ?pointintime WHERE {\n?item (wdt:P31/wdt:P279*) wd:Q667276. # Art exhibitions\nOPTIONAL {?item wdt:P131 ?where}\nOPTIONAL {?item wdt:P580 ?start}\nOPTIONAL {?item wdt:P582 ?end}\nOPTIONAL {?item wdt:P585 ?pointintime}\nOPTIONAL {?item wdt:P625 ?coord}\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,fr,de,es,nl,ru\".\n?item rdfs:label ?name.\n?where rdfs:label ?place\n}\n}\nORDER BY ?place ?name",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?name ?place ?coord ?start ?end ?pointintime WHERE {\n?item (wdt:[property:instance of]/wdt:[property:subclass of]*) wd:[entity:art exhibition]. # Art exhibitions\nOPTIONAL {?item wdt:[property:located in the administrative territorial entity] ?where}\nOPTIONAL {?item wdt:[property:start time] ?start}\nOPTIONAL {?item wdt:[property:end time] ?end}\nOPTIONAL {?item wdt:[property:point in time] ?pointintime}\nOPTIONAL {?item wdt:[property:coordinate location] ?coord}\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,fr,de,es,nl,ru\".\n?item rdfs:label ?name.\n?where rdfs:label ?place\n}\n}\nORDER BY ?place ?name",
    "complexity": "medium"
  },
  {
    "id": "2372",
    "instruction": "List all characters from The Adventures of Tintin series in order of their frequency.",
    "query": "SELECT ?character ?characterLabel (COUNT(*) AS ?count) WHERE {\n?book wdt:P179 wd:Q744536;\nwdt:P674 ?character.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?character ?characterLabel\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?character ?characterLabel (COUNT(*) AS ?count) WHERE {\n?book wdt:[property:part of the series] wd:[entity:The Adventures of Tintin];\nwdt:[property:characters] ?character.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?character ?characterLabel\nORDER BY DESC(?count)",
    "complexity": "medium"
  },
  {
    "id": "2730",
    "instruction": "What are the official languages spoken in Latin America and the Caribbean?",
    "query": "SELECT DISTINCT ?language ?languageLabel (SUM(?population) as ?sum_pop)\nWHERE\n{\n?item wdt:P37 ?language .\n?item wdt:P1082 ?population .\n?item wdt:P31 wd:Q3624078 .\n?item wdt:P361* wd:Q72829598 .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". } # Helps get the label in your language, if not, then en language\n}\nGROUP BY ?language ?languageLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?language ?languageLabel (SUM(?population) as ?sum_pop)\nWHERE\n{\n?item wdt:[property:official language] ?language .\n?item wdt:[property:population] ?population .\n?item wdt:[property:instance of] wd:[entity:sovereign state] .\n?item wdt:[property:part of]* wd:[entity:Latin America and the Caribbean] .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". } # Helps get the label in your language, if not, then en language\n}\nGROUP BY ?language ?languageLabel",
    "complexity": "medium"
  },
  {
    "id": "2275",
    "instruction": "Find paintings of sunflowers created in the 19th century.",
    "query": "SELECT ?painting ?paintingLabel ?pic WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?painting wdt:P31 wd:Q3305213;\nwdt:P180 wd:Q171497;\nwdt:P18 ?pic;\nwdt:P571 ?dob.\nFILTER((\"1800-01-01\"^^xsd:dateTime <= ?dob) && (?dob < \"1899-01-01\"^^xsd:dateTime))\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?painting ?paintingLabel ?pic WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?painting wdt:[property:instance of] wd:[entity:painting];\nwdt:[property:image]0 wd:[entity:common sunflower];\nwdt:[property:image] ?pic;\nwdt:[property:inception] ?dob.\nFILTER((\"1800-01-01\"^^xsd:dateTime <= ?dob) && (?dob < \"1899-01-01\"^^xsd:dateTime))\n}",
    "complexity": "medium"
  },
  {
    "id": "2713",
    "instruction": "List the actors and actresses who have collaborated with Jean-Luc Godard the most.",
    "query": "SELECT DISTINCT ?distribution ?distributionLabel (COUNT(*) AS ?count) WHERE {\n?item wdt:P57 wd:Q53001;\nwdt:P161 ?distribution.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?distribution ?distributionLabel\nORDER BY DESC (?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?distribution ?distributionLabel (COUNT(*) AS ?count) WHERE {\n?item wdt:[property:director] wd:[entity:Jean-Luc Godard];\nwdt:[property:cast member] ?distribution.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?distribution ?distributionLabel\nORDER BY DESC (?count)",
    "complexity": "medium"
  },
  {
    "id": "1184",
    "instruction": "What artworks are featured in Beyonce's latest music video?",
    "query": "SELECT ?item ?itemLabel ?image ?date WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\nwd:Q55075439 wdt:P180 ?item.\nOPTIONAL { ?item wdt:P18 ?image. }\nOPTIONAL { ?item wdt:P571 ?date. }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?image ?date WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\nwd:[entity:Apeshit] wdt:[property:image]0 ?item.\nOPTIONAL { ?item wdt:[property:image] ?image. }\nOPTIONAL { ?item wdt:[property:inception] ?date. }\n}",
    "complexity": "medium"
  },
  {
    "id": "536",
    "instruction": "List all Ukrainian village articles on Romanian Wikipedia with their English and Ukrainian labels.",
    "query": "SELECT DISTINCT ?item ?LabelEN ?LabelUK ?page_titleRO WHERE {\n?item wdt:P31 wd:Q532 .\n?item wdt:P17 wd:Q212 .\n?article schema:about ?item ; schema:isPartOf <https://ro.wikipedia.org/> ; schema:name ?page_titleRO .\n?item rdfs:label ?LabelEN FILTER (lang(?LabelEN) = \"en\") .\n?item rdfs:label ?LabelUK FILTER (lang(?LabelUK) = \"uk\") .\n}\nLIMIT 300",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT DISTINCT ?item ?LabelEN ?LabelUK ?page_titleRO WHERE {\n?item wdt:[property:instance of] wd:[entity:village] .\n?item wdt:[property:country] wd:[entity:Ukraine] .\n?article schema:about ?item ; schema:isPartOf <https://ro.wikipedia.org/> ; schema:name ?page_titleRO .\n?item rdfs:label ?LabelEN FILTER (lang(?LabelEN) = \"en\") .\n?item rdfs:label ?LabelUK FILTER (lang(?LabelUK) = \"uk\") .\n}\nLIMIT 300",
    "complexity": "medium"
  },
  {
    "id": "1676",
    "instruction": "How many riots occurred in each country?",
    "query": "SELECT (COUNT(?riot) AS ?numOfRiots) ?country ?countryLabel\nWHERE {\n?riot wdt:P31/wdt:P279* wd:Q124757 .\n?riot wdt:P17 ?country .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} GROUP BY ?country ?countryLabel ORDER BY DESC(?numOfRiots)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT (COUNT(?riot) AS ?numOfRiots) ?country ?countryLabel\nWHERE {\n?riot wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:riot] .\n?riot wdt:[property:country] ?country .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} GROUP BY ?country ?countryLabel ORDER BY DESC(?numOfRiots)",
    "complexity": "medium"
  },
  {
    "id": "2048",
    "instruction": "Find research papers about backward contact tracing and list the most recent ones.",
    "query": "SELECT ?item ?itemLabel ?doi ?journal ?journalLabel ?date WHERE {\n?item wdt:P921 wd:Q98969121.\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\nOPTIONAL { ?item wdt:P18 ?_image. }\nOPTIONAL { ?item wdt:P356 ?doi. }\nOPTIONAL { ?item wdt:P577 ?date.}\nOPTIONAL { ?item wdt:P1433 ?journal. }\n}\nORDER BY DESC(?date)\nLIMIT 100",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?doi ?journal ?journalLabel ?date WHERE {\n?item wdt:[property:main subject] wd:[entity:backward contact tracing].\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\nOPTIONAL { ?item wdt:[property:image] ?_image. }\nOPTIONAL { ?item wdt:[property:DOI] ?doi. }\nOPTIONAL { ?item wdt:[property:publication date] ?date.}\nOPTIONAL { ?item wdt:[property:published in] ?journal. }\n}\nORDER BY DESC(?date)\nLIMIT 100",
    "complexity": "medium"
  },
  {
    "id": "333",
    "instruction": "List all authors who wrote letters as part of the Electronic Enlightenment project.",
    "query": "SELECT ?author ?authorLabel ?letter ?letterLabel ?ws\nWHERE {\n?letter wdt:P50 ?author;\nwdt:P31 wd:Q133492.\n?author wdt:P3429 []\nOPTIONAL {?ws schema:about ?letter; schema:isPartOf <https://en.wikisource.org/> }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} ORDER BY ?authorLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?author ?authorLabel ?letter ?letterLabel ?ws\nWHERE {\n?letter wdt:[property:author] ?author;\nwdt:[property:instance of] wd:[entity:letter].\n?author wdt:[property:Electronic Enlightenment ID] []\nOPTIONAL {?ws schema:about ?letter; schema:isPartOf <https://en.wikisource.org/> }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} ORDER BY ?authorLabel",
    "complexity": "medium"
  },
  {
    "id": "291",
    "instruction": "What are the entities related to Douglas Adams?",
    "query": "SELECT DISTINCT ?related ?relatedLabel ?relatedDescription WHERE {\nVALUES ?target {wd:Q42}\n{ ?target ?prop ?related } UNION { ?related ?prop ?target }\nfilter (CONTAINS(STR(?related),'/entity/Q') ).\nSERVICE wikibase:label { bd:serviceParam wikibase:language 'en' }\n} ORDER BY UCASE(?relatedLabel)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?related ?relatedLabel ?relatedDescription WHERE {\nVALUES ?target {wd:[entity:Douglas Adams]}\n{ ?target ?prop ?related } UNION { ?related ?prop ?target }\nfilter (CONTAINS(STR(?related),'/entity/Q') ).\nSERVICE wikibase:label { bd:serviceParam wikibase:language 'en' }\n} ORDER BY UCASE(?relatedLabel)",
    "complexity": "medium"
  },
  {
    "id": "2093",
    "instruction": "List all recycling centers in Aberdeen City.",
    "query": "SELECT ?item ?itemLabel ?itemDescription ?coords WHERE {\nVALUES ?o { wd:Q47520309 wd:Q27106436 }\n?item wdt:P131 wd:Q62274582.\n?item wdt:P31 ?o .\n?item wdt:P625 ?coords .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?itemDescription ?coords WHERE {\nVALUES ?o { wd:[entity:recycling facility] wd:[entity:recycling center] }\n?item wdt:[property:located in the administrative territorial entity] wd:[entity:Aberdeen City].\n?item wdt:[property:instance of] ?o .\n?item wdt:[property:coordinate location] ?coords .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "2161",
    "instruction": "How many locations have exhibitions on Wikidata?",
    "query": "SELECT ?loc ?locLabel (count(?i) as ?nr) WHERE {\n?i wdt:P31/wdt:P279* wd:Q464980 .\n?i wdt:P276 ?loc .\n#?loc wdt:P17 wd:Q55.\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"nl\" .\n}\n}\ngroup by ?loc ?locLabel\norder by desc(?nr)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?loc ?locLabel (count(?i) as ?nr) WHERE {\n?i wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:exhibition] .\n?i wdt:[property:location] ?loc .\n#?loc wdt:[property:country] wd:[entity:Netherlands].\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"nl\" .\n}\n}\ngroup by ?loc ?locLabel\norder by desc(?nr)",
    "complexity": "medium"
  },
  {
    "id": "1734",
    "instruction": "How many times was the Wikidata item for Carl von Linnaeus created?",
    "query": "SELECT\n(REPLACE(STR(?item),\".*Q\",\"Q\") AS ?qid)\n(REPLACE(STR(?tgt),\".*Q\",\"Q\") AS ?tgtQid)\n?tgtLabel\n(URI(CONCAT(\"https://www.wikidata.org/w/index.php?title=\",?qid,\"&action=history\")) as ?history)\nWHERE\n{\n?tgt wdt:P31 wd:Q5 .\n?tgt wdt:P106 wd:Q2374149 .\n?item owl:sameAs ?tgt .\nFILTER ( contains(STR(?tgt), \"Q1043\"))\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,en\" }\n}\nORDER BY ?qid",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX owl: <http://www.w3.org/2002/07/owl#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT\n(REPLACE(STR(?item),\".*Q\",\"Q\") AS ?qid)\n(REPLACE(STR(?tgt),\".*Q\",\"Q\") AS ?tgtQid)\n?tgtLabel\n(URI(CONCAT(\"https://www.wikidata.org/w/index.php?title=\",?qid,\"&action=history\")) as ?history)\nWHERE\n{\n?tgt wdt:[property:instance of] wd:[entity:human] .\n?tgt wdt:[property:occupation] wd:[entity:botanist] .\n?item owl:sameAs ?tgt .\nFILTER ( contains(STR(?tgt), \"Q1043\"))\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,en\" }\n}\nORDER BY ?qid",
    "complexity": "medium"
  },
  {
    "id": "2196",
    "instruction": "List all TV series produced in Spain, organized by decade.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?start_time ?end_time ?original_broadcasterLabel ?itemDescription ?sitelinks ?number_of_episodes ?duration ?number_of_seasons WHERE {\n?item wdt:P31 wd:Q5398426;\nwdt:P495 wd:Q29;\nwikibase:sitelinks ?sitelinks.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"es,en\". }\nOPTIONAL { ?item wdt:P449 ?original_broadcaster. }\nOPTIONAL { ?item wdt:P580 ?start_time. }\nOPTIONAL { ?item wdt:P582 ?end_time. }\nOPTIONAL { ?item wdt:P1113 ?number_of_episodes. }\nOPTIONAL { ?item wdt:P2047 ?duration. }\nOPTIONAL { ?item wdt:P2437 ?number_of_seasons. }\n}\nORDER BY DESC (?start_time)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?start_time ?end_time ?original_broadcasterLabel ?itemDescription ?sitelinks ?number_of_episodes ?duration ?number_of_seasons WHERE {\n?item wdt:[property:instance of] wd:[entity:television series];\nwdt:[property:country of origin] wd:[entity:Spain];\nwikibase:sitelinks ?sitelinks.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"es,en\". }\nOPTIONAL { ?item wdt:[property:original broadcaster] ?original_broadcaster. }\nOPTIONAL { ?item wdt:[property:start time] ?start_time. }\nOPTIONAL { ?item wdt:[property:end time] ?end_time. }\nOPTIONAL { ?item wdt:[property:number of episodes] ?number_of_episodes. }\nOPTIONAL { ?item wdt:[property:duration] ?duration. }\nOPTIONAL { ?item wdt:[property:number of seasons] ?number_of_seasons. }\n}\nORDER BY DESC (?start_time)",
    "complexity": "medium"
  },
  {
    "id": "479",
    "instruction": "Find entities that are instances of human and have Belgium as their country of citizenship, but do not have a label in Italian.",
    "query": "SELECT ?item ?itemLabel ?itemDescription WHERE {\n?item wdt:P31 wd:Q5.\n?item wdt:P27 wd:Q31.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"nl,fr,en,de,it,es,no,pt\". }\nFILTER(NOT EXISTS {\n?item rdfs:label ?lang_label.\nFILTER(LANG(?lang_label) = \"it\")\n})\n}\nORDER BY ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?itemDescription WHERE {\n?item wdt:[property:instance of] wd:[entity:human].\n?item wdt:[property:country of citizenship] wd:[entity:Belgium].\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"nl,fr,en,de,it,es,no,pt\". }\nFILTER(NOT EXISTS {\n?item rdfs:label ?lang_label.\nFILTER(LANG(?lang_label) = \"it\")\n})\n}\nORDER BY ?itemLabel",
    "complexity": "medium"
  },
  {
    "id": "884",
    "instruction": "List all places of worship with their coordinates and images.",
    "query": "SELECT ?item ?itemLabel ?_coordinate_location ?_image WHERE {\n?item wdt:P31/wdt:P279* wd:Q1370598.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n?item wdt:P625 ?_coordinate_location.\n?item wdt:P18 ?_image.\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?_coordinate_location ?_image WHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:structure of worship].\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n?item wdt:[property:coordinate location] ?_coordinate_location.\n?item wdt:[property:image] ?_image.\n}",
    "complexity": "medium"
  }
]