[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "592",
    "instruction": "List all human biological pathways from Wikipathways.",
    "query": "SELECT ?pathway ?pathwayLabel ?wpid WHERE {\n?pathway wdt:P2410 ?wpid ;\nwdt:P703 wd:Q15978631 .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?pathway ?pathwayLabel ?wpid WHERE {\n?pathway wdt:[property:WikiPathways ID] ?wpid ;\nwdt:[property:found in taxon] wd:[entity:Homo sapiens] .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "simple"
  },
  {
    "id": "343",
    "instruction": "List all individuals with their corresponding causes of death.",
    "query": "SELECT ?person ?personLabel ?emlo ?causeLabel WHERE {\n?person wdt:P1802 ?emlo;\nwdt:P509 ?cause\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}\nORDER BY ?causeLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?person ?personLabel ?emlo ?causeLabel WHERE {\n?person wdt:[property:Early Modern Letters Online person ID] ?emlo;\nwdt:[property:cause of death] ?cause\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}\nORDER BY ?causeLabel",
    "complexity": "simple"
  },
  {
    "id": "798",
    "instruction": "What are some devices used for torture?",
    "query": "SELECT ?thing ?thingLabel WHERE {\n?thing wdt:P366 wd:Q132781.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?thing ?thingLabel WHERE {\n?thing wdt:[property:has use] wd:[entity:torture].\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}",
    "complexity": "simple"
  },
  {
    "id": "2702",
    "instruction": "How many substance records are there in PubChem Compounds?",
    "query": "SELECT ?time ?casRecords WHERE {\nwd:P662 p:P4876 [\nps:P4876 ?casRecords ;\npq:P585 ?time\n]\n}",
    "annotated": "PREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\n\nSELECT ?time ?casRecords WHERE {\nwd:[property:PubChem CID] p:[property:number of records] [\nps:[property:number of records] ?casRecords ;\npq:[property:point in time] ?time\n]\n}",
    "complexity": "simple"
  },
  {
    "id": "1878",
    "instruction": "How many humans are there on Wikidata?",
    "query": "SELECT (COUNT(?human) AS ?count) { ?human wdt:P31 wd:Q5 }",
    "annotated": "PREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT (COUNT(?human) AS ?count) { ?human wdt:[property:instance of] wd:[entity:human] }",
    "complexity": "simple"
  },
  {
    "id": "738",
    "instruction": "What are all the descendants of Johann Sebastian Bach?",
    "query": "SELECT ?descendant ?descendantLabel\nWHERE\n{\nwd:Q1339 wdt:P40+ ?descendant.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE]\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?descendant ?descendantLabel\nWHERE\n{\nwd:[entity:Johann Sebastian Bach] wdt:[property:child]+ ?descendant.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE]\". }\n}",
    "complexity": "simple"
  },
  {
    "id": "2493",
    "instruction": "List all Klingon words with their corresponding lexemes.",
    "query": "SELECT ?lemma ?lexemeId WHERE {\n?lexemeId dct:language wd:Q10134;\nwikibase:lemma ?lemma.\nfilter(lang(?lemma) = 'tlh-latn')\n}",
    "annotated": "PREFIX dct: <http://purl.org/dc/terms/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?lemma ?lexemeId WHERE {\n?lexemeId dct:language wd:[entity:Klingon];\nwikibase:lemma ?lemma.\nfilter(lang(?lemma) = 'tlh-latn')\n}",
    "complexity": "simple"
  },
  {
    "id": "3",
    "instruction": "How many fictional characters are there on Wikidata?",
    "query": "SELECT (COUNT(DISTINCT ?article) AS ?count)\nWHERE {?article wdt:P31/wdt:P279* wd:Q95074}",
    "annotated": "PREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT (COUNT(DISTINCT ?article) AS ?count)\nWHERE {?article wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:fictional character]}",
    "complexity": "simple"
  },
  {
    "id": "1595",
    "instruction": "List all individuals with their preferred pronouns.",
    "query": "SELECT ?personLabel ?pronoun\nWHERE {\n?person wdt:P6553 [wikibase:lemma ?pronoun].\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?personLabel ?pronoun\nWHERE {\n?person wdt:[property:personal pronoun] [wikibase:lemma ?pronoun].\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "simple"
  },
  {
    "id": "1007",
    "instruction": "What types of cheese are made from cow's milk?",
    "query": "SELECT ?item ?itemLabel\nWHERE\n{\n?item wdt:P279 wd:Q3088299 .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel\nWHERE\n{\n?item wdt:[property:subclass of] wd:[entity:cow's-milk cheese] .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}",
    "complexity": "simple"
  },
  {
    "id": "497",
    "instruction": "List all Wikipedia URLs in different languages.",
    "query": "SELECT ?wikipedia WHERE {\n?wikipedia wikibase:wikiGroup \"wikipedia\".\n}",
    "annotated": "PREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?wikipedia WHERE {\n?wikipedia wikibase:wikiGroup \"wikipedia\".\n}",
    "complexity": "simple"
  },
  {
    "id": "2111",
    "instruction": "What are the stumbling stones in Hannover?",
    "query": "SELECT ?Stolperstein ?StolpersteinLabel ?geographische_Koordinaten ?Bild ?layer\nWHERE {\n?Stolperstein wdt:P31 wd:Q26703203;\nwdt:P276 wd:Q1715;\nwdt:P18 ?Bild;\nwdt:P625 ?geographische_Koordinaten.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}\nORDER BY ?StolpersteinLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?Stolperstein ?StolpersteinLabel ?geographische_Koordinaten ?Bild ?layer\nWHERE {\n?Stolperstein wdt:[property:instance of] wd:[entity:stumbling stone];\nwdt:[property:location] wd:[entity:Hanover];\nwdt:[property:image] ?Bild;\nwdt:[property:coordinate location] ?geographische_Koordinaten.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}\nORDER BY ?StolpersteinLabel",
    "complexity": "simple"
  },
  {
    "id": "464",
    "instruction": "Find all references that link to a website with 'lefigaro.fr' in its URL.",
    "query": "SELECT ?ref ?refURL WHERE {\n?ref pr:P854 ?refURL .\nFILTER (CONTAINS(str(?refURL),'lefigaro.fr')) .\n} LIMIT 200",
    "annotated": "PREFIX pr: <http://www.wikidata.org/prop/reference/>\n\nSELECT ?ref ?refURL WHERE {\n?ref pr:[property:reference URL] ?refURL .\nFILTER (CONTAINS(str(?refURL),'lefigaro.fr')) .\n} LIMIT 200",
    "complexity": "simple"
  },
  {
    "id": "1478",
    "instruction": "List all virtual assistants described in Wikidata.",
    "query": "SELECT ?item ?label WHERE {\n?item wdt:P31 wd:Q3467906.\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n?item rdfs:label ?label\n}\n}\nLIMIT 100",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?label WHERE {\n?item wdt:[property:instance of] wd:[entity:virtual assistant].\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n?item rdfs:label ?label\n}\n}\nLIMIT 100",
    "complexity": "simple"
  },
  {
    "id": "1318",
    "instruction": "List all wizards from the Harry Potter series and their respective houses.",
    "query": "SELECT ?wizard ?wizardLabel ?groupLabel ?group WHERE {\n?wizard wdt:P31 wd:Q15298259; # in Harry Potter universe\nwdt:P463 ?group.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?wizard ?wizardLabel ?groupLabel ?group WHERE {\n?wizard wdt:[property:instance of] wd:[entity:wizard in the Harry Potter universe]; # in Harry Potter universe\nwdt:[property:member of] ?group.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}",
    "complexity": "simple"
  },
  {
    "id": "328",
    "instruction": "List all people along with their electronic enlightenment ID and cause of death.",
    "query": "SELECT ?person ?personLabel ?ee ?causeLabel WHERE {\n?person wdt:P3429 ?ee;\nwdt:P509 ?cause\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}\nORDER BY ?causeLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?person ?personLabel ?ee ?causeLabel WHERE {\n?person wdt:[property:Electronic Enlightenment ID] ?ee;\nwdt:[property:cause of death] ?cause\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}\nORDER BY ?causeLabel",
    "complexity": "simple"
  },
  {
    "id": "145",
    "instruction": "List all the groups that wizards in the Harry Potter universe are a part of.",
    "query": "SELECT ?group ?groupLabel ?wizardLabel ?wizard WHERE {\n?wizard wdt:P31 wd:Q15298259; # in Harry Potter universe\nwdt:P463 ?group.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?group ?groupLabel ?wizardLabel ?wizard WHERE {\n?wizard wdt:[property:instance of] wd:[entity:wizard in the Harry Potter universe]; # in Harry Potter universe\nwdt:[property:member of] ?group.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}",
    "complexity": "simple"
  },
  {
    "id": "148",
    "instruction": "List all fictional worlds inspired by a real person.",
    "query": "SELECT DISTINCT ?thing ?thingLabel ?thingDescription ?personLabel WHERE {\n?thing wdt:P144 ?person.\n?person wdt:P31 wd:Q5\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?thing ?thingLabel ?thingDescription ?personLabel WHERE {\n?thing wdt:[property:based on] ?person.\n?person wdt:[property:instance of] wd:[entity:human]\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}",
    "complexity": "simple"
  },
  {
    "id": "887",
    "instruction": "List all types of sandwiches.",
    "query": "SELECT ?item ?itemLabel ?_image WHERE {\n?item wdt:P279 wd:Q28803.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\nOPTIONAL { ?item wdt:P18 ?_image. }\n}\nLIMIT 100",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?_image WHERE {\n?item wdt:[property:subclass of] wd:[entity:sandwich].\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\nOPTIONAL { ?item wdt:[property:image] ?_image. }\n}\nLIMIT 100",
    "complexity": "simple"
  },
  {
    "id": "1624",
    "instruction": "List all items that have a 3D model associated with them.",
    "query": "SELECT ?item ?itemLabel ?3dmodel\nWHERE {\n?item wdt:P4896 ?3dmodel.\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\".\n}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?3dmodel\nWHERE {\n?item wdt:[property:3D model] ?3dmodel.\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\".\n}\n}",
    "complexity": "simple"
  },
  {
    "id": "325",
    "instruction": "List all organizations with their members and Electronic Enlightenment IDs.",
    "query": "SELECT DISTINCT ?orgLabel ?person ?personLabel ?ee\nWHERE {\n?person wdt:P3429 ?ee;\nwdt:P463 ?org\nSERVICE wikibase:label {bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\"}\n} ORDER BY ?orgLabel ?ee",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?orgLabel ?person ?personLabel ?ee\nWHERE {\n?person wdt:[property:Electronic Enlightenment ID] ?ee;\nwdt:[property:member of] ?org\nSERVICE wikibase:label {bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\"}\n} ORDER BY ?orgLabel ?ee",
    "complexity": "simple"
  },
  {
    "id": "507",
    "instruction": "List all idioms in the Danish language.",
    "query": "SELECT ?l ?lemma WHERE {\n?l dct:language wd:Q9035; # Danish (Q9035)\nwikibase:lemma ?lemma;\nwikibase:lexicalCategory wd:Q184511. # idiom (Q184511)\n}",
    "annotated": "PREFIX dct: <http://purl.org/dc/terms/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?l ?lemma WHERE {\n?l dct:language wd:[entity:Danish]; # Danish ([entity:Danish])\nwikibase:lemma ?lemma;\nwikibase:lexicalCategory wd:[entity:idiom]. # idiom ([entity:idiom])\n}",
    "complexity": "simple"
  },
  {
    "id": "1924",
    "instruction": "List all vBIB20 lectures available in Wikidata.",
    "query": "SELECT ?_vBIB20 ?_vBIB20Label ?datum ?tibURL WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?_vBIB20 wdt:P361 wd:Q94495218;\nwdt:P577 ?datum;\nwdt:P973 ?tibURL.\n}\nLIMIT 100",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?_vBIB20 ?_vBIB20Label ?datum ?tibURL WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?_vBIB20 wdt:[property:part of] wd:[entity:#vBIB20];\nwdt:[property:publication date] ?datum;\nwdt:[property:described at URL] ?tibURL.\n}\nLIMIT 100",
    "complexity": "simple"
  },
  {
    "id": "2402",
    "instruction": "List the names of individuals involved in the Pandora Papers scandal along with their nationalities.",
    "query": "SELECT ?personLabel ?personDescription ?countryLabel (SAMPLE(?photo) as ?photo)\nWHERE {\nwd:Q108782773 wdt:P710 ?person .\n?person wdt:P27 ?country .\n?person wdt:P18 ?photo .\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" .\n}\n}\nGROUP BY ?personLabel ?personDescription ?countryLabel\nORDER BY ?countryLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?personLabel ?personDescription ?countryLabel (SAMPLE(?photo) as ?photo)\nWHERE {\nwd:[entity:Pandora Papers] wdt:[property:participant] ?person .\n?person wdt:[property:country of citizenship] ?country .\n?person wdt:[property:image] ?photo .\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" .\n}\n}\nGROUP BY ?personLabel ?personDescription ?countryLabel\nORDER BY ?countryLabel",
    "complexity": "medium"
  },
  {
    "id": "46",
    "instruction": "List famous people who studied at the University of Bristol but are not British citizens.",
    "query": "SELECT ?nationality ?nationalityLabel ?alum ?alumLabel ?alumDescription\nWHERE {\n?alum wdt:P69 wd:Q459506.\n?alum wdt:P27 ?nationality.\nMINUS { ?alum wdt:P27 wd:Q145 }\nOPTIONAL { ?alum schema:description ?alumDescription FILTER (lang(?alumDescription) = \"en\").}\nOPTIONAL { ?alum rdfs:label ?alumLabel FILTER (lang(?alumLabel) = \"en\").}\nOPTIONAL { ?nationality rdfs:label ?nationalityLabel FILTER (lang(?nationalityLabel) = \"en\")}\n}\nORDER BY ?nationalityLabel",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?nationality ?nationalityLabel ?alum ?alumLabel ?alumDescription\nWHERE {\n?alum wdt:[property:educated at] wd:[entity:University of Bristol].\n?alum wdt:[property:country of citizenship] ?nationality.\nMINUS { ?alum wdt:[property:country of citizenship] wd:[entity:United Kingdom] }\nOPTIONAL { ?alum schema:description ?alumDescription FILTER (lang(?alumDescription) = \"en\").}\nOPTIONAL { ?alum rdfs:label ?alumLabel FILTER (lang(?alumLabel) = \"en\").}\nOPTIONAL { ?nationality rdfs:label ?nationalityLabel FILTER (lang(?nationalityLabel) = \"en\")}\n}\nORDER BY ?nationalityLabel",
    "complexity": "medium"
  },
  {
    "id": "1279",
    "instruction": "List films inspired by video games.",
    "query": "SELECT ?item ?itemLabel ?videogame ?videogameLabel WHERE {\n?item wdt:P31 wd:Q11424.\n?item wdt:P144 ?videogame.\n?videogame (wdt:P31/wdt:P279*) wd:Q7889.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?videogame ?videogameLabel WHERE {\n?item wdt:[property:instance of] wd:[entity:film].\n?item wdt:[property:based on] ?videogame.\n?videogame (wdt:[property:instance of]/wdt:[property:subclass of]*) wd:[entity:video game].\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "108",
    "instruction": "List all types of ancient Greek pottery with their Wikipedia links.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?itemDescription ?enwp WHERE {\n?item wdt:P31/wdt:P279? wd:Q738680 # instance of type of ancient Greek pottery\nOPTIONAL {?enwp schema:about ?item; schema:isPartOf <https://en.wikipedia.org/> }\nMINUS {?item wdt:P1080 []} # exclude fictional (Pandora's Box)\nSERVICE wikibase:label {bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,el,fr,de,pl,uk\"}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?itemDescription ?enwp WHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]? wd:[entity:pottery of ancient Greece] # instance of type of ancient Greek pottery\nOPTIONAL {?enwp schema:about ?item; schema:isPartOf <https://en.wikipedia.org/> }\nMINUS {?item wdt:[property:from narrative universe] []} # exclude fictional (Pandora's Box)\nSERVICE wikibase:label {bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,el,fr,de,pl,uk\"}\n}",
    "complexity": "medium"
  },
  {
    "id": "49",
    "instruction": "What awards have University of Bristol alumni won?",
    "query": "SELECT ?alum ?alumLabel ?award ?awardLabel\nWHERE\n{\n?alum wdt:P69 wd:Q459506.\n?alum wdt:P166 ?award.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} ORDER BY ?awardLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?alum ?alumLabel ?award ?awardLabel\nWHERE\n{\n?alum wdt:[property:educated at] wd:[entity:University of Bristol].\n?alum wdt:[property:award received] ?award.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} ORDER BY ?awardLabel",
    "complexity": "medium"
  },
  {
    "id": "974",
    "instruction": "Show me a list of water towers in the United States with their coordinates.",
    "query": "SELECT ?image ?itemLabel ?item ?coord WHERE {\n?item wdt:P31/wdt:P279* wd:Q274153 ;\n# wdt:P17 wd:Q30 ;\nwdt:P625 ?coord.\nOPTIONAL {\n?item wdt:P18 ?image.\n}\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?image ?itemLabel ?item ?coord WHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:water tower] ;\n# wdt:[property:country] wd:[entity:United States of America] ;\nwdt:[property:coordinate location] ?coord.\nOPTIONAL {\n?item wdt:[property:image] ?image.\n}\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n}",
    "complexity": "medium"
  },
  {
    "id": "1171",
    "instruction": "List people who were born and died in different cities, showing the distance between their birthplace and deathplace.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?placeBirthLabel ?placeDeathLabel ?coordsBirth ?coordsDeath ?distance WHERE {\n?item wdt:P31 wd:Q5 ;\nwdt:P19 ?placeBirth ;\nwdt:P20 ?placeDeath .\n?placeBirth wdt:P625 ?coordsBirth .\n?placeDeath wdt:P625 ?coordsDeath .\nBIND (geof:distance(?coordsBirth, ?coordsDeath) AS ?distance)\nFILTER (?distance > 19000)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n}\nORDER BY DESC(?distance)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?placeBirthLabel ?placeDeathLabel ?coordsBirth ?coordsDeath ?distance WHERE {\n?item wdt:[property:instance of] wd:[entity:human] ;\nwdt:[property:place of birth] ?placeBirth ;\nwdt:[property:place of death] ?placeDeath .\n?placeBirth wdt:[property:coordinate location] ?coordsBirth .\n?placeDeath wdt:[property:coordinate location] ?coordsDeath .\nBIND (geof:distance(?coordsBirth, ?coordsDeath) AS ?distance)\nFILTER (?distance > 19000)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n}\nORDER BY DESC(?distance)",
    "complexity": "medium"
  },
  {
    "id": "532",
    "instruction": "List all countries with a Wikipedia page in English.",
    "query": "SELECT ?country ?countryLabel ?article WHERE {\n?country wdt:P31 wd:Q3624078 . # sovereign state\n?article schema:about ?country .\n?article schema:isPartOf <https://en.wikipedia.org/>.\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\"\n}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?country ?countryLabel ?article WHERE {\n?country wdt:[property:instance of] wd:[entity:sovereign state] . # sovereign state\n?article schema:about ?country .\n?article schema:isPartOf <https://en.wikipedia.org/>.\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\"\n}\n}",
    "complexity": "medium"
  },
  {
    "id": "771",
    "instruction": "List the items with ISNI numbers '00 0001 2281 955X' or '00 0001 2276 4157'.",
    "query": "SELECT ?item ?itemLabel ?mother ?motherLabel ?ISNI WHERE {\nVALUES ?ISNI { \"0000 0001 2281 955X\" \"0000 0001 2276 4157\" }\n?item wdt:P213 ?ISNI.\nOPTIONAL { ?item wdt:P25 ?mother. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?mother ?motherLabel ?ISNI WHERE {\nVALUES ?ISNI { \"0000 0001 2281 955X\" \"0000 0001 2276 4157\" }\n?item wdt:[property:ISNI] ?ISNI.\nOPTIONAL { ?item wdt:[property:mother] ?mother. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "1193",
    "instruction": "List all space telescopes named after a specific person or entity.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?namesakeLabel ?namesakeImage WHERE {\n?item wdt:P31 wd:Q148578.\n?item wdt:P138 ?namesake.\n?namesake wdt:P18 ?namesakeImage.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?namesakeLabel ?namesakeImage WHERE {\n?item wdt:[property:instance of] wd:[entity:space telescope].\n?item wdt:[property:named after] ?namesake.\n?namesake wdt:[property:image] ?namesakeImage.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "622",
    "instruction": "List the authors who received a Nobel prize and wrote scientific articles.",
    "query": "SELECT ?item ?itemLabel ?person ?personLabel ?_image ?award ?awardLabel\nWHERE {\n?person wdt:P166 ?award ; #person received an award\nwdt:P31 wd:Q5 . #person is instance of human\n?award wdt:P31/wdt:P279* wd:Q7191 . #award is a Nobel Prize\n?item wdt:P50 ?person ; #person is an author of item\nwdt:P31 wd:Q13442814 . #item is a scientific article\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\nOPTIONAL { ?person wdt:P18 ?_image. } #Wikimedia Commons has an image of person\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?person ?personLabel ?_image ?award ?awardLabel\nWHERE {\n?person wdt:[property:award received] ?award ; #person received an award\nwdt:[property:instance of] wd:[entity:human] . #person is instance of human\n?award wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:Nobel Prize] . #award is a Nobel Prize\n?item wdt:[property:author] ?person ; #person is an author of item\nwdt:[property:instance of] wd:[entity:scholarly article] . #item is a scientific article\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\nOPTIONAL { ?person wdt:[property:image] ?_image. } #Wikimedia Commons has an image of person\n}",
    "complexity": "medium"
  },
  {
    "id": "498",
    "instruction": "List Wikipedia article names about humans in English, Uzbek, Russian, and Korean languages.",
    "query": "SELECT DISTINCT ?lang ?name WHERE {\n?article schema:about wd:Q5 . hint:Prior hint:runFirst true.\n?article schema:inLanguage ?lang ;\nschema:name ?name ;\nschema:isPartOf [ wikibase:wikiGroup \"wikipedia\" ] .\nFILTER(?lang in ('en', 'uz', 'ru', 'ko')) .\nFILTER (!CONTAINS(?name, ':')) .\n}",
    "annotated": "PREFIX hint: <http://www.bigdata.com/queryHints#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?lang ?name WHERE {\n?article schema:about wd:[entity:human] . hint:Prior hint:runFirst true.\n?article schema:inLanguage ?lang ;\nschema:name ?name ;\nschema:isPartOf [ wikibase:wikiGroup \"wikipedia\" ] .\nFILTER(?lang in ('en', 'uz', 'ru', 'ko')) .\nFILTER (!CONTAINS(?name, ':')) .\n}",
    "complexity": "medium"
  },
  {
    "id": "574",
    "instruction": "What are the nearby places around Wikimedia Foundation office?",
    "query": "SELECT ?place ?location ?distance ?placeLabel WHERE {\nSERVICE wikibase:around {\n?place wdt:P625 ?location .\nbd:serviceParam wikibase:center \"Point(-122.402251 37.789246)\"^^geo:wktLiteral .\nbd:serviceParam wikibase:radius \"1\" .\nbd:serviceParam wikibase:distance ?distance .\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY ?distance LIMIT 100",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?place ?location ?distance ?placeLabel WHERE {\nSERVICE wikibase:around {\n?place wdt:[property:coordinate location] ?location .\nbd:serviceParam wikibase:center \"Point(-122.402251 37.789246)\"^^geo:wktLiteral .\nbd:serviceParam wikibase:radius \"1\" .\nbd:serviceParam wikibase:distance ?distance .\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY ?distance LIMIT 100",
    "complexity": "medium"
  },
  {
    "id": "1448",
    "instruction": "Find information about goats and their images.",
    "query": "SELECT ?item ?itemLabel ?image\nWHERE {\n?item wdt:P31 ?goats.\nVALUES ?goats {\nwd:Q2934\nwd:Q172923\nwd:Q27713372\n}\nOPTIONAL { ?item wdt:P18 ?image . }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?image\nWHERE {\n?item wdt:[property:instance of] ?goats.\nVALUES ?goats {\nwd:[entity:goat]\nwd:[entity:Capra]\nwd:[entity:fictional goat]\n}\nOPTIONAL { ?item wdt:[property:image] ?image . }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  }
]