[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "2066",
    "instruction": "List researchers from National University of La Plata who have co-authored a publication together.",
    "query": "SELECT\n?author1 ?author1Label ?image1 ?rgb\n?author2 ?author2Label ?image2\nWITH {\nSELECT\n?author1 (SAMPLE(?image1_) AS ?image1)\n?author2 (SAMPLE(?image2_) AS ?image2)\n(SAMPLE(?rgb_) AS ?rgb)\nWHERE {\nwd:Q784171 ^wdt:P361* / ^( wdt:P108 | wdt:P1416 | wdt:P463 ) ?author1 , ?author2 .\n?work wdt:P50 ?author1 , ?author2 .\n# Only display co-authorship for certain types of documents\n# Journal and conference articles, books, not (yet?) software\nVALUES ?publication_type { wd:Q13442814 wd:Q571 wd:Q26973022 wd:Q17928402 wd:Q947859 wd:Q54670950 }\nFILTER EXISTS { ?work wdt:P31 ?publication_type . }\n# No self-links.\nFILTER (?author1 != ?author2)\n# Images\nOPTIONAL { ?author1 wdt:P18 ?image1_ }\nOPTIONAL { ?author2 wdt:P18 ?image2_ }\n# Coloring of the nodes\nBIND(\"FFFFFF\" AS ?rgb_)\n}\nGROUP BY ?author1 ?author2\n} AS %result\nWHERE {\nINCLUDE %result\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,da,de,es,fr,jp,sv,ru,zh\".\n}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT\n?author1 ?author1Label ?image1 ?rgb\n?author2 ?author2Label ?image2\nWITH {\nSELECT\n?author1 (SAMPLE(?image1_) AS ?image1)\n?author2 (SAMPLE(?image2_) AS ?image2)\n(SAMPLE(?rgb_) AS ?rgb)\nWHERE {\nwd:[entity:National University of La Plata] ^wdt:[property:part of]* / ^( wdt:[property:employer] | wdt:[property:affiliation] | wdt:[property:member of] ) ?author1 , ?author2 .\n?work wdt:[property:author] ?author1 , ?author2 .\n# Only display co-authorship for certain types of documents\n# Journal and conference articles, books, not (yet?) software\nVALUES ?publication_type { wd:[entity:scholarly article] wd:[entity:book] wd:Q26973022 wd:[entity:blog post] wd:[entity:research proposal] wd:[entity:conference poster] }\nFILTER EXISTS { ?work wdt:[property:instance of] ?publication_type . }\n# No self-links.\nFILTER (?author1 != ?author2)\n# Images\nOPTIONAL { ?author1 wdt:[property:image] ?image1_ }\nOPTIONAL { ?author2 wdt:[property:image] ?image2_ }\n# Coloring of the nodes\nBIND(\"FFFFFF\" AS ?rgb_)\n}\nGROUP BY ?author1 ?author2\n} AS %result\nWHERE {\nINCLUDE %result\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,da,de,es,fr,jp,sv,ru,zh\".\n}\n}",
    "complexity": "complex"
  },
  {
    "id": "2536",
    "instruction": "What are the most frequently used properties specific to German lexemes in Wikidata?",
    "query": "SELECT ?property ?propertyLabel (COUNT(?value) AS ?count) {\nVALUES ?language { wd:Q188 } # <= change the language here\n?property p:P2302 [ a wikibase:BestRank ; ps:P2302 wd:Q52004125 ; pq:P2305 wd:Q51885771 ] ; p:P2302 [ a wikibase:BestRank ; ps:P2302 wd:Q55819106 ; pq:P2305 ?language ] .\nFILTER NOT EXISTS {\n?property p:P2302 [ a wikibase:BestRank ; ps:P2302 wd:Q52004125 ; pq:P2305 ?otherType ] .\nFILTER(?otherType != wd:Q51885771) .\n}\nFILTER NOT EXISTS {\n?property p:P2302 [ a wikibase:BestRank ; ps:P2302 wd:Q55819106 ; pq:P2305 ?otherLanguage ] .\nFILTER(?otherLanguage != ?language) .\n}\n?property wikibase:directClaim ?wdt .\nOPTIONAL { ?lexeme dct:language ?language ; ?wdt ?value }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr,en\" . }\n}\nGROUP BY ?property ?propertyLabel\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX dct: <http://purl.org/dc/terms/>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?property ?propertyLabel (COUNT(?value) AS ?count) {\nVALUES ?language { wd:[entity:German] } # <= change the language here\n?property p:[property:property constraint] [ a wikibase:BestRank ; ps:[property:property constraint] wd:[entity:allowed-entity-types constraint] ; pq:[property:item of property constraint] wd:[entity:Wikibase lexeme] ] ; p:[property:property constraint] [ a wikibase:BestRank ; ps:[property:property constraint] wd:[entity:lexeme requires language constraint] ; pq:[property:item of property constraint] ?language ] .\nFILTER NOT EXISTS {\n?property p:[property:property constraint] [ a wikibase:BestRank ; ps:[property:property constraint] wd:[entity:allowed-entity-types constraint] ; pq:[property:item of property constraint] ?otherType ] .\nFILTER(?otherType != wd:[entity:Wikibase lexeme]) .\n}\nFILTER NOT EXISTS {\n?property p:[property:property constraint] [ a wikibase:BestRank ; ps:[property:property constraint] wd:[entity:lexeme requires language constraint] ; pq:[property:item of property constraint] ?otherLanguage ] .\nFILTER(?otherLanguage != ?language) .\n}\n?property wikibase:directClaim ?wdt .\nOPTIONAL { ?lexeme dct:language ?language ; ?wdt ?value }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr,en\" . }\n}\nGROUP BY ?property ?propertyLabel\nORDER BY DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "2746",
    "instruction": "How many external identifiers are associated with people who have an Australian Dictionary of Biography ID?",
    "query": "SELECT ?propertyLabel ?propertyDescription ?count WHERE {\n{\nSELECT ?propertyclaim (COUNT(*) AS ?count) where {\n?item wdt:P31 wd:Q5;\nwdt:P1907 ?adb_id.\n?item ?propertyclaim [] .\n} GROUP BY ?propertyclaim\n}\n?property wikibase:propertyType wikibase:ExternalId .\n?property wikibase:directClaim ?propertyclaim .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY DESC (?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?propertyLabel ?propertyDescription ?count WHERE {\n{\nSELECT ?propertyclaim (COUNT(*) AS ?count) where {\n?item wdt:[property:instance of] wd:[entity:human];\nwdt:[property:Australian Dictionary of Biography ID] ?adb_id.\n?item ?propertyclaim [] .\n} GROUP BY ?propertyclaim\n}\n?property wikibase:propertyType wikibase:ExternalId .\n?property wikibase:directClaim ?propertyclaim .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY DESC (?count)",
    "complexity": "complex"
  },
  {
    "id": "2009",
    "instruction": "What percentage of UK Parliament members have been named John since 1372?",
    "query": "SELECT distinct ?parliament_start (round((?johns/?members)*100) as ?percent_johns) where\n{\n{ SELECT distinct ?term ?parliament_start where\n{ { ?term wdt:P279 wd:Q16707842 } union { ?term wdt:P279 wd:Q18015642 } union { ?term wdt:P279 wd:Q18018860 }\noptional { ?term wdt:P571 ?parliament_start }\n}\n}\noptional { SELECT ?term (count(distinct ?item) as ?members) where\n{ ?item p:P39 ?positionStatement . ?positionStatement ps:P39 ?term .\n{ ?term wdt:P279 wd:Q16707842 } union { ?term wdt:P279 wd:Q18015642 } union { ?term wdt:P279 wd:Q18018860 }\n# ?item wdt:P735 ?name #has a known forename\n} group by ?term\n}\noptional { SELECT ?term (count(distinct ?item) as ?johns) where\n{ ?item p:P39 ?positionStatement . ?positionStatement ps:P39 ?term .\n{ ?term wdt:P279 wd:Q16707842 } union { ?term wdt:P279 wd:Q18015642 } union { ?term wdt:P279 wd:Q18018860 }\n?item wdt:P735 wd:Q4925477 # that name is John\n} group by ?term\n}\nfilter ( ?members >= 25 ) # only terms with 25 or more people\nSERVICE wikibase:label { bd:serviceParam wikibase:language 'en' }\n} order by ?parliament_start\n#defaultView:ScatterChart",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT distinct ?parliament_start (round((?johns/?members)*100) as ?percent_johns) where\n{\n{ SELECT distinct ?term ?parliament_start where\n{ { ?term wdt:[property:subclass of] wd:[entity:Member of Parliament] } union { ?term wdt:[property:subclass of] wd:[entity:Member of Parliament of Great Britain] } union { ?term wdt:[property:subclass of] wd:[entity:Member of Parliament in the Parliament of England] }\noptional { ?term wdt:[property:inception] ?parliament_start }\n}\n}\noptional { SELECT ?term (count(distinct ?item) as ?members) where\n{ ?item p:[property:position held] ?positionStatement . ?positionStatement ps:[property:position held] ?term .\n{ ?term wdt:[property:subclass of] wd:[entity:Member of Parliament] } union { ?term wdt:[property:subclass of] wd:[entity:Member of Parliament of Great Britain] } union { ?term wdt:[property:subclass of] wd:[entity:Member of Parliament in the Parliament of England] }\n# ?item wdt:[property:given name] ?name #has a known forename\n} group by ?term\n}\noptional { SELECT ?term (count(distinct ?item) as ?johns) where\n{ ?item p:[property:position held] ?positionStatement . ?positionStatement ps:[property:position held] ?term .\n{ ?term wdt:[property:subclass of] wd:[entity:Member of Parliament] } union { ?term wdt:[property:subclass of] wd:[entity:Member of Parliament of Great Britain] } union { ?term wdt:[property:subclass of] wd:[entity:Member of Parliament in the Parliament of England] }\n?item wdt:[property:given name] wd:[entity:John] # that name is John\n} group by ?term\n}\nfilter ( ?members >= 25 ) # only terms with 25 or more people\nSERVICE wikibase:label { bd:serviceParam wikibase:language 'en' }\n} order by ?parliament_start\n#defaultView:ScatterChart",
    "complexity": "complex"
  },
  {
    "id": "457",
    "instruction": "What are the most common property-value combinations that have a qualifier?",
    "query": "SELECT (COUNT(DISTINCT ?statement) AS ?count) ?property ?propertyLabel ?valueLabel WHERE {\nhint:Query hint:optimizer \"None\" .\n?statement pq:P642 [] .\n?statement ?ps ?value .\n?property wikibase:statementProperty ?ps .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} GROUP BY ?property ?propertyLabel ?value ?valueLabel\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX hint: <http://www.bigdata.com/queryHints#>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT (COUNT(DISTINCT ?statement) AS ?count) ?property ?propertyLabel ?valueLabel WHERE {\nhint:Query hint:optimizer \"None\" .\n?statement pq:[property:of] [] .\n?statement ?ps ?value .\n?property wikibase:statementProperty ?ps .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} GROUP BY ?property ?propertyLabel ?value ?valueLabel\nORDER BY DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "1549",
    "instruction": "List the people who have a state named after them.",
    "query": "SELECT DISTINCT ?pers ?persLabel ?item ?itemLabel WHERE {\n?item wdt:P31/wdt:P279* wd:Q3624078.\n?item wdt:P138/wdt:P138* ?pers.\n?pers wdt:P31/wdt:P279* wd:Q5.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} order by ?persLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?pers ?persLabel ?item ?itemLabel WHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:sovereign state].\n?item wdt:[property:named after]/wdt:[property:named after]* ?pers.\n?pers wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:human].\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} order by ?persLabel",
    "complexity": "complex"
  },
  {
    "id": "1834",
    "instruction": "List British Prime Ministers who had children under 5 years old when they took office.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?start ?end ?child ?childLabel (MAX(?child_dob) AS ?child_dob1) (MIN(?child_age) AS ?child_age1) WHERE {\n?item p:P39 ?pm_stmt .\n?pm_stmt ps:P39 wd:Q14211 .\n?pm_stmt pq:P580 ?start .\nOPTIONAL {?pm_stmt pq:P582 ?end} .\n?item wdt:P40 ?child .\n?child wdt:P569 ?child_dob .\nFILTER(! (?child_dob > ?end)) .\nBIND (((?start - ?child_dob) / 365.24) AS ?child_age) .\nFILTER (?child_age < 5)\nFILTER NOT EXISTS {\n?child wdt:P570 ?child_dod .\nFILTER (?child_dod < ?start) .\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} GROUP BY ?item ?itemLabel ?start ?end ?child ?childLabel\nORDER BY DESC(?start) ?child_dob1",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?start ?end ?child ?childLabel (MAX(?child_dob) AS ?child_dob1) (MIN(?child_age) AS ?child_age1) WHERE {\n?item p:[property:position held] ?pm_stmt .\n?pm_stmt ps:[property:position held] wd:[entity:Prime Minister of the United Kingdom] .\n?pm_stmt pq:[property:start time] ?start .\nOPTIONAL {?pm_stmt pq:[property:end time] ?end} .\n?item wdt:[property:child] ?child .\n?child wdt:[property:date of birth] ?child_dob .\nFILTER(! (?child_dob > ?end)) .\nBIND (((?start - ?child_dob) / 365.24) AS ?child_age) .\nFILTER (?child_age < 5)\nFILTER NOT EXISTS {\n?child wdt:[property:date of death] ?child_dod .\nFILTER (?child_dod < ?start) .\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} GROUP BY ?item ?itemLabel ?start ?end ?child ?childLabel\nORDER BY DESC(?start) ?child_dob1",
    "complexity": "complex"
  },
  {
    "id": "1926",
    "instruction": "List researchers who co-presented at vBIB20 and have a Wikidata item.",
    "query": "SELECT\n?author1 ?author1Label (SAMPLE(?image1_) AS ?image1) ?rgb\n?author2 ?author2Label (SAMPLE(?image2_) AS ?image2)\nWITH {\nSELECT\n?vortrag1 ?author1\n(SAMPLE(?dark_rgb_) AS ?dark_rgb)\n(SAMPLE(?light_rgb_) AS ?light_rgb)\nWHERE {\n# Find people at the event\n{\n?vortrag1 wdt:P361 wd:Q94495218; wdt:P50 ?author1 .\nBIND (\"EEEEEE\" AS ?dark_rgb_)\n}\n}\nGROUP BY ?author1 ?vortrag1\n} AS %authors\nWITH {\nSELECT DISTINCT ?author1 ?author2 ?rgb WHERE {\nINCLUDE %authors\n#wd:Q94495218 (wdt:P823 | wdt:P664 | ^wdt:P1344 | wdt:P710 | ^wdt:P4745 / ^wdt:P1433 / wdt:P50) ?author2 .\n# Find co-authors on #vBIB\n?vortrag2 wdt:P361 wd:Q94495218; wdt:P50 ?author2 .\nFILTER (?author1 != ?author2)\nFILTER (?vortrag1 = ?vortrag2)\nBIND(COALESCE(?dark_rgb, ?light_rgb) AS ?rgb)\n}\n} AS %result\nWHERE {\nINCLUDE %result\nOPTIONAL { ?author1 wdt:P18 ?image1_ . }\nOPTIONAL { ?author2 wdt:P18 ?image2_ . }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,da,de,es,fr,jp,nl,no,sv,ru,zh\".\n}\n}\nGROUP BY ?author1 ?author1Label ?rgb ?author2 ?author2Label ?vortrag1 ?vortrag2",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT\n?author1 ?author1Label (SAMPLE(?image1_) AS ?image1) ?rgb\n?author2 ?author2Label (SAMPLE(?image2_) AS ?image2)\nWITH {\nSELECT\n?vortrag1 ?author1\n(SAMPLE(?dark_rgb_) AS ?dark_rgb)\n(SAMPLE(?light_rgb_) AS ?light_rgb)\nWHERE {\n# Find people at the event\n{\n?vortrag1 wdt:[property:part of] wd:[entity:#vBIB20]; wdt:[property:author] ?author1 .\nBIND (\"EEEEEE\" AS ?dark_rgb_)\n}\n}\nGROUP BY ?author1 ?vortrag1\n} AS %authors\nWITH {\nSELECT DISTINCT ?author1 ?author2 ?rgb WHERE {\nINCLUDE %authors\n#wd:[entity:#vBIB20] (wdt:[property:speaker] | wdt:[property:organizer] | ^wdt:[property:participant in] | wdt:[property:participant] | ^wdt:[property:is proceedings from] / ^wdt:[property:published in] / wdt:[property:author]) ?author2 .\n# Find co-authors on #vBIB\n?vortrag2 wdt:[property:part of] wd:[entity:#vBIB20]; wdt:[property:author] ?author2 .\nFILTER (?author1 != ?author2)\nFILTER (?vortrag1 = ?vortrag2)\nBIND(COALESCE(?dark_rgb, ?light_rgb) AS ?rgb)\n}\n} AS %result\nWHERE {\nINCLUDE %result\nOPTIONAL { ?author1 wdt:[property:image] ?image1_ . }\nOPTIONAL { ?author2 wdt:[property:image] ?image2_ . }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,da,de,es,fr,jp,nl,no,sv,ru,zh\".\n}\n}\nGROUP BY ?author1 ?author1Label ?rgb ?author2 ?author2Label ?vortrag1 ?vortrag2",
    "complexity": "complex"
  },
  {
    "id": "239",
    "instruction": "List all manuscripts from the Bodleian Library with their online digitizations.",
    "query": "SELECT ?thing ?thingLabel ?inv ?url WHERE {\nVALUES ?in {wd:Q82133 wd:Q2210813} # Bodleian and Sackler\n?thing p:P195 ?s; wdt:P953 ?url FILTER(CONTAINS(STR(?url),\"ox.ac.uk\")).\n?s ps:P195 ?in\nOPTIONAL { ?s pq:P217 ?inv }\nMINUS {?thing wdt:P1433 []}\nMINUS {?thing wdt:P361 []}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY ?thingLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?thing ?thingLabel ?inv ?url WHERE {\nVALUES ?in {wd:[entity:Bodleian Library] wd:[entity:Bodleian Art, Archaeology and Ancient World Library]} # Bodleian and Sackler\n?thing p:[property:collection] ?s; wdt:[property:full work available at URL] ?url FILTER(CONTAINS(STR(?url),\"ox.ac.uk\")).\n?s ps:[property:collection] ?in\nOPTIONAL { ?s pq:[property:inventory number] ?inv }\nMINUS {?thing wdt:[property:published in] []}\nMINUS {?thing wdt:[property:part of] []}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY ?thingLabel",
    "complexity": "complex"
  },
  {
    "id": "492",
    "instruction": "List all items that have a Wikispecies sitelink.",
    "query": "SELECT ?item ?itemLabel ?article\nWITH {\nSELECT *\nWHERE {\n?article schema:about ?item ;\nschema:isPartOf <https://species.wikimedia.org/> .\n}\nLIMIT 200\n} AS %i\nWHERE {\nINCLUDE %i\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" . }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?article\nWITH {\nSELECT *\nWHERE {\n?article schema:about ?item ;\nschema:isPartOf <https://species.wikimedia.org/> .\n}\nLIMIT 200\n} AS %i\nWHERE {\nINCLUDE %i\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" . }\n}",
    "complexity": "complex"
  },
  {
    "id": "1751",
    "instruction": "List all GLAM institutions situated north of Umea.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?layerLabel ?coords WHERE {\nwd:Q25579 (p:P625/psv:P625/wikibase:geoLatitude) ?threshold.\n?item (wdt:P31/(wdt:P279*)) wd:Q1030034;\n(p:P625/psv:P625) _:b12.\n_:b12 wikibase:geoLatitude ?northernmostLat.\nOPTIONAL { ?item wdt:P17 ?layer. }\n?item wdt:P625 ?coords.\nFILTER(?northernmostLat > ?threshold)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],sv,ru,en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?layerLabel ?coords WHERE {\nwd:[entity:Ume\u00e5] (p:[property:coordinate location]/psv:[property:coordinate location]/wikibase:geoLatitude) ?threshold.\n?item (wdt:[property:instance of]/(wdt:[property:subclass of]*)) wd:[entity:GLAM];\n(p:[property:coordinate location]/psv:[property:coordinate location]) _:b12.\n_:b12 wikibase:geoLatitude ?northernmostLat.\nOPTIONAL { ?item wdt:[property:country] ?layer. }\n?item wdt:[property:coordinate location] ?coords.\nFILTER(?northernmostLat > ?threshold)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],sv,ru,en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "1386",
    "instruction": "List all HMDB identifiers that have multiple items associated with them.",
    "query": "SELECT * WHERE {\n{\nSELECT ?id (COUNT(?obj) AS ?count) (GROUP_CONCAT(?obj; SEPARATOR = \" , \") AS ?items) WHERE { ?obj wdt:P2057 ?id. }\nGROUP BY ?id\n}\nFILTER(?count > 1)\n}",
    "annotated": "PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT * WHERE {\n{\nSELECT ?id (COUNT(?obj) AS ?count) (GROUP_CONCAT(?obj; SEPARATOR = \" , \") AS ?items) WHERE { ?obj wdt:[property:Human Metabolome Database ID] ?id. }\nGROUP BY ?id\n}\nFILTER(?count > 1)\n}",
    "complexity": "complex"
  },
  {
    "id": "1056",
    "instruction": "List celestial bodies with coordinates on globes other than Earth.",
    "query": "SELECT ?item ?itemLabel ?globeLabel ?coordinates WITH {\nSELECT DISTINCT ?globe WHERE {\n[] wikibase:geoGlobe ?globe.\n}\n} AS %globes WHERE {\nINCLUDE %globes.\nFILTER(?globe != wd:Q2).\n?item p:P625 [\nps:P625 ?coordinates;\npsv:P625/wikibase:geoGlobe ?globe\n].\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?globeLabel ?coordinates WITH {\nSELECT DISTINCT ?globe WHERE {\n[] wikibase:geoGlobe ?globe.\n}\n} AS %globes WHERE {\nINCLUDE %globes.\nFILTER(?globe != wd:[entity:Earth]).\n?item p:[property:coordinate location] [\nps:[property:coordinate location] ?coordinates;\npsv:[property:coordinate location]/wikibase:geoGlobe ?globe\n].\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "1528",
    "instruction": "List the ages of American cast members in films released after 2000.",
    "query": "SELECT ?age (COUNT(?gender) as ?count) (SAMPLE(?genderLabel) AS ?genderLabel ) WHERE {\n?film wdt:P31 wd:Q11424.\n?film wdt:P577 ?date .\n?film wdt:P161 ?cast .\n# 57=director 58=screenwriter 86=composer 161=cast member 162=producer 344=photography 1431=executive producer\n?cast wdt:P27 wd:Q30 .\n?cast wdt:P569 ?dob .\n?cast wdt:P21 ?gender .\n?gender rdfs:label ?genderLabel .\nFILTER((LANG(?genderLabel)) = \"en\")\nbind( 1000+year(?date)-year(?dob) as ?age_num )\nbind( SUBSTR(str(?age_num),1,4) as ?age )\nFILTER(BOUND(?age_num))\nFILTER(?age_num<=1100)\nFILTER(?age_num>=1000)\nFILTER(year(?date)>2000)\n#FILTER(year(?date)<2010)\n}\nGROUP BY ?genderLabel ?age\n#ORDER BY ?genderLabel ?age",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?age (COUNT(?gender) as ?count) (SAMPLE(?genderLabel) AS ?genderLabel ) WHERE {\n?film wdt:[property:instance of] wd:[entity:film].\n?film wdt:[property:publication date] ?date .\n?film wdt:[property:cast member] ?cast .\n# 57=director 58=screenwriter 86=composer 161=cast member 162=producer 344=photography 1431=executive producer\n?cast wdt:[property:country of citizenship] wd:[entity:United States of America] .\n?cast wdt:[property:date of birth] ?dob .\n?cast wdt:[property:sex or gender] ?gender .\n?gender rdfs:label ?genderLabel .\nFILTER((LANG(?genderLabel)) = \"en\")\nbind( 1000+year(?date)-year(?dob) as ?age_num )\nbind( SUBSTR(str(?age_num),1,4) as ?age )\nFILTER(BOUND(?age_num))\nFILTER(?age_num<=1100)\nFILTER(?age_num>=1000)\nFILTER(year(?date)>2000)\n#FILTER(year(?date)<2010)\n}\nGROUP BY ?genderLabel ?age\n#ORDER BY ?genderLabel ?age",
    "complexity": "complex"
  },
  {
    "id": "573",
    "instruction": "Find ATMs in Munich that belong to the Bankcard-Servicenetz interbank network.",
    "query": "SELECT ?atm ?geometry ?bank ?bankLabel WHERE {\nhint:Query hint:optimizer \"None\".\nSERVICE <http://linkedgeodata.org/sparql> {\n{ ?atm a lgdo:Bank; lgdo:atm true. }\nUNION { ?atm a lgdo:Atm. }\n?atm geom:geometry [geo:asWKT ?geometry];\nlgdo:operator ?operator.\nFILTER(bif:st_intersects(?geometry, bif:st_point(11.5746898, 48.1479876), 5)) # 5 km around Munich\n}\nBIND(STRLANG(?operator, \"de\") as ?bankLabel)\n?bank rdfs:label ?bankLabel.\n# bank is part of the Bankcard service network, either via an explicit statement or implicitly due to its legal form (unless explicitly excluded)\n{ ?bank wdt:P527 wd:Q806724. }\nUNION { ?bank wdt:P1454 wd:Q5349747. }\nMINUS { wd:Q806724 wdt:P3113 ?bank. }\n}",
    "annotated": "PREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX hint: <http://www.bigdata.com/queryHints#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX lgdo: <http://linkedgeodata.org/ontology/>\nPREFIX geom: <http://geovocab.org/geometry#>\nPREFIX bif: <http://www.openlinksw.com/schemas/bif#>\n\nSELECT ?atm ?geometry ?bank ?bankLabel WHERE {\nhint:Query hint:optimizer \"None\".\nSERVICE <http://linkedgeodata.org/sparql> {\n{ ?atm a lgdo:Bank; lgdo:atm true. }\nUNION { ?atm a lgdo:Atm. }\n?atm geom:geometry [geo:asWKT ?geometry];\nlgdo:operator ?operator.\nFILTER(bif:st_intersects(?geometry, bif:st_point(11.5746898, 48.1479876), 5)) # 5 km around Munich\n}\nBIND(STRLANG(?operator, \"de\") as ?bankLabel)\n?bank rdfs:label ?bankLabel.\n# bank is part of the Bankcard service network, either via an explicit statement or implicitly due to its legal form (unless explicitly excluded)\n{ ?bank wdt:[property:has part(s)] wd:[entity:Bankcard-Servicenetz]. }\nUNION { ?bank wdt:[property:legal form] wd:[entity:Eingetragene Genossenschaft]. }\nMINUS { wd:[entity:Bankcard-Servicenetz] wdt:[property:does not have part] ?bank. }\n}",
    "complexity": "complex"
  },
  {
    "id": "98",
    "instruction": "What are the properties of a thesis?",
    "query": "SELECT ?prop ?propLabel ?count ?exampleLabel WHERE {\n{\nSELECT ?prop (COUNT(DISTINCT ?item) AS ?count) (SAMPLE(?id) AS ?example) WHERE {\nhint:Query hint:optimizer \"None\" .\n?classes wdt:P279* wd:Q1266946 .\n?item wdt:P31 ?classes .\n?item ?p ?id .\n?prop wikibase:directClaim ?p\n} GROUP BY ?prop\n}\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\"\n}\n} ORDER BY DESC (?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX hint: <http://www.bigdata.com/queryHints#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?prop ?propLabel ?count ?exampleLabel WHERE {\n{\nSELECT ?prop (COUNT(DISTINCT ?item) AS ?count) (SAMPLE(?id) AS ?example) WHERE {\nhint:Query hint:optimizer \"None\" .\n?classes wdt:[property:subclass of]* wd:[entity:thesis] .\n?item wdt:[property:instance of] ?classes .\n?item ?p ?id .\n?prop wikibase:directClaim ?p\n} GROUP BY ?prop\n}\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\"\n}\n} ORDER BY DESC (?count)",
    "complexity": "complex"
  },
  {
    "id": "1113",
    "instruction": "List all the mayors of D\u00fcsseldorf along with their tenure periods.",
    "query": "SELECT ?mayor ?mayorLabel ?end ?date (SAMPLE(?photo) AS ?pic)\nWHERE {\nwd:Q1718 p:P6 ?mayorStatement .\n?mayorStatement ps:P6 ?mayor ;\npq:P580 ?date .\nOPTIONAL { ?mayorStatement ps:P6 ?mayor ; pq:P582 ?end . }\nOPTIONAL { ?mayor wdt:P18 ?photo . }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n}GROUP BY ?mayor ?mayorLabel ?date ?end\nORDER BY ?date",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?mayor ?mayorLabel ?end ?date (SAMPLE(?photo) AS ?pic)\nWHERE {\nwd:[entity:D\u00fcsseldorf] p:[property:head of government] ?mayorStatement .\n?mayorStatement ps:[property:head of government] ?mayor ;\npq:[property:start time] ?date .\nOPTIONAL { ?mayorStatement ps:[property:head of government] ?mayor ; pq:[property:end time] ?end . }\nOPTIONAL { ?mayor wdt:[property:image] ?photo . }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n}GROUP BY ?mayor ?mayorLabel ?date ?end\nORDER BY ?date",
    "complexity": "complex"
  },
  {
    "id": "2701",
    "instruction": "List the educational institutions attended by French prefects.",
    "query": "SELECT ?formationLabel (COUNT(DISTINCT ?prefet) AS ?nb) WHERE {\n?prefet p:P39 ?position.\n?position ps:P39 ?prefetde.\n?prefetde (wdt:P279*) wd:Q1285463.\n?prefet wdt:P69 ?formation .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?formationLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?formationLabel (COUNT(DISTINCT ?prefet) AS ?nb) WHERE {\n?prefet p:[property:position held] ?position.\n?position ps:[property:position held] ?prefetde.\n?prefetde (wdt:[property:subclass of]*) wd:[entity:prefect].\n?prefet wdt:[property:educated at] ?formation .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?formationLabel",
    "complexity": "complex"
  },
  {
    "id": "568",
    "instruction": "How many US states share a border with this state?",
    "query": "SELECT ?state ?stateLabel ?borders\nWHERE\n{\n{\nSELECT ?state (COUNT(?otherState) as ?borders)\nWHERE\n{\n?state wdt:P31 wd:Q35657 .\n?otherState wdt:P47 ?state .\n?otherState wdt:P31 wd:Q35657 .\n}\nGROUP BY ?state\n}\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" .\n}\n}\nORDER BY DESC(?borders)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?state ?stateLabel ?borders\nWHERE\n{\n{\nSELECT ?state (COUNT(?otherState) as ?borders)\nWHERE\n{\n?state wdt:[property:instance of] wd:[entity:U.S. state] .\n?otherState wdt:[property:shares border with] ?state .\n?otherState wdt:[property:instance of] wd:[entity:U.S. state] .\n}\nGROUP BY ?state\n}\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" .\n}\n}\nORDER BY DESC(?borders)",
    "complexity": "complex"
  }
]