[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "403",
    "instruction": "List all books written by Q35610, including their titles, illustrators, publishers, and publication dates if available.",
    "query": "SELECT\n?president\n?relationshipEnd\nWHERE {\n?president wdt:P31 wd:Q5 . # required wdt:P31\n?president p:P39 ?position_held_statement . # required p:P39\n?position_held_statement ps:P39 wd:Q11696 . # required ps:P39\n?president p:P26/pq:P582 ?relationshipEnd # required p:P26 and pq:P582\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT\n?president\n?relationshipEnd\nWHERE {\n?president wdt:[property:instance of] wd:[entity:human] . # required wdt:[property:instance of]\n?president p:[property:position held] ?position_held_statement . # required p:[property:position held]\n?position_held_statement ps:[property:position held] wd:[entity:President of the United States] . # required ps:[property:position held]\n?president p:[property:spouse]/pq:[property:end time] ?relationshipEnd # required p:[property:spouse] and pq:[property:end time]\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "2322",
    "instruction": "List the street names in Strasbourg with bilingual signs.",
    "query": "SELECT ?item ?_image ?plaque_fr ?plaque_als WHERE {\n?item wdt:P912 wd:Q104123038;\nwdt:P131 wd:Q6602;\nwdt:P1766 ?_image;\nwdt:P1448 ?plaque_fr;\nwdt:P1448 ?plaque_als.\nfilter (lang(?plaque_fr) = \"fr\").\nfilter (lang(?plaque_als) = \"gsw-fr\")\n}",
    "annotated": "PREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?item ?_image ?plaque_fr ?plaque_als WHERE {\n?item wdt:[property:has facility] wd:[entity:bilingual street name sign];\nwdt:[property:located in the administrative territorial entity] wd:[entity:Strasbourg];\nwdt:[property:place name sign] ?_image;\nwdt:[property:official name] ?plaque_fr;\nwdt:[property:official name] ?plaque_als.\nfilter (lang(?plaque_fr) = \"fr\").\nfilter (lang(?plaque_als) = \"gsw-fr\")\n}",
    "complexity": "medium"
  },
  {
    "id": "2412",
    "instruction": "Show me a list of mosques with their coordinates.",
    "query": "SELECT ?library ?libraryLabel ?coords WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?library (wdt:P31/wdt:P279*) wd:Q32815.\n?library wdt:P625 ?coords.\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?library ?libraryLabel ?coords WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?library (wdt:[property:instance of]/wdt:[property:subclass of]*) wd:[entity:mosque].\n?library wdt:[property:coordinate location] ?coords.\n}",
    "complexity": "medium"
  },
  {
    "id": "1474",
    "instruction": "List the standards bodies in order of the number of standards they are connected to.",
    "query": "SELECT ?body ?bodyLabel (COUNT(?standard) AS ?count)\nWHERE {\n?standard wdt:P1462 ?body .\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n}\nGROUP BY ?body ?bodyLabel\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?body ?bodyLabel (COUNT(?standard) AS ?count)\nWHERE {\n?standard wdt:[property:standards body] ?body .\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n}\nGROUP BY ?body ?bodyLabel\nORDER BY DESC(?count)",
    "complexity": "medium"
  },
  {
    "id": "2225",
    "instruction": "List all temples in Thailand along with their coordinates.",
    "query": "SELECT DISTINCT ?wat ?watLabel ?coord WHERE {\n?wat wdt:P31 wd:Q427287.\n?wat wdt:P17 wd:Q869.\nOPTIONAL { ?wat wdt:P625 ?coord. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],th\". }\n}\nORDER BY ?watLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?wat ?watLabel ?coord WHERE {\n?wat wdt:[property:instance of] wd:[entity:wat].\n?wat wdt:[property:country] wd:[entity:Thailand].\nOPTIONAL { ?wat wdt:[property:coordinate location] ?coord. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],th\". }\n}\nORDER BY ?watLabel",
    "complexity": "medium"
  },
  {
    "id": "754",
    "instruction": "Get a list of humans born in 2015 by filtering the results with the year of birth.",
    "query": "SELECT ?item ?itemLabel ?bblid\nWHERE {\n?item wdt:P2580 ?bblid .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\nFILTER(!REGEX(STR(?bblid), \"^[A-Za-z][-.0-9A-Za-z]{1,}$\"))\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?bblid\nWHERE {\n?item wdt:[property:P2580] ?bblid .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\nFILTER(!REGEX(STR(?bblid), \"^[A-Za-z][-.0-9A-Za-z]{1,}$\"))\n}",
    "complexity": "medium"
  },
  {
    "id": "697",
    "instruction": "Show me ten random paintings.",
    "query": "SELECT ?item ?itemLabel ?image (MD5(CONCAT(str(?item),str(RAND()))) as ?random) WHERE {\n?item wdt:P31 wd:Q3305213.\n?item wdt:P18 ?image.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\"}\n} ORDER BY ?random\nLIMIT 10",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?image (MD5(CONCAT(str(?item),str(RAND()))) as ?random) WHERE {\n?item wdt:[property:instance of] wd:[entity:painting].\n?item wdt:[property:image] ?image.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\"}\n} ORDER BY ?random\nLIMIT 10",
    "complexity": "medium"
  },
  {
    "id": "90",
    "instruction": "List all lifeboat stations without a known location.",
    "query": "SELECT ?station ?stationLabel ?countryLabel\nWHERE {\n?station wdt:P31 wd:Q11997323;\nwdt:P17 ?country.\nMINUS {?station wdt:P625 ?location}\nSERVICE wikibase:label {bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,no,sv,da,de\"}\n} ORDER BY ?countryLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?station ?stationLabel ?countryLabel\nWHERE {\n?station wdt:[property:instance of] wd:[entity:lifeboat station];\nwdt:[property:country] ?country.\nMINUS {?station wdt:[property:coordinate location] ?location}\nSERVICE wikibase:label {bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,no,sv,da,de\"}\n} ORDER BY ?countryLabel",
    "complexity": "medium"
  },
  {
    "id": "495",
    "instruction": "What are the most common eye colors among humans?",
    "query": "SELECT ?eyeColor ?eyeColorLabel ?rgb (COUNT(?human) AS ?count)\nWHERE\n{\n?human wdt:P31 wd:Q5.\n?human wdt:P1340 ?eyeColor.\nOPTIONAL { ?eyeColor wdt:P465 ?rgb. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?eyeColor ?eyeColorLabel ?rgb\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?eyeColor ?eyeColorLabel ?rgb (COUNT(?human) AS ?count)\nWHERE\n{\n?human wdt:[property:instance of] wd:[entity:human].\n?human wdt:[property:eye color] ?eyeColor.\nOPTIONAL { ?eyeColor wdt:[property:sRGB color hex triplet] ?rgb. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?eyeColor ?eyeColorLabel ?rgb\nORDER BY DESC(?count)",
    "complexity": "medium"
  },
  {
    "id": "2475",
    "instruction": "List all municipalities in Puy-de-D\u00f4me with their twinned towns.",
    "query": "SELECT ?commune ?twin ?twinLabel ?layer ?coord WHERE {\n?commune wdt:P131+ wd:Q12694 ; wdt:P190 ?twin .\n?twin wdt:P625 ?coord .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\".\n?commune rdfs:label ?layer }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?commune ?twin ?twinLabel ?layer ?coord WHERE {\n?commune wdt:[property:located in the administrative territorial entity]+ wd:[entity:Puy-de-D\u00f4me] ; wdt:[property:twinned administrative body] ?twin .\n?twin wdt:[property:coordinate location] ?coord .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\".\n?commune rdfs:label ?layer }\n}",
    "complexity": "medium"
  },
  {
    "id": "1491",
    "instruction": "List all organic acids with their corresponding images.",
    "query": "SELECT ?compound ?compoundLabel ?image WHERE {\n?compound wdt:P279+|wdt:P31+ wd:Q421948 ;\nwdt:P18 ?image .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?compound ?compoundLabel ?image WHERE {\n?compound wdt:[property:subclass of]+|wdt:[property:instance of]+ wd:[entity:organic acid] ;\nwdt:[property:image] ?image .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "1273",
    "instruction": "List all software developed by groups within Google.",
    "query": "SELECT ?item ?itemLabel ?dev ?devLabel ?logo WHERE {\n?item wdt:P178 ?dev.\n?dev wdt:P361 wd:Q95.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?dev ?devLabel ?logo WHERE {\n?item wdt:[property:developer] ?dev.\n?dev wdt:[property:part of] wd:[entity:Google].\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "1460",
    "instruction": "List all movies directed by Steven Spielberg along with their durations.",
    "query": "SELECT DISTINCT ?movieLabel ?duration WHERE {\n?movie wdt:P57 wd:Q8877 ; # film directed by Steven Spielberg\nwdt:P2047 ?duration . # the duration of the film\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?movieLabel ?duration WHERE {\n?movie wdt:[property:director] wd:[entity:Steven Spielberg] ; # film directed by Steven Spielberg\nwdt:[property:duration] ?duration . # the duration of the film\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "1413",
    "instruction": "List all Harry Potter characters with their family relationships.",
    "query": "SELECT ?character ?characterLabel ?linkTo WHERE {\n?character wdt:P31/wdt:P279* wd:Q208255;\nwdt:P22|wdt:P25|wdt:P40|wdt:P1038|wdt:P3373 ?linkTo.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,pt\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?character ?characterLabel ?linkTo WHERE {\n?character wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:list of Harry Potter characters];\nwdt:[property:father]|wdt:[property:mother]|wdt:[property:child]|wdt:[property:relative]|wdt:[property:sibling] ?linkTo.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,pt\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "599",
    "instruction": "Find the pathways with identifier WP716 and list their local annotations.",
    "query": "SELECT DISTINCT ?item ?pw_annotation WHERE {\nVALUES ?wpid {\"WP716\"}\n?item wdt:P2410 ?wpid ;\nwdt:P2888 ?source_pathway .\nSERVICE <http://sparql.wikipathways.org/sparql> {\n?wp_pathway dc:identifier ?source_pathway .\n?wp_pathway wp:ontologyTag ?pw_annotation .\n# ?pw_annotation rdfs:label ?annotation_label .\n}\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wp: <http://vocabularies.wikipathways.org/wp#>\n\nSELECT DISTINCT ?item ?pw_annotation WHERE {\nVALUES ?wpid {\"WP716\"}\n?item wdt:[property:WikiPathways ID] ?wpid ;\nwdt:[property:exact match] ?source_pathway .\nSERVICE <http://sparql.wikipathways.org/sparql> {\n?wp_pathway dc:identifier ?source_pathway .\n?wp_pathway wp:ontologyTag ?pw_annotation .\n# ?pw_annotation rdfs:label ?annotation_label .\n}\n}",
    "complexity": "medium"
  },
  {
    "id": "1503",
    "instruction": "List all organic acids with their corresponding images.",
    "query": "SELECT ?compound ?compoundLabel ?image WHERE {\n?compound wdt:P279+|wdt:P31+ wd:Q421948 ;\nwdt:P18|wdt:P117 ?image .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?compound ?compoundLabel ?image WHERE {\n?compound wdt:[property:subclass of]+|wdt:[property:instance of]+ wd:[entity:organic acid] ;\nwdt:[property:image]|wdt:[property:chemical structure] ?image .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "2739",
    "instruction": "List all movie titles containing the word 'it'.",
    "query": "SELECT ?item ?itemLabel ?title\nWHERE {\n?item wdt:P31 wd:Q11424;\nwdt:P1476 ?title.\nFILTER (CONTAINS(?title, ' it ') || CONTAINS(?title, ' It '))\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\nOPTIONAL { ?item wdt:P18 ?_image. }\n}\nORDER BY (?title)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?title\nWHERE {\n?item wdt:[property:instance of] wd:[entity:film];\nwdt:[property:title] ?title.\nFILTER (CONTAINS(?title, ' it ') || CONTAINS(?title, ' It '))\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\nOPTIONAL { ?item wdt:[property:image] ?_image. }\n}\nORDER BY (?title)",
    "complexity": "medium"
  },
  {
    "id": "2462",
    "instruction": "Find artworks that feature snow as a main theme.",
    "query": "SELECT ?q ?qLabel (SAMPLE(?img) AS ?image) WHERE {\n?q wdt:P180 ?depeint ; wdt:P18 ?img .\n?depeint ?prop wd:Q7561 .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?q ?qLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?q ?qLabel (SAMPLE(?img) AS ?image) WHERE {\n?q wdt:[property:image]0 ?depeint ; wdt:[property:image] ?img .\n?depeint ?prop wd:[entity:snow] .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?q ?qLabel",
    "complexity": "medium"
  },
  {
    "id": "1551",
    "instruction": "List the streets in the Netherlands named after a female figure mentioned in Els Kloek's book.",
    "query": "SELECT DISTINCT ?street ?streetLabel ?womanLabel WHERE {\n?street wdt:P17 wd:Q55 ;\nwdt:P31 wd:Q79007 ;\nwdt:P138 ?woman .\n?woman wdt:P21 wd:Q6581072 ;\nwdt:P1343 wd:Q20031271 .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?street ?streetLabel ?womanLabel WHERE {\n?street wdt:[property:country] wd:[entity:Netherlands] ;\nwdt:[property:instance of] wd:[entity:street] ;\nwdt:[property:named after] ?woman .\n?woman wdt:[property:sex or gender] wd:[entity:female] ;\nwdt:[property:described by source] wd:[entity:1001 vrouwen in de 20ste eeuw] .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "2208",
    "instruction": "List all Summer Olympics with their start dates.",
    "query": "SELECT ?jo ?joLabel ?date WHERE {\n?jo wdt:P31 wd:Q159821 ;\nwdt:P580 ?date .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"es\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?jo ?joLabel ?date WHERE {\n?jo wdt:[property:instance of] wd:[entity:Summer Olympic Games] ;\nwdt:[property:start time] ?date .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"es\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "64",
    "instruction": "Show me a map of UNESCO Biosphere Reserves with coordinates and images, excluding those with English Wikipedia articles.",
    "query": "SELECT ?wikidata_item ?biosphere_reserve_name ?biosphereURL ?image ?location\nWHERE {\n?wikidata_item wdt:P2520 ?biosphereURL ; # get a list of all biospheres\nwdt:P625 ?location # and location\nOPTIONAL{ ?wikidata_item wdt:P18 ?image }\nFILTER NOT EXISTS { ?enwp schema:about ?wikidata_item ; schema:isPartOf <https://en.wikipedia.org/> } # No article in English wikipedia\n?wikidata_item rdfs:label ?biosphere_reserve_name filter (lang(?biosphere_reserve_name) = \"en\")\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?wikidata_item ?biosphere_reserve_name ?biosphereURL ?image ?location\nWHERE {\n?wikidata_item wdt:[property:UNESCO Biosphere Reserve URL] ?biosphereURL ; # get a list of all biospheres\nwdt:[property:coordinate location] ?location # and location\nOPTIONAL{ ?wikidata_item wdt:[property:image] ?image }\nFILTER NOT EXISTS { ?enwp schema:about ?wikidata_item ; schema:isPartOf <https://en.wikipedia.org/> } # No article in English wikipedia\n?wikidata_item rdfs:label ?biosphere_reserve_name filter (lang(?biosphere_reserve_name) = \"en\")\n}",
    "complexity": "medium"
  },
  {
    "id": "2820",
    "instruction": "List all Wikidata properties with URLs that match a specific format.",
    "query": "SELECT ?p ?pLabel ?url WHERE {\n?p wdt:P1630 ?url .\nFILTER ( REGEX ( ?url , \"http://data.culture.fr/thesaurus/page/ark:/67717/\" ) )\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY ?p",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?p ?pLabel ?url WHERE {\n?p wdt:[property:formatter URL] ?url .\nFILTER ( REGEX ( ?url , \"http://data.culture.fr/thesaurus/page/ark:/67717/\" ) )\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY ?p",
    "complexity": "medium"
  },
  {
    "id": "2042",
    "instruction": "List artworks with images in Wikidata, organized by their creation year.",
    "query": "SELECT ?year (count(?margolan) AS ?count) WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?margolan wdt:P31 wd:Q3305213;\nwdt:P571 ?sorrera_data.\n?margolan wdt:P18 ?irudia.\nBIND(YEAR(?sorrera_data) as ?year).\nFILTER(?year > 1)\n}\nGROUP by ?year\nORDER by ASC(?year)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?year (count(?margolan) AS ?count) WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?margolan wdt:[property:instance of] wd:[entity:painting];\nwdt:[property:inception] ?sorrera_data.\n?margolan wdt:[property:image] ?irudia.\nBIND(YEAR(?sorrera_data) as ?year).\nFILTER(?year > 1)\n}\nGROUP by ?year\nORDER by ASC(?year)",
    "complexity": "medium"
  },
  {
    "id": "1743",
    "instruction": "What is the longest English word that does not have any repeated letters?",
    "query": "PREFIX dct: <http://purl.org/dc/terms/> # workaround for T233148\nSELECT ?lexeme ?lemma (STRLEN(?lemma) AS ?length) WHERE {\nBIND(wd:Q1860 AS ?language)\n?lexeme dct:language ?language;\nwikibase:lemma ?lemma.\nFILTER(STRLEN(?lemma) >= 10) # cheap filter to avoid running REGEX() on too many lemmata\nFILTER(!REGEX(LCASE(?lemma), \"(.).*\\\\1\"))\nFILTER(!CONTAINS(?lemma, \" \"))\n}\nORDER BY DESC(?length)\nLIMIT 10",
    "annotated": "PREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nPREFIX dct: <http://purl.org/dc/terms/> # workaround for T233148\nSELECT ?lexeme ?lemma (STRLEN(?lemma) AS ?length) WHERE {\nBIND(wd:[entity:English] AS ?language)\n?lexeme dct:language ?language;\nwikibase:lemma ?lemma.\nFILTER(STRLEN(?lemma) >= 10) # cheap filter to avoid running REGEX() on too many lemmata\nFILTER(!REGEX(LCASE(?lemma), \"(.).*\\\\1\"))\nFILTER(!CONTAINS(?lemma, \" \"))\n}\nORDER BY DESC(?length)\nLIMIT 10",
    "complexity": "medium"
  },
  {
    "id": "223",
    "instruction": "List all oil paintings that don't use oil paint as a material.",
    "query": "SELECT ?item ?itemLabel ?itemDescription ?collectionLabel WHERE {\n?item wdt:P31 wd:Q56676227\nMINUS {?item wdt:P186 wd:Q296955}\nOPTIONAL {?item wdt:P195 ?collection}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?itemDescription ?collectionLabel WHERE {\n?item wdt:[property:instance of] wd:[entity:oil painting]\nMINUS {?item wdt:[property:made from material] wd:[entity:oil paint]}\nOPTIONAL {?item wdt:[property:collection] ?collection}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "455",
    "instruction": "List all properties that use the qualifier 'reason for deprecated rank' with value 'link rot'.",
    "query": "SELECT ?item ?itemLabel ?property ?value WHERE {\n?item ?property ?value.\n?value pq:P2241 wd:Q1193907.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} LIMIT 200",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?property ?value WHERE {\n?item ?property ?value.\n?value pq:[property:reason for deprecated rank] wd:[entity:link rot].\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} LIMIT 200",
    "complexity": "medium"
  },
  {
    "id": "266",
    "instruction": "Find objects with two different Ashmolean Museum IDs where the first ID is greater than the second.",
    "query": "SELECT * WHERE {\n?i wdt:P6610 ?id1; wdt:P6610 ?id2 FILTER (?id1 > ?id2)\n}",
    "annotated": "PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT * WHERE {\n?i wdt:[property:Ashmolean museum ID] ?id1; wdt:[property:Ashmolean museum ID] ?id2 FILTER (?id1 > ?id2)\n}",
    "complexity": "medium"
  },
  {
    "id": "1372",
    "instruction": "Find statues of Joan of Arc on horseback and list their locations.",
    "query": "SELECT ?item ?itemLabel ?creatorLabel ?coords ?image WHERE {\n?item wdt:P180 wd:Q7226 ;\nwdt:P136 wd:Q659396 ;\nwdt:P625 ?coords .\nOPTIONAL { ?item wdt:P170 ?creator }\nOPTIONAL { ?item wdt:P18 ?image }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} ORDER BY ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?creatorLabel ?coords ?image WHERE {\n?item wdt:[property:image]0 wd:[entity:Joan of Arc] ;\nwdt:[property:genre] wd:[entity:equestrian statue] ;\nwdt:[property:coordinate location] ?coords .\nOPTIONAL { ?item wdt:[property:creator] ?creator }\nOPTIONAL { ?item wdt:[property:image] ?image }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} ORDER BY ?itemLabel",
    "complexity": "medium"
  },
  {
    "id": "1554",
    "instruction": "List all ACM Fellows who have given TED talks.",
    "query": "SELECT ?item ?itemLabel ?tedtalkLabel ?image WHERE {\n?item wdt:P166 wd:Q18748039.\n?item wdt:P2611 ?ted.\nOPTIONAL { ?item wdt:P18 ?image. }\n?tedtalk wdt:P31 wd:Q23011722.\n?tedtalk wdt:P50 ?item.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?tedtalkLabel ?image WHERE {\n?item wdt:[property:award received] wd:[entity:ACM Fellow].\n?item wdt:[property:TED speaker ID] ?ted.\nOPTIONAL { ?item wdt:[property:image] ?image. }\n?tedtalk wdt:[property:instance of] wd:[entity:TED talk].\n?tedtalk wdt:[property:author] ?item.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "1433",
    "instruction": "What are the colors used on national flags?",
    "query": "SELECT distinct ?colorLabel ?hexa WHERE {\n?item wdt:P31 wd:Q186516 ; wdt:P462 ?color .\noptional { ?color wdt:P465 ?hexa }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT distinct ?colorLabel ?hexa WHERE {\n?item wdt:[property:instance of] wd:[entity:national flag] ; wdt:[property:color] ?color .\noptional { ?color wdt:[property:sRGB color hex triplet] ?hexa }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "711",
    "instruction": "List the rectors of Padua University along with their tenure duration.",
    "query": "SELECT ?rettore ?rettoreLabel ?starttime ?endtime WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?rettore p:P106 [\nps:P106 wd:Q212071; # is a Rector\npq:P642 wd:Q193510; # of Padua Univerity\npq:P580 ?starttime;\npq:P582 ?endtime\n].\n}\nORDER BY ?starttime",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?rettore ?rettoreLabel ?starttime ?endtime WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?rettore p:[property:occupation] [\nps:[property:occupation] wd:[entity:rector]; # is a Rector\npq:[property:of] wd:[entity:University of Padua]; # of Padua Univerity\npq:[property:start time] ?starttime;\npq:[property:end time] ?endtime\n].\n}\nORDER BY ?starttime",
    "complexity": "medium"
  },
  {
    "id": "2794",
    "instruction": "List universities with Mastodon accounts by country.",
    "query": "SELECT DISTINCT ?countryLabel ?item ?itemLabel ?masto_ac WHERE {\n?item wdt:P31/wdt:P279* wd:Q3918 .\n#?item wdt:P131 ?council .\n#?council wdt:P31 wd:Q15060255 .\n?item wdt:P17 ?country .\n?item wdt:P4033 ?masto_ac .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY ?countryLabel ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?countryLabel ?item ?itemLabel ?masto_ac WHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:university] .\n#?item wdt:[property:located in the administrative territorial entity] ?council .\n#?council wdt:[property:instance of] wd:[entity:Scottish council area] .\n?item wdt:[property:country] ?country .\n?item wdt:[property:Mastodon address] ?masto_ac .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY ?countryLabel ?itemLabel",
    "complexity": "medium"
  },
  {
    "id": "2147",
    "instruction": "What is the population of cities in Germany?",
    "query": "SELECT DISTINCT ?city ?cityLabel ?population WHERE {\n?city wdt:P31/wdt:P279* wd:Q486972;\nwdt:P17 wd:Q183;\nwdt:P1082 ?population;\nFILTER (abs(?population - 41962) < 100)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],nl\" }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?city ?cityLabel ?population WHERE {\n?city wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:human settlement];\nwdt:[property:country] wd:[entity:Germany];\nwdt:[property:population] ?population;\nFILTER (abs(?population - 41962) < 100)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],nl\" }\n}",
    "complexity": "medium"
  }
]