[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "563",
    "instruction": "List all bridges over rivers in the former government district of Leipzig.",
    "query": "SELECT (SAMPLE(?bridge) AS ?bridge) (SAMPLE(?bridgeLabel) AS ?bridgeLabel)\n(SAMPLE(?watercourse) AS ?watercourse) (SAMPLE(?watercourseLabel) AS ?watercourseLabel)\n(SAMPLE(?loc) AS ?loc) (SAMPLE(?pic) AS ?pic)\n(CONCAT(SAMPLE(?sKey),\": \",STR(YEAR(SAMPLE(?s)))) AS ?start)\n(CONCAT(SAMPLE(?eKey),\": \",STR(YEAR(SAMPLE(?e)))) AS ?end)\n(SAMPLE(?article) AS ?article) (IF(BOUND(?article),CONCAT(?bridgeLabel,\" in Wikipedia\"),1/0) AS ?articleLabel)\nWHERE {\n{\nSELECT ?bridge ?watercourse WHERE {\n?bridge wdt:P31/wdt:P279* wd:Q12280; wdt:P177 ?watercourse.\n?watercourse wdt:P31/wdt:P279* wd:Q355304.\n# the following actually yields a perf penalty atm\n#?bridge wdt:P17 wd:Q183.\n#OPTIONAL { ?bridge wdt:P17 ?country. }. FILTER(!BOUND(?country) {{!",
    "annotated": "PREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT (SAMPLE(?bridge) AS ?bridge) (SAMPLE(?bridgeLabel) AS ?bridgeLabel)\n(SAMPLE(?watercourse) AS ?watercourse) (SAMPLE(?watercourseLabel) AS ?watercourseLabel)\n(SAMPLE(?loc) AS ?loc) (SAMPLE(?pic) AS ?pic)\n(CONCAT(SAMPLE(?sKey),\": \",STR(YEAR(SAMPLE(?s)))) AS ?start)\n(CONCAT(SAMPLE(?eKey),\": \",STR(YEAR(SAMPLE(?e)))) AS ?end)\n(SAMPLE(?article) AS ?article) (IF(BOUND(?article),CONCAT(?bridgeLabel,\" in Wikipedia\"),1/0) AS ?articleLabel)\nWHERE {\n{\nSELECT ?bridge ?watercourse WHERE {\n?bridge wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:bridge]; wdt:[property:country]7 ?watercourse.\n?watercourse wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:watercourse].\n# the following actually yields a perf penalty atm\n#?bridge wdt:[property:country] wd:[entity:Germany].\n#OPTIONAL { ?bridge wdt:[property:country] ?country. }. FILTER(!BOUND(?country) {{!",
    "complexity": "complex"
  },
  {
    "id": "25",
    "instruction": "List all colleges and permanent private halls of the University of Oxford with their official websites.",
    "query": "SELECT DISTINCT ?web ?collegeLabel (IF(BOUND(?hq), ?hq, ?coord) as ?location) ?arms WHERE {\n{?college wdt:P31 wd:Q2581649} UNION {?college wdt:P31 wd:Q3338504}\nMINUS {?college wdt:P576 []}\nOPTIONAL { ?college p:P159/pq:P625 ?hq }\nOPTIONAL { ?college wdt:P625 ?coord }\n?college wdt:P94 ?arms;\nwdt:P856 ?web\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?web ?collegeLabel (IF(BOUND(?hq), ?hq, ?coord) as ?location) ?arms WHERE {\n{?college wdt:[property:instance of] wd:[entity:college of the University of Oxford]} UNION {?college wdt:[property:instance of] wd:[entity:Permanent Private Hall]}\nMINUS {?college wdt:[property:dissolved, abolished or demolished date] []}\nOPTIONAL { ?college p:[property:headquarters location]/pq:[property:coordinate location] ?hq }\nOPTIONAL { ?college wdt:[property:coordinate location] ?coord }\n?college wdt:[property:coat of arms image] ?arms;\nwdt:[property:official website] ?web\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}",
    "complexity": "complex"
  },
  {
    "id": "162",
    "instruction": "List all things named 'cancer' in order of their popularity.",
    "query": "SELECT ?itemLabel ?item ?itemDescription ?sites WHERE {\nSERVICE wikibase:mwapi {\nbd:serviceParam wikibase:api \"EntitySearch\" .\nbd:serviceParam wikibase:endpoint \"www.wikidata.org\" .\nbd:serviceParam mwapi:search \"cancer\" .\nbd:serviceParam mwapi:language \"en\" .\n?item wikibase:apiOutputItem mwapi:item\n}\n?item wikibase:sitelinks ?sites.\nMINUS {?item wdt:P31 wd:Q4167410} # Exclude Wikimedia disambiguation pages\nSERVICE wikibase:label {bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\"}\n} ORDER BY DESC(?sites)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?itemLabel ?item ?itemDescription ?sites WHERE {\nSERVICE wikibase:mwapi {\nbd:serviceParam wikibase:api \"EntitySearch\" .\nbd:serviceParam wikibase:endpoint \"www.wikidata.org\" .\nbd:serviceParam mwapi:search \"cancer\" .\nbd:serviceParam mwapi:language \"en\" .\n?item wikibase:apiOutputItem mwapi:item\n}\n?item wikibase:sitelinks ?sites.\nMINUS {?item wdt:[property:instance of] wd:[entity:Wikimedia disambiguation page]} # Exclude Wikimedia disambiguation pages\nSERVICE wikibase:label {bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\"}\n} ORDER BY DESC(?sites)",
    "complexity": "complex"
  },
  {
    "id": "2810",
    "instruction": "List all subcategories of the 'Villages in Saale-Holzland-Kreis' category on Commons.",
    "query": "SELECT ?item (SAMPLE(?coords) AS ?coord) ?itemLabel ?out WITH {\nSELECT DISTINCT ?out ?depth WHERE {\nSERVICE <https://query.wikidata.org/bigdata/namespace/categories/sparql> {\nSERVICE mediawiki:categoryTree {\nbd:serviceParam mediawiki:start <https://commons.wikimedia.org/wiki/Category:Villages_in_Saale-Holzland-Kreis> .\nbd:serviceParam mediawiki:direction 'Reverse' .\nbd:serviceParam mediawiki:depth 1 . # direct subcategories only\n}\n}\n}\n} AS %subquery WHERE {\nINCLUDE %subquery .\nFILTER(?depth = 1) . # remove the host category from results\nOPTIONAL {\n?out schema:about/wdt:P301? ?item .\nFILTER NOT EXISTS { ?item wdt:P31 wd:Q4167836 } # remove category items from results set\nOPTIONAL {\n?item wdt:P625 ?coords .\n}\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language 'de' }\n} GROUP BY ?item ?itemLabel ?out # to aggregate sample coordinates in case there are multiple P625 values in items",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item (SAMPLE(?coords) AS ?coord) ?itemLabel ?out WITH {\nSELECT DISTINCT ?out ?depth WHERE {\nSERVICE <https://query.wikidata.org/bigdata/namespace/categories/sparql> {\nSERVICE mediawiki:categoryTree {\nbd:serviceParam mediawiki:start <https://commons.wikimedia.org/wiki/Category:Villages_in_Saale-Holzland-Kreis> .\nbd:serviceParam mediawiki:direction 'Reverse' .\nbd:serviceParam mediawiki:depth 1 . # direct subcategories only\n}\n}\n}\n} AS %subquery WHERE {\nINCLUDE %subquery .\nFILTER(?depth = 1) . # remove the host category from results\nOPTIONAL {\n?out schema:about/wdt:[property:category's main topic]? ?item .\nFILTER NOT EXISTS { ?item wdt:[property:instance of] wd:[entity:Wikimedia category] } # remove category items from results set\nOPTIONAL {\n?item wdt:[property:coordinate location] ?coords .\n}\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language 'de' }\n} GROUP BY ?item ?itemLabel ?out # to aggregate sample coordinates in case there are multiple [property:coordinate location] values in items",
    "complexity": "complex"
  },
  {
    "id": "2672",
    "instruction": "Find instances of geographic regions with problematic references.",
    "query": "SELECT ?st ?itemLabel\nWITH {\nSELECT DISTINCT ?st ?item\nWHERE {\n?refnode pr:P248 ?statedin ;\n^prov:wasDerivedFrom ?st .\n?statedin wdt:P31/wdt:P279* wd:Q82794. # Geographic region\n?item ?p ?st.\n}\nLIMIT 250\n} AS %i\nWHERE {\nINCLUDE %i\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX prov: <http://www.w3.org/ns/prov#>\nPREFIX pr: <http://www.wikidata.org/prop/reference/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?st ?itemLabel\nWITH {\nSELECT DISTINCT ?st ?item\nWHERE {\n?refnode pr:[property:stated in] ?statedin ;\n^prov:wasDerivedFrom ?st .\n?statedin wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:geographic region]. # Geographic region\n?item ?p ?st.\n}\nLIMIT 250\n} AS %i\nWHERE {\nINCLUDE %i\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n}",
    "complexity": "complex"
  },
  {
    "id": "1321",
    "instruction": "List all the items in the Ashmolean Museum collection.",
    "query": "SELECT DISTINCT ?item ?Title ?Creator (YEAR(?Date) AS ?YearCreated) ?Image ?coord WHERE {\n{ ?item wdt:P195 wd:Q636400. } UNION { ?item wdt:P276 wd:Q636400. }\n?item rdfs:label ?Title.\nOPTIONAL {\n?item wdt:P170 ?QCreator.\nFILTER((LANG(?Creator)) = \"en\")\n}\nOPTIONAL { ?item wdt:P571 ?Date. }\nOPTIONAL { ?item wdt:P18 ?Image. }\nFILTER((LANG(?Title)) = \"en\")\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT DISTINCT ?item ?Title ?Creator (YEAR(?Date) AS ?YearCreated) ?Image ?coord WHERE {\n{ ?item wdt:[property:collection] wd:[entity:Ashmolean Museum]. } UNION { ?item wdt:[property:location] wd:[entity:Ashmolean Museum]. }\n?item rdfs:label ?Title.\nOPTIONAL {\n?item wdt:[property:creator] ?QCreator.\nFILTER((LANG(?Creator)) = \"en\")\n}\nOPTIONAL { ?item wdt:[property:inception] ?Date. }\nOPTIONAL { ?item wdt:[property:image] ?Image. }\nFILTER((LANG(?Title)) = \"en\")\n}",
    "complexity": "complex"
  },
  {
    "id": "2444",
    "instruction": "List UK Members of Parliament who left office and their reasons for leaving.",
    "query": "SELECT distinct ?dec ((?count/?decade_total)*100 as ?percent) ?causeLabel ?count\nWITH {\nselect (str(?decade) as ?dec) ?item ?cause where {\n?term wdt:P279 wd:Q16707842 . ?item p:P39 ?ps . ?ps ps:P39 ?term .\n?ps pq:P580 ?start . ?ps pq:P582 ?end . ?ps pq:P1534 ?cause .\nFILTER NOT EXISTS { ?term2 wdt:P279 wd:Q16707842 .\n?item p:P39 ?ps2 . ?ps2 ps:P39 ?term2 . ?ps2 pq:P580 ?start2 . filter (?ps != ?ps2)\noptional { ?ps2 pq:P582 ?end2 } BIND(COALESCE(?end2, ?start2) AS ?check) . filter (?check >= ?end) }\n# filter out any where they were still serving later on\nbind(year(?end) as ?year) . filter(?year >= 1870) . filter(?year < 2020) . bind((floor(?year/10)*10) as ?decade) .\n}\n} AS %members\nWHERE {\n{ SELECT ?dec (count(distinct ?item) as ?count) ?cause where\n{ INCLUDE %members } group by ?dec ?cause }\n{ SELECT ?dec (count(distinct ?item) as ?decade_total) where\n{ INCLUDE %members } group by ?dec }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\n#defaultView:BarChart",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT distinct ?dec ((?count/?decade_total)*100 as ?percent) ?causeLabel ?count\nWITH {\nselect (str(?decade) as ?dec) ?item ?cause where {\n?term wdt:[property:subclass of] wd:[entity:Member of Parliament] . ?item p:[property:position held] ?ps . ?ps ps:[property:position held] ?term .\n?ps pq:[property:start time] ?start . ?ps pq:[property:end time] ?end . ?ps pq:[property:end cause] ?cause .\nFILTER NOT EXISTS { ?term2 wdt:[property:subclass of] wd:[entity:Member of Parliament] .\n?item p:[property:position held] ?ps2 . ?ps2 ps:[property:position held] ?term2 . ?ps2 pq:[property:start time] ?start2 . filter (?ps != ?ps2)\noptional { ?ps2 pq:[property:end time] ?end2 } BIND(COALESCE(?end2, ?start2) AS ?check) . filter (?check >= ?end) }\n# filter out any where they were still serving later on\nbind(year(?end) as ?year) . filter(?year >= 1870) . filter(?year < 2020) . bind((floor(?year/10)*10) as ?decade) .\n}\n} AS %members\nWHERE {\n{ SELECT ?dec (count(distinct ?item) as ?count) ?cause where\n{ INCLUDE %members } group by ?dec ?cause }\n{ SELECT ?dec (count(distinct ?item) as ?decade_total) where\n{ INCLUDE %members } group by ?dec }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\n#defaultView:BarChart",
    "complexity": "complex"
  },
  {
    "id": "2722",
    "instruction": "What are the main causes of death for US presidents categorized by their political party?",
    "query": "SELECT (?partiesLabel AS ?party) (COUNT(?president) AS ?dead_presidents) (SAMPLE(?cause_of_deathLabel) AS ?causes_of_death) WHERE {\n?president wdt:P39 wd:Q11696;\nwdt:P102 ?parties.\n?president wdt:P1196 ?cause_of_death.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\".\n?parties rdfs:label ?partiesLabel .\n?president rdfs:label ?presidentLabel .\n?cause_of_death rdfs:label ?cause_of_deathLabel .}\n} GROUP BY ?partiesLabel ?cause_of_death\nORDER BY DESC (?dead_presidents)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT (?partiesLabel AS ?party) (COUNT(?president) AS ?dead_presidents) (SAMPLE(?cause_of_deathLabel) AS ?causes_of_death) WHERE {\n?president wdt:[property:position held] wd:[entity:President of the United States];\nwdt:[property:member of political party] ?parties.\n?president wdt:[property:manner of death] ?cause_of_death.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\".\n?parties rdfs:label ?partiesLabel .\n?president rdfs:label ?presidentLabel .\n?cause_of_death rdfs:label ?cause_of_deathLabel .}\n} GROUP BY ?partiesLabel ?cause_of_death\nORDER BY DESC (?dead_presidents)",
    "complexity": "complex"
  },
  {
    "id": "2501",
    "instruction": "List Indian writers who passed away in the year 1961.",
    "query": "SELECT DISTINCT ?item ?itemLabel WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE]\". }\n{\nSELECT DISTINCT ?item WHERE {\n?item p:P570 ?statement_0.\n?statement_0 psv:P570 ?statementValue_0.\n?statementValue_0 wikibase:timePrecision ?precision_0.\nhint:Prior hint:rangeSafe \"true\"^^xsd:boolean.\nFILTER(?precision_0 >= 9 )\n?statementValue_0 wikibase:timeValue ?P570_0.\nhint:Prior hint:rangeSafe \"true\"^^xsd:boolean.\nFILTER((\"+1961-00-00T00:00:00Z\"^^xsd:dateTime <= ?P570_0) && (?P570_0 < \"+1962-00-00T00:00:00Z\"^^xsd:dateTime))\n?item p:P27 ?statement1.\n?statement1 (ps:P27/(wdt:P279*)) wd:Q668.\n?item p:P106 ?statement2.\n?statement2 (ps:P106/(wdt:P279*)) wd:Q36180.\n}\nLIMIT 100\n}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX hint: <http://www.bigdata.com/queryHints#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE]\". }\n{\nSELECT DISTINCT ?item WHERE {\n?item p:[property:date of death] ?statement_0.\n?statement_0 psv:[property:date of death] ?statementValue_0.\n?statementValue_0 wikibase:timePrecision ?precision_0.\nhint:Prior hint:rangeSafe \"true\"^^xsd:boolean.\nFILTER(?precision_0 >= 9 )\n?statementValue_0 wikibase:timeValue ?[property:date of death]_0.\nhint:Prior hint:rangeSafe \"true\"^^xsd:boolean.\nFILTER((\"+1961-00-00T00:00:00Z\"^^xsd:dateTime <= ?[property:date of death]_0) && (?[property:date of death]_0 < \"+1962-00-00T00:00:00Z\"^^xsd:dateTime))\n?item p:[property:country of citizenship] ?statement1.\n?statement1 (ps:[property:country of citizenship]/(wdt:[property:country of citizenship]9*)) wd:[entity:India].\n?item p:[property:occupation] ?statement2.\n?statement2 (ps:[property:occupation]/(wdt:[property:country of citizenship]9*)) wd:[entity:writer].\n}\nLIMIT 100\n}\n}",
    "complexity": "complex"
  },
  {
    "id": "1490",
    "instruction": "What is the first World Heritage site in each country?",
    "query": "SELECT DISTINCT ?item ?itemLabel ?countryLabel (YEAR(?date) AS ?year) ?coords ?image WHERE {\n{\nSELECT (MIN(?date) AS ?date) ?country WHERE {\n?item p:P1435 ?statement ;\nwdt:P17 ?country .\n?statement ps:P1435 wd:Q9259 ;\npq:P580 ?date .\n}\nGROUP BY ?country\n}\n?item p:P1435 ?statement ;\nwdt:P17 ?country ;\nwdt:P625 ?coords .\nOPTIONAL { ?item wdt:P18 ?image }\n?statement ps:P1435 wd:Q9259 ;\npq:P580 ?date .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\" . }\n} ORDER BY ?countryLabel ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?countryLabel (YEAR(?date) AS ?year) ?coords ?image WHERE {\n{\nSELECT (MIN(?date) AS ?date) ?country WHERE {\n?item p:[property:heritage designation] ?statement ;\nwdt:[property:country] ?country .\n?statement ps:[property:heritage designation] wd:[entity:World Heritage Site] ;\npq:[property:start time] ?date .\n}\nGROUP BY ?country\n}\n?item p:[property:heritage designation] ?statement ;\nwdt:[property:country] ?country ;\nwdt:[property:coordinate location] ?coords .\nOPTIONAL { ?item wdt:[property:image] ?image }\n?statement ps:[property:heritage designation] wd:[entity:World Heritage Site] ;\npq:[property:start time] ?date .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\" . }\n} ORDER BY ?countryLabel ?itemLabel",
    "complexity": "complex"
  },
  {
    "id": "2692",
    "instruction": "List the top .uk domains with the most items described at a specific URL.",
    "query": "SELECT ?base ?count ?sample_item ?sample_itemLabel ?sample_itemDescription ?sample_url WHERE {\n{\nselect (IRI(CONCAT(?stem, '.uk/')) AS ?base) (count(?item) as ?count) (SAMPLE(?item) AS ?sample_item) (SAMPLE(?url) AS ?sample_url) {\n?item wdt:P973 ?url .\nFILTER(CONTAINS(str(?url), '.uk/')) .\nBIND(STRBEFORE(str(?url), '.uk/') AS ?stem) .\n} group by ?stem\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?base ?count ?sample_item ?sample_itemLabel ?sample_itemDescription ?sample_url WHERE {\n{\nselect (IRI(CONCAT(?stem, '.uk/')) AS ?base) (count(?item) as ?count) (SAMPLE(?item) AS ?sample_item) (SAMPLE(?url) AS ?sample_url) {\n?item wdt:[property:described at URL] ?url .\nFILTER(CONTAINS(str(?url), '.uk/')) .\nBIND(STRBEFORE(str(?url), '.uk/') AS ?stem) .\n} group by ?stem\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "77",
    "instruction": "List famous poems written by individuals who are not primarily known as poets.",
    "query": "SELECT DISTINCT ?work ?workLabel ?author ?authorLabel ?article WHERE {\n?work wdt:P50 ?author ;\nwdt:P31/wdt:P279? wd:Q5185279. # ?work is a poem\n?article schema:about ?work;\nschema:isPartOf <https://en.wikipedia.org/> .\nMINUS {?author wdt:P106 wd:Q49757} # ?author is not listed as a poet\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} ORDER BY ?authorLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?work ?workLabel ?author ?authorLabel ?article WHERE {\n?work wdt:[property:author] ?author ;\nwdt:[property:instance of]/wdt:[property:subclass of]? wd:[entity:poem]. # ?work is a poem\n?article schema:about ?work;\nschema:isPartOf <https://en.wikipedia.org/> .\nMINUS {?author wdt:[property:occupation] wd:[entity:poet]} # ?author is not listed as a poet\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} ORDER BY ?authorLabel",
    "complexity": "complex"
  },
  {
    "id": "2688",
    "instruction": "Show me a list of fungi species with images, ranked by the number of languages they have an article in.",
    "query": "SELECT DISTINCT ?item ?taxonname ?itemLabel ?irudia ?sitelinks WHERE {\n?item wdt:P31 wd:Q16521.\n?item wdt:P105 wd:Q7432.\n?item wdt:P225 ?taxonname.\n?item wdt:P171+ wd:Q27720.\n?item wdt:P171+ ?family.\n?family wdt:P105 wd:Q37517.\n?item wdt:P18 ?irudia.\n?item wikibase:sitelinks ?sitelinks.\n?wen schema:about ?item.\n?wen schema:isPartOf <https://ca.wikipedia.org/>.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"la,eu\". }\nFILTER(NOT EXISTS {\n?weu schema:about ?item.\n?weu schema:inLanguage \"eu\".\n})\n}\nORDER BY DESC(?sitelinks)\nLIMIT 100",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?taxonname ?itemLabel ?irudia ?sitelinks WHERE {\n?item wdt:[property:instance of] wd:[entity:taxon].\n?item wdt:[property:taxon rank] wd:[entity:species].\n?item wdt:[property:taxon name] ?taxonname.\n?item wdt:[property:parent taxon]+ wd:[entity:Agaricomycetes].\n?item wdt:[property:parent taxon]+ ?family.\n?family wdt:[property:taxon rank] wd:[entity:class].\n?item wdt:[property:image] ?irudia.\n?item wikibase:sitelinks ?sitelinks.\n?wen schema:about ?item.\n?wen schema:isPartOf <https://ca.wikipedia.org/>.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"la,eu\". }\nFILTER(NOT EXISTS {\n?weu schema:about ?item.\n?weu schema:inLanguage \"eu\".\n})\n}\nORDER BY DESC(?sitelinks)\nLIMIT 100",
    "complexity": "complex"
  },
  {
    "id": "268",
    "instruction": "List all Wikipedia articles about artists whose work is part of the Ashmolean Museum collection.",
    "query": "SELECT ?artistpage ?extlink WHERE {\n{SELECT DISTINCT ?name ?artistpage WHERE {\n?item wdt:P195 wd:Q636400; wdt:P170 ?artist. # Artists in the Ashmolean\n?artistpage schema:about ?artist;\nschema:isPartOf <https://en.wikipedia.org/>; # ENWP articles about them\nschema:name ?name # Title of article\n}\n}\nOPTIONAL {SERVICE wikibase:mwapi { # External links from each article\nbd:serviceParam wikibase:api \"Generator\";\nwikibase:endpoint \"en.wikipedia.org\";\nmwapi:generator \"allpages\";\nmwapi:gapfrom ?name;\nmwapi:gapto ?name;\nmwapi:prop \"extlinks\".\n?extlink wikibase:apiOutput \"extlinks/el/text()\".\n}\nFILTER CONTAINS(?extlink, \"rkd.nl\")\n}\n} ORDER BY ?artistpage",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?artistpage ?extlink WHERE {\n{SELECT DISTINCT ?name ?artistpage WHERE {\n?item wdt:[property:collection] wd:[entity:Ashmolean Museum]; wdt:[property:creator] ?artist. # Artists in the Ashmolean\n?artistpage schema:about ?artist;\nschema:isPartOf <https://en.wikipedia.org/>; # ENWP articles about them\nschema:name ?name # Title of article\n}\n}\nOPTIONAL {SERVICE wikibase:mwapi { # External links from each article\nbd:serviceParam wikibase:api \"Generator\";\nwikibase:endpoint \"en.wikipedia.org\";\nmwapi:generator \"allpages\";\nmwapi:gapfrom ?name;\nmwapi:gapto ?name;\nmwapi:prop \"extlinks\".\n?extlink wikibase:apiOutput \"extlinks/el/text()\".\n}\nFILTER CONTAINS(?extlink, \"rkd.nl\")\n}\n} ORDER BY ?artistpage",
    "complexity": "complex"
  },
  {
    "id": "2238",
    "instruction": "How many companies are categorized under each industry on Wikidata?",
    "query": "SELECT ?P452 ?P452Label ?count WITH {\nSELECT ?P452 (COUNT (DISTINCT ?item) as ?count)\nWHERE\n{\n?item wdt:P31/wdt:P279* wd:Q783794 .\n?item wdt:P452 ?P452 .\n} group by ?P452} as %i\nWHERE\n{include %i\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER by desc (?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?[property:industry] ?[property:industry]Label ?count WITH {\nSELECT ?[property:industry] (COUNT (DISTINCT ?item) as ?count)\nWHERE\n{\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:company] .\n?item wdt:[property:industry] ?[property:industry] .\n} group by ?[property:industry]} as %i\nWHERE\n{include %i\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER by desc (?count)",
    "complexity": "complex"
  },
  {
    "id": "2259",
    "instruction": "List the people affiliated with the Technical University of Denmark who have received the most awards.",
    "query": "SELECT ?count ?researcher ?researcherLabel ?awards\nWITH {\nSELECT (COUNT(?award) AS ?count) ?researcher (GROUP_CONCAT(?award_label; separator=\", \") AS ?awards) WHERE {\nhint:Query hint:optimizer \"None\" .\n{\nSELECT DISTINCT ?researcher WHERE {\n?researcher ( wdt:P108 | wdt:P463 | wdt:P1416 ) / wdt:P361* wd:Q1269766 .\n}\n}\n?researcher wdt:P166 ?award .\n?award rdfs:label ?award_label . FILTER (LANG(?award_label) = 'en')\n}\nGROUP BY ?researcher\n} AS %result\nWHERE {\nINCLUDE %result\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,da,de,es,fr,jp,nl,no,ru,sv,zh\" . }\n}\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX hint: <http://www.bigdata.com/queryHints#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?count ?researcher ?researcherLabel ?awards\nWITH {\nSELECT (COUNT(?award) AS ?count) ?researcher (GROUP_CONCAT(?award_label; separator=\", \") AS ?awards) WHERE {\nhint:Query hint:optimizer \"None\" .\n{\nSELECT DISTINCT ?researcher WHERE {\n?researcher ( wdt:[property:employer] | wdt:[property:member of] | wdt:[property:affiliation] ) / wdt:[property:part of]* wd:[entity:Technical University of Denmark] .\n}\n}\n?researcher wdt:[property:award received] ?award .\n?award rdfs:label ?award_label . FILTER (LANG(?award_label) = 'en')\n}\nGROUP BY ?researcher\n} AS %result\nWHERE {\nINCLUDE %result\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,da,de,es,fr,jp,nl,no,ru,sv,zh\" . }\n}\nORDER BY DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "1524",
    "instruction": "List the number of movies that passed or failed the Bechdel test by year.",
    "query": "SELECT ?year (COUNT(?film) AS ?nb_films) ?statusLabel WHERE {\n?film wdt:P31/wdt:P279* wd:Q11424 ;\nwdt:P577 ?date ;\nwdt:P1552 ?status.\nBIND(STR(YEAR(?date)) AS ?year)\nVALUES ?status { wd:Q45171911 wd:Q45172088 }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?year ?statusLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?year (COUNT(?film) AS ?nb_films) ?statusLabel WHERE {\n?film wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:film] ;\nwdt:[property:publication date] ?date ;\nwdt:[property:has characteristic] ?status.\nBIND(STR(YEAR(?date)) AS ?year)\nVALUES ?status { wd:[entity:Q45171911] wd:[entity:Q45172088] }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?year ?statusLabel",
    "complexity": "complex"
  },
  {
    "id": "2371",
    "instruction": "How many movies starring Jean-Paul Belmondo were released in each decade?",
    "query": "SELECT DISTINCT\n?decade\n(COUNT(*) as ?count)\n(SAMPLE(?item) as ?sample_movie)\n(SAMPLE(?itemLabel) as ?sample_movieLabel)\n(SAMPLE(?d) as ?sample_date)\nWHERE\n{\n?item wdt:P161 wd:Q106255; wdt:P31/wdt:P279? wd:Q11424 .\n?item wdt:P577 ?d.\nFILTER(NOT EXISTS {\n?item wdt:P577 ?d2.\nFILTER(?d2 < ?d)\n})\nBIND(FLOOR(YEAR(?d)/10)*10 AS ?decade)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],fr,cs,it,en\".\n?item rdfs:label ?itemLabel\n}\n}\nGROUP BY ?decade\nORDER BY ?decade",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT\n?decade\n(COUNT(*) as ?count)\n(SAMPLE(?item) as ?sample_movie)\n(SAMPLE(?itemLabel) as ?sample_movieLabel)\n(SAMPLE(?d) as ?sample_date)\nWHERE\n{\n?item wdt:[property:cast member] wd:[entity:Jean-Paul Belmondo]; wdt:[property:instance of]/wdt:[property:subclass of]? wd:[entity:film] .\n?item wdt:[property:publication date] ?d.\nFILTER(NOT EXISTS {\n?item wdt:[property:publication date] ?d2.\nFILTER(?d2 < ?d)\n})\nBIND(FLOOR(YEAR(?d)/10)*10 AS ?decade)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],fr,cs,it,en\".\n?item rdfs:label ?itemLabel\n}\n}\nGROUP BY ?decade\nORDER BY ?decade",
    "complexity": "complex"
  }
]