[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "2277",
    "instruction": "What are the dates of accidents involving road vehicles crashing into Montague Street Bridge?",
    "query": "SELECT ?event_date WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\nBIND(wd:Q60749688 AS ?Montague_Street_Bridge).\n?Montague_Street_Bridge p:P793 ?event.\n?event ps:P793 wd:Q9687.\n?event pq:P585 ?event_date.\n}\nORDER BY ?event_date",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?event_date WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\nBIND(wd:[entity:Montague Street Bridge] AS ?Montague_Street_Bridge).\n?Montague_Street_Bridge p:[property:significant event] ?event.\n?event ps:[property:significant event] wd:[entity:traffic collision].\n?event pq:[property:point in time] ?event_date.\n}\nORDER BY ?event_date",
    "complexity": "medium"
  },
  {
    "id": "1466",
    "instruction": "List all national parks in India along with their coordinates and images.",
    "query": "SELECT ?national_park ?national_parkLabel ?coordinate_location ?image WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?national_park wdt:P31 wd:Q46169.\n?national_park wdt:P17 wd:Q668.\nOPTIONAL { ?national_park wdt:P625 ?coordinate_location. }\nOPTIONAL { ?national_park wdt:P18 ?image. }\n}\nLIMIT 140",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?national_park ?national_parkLabel ?coordinate_location ?image WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?national_park wdt:[property:instance of] wd:[entity:national park].\n?national_park wdt:[property:country] wd:[entity:India].\nOPTIONAL { ?national_park wdt:[property:coordinate location] ?coordinate_location. }\nOPTIONAL { ?national_park wdt:[property:image] ?image. }\n}\nLIMIT 140",
    "complexity": "medium"
  },
  {
    "id": "265",
    "instruction": "List all paintings in the Ashmolean Museum made entirely of gold.",
    "query": "SELECT ?item ?url WHERE {\n?item wdt:P195 wd:Q636400; # collection: Ashmolean\nwdt:P31 wd:Q3305213; # type: painting\nwdt:P186 wd:Q897 # material: gold\nMINUS {?item wdt:P186 ?mat FILTER (?mat != wd:Q897) } # no non-gold material\nOPTIONAL {?item wdt:P973 ?url}\n}",
    "annotated": "PREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?item ?url WHERE {\n?item wdt:[property:collection] wd:[entity:Ashmolean Museum]; # collection: Ashmolean\nwdt:[property:instance of] wd:[entity:painting]; # type: painting\nwdt:[property:made from material] wd:[entity:gold] # material: gold\nMINUS {?item wdt:[property:made from material] ?mat FILTER (?mat != wd:[entity:gold]) } # no non-gold material\nOPTIONAL {?item wdt:[property:described at URL] ?url}\n}",
    "complexity": "medium"
  },
  {
    "id": "841",
    "instruction": "What are the names of mountains with an elevation above 8,000 meters?",
    "query": "SELECT ?subj ?label ?coord ?elev\nWHERE\n{\n?subj wdt:P2044 ?elev filter(?elev > 8000) .\n?subj wdt:P625 ?coord .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,zh\" . ?subj rdfs:label ?label }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?subj ?label ?coord ?elev\nWHERE\n{\n?subj wdt:[property:elevation above sea level] ?elev filter(?elev > 8000) .\n?subj wdt:[property:coordinate location] ?coord .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,zh\" . ?subj rdfs:label ?label }\n}",
    "complexity": "medium"
  },
  {
    "id": "137",
    "instruction": "List all cities with a population of over a million that have sister-city relationships.",
    "query": "SELECT ?city ?cityLabel ?image ?cityB\nWHERE {\n?cityB wdt:P31 wd:Q1637706 .\n?city wdt:P31 wd:Q1637706 ;\nwdt:P190 ?cityB ;\nwdt:P18 ?image\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?city ?cityLabel ?image ?cityB\nWHERE {\n?cityB wdt:[property:instance of] wd:[entity:million city] .\n?city wdt:[property:instance of] wd:[entity:million city] ;\nwdt:[property:twinned administrative body] ?cityB ;\nwdt:[property:image] ?image\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "1895",
    "instruction": "List all magicians with their exact birth dates.",
    "query": "SELECT ?PersonLabel ?birthdate\nWHERE{\n?Person wdt:P106 wd:Q15855449.\n?Person p:P569/psv:P569 [ wikibase:timeValue ?birthdate; wikibase:timePrecision 11 ].\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?PersonLabel ?birthdate\nWHERE{\n?Person wdt:[property:occupation] wd:[entity:magician].\n?Person p:[property:date of birth]/psv:[property:date of birth] [ wikibase:timeValue ?birthdate; wikibase:timePrecision 11 ].\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "1195",
    "instruction": "List all companies that are owned by The Walt Disney Company.",
    "query": "SELECT DISTINCT ?item ?itemLabel WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?item (wdt:P127|^wdt:P199|wdt:P749|^wdt:P1830|^wdt:P355)+ wd:Q7414.\n?item (wdt:P31/wdt:P279*) wd:Q4830453.\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?item (wdt:[property:owned by]|^wdt:[property:business division]|wdt:[property:parent organization]|^wdt:[property:owner of]|^wdt:[property:has subsidiary])+ wd:[entity:The Walt Disney Company].\n?item (wdt:[property:instance of]/wdt:[property:subclass of]*) wd:[entity:business].\n}",
    "complexity": "medium"
  },
  {
    "id": "1742",
    "instruction": "Find artworks that show people kissing.",
    "query": "SELECT ?item ?itemLabel ?pic WHERE {\n?item wdt:P180 wd:Q7307;\nwdt:P18 ?pic.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?pic WHERE {\n?item wdt:[property:depicts] wd:[entity:kiss];\nwdt:[property:image] ?pic.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "558",
    "instruction": "List all municipalities in the Netherlands that share a border with Alphen aan den Rijn.",
    "query": "SELECT ?muni ?muniLabel where {\n?muni p:P31 [ps:P31 wd:Q2039348];\nwdt:P47 wd:Q213246.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"nl\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?muni ?muniLabel where {\n?muni p:[property:instance of] [ps:[property:instance of] wd:[entity:municipality of the Netherlands]];\nwdt:[property:shares border with] wd:[entity:Alphen aan den Rijn].\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"nl\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "1103",
    "instruction": "List the names of female scientists who are members of the National Academy of Sciences.",
    "query": "SELECT ?personLabel ?schoolLabel ?image\nWHERE {\n?person wdt:P463 wd:Q270794.\n?person wdt:P21 wd:Q6581072;\np:P69 [ps:P69 ?school; pq:P512 wd:Q752297].\nOPTIONAL {?person wdt:P18 ?image.}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?personLabel ?schoolLabel ?image\nWHERE {\n?person wdt:[property:member of] wd:[entity:National Academy of Sciences].\n?person wdt:[property:sex or gender] wd:[entity:female];\np:[property:educated at] [ps:[property:educated at] ?school; pq:[property:academic degree] wd:[entity:Doctor of Philosophy]].\nOPTIONAL {?person wdt:[property:image] ?image.}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "2425",
    "instruction": "Find the coordinates of the places where people with the family name Autrique were born.",
    "query": "SELECT ?item ?itemLabel ?coord WHERE {\n?item wdt:P31 wd:Q5;\nwdt:P734 wd:Q11134722;\nwdt:P19 ?place.\n?place wdt:P625 ?coord.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?coord WHERE {\n?item wdt:[property:instance of] wd:[entity:human];\nwdt:[property:family name] wd:[entity:Bernard];\nwdt:[property:place of birth] ?place.\n?place wdt:[property:coordinate location] ?coord.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "1514",
    "instruction": "What is the number of Google Doodles categorized by gender?",
    "query": "SELECT ?sexo_ou_g_neroLabel (COUNT(?ser_humano) AS ?count) WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?ser_humano wdt:P31 wd:Q5.\n?ser_humano wdt:P4431 ?Google_Doodle.\nOPTIONAL { }\nOPTIONAL { ?ser_humano wdt:P21 ?sexo_ou_g_nero. }\n}\nGROUP BY ?sexo_ou_g_neroLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?sexo_ou_g_neroLabel (COUNT(?ser_humano) AS ?count) WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?ser_humano wdt:[property:instance of] wd:[entity:human].\n?ser_humano wdt:[property:Google Doodle] ?Google_Doodle.\nOPTIONAL { }\nOPTIONAL { ?ser_humano wdt:[property:sex or gender] ?sexo_ou_g_nero. }\n}\nGROUP BY ?sexo_ou_g_neroLabel",
    "complexity": "medium"
  },
  {
    "id": "866",
    "instruction": "List all sculptures created by Max Bill.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?countryLabel ?placeLabel (YEAR(?date) as ?year) ?coords ?image WHERE {\n?item wdt:P31/wdt:P279* wd:Q860861 .\n?item wdt:P170 wd:Q123454 .\nOPTIONAL { ?item wdt:P17 ?country . }\nOPTIONAL { ?item wdt:P131 ?place . }\nOPTIONAL { ?item wdt:P571 ?date . }\nOPTIONAL { ?item wdt:P625 ?coords . }\nOPTIONAL { ?item wdt:P18 ?image . }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} ORDER BY ?itemLabel ?placeLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?countryLabel ?placeLabel (YEAR(?date) as ?year) ?coords ?image WHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:sculpture] .\n?item wdt:[property:country]0 wd:[entity:Max Bill] .\nOPTIONAL { ?item wdt:[property:country] ?country . }\nOPTIONAL { ?item wdt:[property:located in the administrative territorial entity] ?place . }\nOPTIONAL { ?item wdt:[property:inception] ?date . }\nOPTIONAL { ?item wdt:[property:coordinate location] ?coords . }\nOPTIONAL { ?item wdt:[property:image] ?image . }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} ORDER BY ?itemLabel ?placeLabel",
    "complexity": "medium"
  },
  {
    "id": "523",
    "instruction": "How many properties are there in each type?",
    "query": "SELECT (COUNT(?property) as ?pcount ) ?wbtype WHERE {\n?property rdf:type wikibase:Property.\n?property wikibase:propertyType ?wbtype.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?wbtype\nORDER BY DESC(?pcount)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT (COUNT(?property) as ?pcount ) ?wbtype WHERE {\n?property rdf:type wikibase:Property.\n?property wikibase:propertyType ?wbtype.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?wbtype\nORDER BY DESC(?pcount)",
    "complexity": "medium"
  },
  {
    "id": "1521",
    "instruction": "List all movies featuring both Bud Spencer and Terence Hill.",
    "query": "SELECT ?item ?itemLabel ?_image ?publication_date WHERE {\n?item wdt:P161 wd:Q221074.\n?item wdt:P161 wd:Q243430.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\nOPTIONAL { ?item wdt:P18 ?_image. }\nOPTIONAL { ?item wdt:P577 ?publication_date. }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?_image ?publication_date WHERE {\n?item wdt:[property:cast member] wd:[entity:Bud Spencer].\n?item wdt:[property:cast member] wd:[entity:Terence Hill].\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\nOPTIONAL { ?item wdt:[property:image] ?_image. }\nOPTIONAL { ?item wdt:[property:publication date] ?publication_date. }\n}",
    "complexity": "medium"
  },
  {
    "id": "2271",
    "instruction": "List Twitter usernames of artists whose works are part of the Museo Nacional de Arte collection.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?itemDescription ?image ?collection ?creadorLabel WHERE {\n?item wdt:P31 wd:Q3305213 ;\nwdt:P195/wdt:P361* ?collection .\n?item wdt:P170 ?creador .\nFILTER ( ?collection = wd:Q1138147)\nOPTIONAL { ?item wdt:P18 ?image }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"es,en\" }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?itemDescription ?image ?collection ?creadorLabel WHERE {\n?item wdt:[property:instance of] wd:[entity:painting] ;\nwdt:[property:collection]/wdt:[property:part of]* ?collection .\n?item wdt:[property:creator] ?creador .\nFILTER ( ?collection = wd:[entity:Museo Nacional de Arte])\nOPTIONAL { ?item wdt:[property:image] ?image }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"es,en\" }\n}",
    "complexity": "medium"
  },
  {
    "id": "701",
    "instruction": "Show me a map of all the locations where Johannes Vermeer's paintings are housed.",
    "query": "SELECT ?painting ?paintingLabel ?location ?image where {\n?painting wdt:P276 ?collection;\nwdt:P170 wd:Q41264;\nwdt:P18 ?image.\n?collection wdt:P625 ?location.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?painting ?paintingLabel ?location ?image where {\n?painting wdt:[property:location] ?collection;\nwdt:[property:creator] wd:[entity:Johannes Vermeer];\nwdt:[property:image] ?image.\n?collection wdt:[property:coordinate location] ?location.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "1541",
    "instruction": "List movies that are considered Christmas traditions.",
    "query": "SELECT DISTINCT ?christmasTraditionMovie ?christmasTraditionMovieLabel WHERE {\n?christmasTraditionMovie p:P31/ps:P31 wd:Q717040, [ wdt:P279* wd:Q11424 ].\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,sv\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?christmasTraditionMovie ?christmasTraditionMovieLabel WHERE {\n?christmasTraditionMovie p:[property:instance of]/ps:[property:instance of] wd:[entity:Christmas tradition], [ wdt:[property:subclass of]* wd:[entity:film] ].\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,sv\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "807",
    "instruction": "What were the battles fought during World War II?",
    "query": "SELECT distinct ?item ?itemLabel (?end - ?start as ?duration)\nWHERE {\n?item (wdt:P361)* wd:Q362 .\n?item wdt:P31/wdt:P279* wd:Q178561 .\n?item wdt:P580 ?start .\n?item wdt:P582 ?end .\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT distinct ?item ?itemLabel (?end - ?start as ?duration)\nWHERE {\n?item (wdt:[property:part of])* wd:[entity:World War II] .\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:battle] .\n?item wdt:[property:start time] ?start .\n?item wdt:[property:end time] ?end .\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n}",
    "complexity": "medium"
  },
  {
    "id": "313",
    "instruction": "List female historians born in the 1730s from Eastern Europe.",
    "query": "SELECT ?person ?personLabel ?birthdate WHERE {\n?person wdt:P3429 ?ee.\n?person wdt:P21 wd:Q6581072.\n?person wdt:P106 wd:Q201788.\n?person wdt:P569 ?birthdate.\nFILTER ((YEAR(?birthdate) > 1729) && (YEAR(?birthdate) < 1740))\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?person ?personLabel ?birthdate WHERE {\n?person wdt:[property:Electronic Enlightenment ID] ?ee.\n?person wdt:[property:sex or gender] wd:[entity:female].\n?person wdt:[property:occupation] wd:[entity:historian].\n?person wdt:[property:date of birth] ?birthdate.\nFILTER ((YEAR(?birthdate) > 1729) && (YEAR(?birthdate) < 1740))\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "1747",
    "instruction": "List all libraries in Africa.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?countryLabel ?coords WHERE {\n?item (wdt:P31/(wdt:P279*)) wd:Q7075;\nwdt:P17 ?country.\n?country wdt:P30 wd:Q15.\nOPTIONAL{?item wdt:P625 ?coords.}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?countryLabel ?coords WHERE {\n?item (wdt:[property:instance of]/(wdt:[property:subclass of]*)) wd:[entity:library];\nwdt:[property:country] ?country.\n?country wdt:[property:continent] wd:[entity:Africa].\nOPTIONAL{?item wdt:[property:coordinate location] ?coords.}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "1712",
    "instruction": "List all Finnish heavy metal bands with their images and dates.",
    "query": "SELECT DISTINCT ?band ?bandLabel ?image ?date_image WHERE {\n?band wdt:P31 wd:Q215380. #music band\n?band wdt:P136*/wdt:P279* wd:Q38848. #playing heavy metal or a sub-genre of it\n?band wdt:P495 wd:Q33. # coming from Finland \\../.\nOPTIONAL {?band p:P18 ?istat. # with an image\n?istat ps:P18 ?image.}\nOPTIONAL {?band p:P18 ?istat. # with a date for the image\n?istat pq:P585 ?date_image.}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en, fi\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?band ?bandLabel ?image ?date_image WHERE {\n?band wdt:[property:instance of] wd:[entity:musical group]. #music band\n?band wdt:[property:genre]*/wdt:[property:subclass of]* wd:[entity:heavy metal]. #playing heavy metal or a sub-genre of it\n?band wdt:[property:country of origin] wd:[entity:Finland]. # coming from Finland \\../.\nOPTIONAL {?band p:[property:image] ?istat. # with an image\n?istat ps:[property:image] ?image.}\nOPTIONAL {?band p:[property:image] ?istat. # with a date for the image\n?istat pq:[property:point in time] ?date_image.}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en, fi\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "2666",
    "instruction": "What are the latest information leaks according to Wikidata?",
    "query": "SELECT ?item ?itemLabel ?itemDescription ?instance ?instanceLabel ?date WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\nwd:Q2904148 ^(wdt:P279*) ?instance.\n?item wdt:P31 ?instance.\nOPTIONAL {?item wdt:P585 ?date }\n}\nORDER BY DESC(?date)\nLIMIT 1000",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?itemDescription ?instance ?instanceLabel ?date WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\nwd:[entity:information leak] ^(wdt:[property:subclass of]*) ?instance.\n?item wdt:[property:instance of] ?instance.\nOPTIONAL {?item wdt:[property:point in time] ?date }\n}\nORDER BY DESC(?date)\nLIMIT 1000",
    "complexity": "medium"
  },
  {
    "id": "2391",
    "instruction": "List all cemeteries in New Zealand along with their locations.",
    "query": "SELECT ?cemetery ?cemeteryLabel ?districtLabel ?operatorLabel ?coords\nWHERE {\n?cemetery wdt:P31/wdt:P279* wd:Q39614 .\n?cemetery wdt:P17 wd:Q664 .\n?cemetery wdt:P131 ?district .\nOPTIONAL { ?cemetery wdt:P137 ?operator } .\n?cemetery wdt:P625 ?coords\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}\nORDER BY ?districtLabel ?cemeteryLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?cemetery ?cemeteryLabel ?districtLabel ?operatorLabel ?coords\nWHERE {\n?cemetery wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:cemetery] .\n?cemetery wdt:[property:country] wd:[entity:New Zealand] .\n?cemetery wdt:[property:located in the administrative territorial entity] ?district .\nOPTIONAL { ?cemetery wdt:[property:operator] ?operator } .\n?cemetery wdt:[property:coordinate location] ?coords\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}\nORDER BY ?districtLabel ?cemeteryLabel",
    "complexity": "medium"
  },
  {
    "id": "610",
    "instruction": "List two chemical compounds that share the same CAS registry number.",
    "query": "SELECT DISTINCT ?cas ?compound1 ?compound1Label ?compound2 ?compound2Label WHERE {\n?compound1 wdt:P231 ?cas .\n?compound2 wdt:P231 ?cas .\nFILTER (?compound1 != ?compound2)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?cas ?compound1 ?compound1Label ?compound2 ?compound2Label WHERE {\n?compound1 wdt:[property:CAS Registry Number] ?cas .\n?compound2 wdt:[property:CAS Registry Number] ?cas .\nFILTER (?compound1 != ?compound2)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "831",
    "instruction": "What are the names of Italian mountains with elevations above 4000 meters?",
    "query": "SELECT ?subj ?label ?coord ?elev ?picture\nWHERE\n{\n?subj wdt:P2044 ?elev filter(?elev > 4000) .\n?subj wdt:P625 ?coord .\n?subj wdt:P17 wd:Q38 .\n?subj wdt:P18 ?picture .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"it\" . ?subj rdfs:label ?label }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?subj ?label ?coord ?elev ?picture\nWHERE\n{\n?subj wdt:[property:elevation above sea level] ?elev filter(?elev > 4000) .\n?subj wdt:[property:coordinate location] ?coord .\n?subj wdt:[property:country] wd:[entity:Italy] .\n?subj wdt:[property:image] ?picture .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"it\" . ?subj rdfs:label ?label }\n}",
    "complexity": "medium"
  },
  {
    "id": "583",
    "instruction": "How many types of gene variants are sourced from the CIViC database?",
    "query": "SELECT ?variant_typeLabel (count(?variant_typeLabel) as ?counts)\nWHERE\n{\n?item wdt:P3329 ?civic_id ;\nwdt:P31 ?variant_type .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}\nGROUP BY ?variant_typeLabel\nORDER BY ?counts",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?variant_typeLabel (count(?variant_typeLabel) as ?counts)\nWHERE\n{\n?item wdt:[property:CIViC variant ID] ?civic_id ;\nwdt:[property:instance of] ?variant_type .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}\nGROUP BY ?variant_typeLabel\nORDER BY ?counts",
    "complexity": "medium"
  },
  {
    "id": "1841",
    "instruction": "List all movies about pandemics, including their release dates.",
    "query": "SELECT DISTINCT ?film ?filmLabel ?argitaratze_data WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?film wdt:P31 wd:Q11424;\nwdt:P921 wd:Q44512.\n?film wdt:P577 ?argitaratze_data.\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?film ?filmLabel ?argitaratze_data WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?film wdt:[property:instance of] wd:[entity:film];\nwdt:[property:main subject] wd:[entity:epidemic].\n?film wdt:[property:publication date] ?argitaratze_data.\n}",
    "complexity": "medium"
  },
  {
    "id": "2771",
    "instruction": "Show me a map of the birthplaces of women writers mentioned in 'Femmes de lettres en Bretagne'.",
    "query": "SELECT ?element ?elementLabel ?coord WHERE {\n?element wdt:P1343 wd:Q109662197 .\n?element wdt:P19/wdt:P625 ?coord .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?element ?elementLabel ?coord WHERE {\n?element wdt:[property:described by source] wd:[entity:Femmes de lettres en Bretagne] .\n?element wdt:[property:place of birth]/wdt:[property:coordinate location] ?coord .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "264",
    "instruction": "List all items from the Ashmolean Museum website without an Ashmolean Museum ID.",
    "query": "SELECT ?item ?itemLabel ?itemDescription ?url WHERE {\n?item wdt:P195 wd:Q636400.\n?item wdt:P973 ?url FILTER( CONTAINS(STR(?url), \"www.ashmolean.org\") )\nMINUS {?item wdt:P6610 []}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?itemDescription ?url WHERE {\n?item wdt:[property:collection] wd:[entity:Ashmolean Museum].\n?item wdt:[property:described at URL] ?url FILTER( CONTAINS(STR(?url), \"www.ashmolean.org\") )\nMINUS {?item wdt:[property:Ashmolean museum ID] []}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  }
]