[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "1142",
    "instruction": "List all humans who are citizens of France and have at least 5 Wikipedia pages in languages other than French.",
    "query": "SELECT ?item ?itemLabel ?numLinks ?who WHERE {\n?item wdt:P31 wd:Q5.\n?item wdt:P27 wd:Q142. # citizen of France\n?item wikibase:sitelinks ?numLinks.\n?item schema:description ?who.\nFILTER((LANG(?who)) = \"en\")\nFILTER(?numLinks >= 5)\nMINUS {\n?article schema:about ?item.\n?article schema:isPartOf <https://fr.wikipedia.org/>. # no French Wikipedia page\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?numLinks)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?numLinks ?who WHERE {\n?item wdt:[property:instance of] wd:[entity:human].\n?item wdt:[property:country of citizenship] wd:[entity:France]. # citizen of France\n?item wikibase:sitelinks ?numLinks.\n?item schema:description ?who.\nFILTER((LANG(?who)) = \"en\")\nFILTER(?numLinks >= 5)\nMINUS {\n?article schema:about ?item.\n?article schema:isPartOf <https://fr.wikipedia.org/>. # no French Wikipedia page\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?numLinks)",
    "complexity": "complex"
  },
  {
    "id": "21",
    "instruction": "List all Chancellors of the Exchequer along with their tenure.",
    "query": "SELECT ?item ?itemLabel ?start ?end ?image ?link ?partyLabel WHERE {\n?item p:P39 ?s.?s ps:P39 wd:Q531471.\n?s pq:P580 ?start. OPTIONAL {?s pq:P582 ?end}\nOPTIONAL {?item wdt:P18 ?image}\nOPTIONAL {?item wdt:P1417 ?id}\nOPTIONAL {?item wdt:P102 ?party}\nBIND(IF(BOUND(?id), URI(CONCAT(\"https://www.britannica.com/\",?id)) , ?item) AS ?link)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY ?start",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?start ?end ?image ?link ?partyLabel WHERE {\n?item p:[property:position held] ?s.?s ps:[property:position held] wd:[entity:Chancellor of the Exchequer].\n?s pq:[property:start time] ?start. OPTIONAL {?s pq:[property:end time] ?end}\nOPTIONAL {?item wdt:[property:image] ?image}\nOPTIONAL {?item wdt:[property:Encyclop\u00e6dia Britannica Online ID] ?id}\nOPTIONAL {?item wdt:[property:member of political party] ?party}\nBIND(IF(BOUND(?id), URI(CONCAT(\"https://www.britannica.com/\",?id)) , ?item) AS ?link)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY ?start",
    "complexity": "complex"
  },
  {
    "id": "1182",
    "instruction": "List all islands situated in capital cities.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?capitalLabel ?countryLabel ?coords WHERE {\n?item wdt:P31/wdt:P279* wd:Q23442 ;\nwdt:P131+ ?capital .\n?capital p:P1376 ?scapital .\n?scapital ps:P1376 ?country .\nFILTER NOT EXISTS { ?scapital pq:P582 ?x }\n?country p:P31 ?scountry .\n?scountry ps:P31 wd:Q6256 .\nFILTER NOT EXISTS { ?scountry pq:P582 ?x }\nOPTIONAL { ?item wdt:P625 ?coords }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} ORDER BY ?countryLabel ?capitalLabel ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?capitalLabel ?countryLabel ?coords WHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:island] ;\nwdt:[property:located in the administrative territorial entity]+ ?capital .\n?capital p:[property:capital of] ?scapital .\n?scapital ps:[property:capital of] ?country .\nFILTER NOT EXISTS { ?scapital pq:[property:end time] ?x }\n?country p:[property:instance of] ?scountry .\n?scountry ps:[property:instance of] wd:[entity:country] .\nFILTER NOT EXISTS { ?scountry pq:[property:end time] ?x }\nOPTIONAL { ?item wdt:[property:coordinate location] ?coords }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} ORDER BY ?countryLabel ?capitalLabel ?itemLabel",
    "complexity": "complex"
  },
  {
    "id": "2738",
    "instruction": "List the occupations of people in the British Museum's person-institution thesaurus, categorized by gender.",
    "query": "SELECT ?occupation_en ?rgb (COUNT(DISTINCT ?person) AS ?personCount) WHERE {\n?person wdt:P31 wd:Q5;\nwdt:P1711 ?bm_id;\nwdt:P106 ?occupation;\nwdt:P21 ?gender.\nbind( if(?gender=wd:Q6581097,\"3399FF\",\"FF99FF\") as ?rgb ) .\nOPTIONAL {?occupation rdfs:label ?occupation_en filter (lang(?occupation_en) = \"en\")}.\n}\nGROUP BY ?occupation_en ?rgb\nORDER BY DESC(?personCount)",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?occupation_en ?rgb (COUNT(DISTINCT ?person) AS ?personCount) WHERE {\n?person wdt:[property:instance of] wd:[entity:human];\nwdt:[property:British Museum person or institution ID] ?bm_id;\nwdt:[property:occupation] ?occupation;\nwdt:[property:sex or gender] ?gender.\nbind( if(?gender=wd:[entity:male],\"3399FF\",\"FF99FF\") as ?rgb ) .\nOPTIONAL {?occupation rdfs:label ?occupation_en filter (lang(?occupation_en) = \"en\")}.\n}\nGROUP BY ?occupation_en ?rgb\nORDER BY DESC(?personCount)",
    "complexity": "complex"
  },
  {
    "id": "124",
    "instruction": "What are the most common jobs held by members of each parliament?",
    "query": "select ?parliament ?parliamentLabel ?job ?jobLabel ?s\nWITH {\nSELECT (COUNT(?sen) AS ?sens) ?job ?parliament WHERE {\n?sen wdt:P39 ?parliament;\nwdt:P106 ?job.\n?parliament wdt:P279* wd:Q486839\nFILTER (?job != wd:Q82955)\n} GROUP BY ?job ?parliament HAVING (?sens > 1)\n} AS %subquery\nWHERE{\n{\nSELECT ?parliament (MAX(?sens) AS ?s) WHERE{\nINCLUDE %subquery\n} GROUP BY ?parliament\n}\nINCLUDE %subquery\nFILTER(?s = ?sens)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} ORDER BY DESC(?s)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nselect ?parliament ?parliamentLabel ?job ?jobLabel ?s\nWITH {\nSELECT (COUNT(?sen) AS ?sens) ?job ?parliament WHERE {\n?sen wdt:[property:position held] ?parliament;\nwdt:[property:occupation] ?job.\n?parliament wdt:[property:subclass of]* wd:[entity:member of parliament]\nFILTER (?job != wd:[entity:politician])\n} GROUP BY ?job ?parliament HAVING (?sens > 1)\n} AS %subquery\nWHERE{\n{\nSELECT ?parliament (MAX(?sens) AS ?s) WHERE{\nINCLUDE %subquery\n} GROUP BY ?parliament\n}\nINCLUDE %subquery\nFILTER(?s = ?sens)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} ORDER BY DESC(?s)",
    "complexity": "complex"
  },
  {
    "id": "1358",
    "instruction": "List all notable integers with their values and classes.",
    "query": "SELECT * WHERE {\nSELECT\n(SAMPLE(?item) as ?item)\n(SAMPLE(?en_label) as ?name)\n(SAMPLE(?value) as ?value)\n(GROUP_CONCAT(DISTINCT ?en_class_label; SEPARATOR = \", \") AS ?classes)\nWHERE {\n?item p:P31/ps:P31/wdt:P279* wd:Q12503.\n?item wdt:P1181 ?value.\n?item p:P31/ps:P31 ?class.\nOPTIONAL {?item rdfs:label ?en_label. FILTER(LANG(?en_label) = \"en\")}\nOPTIONAL {?class rdfs:label ?en_class_label. FILTER(LANG(?en_class_label) = \"en\")}\n}\nGROUP BY ?item\n}\nORDER BY DESC(?name)",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT * WHERE {\nSELECT\n(SAMPLE(?item) as ?item)\n(SAMPLE(?en_label) as ?name)\n(SAMPLE(?value) as ?value)\n(GROUP_CONCAT(DISTINCT ?en_class_label; SEPARATOR = \", \") AS ?classes)\nWHERE {\n?item p:[property:instance of]/ps:[property:instance of]/wdt:[property:subclass of]* wd:[entity:integer].\n?item wdt:[property:numeric value] ?value.\n?item p:[property:instance of]/ps:[property:instance of] ?class.\nOPTIONAL {?item rdfs:label ?en_label. FILTER(LANG(?en_label) = \"en\")}\nOPTIONAL {?class rdfs:label ?en_class_label. FILTER(LANG(?en_class_label) = \"en\")}\n}\nGROUP BY ?item\n}\nORDER BY DESC(?name)",
    "complexity": "complex"
  },
  {
    "id": "2551",
    "instruction": "What is the frequency of each letter in five-letter English words?",
    "query": "SELECT ?letter (COUNT(?letter) AS ?count) WITH {\nSELECT ?l WHERE {\n?l a ontolex:LexicalEntry ;\ndct:language wd:Q1860 # English\n}} AS %lexemes\nWITH { SELECT ?wl {\nBIND ( 5 AS ?wl )\n}} AS %word_length\nWITH { SELECT DISTINCT ?word {\nINCLUDE %word_length\nINCLUDE %lexemes\n?l ontolex:lexicalForm [ontolex:representation ?word ]\nBIND (CONCAT(\"^[a-z]{\", STR(?wl), \"}$\") AS ?r )\nFILTER(REGEX(?word, ?r))\n}} AS %word_matches\nWITH { SELECT DISTINCT ?index WHERE {\nINCLUDE %word_length\nVALUES ?start { 1 }\nBIND (?wl AS ?end)\nBIND ( (?end - ?start ) + 1 AS ?x )\n?n p:P31 [\nps:P31 wd:Q21199 ;\npq:P155 ?prev\n] .\n?prev wdt:P1181 ?index .\nFILTER (?index > 0 && ?index < ?x + 1)\n}\n} AS %indices\nWHERE {\nINCLUDE %word_matches\nINCLUDE %indices\nVALUES ?letter { \"a\" \"b\" \"c\" \"d\" \"e\" \"f\" \"g\" \"h\" \"i\" \"j\" \"k\" \"l\" \"m\" \"n\" \"o\" \"p\" \"q\" \"r\" \"s\" \"t\" \"u\" \"v\" \"w\" \"x\" \"y\" \"z\" }\nFILTER (CONTAINS(SUBSTR (?word, ?index, 1 ), ?letter))\n}\nGROUP BY ?letter\nORDER BY DESC (?count)",
    "annotated": "PREFIX dct: <http://purl.org/dc/terms/>\nPREFIX ontolex: <http://www.w3.org/ns/lemon/ontolex#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?letter (COUNT(?letter) AS ?count) WITH {\nSELECT ?l WHERE {\n?l a ontolex:LexicalEntry ;\ndct:language wd:[entity:English] # English\n}} AS %lexemes\nWITH { SELECT ?wl {\nBIND ( 5 AS ?wl )\n}} AS %word_length\nWITH { SELECT DISTINCT ?word {\nINCLUDE %word_length\nINCLUDE %lexemes\n?l ontolex:lexicalForm [ontolex:representation ?word ]\nBIND (CONCAT(\"^[a-z]{\", STR(?wl), \"}$\") AS ?r )\nFILTER(REGEX(?word, ?r))\n}} AS %word_matches\nWITH { SELECT DISTINCT ?index WHERE {\nINCLUDE %word_length\nVALUES ?start { 1 }\nBIND (?wl AS ?end)\nBIND ( (?end - ?start ) + 1 AS ?x )\n?n p:[property:instance of] [\nps:[property:instance of] wd:[entity:natural number] ;\npq:[property:follows] ?prev\n] .\n?prev wdt:[property:numeric value] ?index .\nFILTER (?index > 0 && ?index < ?x + 1)\n}\n} AS %indices\nWHERE {\nINCLUDE %word_matches\nINCLUDE %indices\nVALUES ?letter { \"a\" \"b\" \"c\" \"d\" \"e\" \"f\" \"g\" \"h\" \"i\" \"j\" \"k\" \"l\" \"m\" \"n\" \"o\" \"p\" \"q\" \"r\" \"s\" \"t\" \"u\" \"v\" \"w\" \"x\" \"y\" \"z\" }\nFILTER (CONTAINS(SUBSTR (?word, ?index, 1 ), ?letter))\n}\nGROUP BY ?letter\nORDER BY DESC (?count)",
    "complexity": "complex"
  },
  {
    "id": "528",
    "instruction": "What are the properties of Wikidata entities?",
    "query": "SELECT ?root ?rootLabel ?item ?itemL ?itemImage ?item2 ?itemL2 ?itemImage2 ?item3 ?itemL3 ?itemImage3 ?item4 ?itemL4 ?itemImage4 ?item5 ?itemL5 ?itemImage5 ?item6 ?itemL6 ?itemImage6 ?item7 ?itemL7 ?itemImage7 WHERE {\nBIND(wd:Q18616576 AS ?root)\nBIND(wdt:P279 AS ?property)\n?item ?property ?root.\nOPTIONAL { ?item wdt:P18 ?itemImage. }\nOPTIONAL {\n?item2 ?property ?item.\nOPTIONAL { ?item2 wdt:P18 ?itemImage2. }\nOPTIONAL {\n?item3 ?property ?item2.\nOPTIONAL { ?item3 wdt:P18 ?itemImage3. }\nOPTIONAL {\n?item4 ?property ?item3.\nOPTIONAL { ?item4 wdt:P18 ?itemImage4. }\nOPTIONAL {\n?item5 ?property ?item4.\nOPTIONAL { ?item5 wdt:P18 ?itemImage5. }\nOPTIONAL {\n?item6 ?property ?item5.\nOPTIONAL { ?item6 wdt:P18 ?itemImage6. }\nOPTIONAL {\n?item7 ?property ?item6.\nOPTIONAL { ?item7 wdt:P18 ?itemImage7. }\n}\n}\n}\n}\n}\n}\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,es,fr,de\".\n?root rdfs:label ?rootLabel.\n?item rdfs:label ?itemLabel;\nschema:description ?itemDescription.\n?item2 rdfs:label ?itemLabel2;\nschema:description ?itemDescription2.\n?item3 rdfs:label ?itemLabel3;\nschema:description ?itemDescription3.\n?item4 rdfs:label ?itemLabel4;\nschema:description ?itemDescription4.\n?item5 rdfs:label ?itemLabel5;\nschema:description ?itemDescription5.\n?item6 rdfs:label ?itemLabel6;\nschema:description ?itemDescription6.\n?item7 rdfs:label ?itemLabel7;\nschema:description ?itemDescription7.\n}\nBIND(CONCAT(?itemLabel, \": \", COALESCE(?itemDescription, \"\")) AS ?itemL)\nBIND(CONCAT(?itemLabel2, \": \", COALESCE(?itemDescription2, \"\")) AS ?itemL2)\nBIND(CONCAT(?itemLabel3, \": \", COALESCE(?itemDescription3, \"\")) AS ?itemL3)\nBIND(CONCAT(?itemLabel4, \": \", COALESCE(?itemDescription4, \"\")) AS ?itemL4)\nBIND(CONCAT(?itemLabel5, \": \", COALESCE(?itemDescription5, \"\")) AS ?itemL5)\nBIND(CONCAT(?itemLabel6, \": \", COALESCE(?itemDescription6, \"\")) AS ?itemL6)\nBIND(CONCAT(?itemLabel7, \": \", COALESCE(?itemDescription7, \"\")) AS ?itemL7)\n}\nORDER BY (?itemL) (?itemL2) (?itemL3) (?itemL4) (?itemL5) (?itemL6) (?itemL7)\nLIMIT 20000",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?root ?rootLabel ?item ?itemL ?itemImage ?item2 ?itemL2 ?itemImage2 ?item3 ?itemL3 ?itemImage3 ?item4 ?itemL4 ?itemImage4 ?item5 ?itemL5 ?itemImage5 ?item6 ?itemL6 ?itemImage6 ?item7 ?itemL7 ?itemImage7 WHERE {\nBIND(wd:[entity:Wikidata property] AS ?root)\nBIND(wdt:[property:subclass of] AS ?property)\n?item ?property ?root.\nOPTIONAL { ?item wdt:[property:image] ?itemImage. }\nOPTIONAL {\n?item2 ?property ?item.\nOPTIONAL { ?item2 wdt:[property:image] ?itemImage2. }\nOPTIONAL {\n?item3 ?property ?item2.\nOPTIONAL { ?item3 wdt:[property:image] ?itemImage3. }\nOPTIONAL {\n?item4 ?property ?item3.\nOPTIONAL { ?item4 wdt:[property:image] ?itemImage4. }\nOPTIONAL {\n?item5 ?property ?item4.\nOPTIONAL { ?item5 wdt:[property:image] ?itemImage5. }\nOPTIONAL {\n?item6 ?property ?item5.\nOPTIONAL { ?item6 wdt:[property:image] ?itemImage6. }\nOPTIONAL {\n?item7 ?property ?item6.\nOPTIONAL { ?item7 wdt:[property:image] ?itemImage7. }\n}\n}\n}\n}\n}\n}\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,es,fr,de\".\n?root rdfs:label ?rootLabel.\n?item rdfs:label ?itemLabel;\nschema:description ?itemDescription.\n?item2 rdfs:label ?itemLabel2;\nschema:description ?itemDescription2.\n?item3 rdfs:label ?itemLabel3;\nschema:description ?itemDescription3.\n?item4 rdfs:label ?itemLabel4;\nschema:description ?itemDescription4.\n?item5 rdfs:label ?itemLabel5;\nschema:description ?itemDescription5.\n?item6 rdfs:label ?itemLabel6;\nschema:description ?itemDescription6.\n?item7 rdfs:label ?itemLabel7;\nschema:description ?itemDescription7.\n}\nBIND(CONCAT(?itemLabel, \": \", COALESCE(?itemDescription, \"\")) AS ?itemL)\nBIND(CONCAT(?itemLabel2, \": \", COALESCE(?itemDescription2, \"\")) AS ?itemL2)\nBIND(CONCAT(?itemLabel3, \": \", COALESCE(?itemDescription3, \"\")) AS ?itemL3)\nBIND(CONCAT(?itemLabel4, \": \", COALESCE(?itemDescription4, \"\")) AS ?itemL4)\nBIND(CONCAT(?itemLabel5, \": \", COALESCE(?itemDescription5, \"\")) AS ?itemL5)\nBIND(CONCAT(?itemLabel6, \": \", COALESCE(?itemDescription6, \"\")) AS ?itemL6)\nBIND(CONCAT(?itemLabel7, \": \", COALESCE(?itemDescription7, \"\")) AS ?itemL7)\n}\nORDER BY (?itemL) (?itemL2) (?itemL3) (?itemL4) (?itemL5) (?itemL6) (?itemL7)\nLIMIT 20000",
    "complexity": "complex"
  },
  {
    "id": "627",
    "instruction": "List all languages with their corresponding labels where the disease ontology ID is DOID:399.",
    "query": "SELECT ?English ?language ?label WHERE {\n?disease wdt:P699 \"DOID:399\";\nrdfs:label ?English;\nrdfs:label ?label .\nBIND(LANG(?label) as ?languageCode)\n?wdLanguage wdt:P424 ?languageCode;\nrdfs:label ?language .\nFILTER EXISTS {?wdLanguage wdt:P31?/wdt:P279+ wd:Q17376908}\nFILTER (LANG(?English)=\"en\")\nFILTER (LANG(?language)=\"en\")\n} ORDER BY ?language",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?English ?language ?label WHERE {\n?disease wdt:[property:Disease Ontology ID] \"DOID:399\";\nrdfs:label ?English;\nrdfs:label ?label .\nBIND(LANG(?label) as ?languageCode)\n?wdLanguage wdt:[property:Wikimedia language code] ?languageCode;\nrdfs:label ?language .\nFILTER EXISTS {?wdLanguage wdt:[property:instance of]?/wdt:[property:subclass of]+ wd:[entity:languoid]}\nFILTER (LANG(?English)=\"en\")\nFILTER (LANG(?language)=\"en\")\n} ORDER BY ?language",
    "complexity": "complex"
  },
  {
    "id": "217",
    "instruction": "List artists with the most artworks in both Tate and National Portrait Gallery collections.",
    "query": "SELECT (?count1 AS ?in_Tate) (?count2 AS ?in_NPG) ?artist WHERE {\n{ SELECT (COUNT(?obj1) AS ?count1) ?creator WHERE {\n?obj1 wdt:P195 wd:Q430682. #Tate\n?obj1 wdt:P170 ?creator.\n} GROUP BY ?creator }\n{ SELECT (COUNT(?obj2) AS ?count2) ?creator WHERE {\n?obj2 wdt:P195 wd:Q238587. #National Portrait Gallery\n?obj2 wdt:P170 ?creator.\n} GROUP BY ?creator }\nFILTER (?creator != wd:Q4233718) # exclude anonymous works\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". ?creator rdfs:label ?artist }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT (?count1 AS ?in_Tate) (?count2 AS ?in_NPG) ?artist WHERE {\n{ SELECT (COUNT(?obj1) AS ?count1) ?creator WHERE {\n?obj1 wdt:[property:collection] wd:[entity:Tate]. #Tate\n?obj1 wdt:[property:creator] ?creator.\n} GROUP BY ?creator }\n{ SELECT (COUNT(?obj2) AS ?count2) ?creator WHERE {\n?obj2 wdt:[property:collection] wd:[entity:National Portrait Gallery]. #National Portrait Gallery\n?obj2 wdt:[property:creator] ?creator.\n} GROUP BY ?creator }\nFILTER (?creator != wd:[entity:anonymous]) # exclude anonymous works\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". ?creator rdfs:label ?artist }\n}",
    "complexity": "complex"
  },
  {
    "id": "975",
    "instruction": "List all medieval battles without a specific location.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?placeLabel ?date ?coords WHERE {\n?item wdt:P31 wd:Q15991159 .\n{\nFILTER NOT EXISTS { ?item wdt:P276 ?place . }\n} UNION {\nFILTER NOT EXISTS { ?item wdt:P585 ?date . }\n}\nOPTIONAL{ ?item wdt:P625 ?coords . }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,fr\" }\n} ORDER BY ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?placeLabel ?date ?coords WHERE {\n?item wdt:[property:instance of] wd:[entity:medieval battle] .\n{\nFILTER NOT EXISTS { ?item wdt:[property:location] ?place . }\n} UNION {\nFILTER NOT EXISTS { ?item wdt:[property:point in time] ?date . }\n}\nOPTIONAL{ ?item wdt:[property:coordinate location] ?coords . }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,fr\" }\n} ORDER BY ?itemLabel",
    "complexity": "complex"
  },
  {
    "id": "1987",
    "instruction": "List the heads of government who returned to power after the longest time gap.",
    "query": "SELECT DISTINCT ?person ?personLabel ?office ?officeLabel ?end1 ?start2 (FLOOR(?days/36.525)/10 AS ?gap)\nWHERE {\n# Offices Held by Heads of Government\n?country wdt:P31 wd:Q3624078; p:P1313/ps:P1313 ?office .\n# People who have held the office more than once\n?person p:P39 [ ps:P39 ?office ; pq:P582 ?end1 ] .\n?person p:P39 [ ps:P39 ?office ; pq:P580 ?start2 ] .\nFILTER (?start2 > ?end1)\nFILTER NOT EXISTS { # but must be successive periods\n?person p:P39 [ ps:P39 ?office ; pq:P580 ?start3 ] .\nFILTER((?start3 > ?end1) && (?start3 < ?start2))\n}\n# How long between end of one term and start of the next\nBIND (?start2 - ?end1 AS ?days)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?days)\nLIMIT 10",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?person ?personLabel ?office ?officeLabel ?end1 ?start2 (FLOOR(?days/36.525)/10 AS ?gap)\nWHERE {\n# Offices Held by Heads of Government\n?country wdt:[property:instance of] wd:[entity:sovereign state]; p:[property:office held by head of government]/ps:[property:office held by head of government] ?office .\n# People who have held the office more than once\n?person p:[property:position held] [ ps:[property:position held] ?office ; pq:[property:end time] ?end1 ] .\n?person p:[property:position held] [ ps:[property:position held] ?office ; pq:[property:start time] ?start2 ] .\nFILTER (?start2 > ?end1)\nFILTER NOT EXISTS { # but must be successive periods\n?person p:[property:position held] [ ps:[property:position held] ?office ; pq:[property:start time] ?start3 ] .\nFILTER((?start3 > ?end1) && (?start3 < ?start2))\n}\n# How long between end of one term and start of the next\nBIND (?start2 - ?end1 AS ?days)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?days)\nLIMIT 10",
    "complexity": "complex"
  },
  {
    "id": "2729",
    "instruction": "List all students and their advisors in the Stanford Thesis Project.",
    "query": "SELECT ?author1 ?author1Label ?rgb ?author2 ?author2Label\nWITH {\nSELECT ?author1 ?author2 ?rgb WHERE {\n{ ?author1 wdt:P5008 wd:Q113628913 .}\n{ ?author2 wdt:P5008 wd:Q113628913 .}\n{?author1 wdt:P184 ?author2 }\nUNION\n{?author2 wdt:P185 ?author1 }\n?author1 wdt:P21 ?gender1 .\nBIND ( IF(?gender1 = wd:Q6581097, \"3182BD\", \"E6550D\") AS ?rgb)\n}\n} AS %result\nWHERE {\nINCLUDE %result\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,da,de,es,fr,jp,sv,ru,zh\".\n}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?author1 ?author1Label ?rgb ?author2 ?author2Label\nWITH {\nSELECT ?author1 ?author2 ?rgb WHERE {\n{ ?author1 wdt:[property:on focus list of Wikimedia project] wd:[entity:StanfordThesisProject] .}\n{ ?author2 wdt:[property:on focus list of Wikimedia project] wd:[entity:StanfordThesisProject] .}\n{?author1 wdt:[property:doctoral advisor] ?author2 }\nUNION\n{?author2 wdt:[property:doctoral student] ?author1 }\n?author1 wdt:[property:sex or gender] ?gender1 .\nBIND ( IF(?gender1 = wd:[entity:male], \"3182BD\", \"E6550D\") AS ?rgb)\n}\n} AS %result\nWHERE {\nINCLUDE %result\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,da,de,es,fr,jp,sv,ru,zh\".\n}\n}",
    "complexity": "complex"
  },
  {
    "id": "1206",
    "instruction": "List fictional characters who are married to their siblings.",
    "query": "SELECT DISTINCT ?character ?characterLabel ?spouseLabel ?universeLabel WHERE {\n?character wdt:P31/wdt:P279* wd:Q95074;\nwdt:P26|^wdt:P26 ?spouse;\nwdt:P3373|^wdt:P3373 ?spouse.\nOPTIONAL { ?character wdt:P1080 ?universe. }\nFILTER(STR(?character) < STR(?spouse))\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY ?universeLabel ?characterLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?character ?characterLabel ?spouseLabel ?universeLabel WHERE {\n?character wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:fictional character];\nwdt:[property:spouse]|^wdt:[property:spouse] ?spouse;\nwdt:[property:sibling]|^wdt:[property:sibling] ?spouse.\nOPTIONAL { ?character wdt:[property:from narrative universe] ?universe. }\nFILTER(STR(?character) < STR(?spouse))\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY ?universeLabel ?characterLabel",
    "complexity": "complex"
  },
  {
    "id": "272",
    "instruction": "What are the items in Oxford collections that have a specific property?",
    "query": "SELECT (SUBSTR(STR(?thing),32) AS ?q) (SUBSTR(STR(?prop),37) as ?p) (SUBSTR(STR(?item),32) AS ?itemq) ?itemLabel ?fullwork (SUBSTR(STR(?coll),32) as ?collq) ?inventory ?url (GROUP_CONCAT(SUBSTR(STR(?artist),32);separator=\" \") AS ?artists)\n(GROUP_CONCAT(?typeLabel; separator=\", \") AS ?types) ?from (YEAR(?latest) AS ?to) ?precision WHERE {\nVALUES ?coll {wd:Q636400 wd:Q82133 wd:Q1456119 wd:Q6941088} # Ashmolean, Bodleian, PRM, MHS\n?item p:P195 [ps:P195 ?coll; pq:P217 ?inventory].\nVALUES ?prop {wdt:P180 wdt:P170 wdt:P1774 wdt:P138} # depicted, creator, school of, named after\n?item ?prop ?thing; wdt:P31 ?type.\nOPTIONAL {?item wdt:P973 ?url FILTER(CONTAINS(STR(?url), \".ox.ac.uk\") || CONTAINS(STR(?url), \"ashmolean.org\") )}\nOPTIONAL {?item wdt:P953 ?fullwork FILTER(CONTAINS(STR(?fullwork), \".ox.ac.uk\") || CONTAINS(STR(?fullwork), \"ashmolean.org\") )}\nFILTER (BOUND(?fullwork) || BOUND(?url) )\nOPTIONAL {?item wdt:P170 ?artist}\nOPTIONAL {?item p:P571 [pq:P1319 ?earliest; pq:P1326 ?latest] }\nOPTIONAL {?item p:P571/psv:P571 [ wikibase:timePrecision ?precision; wikibase:timeValue ?year ] }\nBIND(IF (BOUND(?earliest), YEAR(?earliest), YEAR(?year)) AS ?from)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" .\n?item rdfs:label ?itemLabel. ?type rdfs:label ?typeLabel }\n} GROUP BY ?thing ?prop ?item ?itemLabel ?fullwork ?inventory ?url ?coll ?from ?latest ?precision\nORDER BY DESC(?prop) ?from ?to",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT (SUBSTR(STR(?thing),32) AS ?q) (SUBSTR(STR(?prop),37) as ?p) (SUBSTR(STR(?item),32) AS ?itemq) ?itemLabel ?fullwork (SUBSTR(STR(?coll),32) as ?collq) ?inventory ?url (GROUP_CONCAT(SUBSTR(STR(?artist),32);separator=\" \") AS ?artists)\n(GROUP_CONCAT(?typeLabel; separator=\", \") AS ?types) ?from (YEAR(?latest) AS ?to) ?precision WHERE {\nVALUES ?coll {wd:[entity:Ashmolean Museum] wd:[entity:Bodleian Library] wd:[entity:Pitt Rivers Museum] wd:[entity:History of Science Museum]} # Ashmolean, Bodleian, PRM, MHS\n?item p:[property:collection] [ps:[property:collection] ?coll; pq:[property:inventory number] ?inventory].\nVALUES ?prop {wdt:[property:depicts] wdt:[property:creator] wdt:[property:workshop of] wdt:[property:named after]} # depicted, creator, school of, named after\n?item ?prop ?thing; wdt:[property:instance of] ?type.\nOPTIONAL {?item wdt:[property:described at URL] ?url FILTER(CONTAINS(STR(?url), \".ox.ac.uk\") || CONTAINS(STR(?url), \"ashmolean.org\") )}\nOPTIONAL {?item wdt:[property:full work available at URL] ?fullwork FILTER(CONTAINS(STR(?fullwork), \".ox.ac.uk\") || CONTAINS(STR(?fullwork), \"ashmolean.org\") )}\nFILTER (BOUND(?fullwork) || BOUND(?url) )\nOPTIONAL {?item wdt:[property:creator] ?artist}\nOPTIONAL {?item p:[property:inception] [pq:[property:earliest date] ?earliest; pq:[property:latest date] ?latest] }\nOPTIONAL {?item p:[property:inception]/psv:[property:inception] [ wikibase:timePrecision ?precision; wikibase:timeValue ?year ] }\nBIND(IF (BOUND(?earliest), YEAR(?earliest), YEAR(?year)) AS ?from)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" .\n?item rdfs:label ?itemLabel. ?type rdfs:label ?typeLabel }\n} GROUP BY ?thing ?prop ?item ?itemLabel ?fullwork ?inventory ?url ?coll ?from ?latest ?precision\nORDER BY DESC(?prop) ?from ?to",
    "complexity": "complex"
  },
  {
    "id": "453",
    "instruction": "What properties are most commonly used to describe items related to 'mort pour la France'?",
    "query": "SELECT ?property ?count\nWHERE {\nSELECT ?property (COUNT(?item) AS ?count)\nWHERE {\n?item ?statement wd:Q3324507 . # items pointing to Q3324507 through a statement\n?property wikibase:statementProperty ?statement . # property used for that statement\n} GROUP BY ?property # count usage for each property pointing to that entity\n} ORDER BY DESC(?count) # show in descending order of uses",
    "annotated": "PREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?property ?count\nWHERE {\nSELECT ?property (COUNT(?item) AS ?count)\nWHERE {\n?item ?statement wd:[entity:mort pour la France] . # items pointing to [entity:mort pour la France] through a statement\n?property wikibase:statementProperty ?statement . # property used for that statement\n} GROUP BY ?property # count usage for each property pointing to that entity\n} ORDER BY DESC(?count) # show in descending order of uses",
    "complexity": "complex"
  }
]