[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "1677",
    "instruction": "List the European countries with more than 300 politicians, both male and female.",
    "query": "SELECT ?countryFemale ?countryFemaleLabel (?countFemales / (?countMales + ?countFemales) AS ?ratioFemales) WHERE {\n{\nSELECT ?countryMale (COUNT(?itemMale) AS ?countMales) WHERE {\n?itemMale wdt:P106 wd:Q82955;\nwdt:P569 ?dateBirthMale;\nwdt:P31 wd:Q5;\nwdt:P21 wd:Q6581097;\nwdt:P27 ?countryMale.\nFILTER((YEAR(?dateBirthMale)) > 1960 )\n}\nGROUP BY ?countryMale\n}\n{\nSELECT ?countryFemale (COUNT(?itemFemale) AS ?countFemales) WHERE {\n?itemFemale wdt:P106 wd:Q82955;\nwdt:P569 ?dateBirthFemale;\nwdt:P31 wd:Q5;\nwdt:P21 wd:Q6581072;\nwdt:P27 ?countryFemale.\nFILTER((YEAR(?dateBirthFemale)) > 1960 )\n}\nGROUP BY ?countryFemale\n}\nFILTER(?countryMale = ?countryFemale)\nFILTER((?countMales + ?countFemales) > 300 )\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC (?ratioFemales)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?countryFemale ?countryFemaleLabel (?countFemales / (?countMales + ?countFemales) AS ?ratioFemales) WHERE {\n{\nSELECT ?countryMale (COUNT(?itemMale) AS ?countMales) WHERE {\n?itemMale wdt:[property:occupation] wd:[entity:politician];\nwdt:[property:date of birth] ?dateBirthMale;\nwdt:[property:instance of] wd:[entity:human];\nwdt:[property:sex or gender] wd:[entity:male];\nwdt:[property:country of citizenship] ?countryMale.\nFILTER((YEAR(?dateBirthMale)) > 1960 )\n}\nGROUP BY ?countryMale\n}\n{\nSELECT ?countryFemale (COUNT(?itemFemale) AS ?countFemales) WHERE {\n?itemFemale wdt:[property:occupation] wd:[entity:politician];\nwdt:[property:date of birth] ?dateBirthFemale;\nwdt:[property:instance of] wd:[entity:human];\nwdt:[property:sex or gender] wd:[entity:female];\nwdt:[property:country of citizenship] ?countryFemale.\nFILTER((YEAR(?dateBirthFemale)) > 1960 )\n}\nGROUP BY ?countryFemale\n}\nFILTER(?countryMale = ?countryFemale)\nFILTER((?countMales + ?countFemales) > 300 )\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC (?ratioFemales)",
    "complexity": "complex"
  },
  {
    "id": "2256",
    "instruction": "List all places in Czechia that have changed their geographical coordinates over time.",
    "query": "SELECT ?item ?line WHERE {\n?item wdt:P17 wd:Q213 .\n?item wdt:P625 [] .\n?item p:P625 ?statement1, ?statement2 filter(?statement1 != ?statement2).\n{?statement1 pq:P580 [] .} union {?statement1 pq:P582 [] .}\n{?statement1 pq:P580 [] .} union {?statement2 pq:P582 [] .}\n?statement1 ps:P625 []; psv:P625 [ wikibase:geoLongitude ?coord1lon; wikibase:geoLatitude ?coord1lat; ].\n?statement2 ps:P625 []; psv:P625 [ wikibase:geoLongitude ?coord2lon; wikibase:geoLatitude ?coord2lat; ].\nBIND(CONCAT('LINESTRING (', STR(?coord1lon), ' ', STR(?coord1lat), ',', STR(?coord2lon), ' ', STR(?coord2lat), ')') AS ?str) .\nBIND(STRDT(?str, geo:wktLiteral) AS ?line)\n}",
    "annotated": "PREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?line WHERE {\n?item wdt:[property:country] wd:[entity:Czech Republic] .\n?item wdt:[property:coordinate location] [] .\n?item p:[property:coordinate location] ?statement1, ?statement2 filter(?statement1 != ?statement2).\n{?statement1 pq:[property:start time] [] .} union {?statement1 pq:[property:end time] [] .}\n{?statement1 pq:[property:start time] [] .} union {?statement2 pq:[property:end time] [] .}\n?statement1 ps:[property:coordinate location] []; psv:[property:coordinate location] [ wikibase:geoLongitude ?coord1lon; wikibase:geoLatitude ?coord1lat; ].\n?statement2 ps:[property:coordinate location] []; psv:[property:coordinate location] [ wikibase:geoLongitude ?coord2lon; wikibase:geoLatitude ?coord2lat; ].\nBIND(CONCAT('LINESTRING (', STR(?coord1lon), ' ', STR(?coord1lat), ',', STR(?coord2lon), ' ', STR(?coord2lat), ')') AS ?str) .\nBIND(STRDT(?str, geo:wktLiteral) AS ?line)\n}",
    "complexity": "complex"
  },
  {
    "id": "2266",
    "instruction": "List all subclasses of musical instruments with the highest number of instances.",
    "query": "SELECT ?class ?classLabel ?classDescription ?count WITH {\nSELECT ?class (COUNT(*) AS ?count) WHERE {\n?class wdt:P279+ wd:Q34379.\n?instance wdt:P31 ?class.\n}\nGROUP BY ?class\n} AS %results WHERE {\nINCLUDE %results.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?class ?classLabel ?classDescription ?count WITH {\nSELECT ?class (COUNT(*) AS ?count) WHERE {\n?class wdt:[property:subclass of]+ wd:[entity:musical instrument].\n?instance wdt:[property:instance of] ?class.\n}\nGROUP BY ?class\n} AS %results WHERE {\nINCLUDE %results.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "1339",
    "instruction": "List the top 100 painters with the most Wikipedia articles about their works.",
    "query": "SELECT ?Peintre ?PeintreLabel (SUM(?NbArticles) as ?TotalArticles)\nWHERE {\n?item wdt:P31/wdt:P279* wd:Q3305213.\n?item wdt:P170 ?Peintre.\nMINUS {?item wdt:P170 wd:Q4233718}\n?item wikibase:sitelinks ?NbArticles .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr,en\" }\n} GROUP BY ?Peintre ?PeintreLabel\nORDER BY DESC(?TotalArticles)\nLIMIT 100",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?Peintre ?PeintreLabel (SUM(?NbArticles) as ?TotalArticles)\nWHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:painting].\n?item wdt:[property:creator] ?Peintre.\nMINUS {?item wdt:[property:creator] wd:[entity:anonymous]}\n?item wikibase:sitelinks ?NbArticles .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr,en\" }\n} GROUP BY ?Peintre ?PeintreLabel\nORDER BY DESC(?TotalArticles)\nLIMIT 100",
    "complexity": "complex"
  },
  {
    "id": "281",
    "instruction": "What are the different eras in Japanese history?",
    "query": "SELECT ?era ?eraLabel (YEAR(?start_time) AS ?start) (YEAR(?end_time) AS ?end) ?subera ?suberaLabel\n(YEAR(?sub_start_time) AS ?sub_start) (YEAR(?sub_end_time) AS ?sub_end) WHERE {\n?era wdt:P31 wd:Q11514315; wdt:P361 wd:Q130436; # eras of the history of Japan\nwdt:P580 ?start_time.\nMINUS { ?era wdt:P2348 []} # exclude sub-eras\nOPTIONAL { ?era wdt:P582 ?end_time }\nOPTIONAL { ?subera wdt:P2348 ?era; wdt:P361 wd:Q130436; wdt:P580 ?sub_start_time;\nwdt:P582 ?sub_end_time }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} ORDER BY ?start DESC(?end)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?era ?eraLabel (YEAR(?start_time) AS ?start) (YEAR(?end_time) AS ?end) ?subera ?suberaLabel\n(YEAR(?sub_start_time) AS ?sub_start) (YEAR(?sub_end_time) AS ?sub_end) WHERE {\n?era wdt:[property:instance of] wd:[entity:historical period]; wdt:[property:part of] wd:[entity:history of Japan]; # eras of the history of Japan\nwdt:[property:start time] ?start_time.\nMINUS { ?era wdt:[property:time period] []} # exclude sub-eras\nOPTIONAL { ?era wdt:[property:end time] ?end_time }\nOPTIONAL { ?subera wdt:[property:time period] ?era; wdt:[property:part of] wd:[entity:history of Japan]; wdt:[property:start time] ?sub_start_time;\nwdt:[property:end time] ?sub_end_time }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} ORDER BY ?start DESC(?end)",
    "complexity": "complex"
  },
  {
    "id": "74",
    "instruction": "List poems from the 18th century along with their authors and languages.",
    "query": "SELECT ?poem ?poemLabel ?languageLabel ?authorLabel ?year WHERE {\n?poem wdt:P31/wdt:P279? wd:Q5185279;\nOPTIONAL{?poem wdt:P577 ?pubdate}\nOPTIONAL{?poem wdt:P571 ?inception}\nOPTIONAL{?poem wdt:P50 ?author}\nOPTIONAL{?poem wdt:P407 ?language}\nBIND((IF (BOUND(?pubdate),?pubdate,?inception) ) AS ?date)\nBIND(YEAR(?date) AS ?year)\nFILTER (?year > 1699 && ?year < 1800)\nSERVICE wikibase:label {bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,de,fr,ru\"}\n} ORDER BY ?authorLabel ?year ?poemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?poem ?poemLabel ?languageLabel ?authorLabel ?year WHERE {\n?poem wdt:[property:instance of]/wdt:[property:subclass of]? wd:[entity:poem];\nOPTIONAL{?poem wdt:[property:publication date] ?pubdate}\nOPTIONAL{?poem wdt:[property:inception] ?inception}\nOPTIONAL{?poem wdt:[property:author] ?author}\nOPTIONAL{?poem wdt:[property:language of work or name] ?language}\nBIND((IF (BOUND(?pubdate),?pubdate,?inception) ) AS ?date)\nBIND(YEAR(?date) AS ?year)\nFILTER (?year > 1699 && ?year < 1800)\nSERVICE wikibase:label {bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,de,fr,ru\"}\n} ORDER BY ?authorLabel ?year ?poemLabel",
    "complexity": "complex"
  },
  {
    "id": "1803",
    "instruction": "What are the most popular movie genres in each decade?",
    "query": "SELECT ?decade ?genre ?genreLabel ?count ?decadeCount (100 * ?count / ?decadeCount AS ?percentage) WHERE {\n{\nSELECT ?decade ?genre (count(?x) as ?count) WHERE {\n{\n# TOP 20 Genres\nSELECT ?top20Genre ?count WHERE {\n{\nSELECT ?genre (count(?x) as ?count) WHERE {\n?x wdt:P31 wd:Q11424.\n?x wdt:P136 ?genre.\n# Exclude silent film; doesn't make a ton of sense\n# in this context, since it's more about the medium\n# than the content\nFILTER(?genre != wd:Q226730)\n}\nGROUP BY ?genre\n}\nBIND(?genre as ?top20Genre)\n}\nORDER BY DESC(?count)\nLIMIT 20\n}\n{\nSELECT ?x (min(?pubDate) as ?firstPubDate) WHERE {\n?x wdt:P31 wd:Q11424.\n?x wdt:P577 ?pubDate.\n}\nGROUP BY ?x\n}\n?x wdt:P136 ?top20Genre.\nBIND(?top20Genre as ?genre)\nBIND(concat(str(floor(year(?firstPubDate) / 10)), \"0s\") as ?decade)\nFILTER(!isBlank(?decade))\n}\nGROUP BY ?decade ?genre\n}\n{\n# Movies per decade\nSELECT ?decade (count(?x) as ?decadeCount) WHERE {\n{\nSELECT ?x (min(?pubDate) as ?firstPubDate) WHERE {\n?x wdt:P31 wd:Q11424.\n?x wdt:P577 ?pubDate.\n}\nGROUP BY ?x\n}\nBIND(concat(str(floor(year(?firstPubDate) / 10)), \"0s\") as ?decade)\n# This filter is very important (in both subqueries)! Otherwise\n# the results of the sub queries can't be properly aligned.\nFILTER(!isBlank(?decade))\n}\nGROUP BY ?decade\n}\n# See https://www.wikidata.org/wiki/Q22917333\nFILTER(?decade != \"2110s\")\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?decade ?genre ?genreLabel ?count ?decadeCount (100 * ?count / ?decadeCount AS ?percentage) WHERE {\n{\nSELECT ?decade ?genre (count(?x) as ?count) WHERE {\n{\n# TOP 20 Genres\nSELECT ?top20Genre ?count WHERE {\n{\nSELECT ?genre (count(?x) as ?count) WHERE {\n?x wdt:[property:instance of] wd:[entity:film].\n?x wdt:[property:genre] ?genre.\n# Exclude silent film; doesn't make a ton of sense\n# in this context, since it's more about the medium\n# than the content\nFILTER(?genre != wd:[entity:silent film])\n}\nGROUP BY ?genre\n}\nBIND(?genre as ?top20Genre)\n}\nORDER BY DESC(?count)\nLIMIT 20\n}\n{\nSELECT ?x (min(?pubDate) as ?firstPubDate) WHERE {\n?x wdt:[property:instance of] wd:[entity:film].\n?x wdt:[property:publication date] ?pubDate.\n}\nGROUP BY ?x\n}\n?x wdt:[property:genre] ?top20Genre.\nBIND(?top20Genre as ?genre)\nBIND(concat(str(floor(year(?firstPubDate) / 10)), \"0s\") as ?decade)\nFILTER(!isBlank(?decade))\n}\nGROUP BY ?decade ?genre\n}\n{\n# Movies per decade\nSELECT ?decade (count(?x) as ?decadeCount) WHERE {\n{\nSELECT ?x (min(?pubDate) as ?firstPubDate) WHERE {\n?x wdt:[property:instance of] wd:[entity:film].\n?x wdt:[property:publication date] ?pubDate.\n}\nGROUP BY ?x\n}\nBIND(concat(str(floor(year(?firstPubDate) / 10)), \"0s\") as ?decade)\n# This filter is very important (in both subqueries)! Otherwise\n# the results of the sub queries can't be properly aligned.\nFILTER(!isBlank(?decade))\n}\nGROUP BY ?decade\n}\n# See https://www.wikidata.org/wiki/Q22917333\nFILTER(?decade != \"2110s\")\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "174",
    "instruction": "List the countries where the most chemical elements were discovered.",
    "query": "SELECT ?countryLabel (COUNT(?element) AS ?count) (GROUP_CONCAT(DISTINCT ?elementLabel) AS ?list) WHERE {\n?element wdt:P31 wd:Q11344; # chemical element\nwdt:P61/wdt:P27 ?country. # nationality of discoverer\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\".\n?country rdfs:label ?countryLabel. ?element rdfs:label ?elementLabel}\n} GROUP BY ?countryLabel\nORDER BY DESC (?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?countryLabel (COUNT(?element) AS ?count) (GROUP_CONCAT(DISTINCT ?elementLabel) AS ?list) WHERE {\n?element wdt:[property:instance of] wd:[entity:chemical element]; # chemical element\nwdt:[property:discoverer or inventor]/wdt:[property:country of citizenship] ?country. # nationality of discoverer\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\".\n?country rdfs:label ?countryLabel. ?element rdfs:label ?elementLabel}\n} GROUP BY ?countryLabel\nORDER BY DESC (?count)",
    "complexity": "complex"
  },
  {
    "id": "262",
    "instruction": "How many items in the Ashmolean Museum have a location linked to them from Jameel Centre?",
    "query": "SELECT (COUNT(?loc) as ?count) WHERE {\n?item wdt:P195 wd:Q636400; wdt:P973 ?url FILTER (STRSTARTS(STR(?url),\"http://jameelcentre\") ).\n?item ?prop ?loc. ?loc wdt:P625 [] FILTER (?loc != wd:Q636400)\n}",
    "annotated": "PREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT (COUNT(?loc) as ?count) WHERE {\n?item wdt:[property:collection] wd:[entity:Ashmolean Museum]; wdt:[property:described at URL] ?url FILTER (STRSTARTS(STR(?url),\"http://jameelcentre\") ).\n?item ?prop ?loc. ?loc wdt:[property:coordinate location] [] FILTER (?loc != wd:[entity:Ashmolean Museum])\n}",
    "complexity": "complex"
  },
  {
    "id": "2193",
    "instruction": "List GLAMs with open access policies along with their locations.",
    "query": "SELECT ?item ?itemLabel ?coordinate_location ?image WHERE {\n?item wdt:P1343 wd:Q73357989.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\nOPTIONAL {\n{ ?item wdt:P625 ?coordinate_location. }\nUNION\n{\n?item p:P159 ?headquarters.\n?headquarters pq:P625 ?coordinate_location.\n}\n}\nOPTIONAL { ?item wdt:P18 ?image. }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?coordinate_location ?image WHERE {\n?item wdt:[property:described by source] wd:[entity:Survey of GLAM open access policy and practice].\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\nOPTIONAL {\n{ ?item wdt:[property:coordinate location] ?coordinate_location. }\nUNION\n{\n?item p:[property:headquarters location] ?headquarters.\n?headquarters pq:[property:coordinate location] ?coordinate_location.\n}\n}\nOPTIONAL { ?item wdt:[property:image] ?image. }\n}",
    "complexity": "complex"
  },
  {
    "id": "1035",
    "instruction": "List all French communes named after a river.",
    "query": "SELECT ?item ?itemLabel ?layer ?coords WHERE {\n?item wdt:P31/wdt:P279* wd:Q484170;\nwdt:P17 wd:Q142;\nwdt:P138 ?river;\nwdt:P625 ?coords .\n?river wdt:P31/wdt:P279* wd:Q355304 .\n?river rdfs:label ?layer . FILTER(LANG(?layer) = 'fr')\n}\nORDER BY ?riverLabel ?itemLabel",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?item ?itemLabel ?layer ?coords WHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:commune of France];\nwdt:[property:country] wd:[entity:France];\nwdt:[property:named after] ?river;\nwdt:[property:coordinate location] ?coords .\n?river wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:watercourse] .\n?river rdfs:label ?layer . FILTER(LANG(?layer) = 'fr')\n}\nORDER BY ?riverLabel ?itemLabel",
    "complexity": "complex"
  },
  {
    "id": "1608",
    "instruction": "What are the most common color combinations used in national flags?",
    "query": "SELECT DISTINCT ?color1 ?color1Label ?color2 ?color2Label (COUNT(DISTINCT ?flag) AS ?count) WHERE {\n?flag wdt:P31/wdt:P279* wd:Q186516 ;\nwdt:P1001 ?country ;\nwdt:P462/wdt:P279* ?color1 ;\nwdt:P462/wdt:P279* ?color2 .\n?color1 wdt:P31 wd:Q1075 .\n?color2 wdt:P31 wd:Q1075 .\n?country wdt:P31 wd:Q3624078 .\nFILTER NOT EXISTS { ?country wdt:P576 ?x }\nFILTER NOT EXISTS { ?color1 wdt:P279 ?c . ?c wdt:P31 wd:Q1075 }\nFILTER NOT EXISTS { ?color2 wdt:P279 ?c . ?c wdt:P31 wd:Q1075 }\n?color1 rdfs:label ?color1L filter (lang(?color1L) = \"en\") .\n?color2 rdfs:label ?color2L filter (lang(?color2L) = \"en\") .\nFILTER(xsd:string(?color1L) < xsd:string(?color2L))\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?color1 ?color1Label ?color2 ?color2Label\nORDER BY DESC(?count) ?color1Label ?color2Label",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?color1 ?color1Label ?color2 ?color2Label (COUNT(DISTINCT ?flag) AS ?count) WHERE {\n?flag wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:national flag] ;\nwdt:[property:applies to jurisdiction] ?country ;\nwdt:[property:color]/wdt:[property:subclass of]* ?color1 ;\nwdt:[property:color]/wdt:[property:subclass of]* ?color2 .\n?color1 wdt:[property:instance of] wd:[entity:color] .\n?color2 wdt:[property:instance of] wd:[entity:color] .\n?country wdt:[property:instance of] wd:[entity:sovereign state] .\nFILTER NOT EXISTS { ?country wdt:[property:dissolved, abolished or demolished date] ?x }\nFILTER NOT EXISTS { ?color1 wdt:[property:subclass of] ?c . ?c wdt:[property:instance of] wd:[entity:color] }\nFILTER NOT EXISTS { ?color2 wdt:[property:subclass of] ?c . ?c wdt:[property:instance of] wd:[entity:color] }\n?color1 rdfs:label ?color1L filter (lang(?color1L) = \"en\") .\n?color2 rdfs:label ?color2L filter (lang(?color2L) = \"en\") .\nFILTER(xsd:string(?color1L) < xsd:string(?color2L))\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?color1 ?color1Label ?color2 ?color2Label\nORDER BY DESC(?count) ?color1Label ?color2Label",
    "complexity": "complex"
  },
  {
    "id": "566",
    "instruction": "What are the metro stations on Paris Metro Line 1?",
    "query": "SELECT ?item ?itemLabel ?adjacent ?adjacentL ?coords\n{\n?item wdt:P31/wdt:P279* wd:Q928830 ;\nwdt:P81 wd:Q13224 ;\nwdt:P625 ?coords .\nOPTIONAL {\n?item p:P197 [ ps:P197 ?adjacent ; pq:P5051 wd:Q585752;\npq:P81 wd:Q13224] .\n?adjacent rdfs:label ?adjacentL FILTER (lang(?adjacentL) = \"en\")\n}\n?item wdt:P1619 ?founded_date. #needs existence\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} ORDER BY ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?adjacent ?adjacentL ?coords\n{\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:metro station] ;\nwdt:[property:connecting line] wd:[entity:Paris M\u00e9tro Line 1] ;\nwdt:[property:coordinate location] ?coords .\nOPTIONAL {\n?item p:[property:adjacent station] [ ps:[property:adjacent station] ?adjacent ; pq:[property:towards] wd:[entity:Ch\u00e2teau de Vincennes];\npq:[property:connecting line] wd:[entity:Paris M\u00e9tro Line 1]] .\n?adjacent rdfs:label ?adjacentL FILTER (lang(?adjacentL) = \"en\")\n}\n?item wdt:[property:date of official opening] ?founded_date. #needs existence\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} ORDER BY ?itemLabel",
    "complexity": "complex"
  },
  {
    "id": "2831",
    "instruction": "List all free software licenses with their frequency of use.",
    "query": "SELECT ?licLabel (COUNT(?lic) AS ?count) WHERE {\n?item wdt:P31/wdt:P279* wd:Q7397 ;\nwdt:P275 ?lic .\nFILTER EXISTS { ?lic wdt:P31/wdt:P279* wd:Q196294 } .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n} GROUP BY ?licLabel\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?licLabel (COUNT(?lic) AS ?count) WHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:software] ;\nwdt:[property:copyright license] ?lic .\nFILTER EXISTS { ?lic wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:free license] } .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n} GROUP BY ?licLabel\nORDER BY DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "2517",
    "instruction": "Find camps within a 20km radius from my current location.",
    "query": "SELECT ?place ?placeLabel ?location WHERE {\nSERVICE wikibase:around {\n?place wdt:P625 ?location.\nbd:serviceParam wikibase:center \"[AUTO_COORDINATES]\" ;\nwikibase:radius \"20\";\nwikibase:distance ?dist.\n}\n?place wdt:P31/wdt:P279* wd:Q152081\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?place ?placeLabel ?location WHERE {\nSERVICE wikibase:around {\n?place wdt:[property:coordinate location] ?location.\nbd:serviceParam wikibase:center \"[AUTO_COORDINATES]\" ;\nwikibase:radius \"20\";\nwikibase:distance ?dist.\n}\n?place wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:concentration camp]\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "2320",
    "instruction": "List languages that are vulnerable, endangered or extinct along with the number of lexemes in Wikidata.",
    "query": "SELECT ?language ?languageLabel ?statusLabel ?lexemes WITH {\nSELECT ?language ?status (COUNT(?lexeme) AS ?lexemes) WHERE {\nVALUES ?status {\nwd:Q20672087 # 2 vulnerable\nwd:Q20672088 # 3 definitely endangered\nwd:Q20672089 # 4 severely endangered\nwd:Q20672090 # 5 critically endangered\nwd:Q20672091 # 6 extinct\n}\n?language wdt:P1999 ?status.\nOPTIONAL { ?lexeme dct:language ?language. }\n}\nGROUP BY ?language ?status\n} AS %results WHERE {\nINCLUDE %results.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?lexemes) DESC(?statusLabel)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX dct: <http://purl.org/dc/terms/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?language ?languageLabel ?statusLabel ?lexemes WITH {\nSELECT ?language ?status (COUNT(?lexeme) AS ?lexemes) WHERE {\nVALUES ?status {\nwd:[entity:2 vulnerable] # 2 vulnerable\nwd:[entity:3 definitely endangered] # 3 definitely endangered\nwd:[entity:4 severely endangered] # 4 severely endangered\nwd:[entity:5 critically endangered] # 5 critically endangered\nwd:[entity:6 extinct] # 6 extinct\n}\n?language wdt:[property:UNESCO language status] ?status.\nOPTIONAL { ?lexeme dct:language ?language. }\n}\nGROUP BY ?language ?status\n} AS %results WHERE {\nINCLUDE %results.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?lexemes) DESC(?statusLabel)",
    "complexity": "complex"
  },
  {
    "id": "531",
    "instruction": "List all subclasses that have both physical and non-physical superclasses.",
    "query": "SELECT DISTINCT ?item ?itemLabel WHERE {\n{\nSELECT ?item WHERE { ?item (wdt:P279/wdt:P279/(wdt:P279?)/(wdt:P279?)/(wdt:P279?)) wd:Q7048977, wd:Q112276019. }\nLIMIT 300\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,es,fr,de\". }\n}\nORDER BY (?itemLabel)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel WHERE {\n{\nSELECT ?item WHERE { ?item (wdt:[property:subclass of]/wdt:[property:subclass of]/(wdt:[property:subclass of]?)/(wdt:[property:subclass of]?)/(wdt:[property:subclass of]?)) wd:[entity:abstract entity], wd:Q112276019. }\nLIMIT 300\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,es,fr,de\". }\n}\nORDER BY (?itemLabel)",
    "complexity": "complex"
  },
  {
    "id": "2748",
    "instruction": "List the most common jobs for men.",
    "query": "select ?profession ?professionLabel (avg(?diff) as ?avg_difference) with {\nselect ?profession (count(?item) as ?count) where {\n?item wdt:P106 ?profession .\n?item wdt:P26 [] .\n} group by ?profession having (?count > 100) } as %professions with {\nselect ?item ?person1 ?profession where {\ninclude %professions\n?person1 wdt:P106 ?profession .\n?person1 wdt:P21 wd:Q6581097 .\n} limit 700000 } as %sample with {\nselect ?profession ?diff where {\ninclude %sample\n?person1 wdt:P26 ?person2 .\n?person1 wdt:P569 ?date1 .\nbind(year(?date1) as ?year1) .\n?person2 wdt:P569 ?date2 .\nbind(year(?date2) as ?year2) .\nbind((?year1-?year2) as ?diff) .\n} } as %results where {\ninclude %results\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n} group by ?profession ?professionLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nselect ?profession ?professionLabel (avg(?diff) as ?avg_difference) with {\nselect ?profession (count(?item) as ?count) where {\n?item wdt:[property:occupation] ?profession .\n?item wdt:[property:spouse] [] .\n} group by ?profession having (?count > 100) } as %professions with {\nselect ?item ?person1 ?profession where {\ninclude %professions\n?person1 wdt:[property:occupation] ?profession .\n?person1 wdt:[property:sex or gender] wd:[entity:male] .\n} limit 700000 } as %sample with {\nselect ?profession ?diff where {\ninclude %sample\n?person1 wdt:[property:spouse] ?person2 .\n?person1 wdt:[property:date of birth] ?date1 .\nbind(year(?date1) as ?year1) .\n?person2 wdt:[property:date of birth] ?date2 .\nbind(year(?date2) as ?year2) .\nbind((?year1-?year2) as ?diff) .\n} } as %results where {\ninclude %results\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n} group by ?profession ?professionLabel",
    "complexity": "complex"
  },
  {
    "id": "1252",
    "instruction": "Find maps from the King George III Topographical Collection that focus on South America.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?img ?bbox WHERE {\n?class wdt:P195 wd:Q56753539 . # KTop\n?class wdt:P921 wd:Q18 .\n?item wdt:P195 ?class .\n?class wdt:P921 wd:Q18 .\n?item p:P1332/psv:P1332/wikibase:geoLatitude ?nth .\n?item p:P1333/psv:P1333/wikibase:geoLatitude ?sth .\n?item p:P1334/psv:P1334/wikibase:geoLongitude ?east .\n?item p:P1335/psv:P1335/wikibase:geoLongitude ?west .\nOPTIONAL {?item wdt:P18 ?img} .\nBIND(STRDT( CONCAT('LINESTRING (',\nstr(?west), ' ', str(?sth), ',',\nstr(?west), ' ', str(?nth), ',',\nstr(?east), ' ', str(?nth), ',',\nstr(?east), ' ', str(?sth), ',',\nstr(?west), ' ', str(?sth), ')' ), geo:wktLiteral) AS ?bbox) .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?img ?bbox WHERE {\n?class wdt:[property:collection] wd:[entity:King George III Topographical Collection] . # KTop\n?class wdt:[property:main subject] wd:[entity:South America] .\n?item wdt:[property:collection] ?class .\n?class wdt:[property:main subject] wd:[entity:South America] .\n?item p:[property:coordinates of northernmost point]/psv:[property:coordinates of northernmost point]/wikibase:geoLatitude ?nth .\n?item p:[property:coordinates of southernmost point]/psv:[property:coordinates of southernmost point]/wikibase:geoLatitude ?sth .\n?item p:[property:coordinates of easternmost point]/psv:[property:coordinates of easternmost point]/wikibase:geoLongitude ?east .\n?item p:[property:coordinates of westernmost point]/psv:[property:coordinates of westernmost point]/wikibase:geoLongitude ?west .\nOPTIONAL {?item wdt:[property:image] ?img} .\nBIND(STRDT( CONCAT('LINESTRING (',\nstr(?west), ' ', str(?sth), ',',\nstr(?west), ' ', str(?nth), ',',\nstr(?east), ' ', str(?nth), ',',\nstr(?east), ' ', str(?sth), ',',\nstr(?west), ' ', str(?sth), ')' ), geo:wktLiteral) AS ?bbox) .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  }
]