[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "1836",
    "instruction": "Find profiles of individuals who have contributed to The Washington Post.",
    "query": "SELECT ?image ?webpage ?person ?personLabel WHERE {\n?person wdt:P31 wd:Q5.\n?person wdt:P7943 ?id.\nwd:P7943 wdt:P1630 ?url .\nBIND(IRI(REPLACE(?id, '^(.+)$', ?url)) AS ?webpage).\nOPTIONAL { ?person wdt:P18 ?image. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en, fr\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?image ?webpage ?person ?personLabel WHERE {\n?person wdt:[property:instance of] wd:[entity:human].\n?person wdt:[property:The Washington Post contributor ID] ?id.\nwd:[property:The Washington Post contributor ID] wdt:[property:formatter URL] ?url .\nBIND(IRI(REPLACE(?id, '^(.+)$', ?url)) AS ?webpage).\nOPTIONAL { ?person wdt:[property:image] ?image. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en, fr\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "1637",
    "instruction": "How many people are still alive who have walked on the Moon?",
    "query": "SELECT ?date (COUNT(DISTINCT ?item) AS ?count)\nWITH {\n# get all the dates where the number of living people who have walked on the moon changed\n# (person walked on the moon or person died)\nSELECT DISTINCT ?date WHERE {\n{\n# person walked on the moon\n?item p:P793 [\nps:P793 wd:Q42882411;\npq:P580 ?date_\n].\n} UNION {\n# person died\n?item p:P793/ps:P793 wd:Q42882411;\nwdt:P570 ?date_.\n}\n# for each date, inject a second date, one day before,\n# so that we get a straight line until that date and then a steep climb/drop for the real change,\n# instead of a diagonal slope over the entire preceding period\nVALUES ?toggle { true false }\nBIND(IF(?toggle, ?date_, ?date_ - \"P1D\"^^xsd:duration) AS ?date)\n}\n} AS %dates\nWHERE {\n# inject the current time as another date, so that the chart continues until the present day\n{ INCLUDE %dates. } UNION { BIND(NOW() AS ?date) }\n# main query: find all living people who have walked on the moon at each date\n?item p:P793 [\nps:P793 wd:Q42882411;\npq:P580 ?walkdate\n].\nFILTER(?date >= ?walkdate) # must have walked on the moon already\nOPTIONAL { ?item wdt:P570 ?died. }\nFILTER(!BOUND(?died) || ?date < ?died) # must not yet have died\n}\nGROUP BY ?date\nORDER BY ?date",
    "annotated": "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?date (COUNT(DISTINCT ?item) AS ?count)\nWITH {\n# get all the dates where the number of living people who have walked on the moon changed\n# (person walked on the moon or person died)\nSELECT DISTINCT ?date WHERE {\n{\n# person walked on the moon\n?item p:[property:significant event] [\nps:[property:significant event] wd:[entity:walk on the Moon];\npq:[property:start time] ?date_\n].\n} UNION {\n# person died\n?item p:[property:significant event]/ps:[property:significant event] wd:[entity:walk on the Moon];\nwdt:[property:date of death] ?date_.\n}\n# for each date, inject a second date, one day before,\n# so that we get a straight line until that date and then a steep climb/drop for the real change,\n# instead of a diagonal slope over the entire preceding period\nVALUES ?toggle { true false }\nBIND(IF(?toggle, ?date_, ?date_ - \"P1D\"^^xsd:duration) AS ?date)\n}\n} AS %dates\nWHERE {\n# inject the current time as another date, so that the chart continues until the present day\n{ INCLUDE %dates. } UNION { BIND(NOW() AS ?date) }\n# main query: find all living people who have walked on the moon at each date\n?item p:[property:significant event] [\nps:[property:significant event] wd:[entity:walk on the Moon];\npq:[property:start time] ?walkdate\n].\nFILTER(?date >= ?walkdate) # must have walked on the moon already\nOPTIONAL { ?item wdt:[property:date of death] ?died. }\nFILTER(!BOUND(?died) || ?date < ?died) # must not yet have died\n}\nGROUP BY ?date\nORDER BY ?date",
    "complexity": "complex"
  },
  {
    "id": "1351",
    "instruction": "List countries where the capital city has the same name in their official language.",
    "query": "SELECT ?country ?countryLabel ?lang ?capital ?capitalLabel\nWHERE {\n?country wdt:P31 wd:Q6256 .\n?country wdt:P37/wdt:P218 ?lang .\n?country wdt:P36 ?capital .\n?country rdfs:label ?countryLabel FILTER (LANG(?countryLabel) = ?lang) .\n?capital rdfs:label ?capitalLabel FILTER (LANG(?capitalLabel) = ?lang) .\nFILTER (?countryLabel = ?capitalLabel) .\n}\nORDER BY ?country ?lang",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?country ?countryLabel ?lang ?capital ?capitalLabel\nWHERE {\n?country wdt:[property:instance of] wd:[entity:country] .\n?country wdt:[property:official language]/wdt:[property:ISO 639-1 code] ?lang .\n?country wdt:[property:capital] ?capital .\n?country rdfs:label ?countryLabel FILTER (LANG(?countryLabel) = ?lang) .\n?capital rdfs:label ?capitalLabel FILTER (LANG(?capitalLabel) = ?lang) .\nFILTER (?countryLabel = ?capitalLabel) .\n}\nORDER BY ?country ?lang",
    "complexity": "complex"
  },
  {
    "id": "2734",
    "instruction": "List the Nobel laureates who have children that are also Nobel Prize winners.",
    "query": "SELECT DISTINCT ?parent ?parentLabel ?prize1Label ?child ?childLabel ?prize2Label WHERE {\n?prize1 wdt:P279?/wdt:P31? wd:Q7191 .\n?parent wdt:P166? ?prize1 ;\nwdt:P40 ?child .\n?prize2 wdt:P279?/wdt:P31? wd:Q7191 .\n?child wdt:P166? ?prize2 .\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"sv,en,[AUTO_LANGUAGE]\" .\n}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?parent ?parentLabel ?prize1Label ?child ?childLabel ?prize2Label WHERE {\n?prize1 wdt:[property:subclass of]?/wdt:[property:instance of]? wd:[entity:Nobel Prize] .\n?parent wdt:[property:award received]? ?prize1 ;\nwdt:[property:child] ?child .\n?prize2 wdt:[property:subclass of]?/wdt:[property:instance of]? wd:[entity:Nobel Prize] .\n?child wdt:[property:award received]? ?prize2 .\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"sv,en,[AUTO_LANGUAGE]\" .\n}\n}",
    "complexity": "complex"
  },
  {
    "id": "2653",
    "instruction": "List the occupations of musicians in Wales.",
    "query": "SELECT ?ocu ?ocuLabel (COUNT(DISTINCT ?item) AS ?count)\n(SAMPLE(?ocu) as ?ocu_sampled)\nwhere {\nhint:Query hint:optimizer \"None\".\n?item wdt:P2966 ?llgc .\n?item wdt:P106 ?ocu .\n?ocu wdt:P279+ wd:Q639669 .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?ocu ?ocuLabel\nORDER BY DESC(?count) ?ocuLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX hint: <http://www.bigdata.com/queryHints#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?ocu ?ocuLabel (COUNT(DISTINCT ?item) AS ?count)\n(SAMPLE(?ocu) as ?ocu_sampled)\nwhere {\nhint:Query hint:optimizer \"None\".\n?item wdt:[property:National Library of Wales Authority ID] ?llgc .\n?item wdt:[property:occupation] ?ocu .\n?ocu wdt:[property:subclass of]+ wd:[entity:musician] .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?ocu ?ocuLabel\nORDER BY DESC(?count) ?ocuLabel",
    "complexity": "complex"
  },
  {
    "id": "2819",
    "instruction": "List all countries without a river.",
    "query": "SELECT distinct ?country ?countryLabel ?area\nWHERE {\n{SELECT distinct ?country WHERE {\n?country wdt:P31/wdt:P279* wd:Q3624078.\n} }\nMINUS\n{SELECT distinct ?country #(COUNT(?river) AS ?cnt)\nWHERE {\n?river wdt:P31/wdt:P279* wd:Q4022.\n?river p:P17 [ps:P17 ?country].\n} GROUP BY ?country\n}\nMINUS {?country wdt:P31 wd:Q3024240}\nMINUS {?country wdt:P31 wd:Q11514315}\nMINUS {?country wdt:P31 wd:Q7840353}\nMINUS {?country wdt:P31 wd:Q11514315}\nMINUS {?country wdt:P31 wd:Q1790360}\nOPTIONAL {?country wdt:P2046 ?area}\n# MINUS %includes\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY ?area",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT distinct ?country ?countryLabel ?area\nWHERE {\n{SELECT distinct ?country WHERE {\n?country wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:sovereign state].\n} }\nMINUS\n{SELECT distinct ?country #(COUNT(?river) AS ?cnt)\nWHERE {\n?river wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:river].\n?river p:[property:country] [ps:[property:country] ?country].\n} GROUP BY ?country\n}\nMINUS {?country wdt:[property:instance of] wd:[entity:historical country]}\nMINUS {?country wdt:[property:instance of] wd:[entity:historical period]}\nMINUS {?country wdt:[property:instance of] wd:[entity:federally recognized Native American tribe in the United States]}\nMINUS {?country wdt:[property:instance of] wd:[entity:historical period]}\nMINUS {?country wdt:[property:instance of] wd:[entity:colonial empire]}\nOPTIONAL {?country wdt:[property:area] ?area}\n# MINUS %includes\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY ?area",
    "complexity": "complex"
  },
  {
    "id": "2601",
    "instruction": "List women who hold citizenship of a country and have the most articles in languages other than French.",
    "query": "SELECT ?item ?itemLabel ?itemDescription ?sitelinken (COUNT(distinct ?sitelink) as ?count)\nWHERE {\n?item wdt:P31 wd:Q5 .\n?item wdt:P21 wd:Q6581072 .\n?item wdt:P27 wd:Q235 .\n?sitelink schema:about ?item .\n?sitelinken schema:about ?item .\n?sitelinken schema:isPartOf <https://en.wikipedia.org/>;\nFILTER NOT EXISTS {\n?wfr schema:about ?item . ?wfr schema:inLanguage \"fr\"\n}\nFILTER EXISTS {\n?wen schema:about ?item . ?wen schema:inLanguage \"en\"\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". } # le label viendra de preference dans votre langue, et autrement en anglais\n}\nGROUP BY ?item ?itemLabel ?itemDescription ?sitelinken ORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?itemDescription ?sitelinken (COUNT(distinct ?sitelink) as ?count)\nWHERE {\n?item wdt:[property:instance of] wd:[entity:human] .\n?item wdt:[property:sex or gender] wd:[entity:female] .\n?item wdt:[property:country of citizenship] wd:[entity:Monaco] .\n?sitelink schema:about ?item .\n?sitelinken schema:about ?item .\n?sitelinken schema:isPartOf <https://en.wikipedia.org/>;\nFILTER NOT EXISTS {\n?wfr schema:about ?item . ?wfr schema:inLanguage \"fr\"\n}\nFILTER EXISTS {\n?wen schema:about ?item . ?wen schema:inLanguage \"en\"\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". } # le label viendra de preference dans votre langue, et autrement en anglais\n}\nGROUP BY ?item ?itemLabel ?itemDescription ?sitelinken ORDER BY DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "925",
    "instruction": "List the directors who have worked with the same actor more than 20 times.",
    "query": "SELECT ?director ?directorLabel ?actor ?actorLabel ?filmCount ?minYear ?maxYear WHERE {\n{\nSELECT ?director ?actor (COUNT(?film) AS ?filmCount) (MIN(?year) AS ?minYear) (MAX(?year) AS ?maxYear) WHERE {\n?film wdt:P57 ?director.\n?film wdt:P161 ?actor.\nOPTIONAL {\n?film wdt:P577 ?date .\nBIND (YEAR(?date) AS ?year)\n}\n}\nGROUP BY ?director ?actor\nHAVING (?filmCount > 20)\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nORDER BY DESC(?filmCount) ?directorLabel ?actorLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?director ?directorLabel ?actor ?actorLabel ?filmCount ?minYear ?maxYear WHERE {\n{\nSELECT ?director ?actor (COUNT(?film) AS ?filmCount) (MIN(?year) AS ?minYear) (MAX(?year) AS ?maxYear) WHERE {\n?film wdt:[property:director] ?director.\n?film wdt:[property:cast member] ?actor.\nOPTIONAL {\n?film wdt:[property:publication date] ?date .\nBIND (YEAR(?date) AS ?year)\n}\n}\nGROUP BY ?director ?actor\nHAVING (?filmCount > 20)\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nORDER BY DESC(?filmCount) ?directorLabel ?actorLabel",
    "complexity": "complex"
  },
  {
    "id": "1156",
    "instruction": "List all people named Karl born in Karlsruhe after its inception.",
    "query": "SELECT ?person ?personLabel ?dob WHERE {\nBIND(wd:Q1040 AS ?city)\n?city wdt:P571 ?inception.\n?person wdt:P31 wd:Q5;\nwdt:P569 ?dob;\nwdt:P19/wdt:P131* ?city;\nwdt:P735 wd:Q15731830.\nFILTER(?dob >= ?inception)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?person ?personLabel ?dob WHERE {\nBIND(wd:[entity:Karlsruhe] AS ?city)\n?city wdt:[property:inception] ?inception.\n?person wdt:[property:instance of] wd:[entity:human];\nwdt:[property:date of birth] ?dob;\nwdt:[property:place of birth]/wdt:[property:located in the administrative territorial entity]* ?city;\nwdt:[property:given name] wd:[entity:Karl].\nFILTER(?dob >= ?inception)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "930",
    "instruction": "List all the Tony Awards nominees and winners.",
    "query": "SELECT ?item ?itemLabel ?reason ?distinctionLabel (year(?date) as ?year)\nWHERE {\n?item ?prop ?statement .\n?statement pq:P805 ?ceremony .\n?ceremony wdt:P31 wd:Q24569309 .\n?statement ?propS ?distinction .\nVALUES (?prop ?propS ?reason) {\n(p:P1411 ps:P1411 \"nominated for\")\n(p:P166 ps:P166 \"award received\")\n}\nOPTIONAL { ?statement pq:P585 ?date . }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n} ORDER BY ?distinctionLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?reason ?distinctionLabel (year(?date) as ?year)\nWHERE {\n?item ?prop ?statement .\n?statement pq:[property:statement is subject of] ?ceremony .\n?ceremony wdt:[property:instance of] wd:[entity:Tony Awards ceremony] .\n?statement ?propS ?distinction .\nVALUES (?prop ?propS ?reason) {\n(p:[property:nominated for] ps:[property:nominated for] \"nominated for\")\n(p:[property:award received] ps:[property:award received] \"award received\")\n}\nOPTIONAL { ?statement pq:[property:point in time] ?date . }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n} ORDER BY ?distinctionLabel",
    "complexity": "complex"
  },
  {
    "id": "2822",
    "instruction": "What is the shortest rail route from Narvik to Singapore?",
    "query": "SELECT ?station ?stationLabel ?cds ?line ?layer WHERE {\n{ SERVICE gas:service {\ngas:program gas:gasClass \"com.bigdata.rdf.graph.analytics.BFS\" ;\ngas:in wd:Q3374603 ; # Umea central station\n# gas:target wd:Q18337797 ; # Didymoteicho railway station. From here on, adjacent stations rapidly vanish\ngas:out ?station ;\ngas:out1 [] ;\ngas:out2 ?pred .\ngas:program gas:linkType wdt:P197 . } # adjacent station\n}\nFILTER(?station != wd:Q3374603)\n?pred p:P625/psv:P625/wikibase:geoLatitude ?lat1 ;\np:P625/psv:P625/wikibase:geoLongitude ?lon1 .\n?station p:P625/psv:P625/wikibase:geoLatitude ?lat2 ;\np:P625/psv:P625/wikibase:geoLongitude ?lon2 .\nBIND(CONCAT('LINESTRING(', STR(?lon1), ' ', STR(?lat1), ',', STR(?lon2), ' ', STR(?lat2), ')') AS ?str) .\nBIND(STRDT(?str, geo:wktLiteral) AS ?line)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\nPREFIX gas: <http://www.bigdata.com/rdf/gas#>\n\nSELECT ?station ?stationLabel ?cds ?line ?layer WHERE {\n{ SERVICE gas:service {\ngas:program gas:gasClass \"com.bigdata.rdf.graph.analytics.BFS\" ;\ngas:in wd:[entity:Ume\u00e5 Central Station] ; # Umea central station\n# gas:target wd:[entity:Didymoteicho railway station] ; # Didymoteicho railway station. From here on, adjacent stations rapidly vanish\ngas:out ?station ;\ngas:out1 [] ;\ngas:out2 ?pred .\ngas:program gas:linkType wdt:[property:adjacent station] . } # adjacent station\n}\nFILTER(?station != wd:[entity:Ume\u00e5 Central Station])\n?pred p:[property:coordinate location]/psv:[property:coordinate location]/wikibase:geoLatitude ?lat1 ;\np:[property:coordinate location]/psv:[property:coordinate location]/wikibase:geoLongitude ?lon1 .\n?station p:[property:coordinate location]/psv:[property:coordinate location]/wikibase:geoLatitude ?lat2 ;\np:[property:coordinate location]/psv:[property:coordinate location]/wikibase:geoLongitude ?lon2 .\nBIND(CONCAT('LINESTRING(', STR(?lon1), ' ', STR(?lat1), ',', STR(?lon2), ' ', STR(?lat2), ')') AS ?str) .\nBIND(STRDT(?str, geo:wktLiteral) AS ?line)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "2649",
    "instruction": "List all fictional wars and their respective universes.",
    "query": "SELECT ?from ?fromLabel ?to ?toLabel ?rgb WHERE {\n{SELECT (?fictional_war AS ?from) (?universe AS ?to) (\"F7FF00\" as ?rgb) WHERE {\n?fictional_war wdt:P31 wd:Q17198419. OPTIONAL{?fictional_war wdt:P1080 ?narr_universe}\nOPTIONAL {?fictional_war wdt:P8345 ?franchise }\nOPTIONAL {?fictional_war wdt:P1441 ?work }\nBIND(COALESCE(?narr_universe, ?franchise, ?work, '') AS ?universe)\n} }\nUNION {SELECT (?participant AS ?from) (?fictional_war AS ?to) (\"7FFF00\" as ?rgb) WHERE {\n?fictional_war wdt:P31 wd:Q17198419.\nOPTIONAL { ?fictional_war wdt:P710 ?participant } } }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?from ?fromLabel ?to ?toLabel ?rgb WHERE {\n{SELECT (?fictional_war AS ?from) (?universe AS ?to) (\"F7FF00\" as ?rgb) WHERE {\n?fictional_war wdt:[property:instance of] wd:[entity:fictional war]. OPTIONAL{?fictional_war wdt:[property:from narrative universe] ?narr_universe}\nOPTIONAL {?fictional_war wdt:[property:media franchise] ?franchise }\nOPTIONAL {?fictional_war wdt:[property:present in work] ?work }\nBIND(COALESCE(?narr_universe, ?franchise, ?work, '') AS ?universe)\n} }\nUNION {SELECT (?participant AS ?from) (?fictional_war AS ?to) (\"7FFF00\" as ?rgb) WHERE {\n?fictional_war wdt:[property:instance of] wd:[entity:fictional war].\nOPTIONAL { ?fictional_war wdt:[property:participant] ?participant } } }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "214",
    "instruction": "What is the count of items in Wikidata for each collection property?",
    "query": "SELECT (COUNT(?obj) AS ?count) ?collection ?collectionLabel ?partofLabel WHERE {\n?obj p:P195 ?s.\n?s ps:P195 ?collection.\nMINUS { ?s pq:P582 [] }\nOPTIONAL { ?collection wdt:P361 ?partof }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} GROUP BY ?collection ?collectionLabel ?partofLabel\nORDER BY DESC(?count)\nLIMIT 100",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT (COUNT(?obj) AS ?count) ?collection ?collectionLabel ?partofLabel WHERE {\n?obj p:[property:collection] ?s.\n?s ps:[property:collection] ?collection.\nMINUS { ?s pq:[property:end time] [] }\nOPTIONAL { ?collection wdt:[property:part of] ?partof }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} GROUP BY ?collection ?collectionLabel ?partofLabel\nORDER BY DESC(?count)\nLIMIT 100",
    "complexity": "complex"
  },
  {
    "id": "13",
    "instruction": "List the workplaces of Nobel laureates in Economics along with their coordinates.",
    "query": "SELECT ?name ?coord ?image ?workplace ?article WHERE {\n?person wdt:P166 wd:Q47170 ;\nwdt:P108 ?place .\n?place wdt:P625 ?coord\nOPTIONAL{ ?person wdt:P18 ?image }\nOPTIONAL{ ?article schema:about ?person ; schema:isPartOf <https://en.wikipedia.org/> }\nMINUS{ ?person wdt:P31/wdt:P279? wd:Q15632617 } # exclude fictional people\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". ?place rdfs:label ?workplace. ?person rdfs:label ?name}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?name ?coord ?image ?workplace ?article WHERE {\n?person wdt:[property:award received] wd:[entity:Prize in Economic Sciences in Memory of Alfred Nobel] ;\nwdt:[property:employer] ?place .\n?place wdt:[property:coordinate location] ?coord\nOPTIONAL{ ?person wdt:[property:image] ?image }\nOPTIONAL{ ?article schema:about ?person ; schema:isPartOf <https://en.wikipedia.org/> }\nMINUS{ ?person wdt:[property:instance of]/wdt:[property:subclass of]? wd:[entity:fictional human] } # exclude fictional people\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". ?place rdfs:label ?workplace. ?person rdfs:label ?name}\n}",
    "complexity": "complex"
  },
  {
    "id": "1656",
    "instruction": "List all London Underground stations that are on at least three lines.",
    "query": "SELECT DISTINCT ?line ?lineLabel ?rgb ?p ?pLabel WHERE {\nVALUES $IS_ON_LINE { wdt:P81 }\nVALUES $IS_PART_OF { wdt:P361 }\nVALUES $LONDON_UNDERGROUND { wd:Q20075 }\n?p $IS_ON_LINE ?line .\n?line $IS_PART_OF $LONDON_UNDERGROUND .\n?line wdt:P465 ?rgb . # gets the tube line's colour\n{ # inner select returns all stations which are on 3 or more London Underground lines\nSELECT ?p (COUNT(?line) AS ?count) WHERE {\nVALUES $IS_A { wdt:P31 }\nVALUES $TUBE_STATION { wd:Q14562709 }\nVALUES $IS_ON_LINE { wdt:P81 }\nVALUES $IS_PART_OF { wdt:P361 }\nVALUES $LONDON_UNDERGROUND { wd:Q20075 }\n?p $IS_A $TUBE_STATION .\n?p $IS_ON_LINE ?line .\n?line $IS_PART_OF $LONDON_UNDERGROUND .\n} GROUP BY ?p\nHAVING (?count >= 3)\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?line ?lineLabel ?rgb ?p ?pLabel WHERE {\nVALUES $IS_ON_LINE { wdt:[property:connecting line] }\nVALUES $IS_PART_OF { wdt:[property:part of] }\nVALUES $LONDON_UNDERGROUND { wd:[entity:London Underground] }\n?p $IS_ON_LINE ?line .\n?line $IS_PART_OF $LONDON_UNDERGROUND .\n?line wdt:[property:sRGB color hex triplet] ?rgb . # gets the tube line's colour\n{ # inner select returns all stations which are on 3 or more London Underground lines\nSELECT ?p (COUNT(?line) AS ?count) WHERE {\nVALUES $IS_A { wdt:[property:instance of] }\nVALUES $TUBE_STATION { wd:[entity:London Underground station] }\nVALUES $IS_ON_LINE { wdt:[property:connecting line] }\nVALUES $IS_PART_OF { wdt:[property:part of] }\nVALUES $LONDON_UNDERGROUND { wd:[entity:London Underground] }\n?p $IS_A $TUBE_STATION .\n?p $IS_ON_LINE ?line .\n?line $IS_PART_OF $LONDON_UNDERGROUND .\n} GROUP BY ?p\nHAVING (?count >= 3)\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "1772",
    "instruction": "List the people buried at Riddarholm Church in Stockholm.",
    "query": "SELECT ?book ?bookLabel ?url ?person ?personLabel ?personDescription ?page ?quote WHERE {\n{\nBIND( wd:Q61765464 AS ?book)\n?person wdt:P119 wd:Q657118;\np:P119 ?statement.\n{ ?statement prov:wasDerivedFrom ?ref. }\n{ ?ref pr:P248 wd:Q61765464. }\nOPTIONAL { ?book wdt:P953 ?url. }\nOPTIONAL { ?ref pr:P304 ?page. }\nOPTIONAL { ?ref pr:P1683 ?quote. }\nFILTER(STRSTARTS(STR(?person), \"http://www.wikidata.org/entity/Q\"))\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,sv\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX prov: <http://www.w3.org/ns/prov#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pr: <http://www.wikidata.org/prop/reference/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?book ?bookLabel ?url ?person ?personLabel ?personDescription ?page ?quote WHERE {\n{\nBIND( wd:[entity:Riddarholmskyrkan - inventories and graves] AS ?book)\n?person wdt:[property:place of burial] wd:[entity:Riddarholm Church];\np:[property:place of burial] ?statement.\n{ ?statement prov:wasDerivedFrom ?ref. }\n{ ?ref pr:[property:stated in] wd:[entity:Riddarholmskyrkan - inventories and graves]. }\nOPTIONAL { ?book wdt:[property:full work available at URL] ?url. }\nOPTIONAL { ?ref pr:[property:page(s)] ?page. }\nOPTIONAL { ?ref pr:[property:quotation] ?quote. }\nFILTER(STRSTARTS(STR(?person), \"http://www.wikidata.org/entity/Q\"))\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,sv\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "1097",
    "instruction": "What are the classes that inherit from both physical object and abstract object?",
    "query": "SELECT DISTINCT ?class1 ?class1Label ?physClass ?physClassLabel ?absClass ?absClassLabel\nWITH {\nSELECT DISTINCT ?class WHERE {\n?class wdt:P279+ wd:Q223557 .\n# hint:Prior hint:gearing \"reverse\".\n} LIMIT 40000\n} AS %physicalClasses\nWITH {\nSELECT DISTINCT ?class WHERE {\n?class wdt:P279+ wd:Q7184903 .\n# hint:Prior hint:gearing \"reverse\".\n} LIMIT 40000\n} AS %abstractClasses\nWITH {\nSELECT DISTINCT ?class WHERE {\nINCLUDE %physicalClasses .\nINCLUDE %abstractClasses .\n}\n} AS %commonClasses\nWITH {\nSELECT DISTINCT ?class WHERE {\nINCLUDE %commonClasses.\nMINUS {\n{ SELECT (?class AS ?parentClass) WHERE { INCLUDE %commonClasses. } }\n?class wdt:P279 ?parentClass.\n}\n}\n} AS %reducedClasses\nWHERE {\nINCLUDE %reducedClasses .\n?class wdt:P279* ?class1 .\nhint:Prior hint:gearing \"forward\".\n?class1 wdt:P279 ?absClass .\n?absClass wdt:P279* wd:Q7184903 .\nhint:Prior hint:gearing \"forward\".\nOPTIONAL {\n?absClass wdt:P279* wd:Q223557 .\nhint:Prior hint:gearing \"forward\".\nBIND (1 AS ?no_go) .\n}\nFILTER (!bound(?no_go)) .\n?class1 wdt:P279 ?physClass .\n?physClass wdt:P279* wd:Q223557 .\nhint:Prior hint:gearing \"forward\".\n# OPTIONAL {\n# ?physClass wdt:P279* wd:Q7184903 .\n# hint:Prior hint:gearing \"forward\".\n# BIND (1 AS ?no_go2) .\n# }\n# FILTER (!bound(?no_go2)) .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY ?absClassLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX hint: <http://www.bigdata.com/queryHints#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?class1 ?class1Label ?physClass ?physClassLabel ?absClass ?absClassLabel\nWITH {\nSELECT DISTINCT ?class WHERE {\n?class wdt:[property:subclass of]+ wd:[entity:physical object] .\n# hint:Prior hint:gearing \"reverse\".\n} LIMIT 40000\n} AS %physicalClasses\nWITH {\nSELECT DISTINCT ?class WHERE {\n?class wdt:[property:subclass of]+ wd:Q7184903 .\n# hint:Prior hint:gearing \"reverse\".\n} LIMIT 40000\n} AS %abstractClasses\nWITH {\nSELECT DISTINCT ?class WHERE {\nINCLUDE %physicalClasses .\nINCLUDE %abstractClasses .\n}\n} AS %commonClasses\nWITH {\nSELECT DISTINCT ?class WHERE {\nINCLUDE %commonClasses.\nMINUS {\n{ SELECT (?class AS ?parentClass) WHERE { INCLUDE %commonClasses. } }\n?class wdt:[property:subclass of] ?parentClass.\n}\n}\n} AS %reducedClasses\nWHERE {\nINCLUDE %reducedClasses .\n?class wdt:[property:subclass of]* ?class1 .\nhint:Prior hint:gearing \"forward\".\n?class1 wdt:[property:subclass of] ?absClass .\n?absClass wdt:[property:subclass of]* wd:Q7184903 .\nhint:Prior hint:gearing \"forward\".\nOPTIONAL {\n?absClass wdt:[property:subclass of]* wd:[entity:physical object] .\nhint:Prior hint:gearing \"forward\".\nBIND (1 AS ?no_go) .\n}\nFILTER (!bound(?no_go)) .\n?class1 wdt:[property:subclass of] ?physClass .\n?physClass wdt:[property:subclass of]* wd:[entity:physical object] .\nhint:Prior hint:gearing \"forward\".\n# OPTIONAL {\n# ?physClass wdt:[property:subclass of]* wd:Q7184903 .\n# hint:Prior hint:gearing \"forward\".\n# BIND (1 AS ?no_go2) .\n# }\n# FILTER (!bound(?no_go2)) .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY ?absClassLabel",
    "complexity": "complex"
  }
]