[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "2316",
    "instruction": "List all movies directed by Agnes Varda along with their release years.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?year WHERE {\n?item wdt:P57 wd:Q229990;\nwdt:P577 ?date.\nBIND(YEAR(?date) AS ?year)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"es,en,fr\". }\n}\nORDER BY (?year)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?year WHERE {\n?item wdt:[property:director] wd:[entity:Agn\u00e8s Varda];\nwdt:[property:publication date] ?date.\nBIND(YEAR(?date) AS ?year)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"es,en,fr\". }\n}\nORDER BY (?year)",
    "complexity": "medium"
  },
  {
    "id": "2421",
    "instruction": "Show me a map of high-speed rail bridges and tunnels in France.",
    "query": "SELECT DISTINCT ?ouvrage ?ouvrageLabel ?ligne ?ligneLabel ?coordonnees ?image WHERE {\n?ouvrage wdt:P2505 ?ligne;\nwdt:P17 wd:Q142;\nwdt:P625 ?coordonnees.\nOPTIONAL { ?ouvrage wdt:P18 ?image. }\n?ligne wdt:P31 wd:Q858485.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?ouvrage ?ouvrageLabel ?ligne ?ligneLabel ?coordonnees ?image WHERE {\n?ouvrage wdt:[property:carries] ?ligne;\nwdt:[property:country] wd:[entity:France];\nwdt:[property:coordinate location] ?coordonnees.\nOPTIONAL { ?ouvrage wdt:[property:image] ?image. }\n?ligne wdt:[property:instance of] wd:[entity:high-speed railway line].\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "2017",
    "instruction": "List the 10 largest cities in the Czech Republic along with their earliest written records.",
    "query": "select ?itemLabel ?zminka ?img where {\n?item wdt:P31 wd:Q5153359 .\n?item wdt:P1249 ?zminka .\n?item wdt:P18 ?img .\n?item wdt:P1082 ?populace .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"cs\". }\n}\norder by desc(?populace)\nlimit 10",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nselect ?itemLabel ?zminka ?img where {\n?item wdt:[property:instance of] wd:[entity:municipality of the Czech Republic] .\n?item wdt:[property:time of earliest written record] ?zminka .\n?item wdt:[property:image] ?img .\n?item wdt:[property:population] ?populace .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"cs\". }\n}\norder by desc(?populace)\nlimit 10",
    "complexity": "medium"
  },
  {
    "id": "102",
    "instruction": "List all people from Ancient Greece.",
    "query": "SELECT DISTINCT ?person ?en_name WHERE {\n{?person wdt:P2596 wd:Q11772. ?person wdt:P31 wd:Q5 } # Person & Culture: Ancient Greece\nUNION {?person wdt:P27/wdt:P31 wd:Q148837} # Citizen of a Polis\nUNION {?person wdt:P551/wdt:P31 wd:Q148837 } # Resident of a Polis\nOPTIONAL{ ?person rdfs:label ?en_name FILTER(lang(?en_name) = \"en\")}\n} ORDER BY ?en_name",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT DISTINCT ?person ?en_name WHERE {\n{?person wdt:[property:culture] wd:[entity:Ancient Greece]. ?person wdt:[property:instance of] wd:[entity:human] } # Person & Culture: Ancient Greece\nUNION {?person wdt:[property:country of citizenship]/wdt:[property:instance of] wd:[entity:polis]} # Citizen of a Polis\nUNION {?person wdt:[property:residence]/wdt:[property:instance of] wd:[entity:polis] } # Resident of a Polis\nOPTIONAL{ ?person rdfs:label ?en_name FILTER(lang(?en_name) = \"en\")}\n} ORDER BY ?en_name",
    "complexity": "medium"
  },
  {
    "id": "1015",
    "instruction": "List all educational institutions worldwide along with their coordinates.",
    "query": "SELECT ?universityLabel ?universityDescription ?website ?coord WHERE {\n?university (wdt:P31/wdt:P279*) wd:Q2385804.\n?university wdt:P625 ?coord.\nOPTIONAL { ?university wdt:P856 ?website. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?universityLabel ?universityDescription ?website ?coord WHERE {\n?university (wdt:[property:instance of]/wdt:[property:subclass of]*) wd:[entity:educational institution].\n?university wdt:[property:coordinate location] ?coord.\nOPTIONAL { ?university wdt:[property:official website] ?website. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "1329",
    "instruction": "List the female artists whose paintings are displayed in the Louvre Museum.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?creatorLabel ?image WHERE {\n?item wdt:P195 wd:Q3044768 ;\nwdt:P170 ?creator .\n?creator wdt:P21 wd:Q6581072 .\nOPTIONAL { ?item wdt:P18 ?image }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\" . }\n} ORDER BY ?creatorLabel ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?creatorLabel ?image WHERE {\n?item wdt:[property:collection] wd:[entity:Department of Paintings of the Louvre] ;\nwdt:[property:creator] ?creator .\n?creator wdt:[property:sex or gender] wd:[entity:female] .\nOPTIONAL { ?item wdt:[property:image] ?image }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\" . }\n} ORDER BY ?creatorLabel ?itemLabel",
    "complexity": "medium"
  },
  {
    "id": "2139",
    "instruction": "List all winners of the women's Ballon d'or award.",
    "query": "SELECT ?item ?itemLabel ?itemDescription ?year WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?item p:P166 ?statement.\n?statement ps:P166 wd:Q59411480.\n?statement pq:P585 ?date\nBIND(YEAR(?date) AS ?year)\n}\nORDER BY ?date",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?itemDescription ?year WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?item p:[property:award received] ?statement.\n?statement ps:[property:award received] wd:[entity:Ballon d'Or F\u00e9minin].\n?statement pq:[property:point in time] ?date\nBIND(YEAR(?date) AS ?year)\n}\nORDER BY ?date",
    "complexity": "medium"
  },
  {
    "id": "89",
    "instruction": "Show me a map of lifeboat stations with their owners.",
    "query": "SELECT ?url ?ownerLabel ?station ?stationLabel ?location (SAMPLE(?image) AS ?image)\nWHERE {\n?station wdt:P31 wd:Q11997323;\nwdt:P625 ?location.\nOPTIONAL { ?station wdt:P18 ?image}\nOPTIONAL { ?station wdt:P127 ?owner}\nOPTIONAL { ?station wdt:P856 ?url }\nSERVICE wikibase:label {bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,no,sv,da,de\"}\n} GROUP BY ?station ?stationLabel ?location ?ownerLabel ?url",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?url ?ownerLabel ?station ?stationLabel ?location (SAMPLE(?image) AS ?image)\nWHERE {\n?station wdt:[property:instance of] wd:[entity:lifeboat station];\nwdt:[property:coordinate location] ?location.\nOPTIONAL { ?station wdt:[property:image] ?image}\nOPTIONAL { ?station wdt:[property:owned by] ?owner}\nOPTIONAL { ?station wdt:[property:official website] ?url }\nSERVICE wikibase:label {bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,no,sv,da,de\"}\n} GROUP BY ?station ?stationLabel ?location ?ownerLabel ?url",
    "complexity": "medium"
  },
  {
    "id": "1311",
    "instruction": "What are the windmills located in Paris?",
    "query": "SELECT ?item ?itemLabel ?coords ?image WHERE {\n?item wdt:P31 wd:Q38720 ;\nwdt:P131 ?arrdt ;\nwdt:P625 ?coords ;\nwdt:P18 ?image .\n?arrdt wdt:P131 wd:Q90 .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\" . }\n} ORDER BY ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?coords ?image WHERE {\n?item wdt:[property:instance of] wd:[entity:windmill] ;\nwdt:[property:located in the administrative territorial entity] ?arrdt ;\nwdt:[property:coordinate location] ?coords ;\nwdt:[property:image] ?image .\n?arrdt wdt:[property:located in the administrative territorial entity] wd:[entity:Paris] .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\" . }\n} ORDER BY ?itemLabel",
    "complexity": "medium"
  },
  {
    "id": "1702",
    "instruction": "Show me a map of Scotland with the homes of accused witches, colored by gender.",
    "query": "SELECT DISTINCT ?person ?personLabel ?accusedwitch ?precision ?coords ?Occupation ?Residence ?image (?Gender as ?layer)\nWHERE {\n?person wdt:P4478 ?accusedwitch .\n?person wdt:P31 wd:Q5.\n?person wdt:P21 ?gender .\n?person wdt:P551 ?residence .\n?residence wdt:P625 ?coords.\nOPTIONAL { ?article schema:about ?person. }\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\".\n?person rdfs:label ?personLabel.\n?residence rdfs:label ?Residence .\n?occupation rdfs:label ?Occupation.\n?gender rdfs:label ?Gender.\n}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?person ?personLabel ?accusedwitch ?precision ?coords ?Occupation ?Residence ?image (?Gender as ?layer)\nWHERE {\n?person wdt:[property:Survey of Scottish Witchcraft - Accused witch ID] ?accusedwitch .\n?person wdt:[property:instance of] wd:[entity:human].\n?person wdt:[property:sex or gender] ?gender .\n?person wdt:[property:residence] ?residence .\n?residence wdt:[property:coordinate location] ?coords.\nOPTIONAL { ?article schema:about ?person. }\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\".\n?person rdfs:label ?personLabel.\n?residence rdfs:label ?Residence .\n?occupation rdfs:label ?Occupation.\n?gender rdfs:label ?Gender.\n}\n}",
    "complexity": "medium"
  },
  {
    "id": "173",
    "instruction": "What are the commonalities between John Calvin and Thomas Hobbes?",
    "query": "SELECT ?thing ?thingLabel WHERE {\n{wd:Q37577 ?p1 ?thing} UNION {?thing ?p1 wd:Q37577} # calvin\n{wd:Q37621 ?p2 ?thing} UNION {?thing ?p2 wd:Q37621} # hobbes\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?thing ?thingLabel WHERE {\n{wd:[entity:John Calvin] ?p1 ?thing} UNION {?thing ?p1 wd:[entity:John Calvin]} # calvin\n{wd:[entity:Thomas Hobbes] ?p2 ?thing} UNION {?thing ?p2 wd:[entity:Thomas Hobbes]} # hobbes\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "2368",
    "instruction": "List all Council Information Systems with their API endpoint URLs.",
    "query": "SELECT ?item ?itemLabel ?url ?area ?areaLabel ?engine ?engineLabel ?coordinates WHERE {\n?item wdt:P31/wdt:P279* wd:Q2132880;\np:P6269 [\na wikibase:BestRank;\nps:P6269 ?url;\npq:P2700 wd:Q47450936\n].\nOPTIONAL { ?item wdt:P408 ?engine. }\nOPTIONAL {\n?item wdt:P2541 ?area.\nOPTIONAL { ?area wdt:P625 ?coordinates. }\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,de\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?url ?area ?areaLabel ?engine ?engineLabel ?coordinates WHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:Council Information System];\np:[property:API endpoint URL] [\na wikibase:BestRank;\nps:[property:API endpoint URL] ?url;\npq:[property:protocol] wd:[entity:OParl API]\n].\nOPTIONAL { ?item wdt:[property:software engine] ?engine. }\nOPTIONAL {\n?item wdt:[property:operating area] ?area.\nOPTIONAL { ?area wdt:[property:coordinate location] ?coordinates. }\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,de\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "1363",
    "instruction": "List all humans whose birthplace is named after them.",
    "query": "SELECT ?person ?personLabel ?place ?placeLabel WHERE {\n?person wdt:P31 wd:Q5;\nwdt:P19 ?place.\n?place wdt:P138 ?person.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\", \"ru\", \"zh\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?person ?personLabel ?place ?placeLabel WHERE {\n?person wdt:[property:instance of] wd:[entity:human];\nwdt:[property:place of birth] ?place.\n?place wdt:[property:named after] ?person.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\", \"ru\", \"zh\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "2614",
    "instruction": "List all Twitter accounts on Wikidata along with their number of subscribers.",
    "query": "SELECT ?item ?twitter ?subscribers WHERE {\n?item p:P2002 ?statement.\n?statement ps:P2002 ?twitter;\npq:P3744 ?subscribers.\n}\nORDER BY DESC(?subscribers)",
    "annotated": "PREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\n\nSELECT ?item ?twitter ?subscribers WHERE {\n?item p:[property:Twitter (X) username] ?statement.\n?statement ps:[property:Twitter (X) username] ?twitter;\npq:[property:number of subscribers] ?subscribers.\n}\nORDER BY DESC(?subscribers)",
    "complexity": "medium"
  },
  {
    "id": "1060",
    "instruction": "List the countries with the highest number of out-of-school children in 2013.",
    "query": "SELECT DISTINCT ?country ?countryLabel ?number_of_out_of_school_chidren ?date ?methodLabel\nWHERE {\n?country wdt:P31 wd:Q6256 .\n?country p:P2573 ?out_of_school_chidren .\n?out_of_school_chidren ps:P2573 ?number_of_out_of_school_chidren .\n?out_of_school_chidren pq:P585 ?date .\n?out_of_school_chidren pq:P459 ?method .\nFILTER (year(?date) = 2013)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC (?number_of_out_of_school_chidren)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?country ?countryLabel ?number_of_out_of_school_chidren ?date ?methodLabel\nWHERE {\n?country wdt:[property:instance of] wd:[entity:country] .\n?country p:[property:number of out-of-school children] ?out_of_school_chidren .\n?out_of_school_chidren ps:[property:number of out-of-school children] ?number_of_out_of_school_chidren .\n?out_of_school_chidren pq:[property:point in time] ?date .\n?out_of_school_chidren pq:[property:determination method] ?method .\nFILTER (year(?date) = 2013)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC (?number_of_out_of_school_chidren)",
    "complexity": "medium"
  },
  {
    "id": "1842",
    "instruction": "Show me a map with the locations of all hospitals.",
    "query": "SELECT * WHERE {\n?item wdt:P31/wdt:P279* wd:Q16917;\nwdt:P625 ?geo .\n}",
    "annotated": "PREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT * WHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:hospital];\nwdt:[property:coordinate location] ?geo .\n}",
    "complexity": "medium"
  },
  {
    "id": "643",
    "instruction": "What happened on September 11, 2001?",
    "query": "SELECT ?item ?itemLabel\nWHERE\n{\n?item p:P585/ps:P585 \"2001-09-11T00:00:00Z\"^^xsd:dateTime\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel\nWHERE\n{\n?item p:[property:point in time]/ps:[property:point in time] \"2001-09-11T00:00:00Z\"^^xsd:dateTime\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "1934",
    "instruction": "List all biographical articles from Die Datenlaube about people with an entry in the Biographical Lexicon of the Austrian Empire.",
    "query": "SELECT DISTINCT ?blkoe ?blkoeLabel ?image ?artikel ?artikelLabel ?edgeLabel WHERE {\n?artikel wdt:P1433 wd:Q655617;\nwdt:P921 ?schlagwort.\n?schlagwort wdt:P31 wd:Q5; wdt:P18 ?image.\n?blkoe wdt:P1433 wd:Q665807;\nwdt:P31 wd:Q19389637;\nwdt:P921 ?schlagwort.\nBIND(\"Thema in\" AS ?edgeLabel)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY ?schlagwort",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?blkoe ?blkoeLabel ?image ?artikel ?artikelLabel ?edgeLabel WHERE {\n?artikel wdt:[property:published in] wd:[entity:Die Gartenlaube];\nwdt:[property:main subject] ?schlagwort.\n?schlagwort wdt:[property:instance of] wd:[entity:human]; wdt:[property:image] ?image.\n?blkoe wdt:[property:published in] wd:[entity:Biographisches Lexikon des Kaiserthums Oesterreich];\nwdt:[property:instance of] wd:[entity:biographical article];\nwdt:[property:main subject] ?schlagwort.\nBIND(\"Thema in\" AS ?edgeLabel)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY ?schlagwort",
    "complexity": "medium"
  },
  {
    "id": "786",
    "instruction": "List all horses with their mothers and fathers.",
    "query": "SELECT DISTINCT ?cheval ?chevalLabel ?mere ?pere (year(?naissance) as ?Naissance) (year(?deces) as ?Deces) ?sexe\nwhere {\n{?cheval wdt:P31/wdt:P279* wd:Q726 .} # Instance et sous-classes de Q726-Cheval\nOPTIONAL{?cheval wdt:P25 ?mere .} # P25 : Mere\nOPTIONAL{?cheval wdt:P22 ?pere .} # P22 : Pere\nOPTIONAL{?cheval wdt:P569 ?naissance .} # P569 : Date de naissance\nOPTIONAL{?cheval wdt:P571 ?deces .} # P571 : Date de deces\nOPTIONAL{?cheval wdt:P21 ?sexe .} # P21 : Sexe\nSERVICE wikibase:label { #BabelRainbow\nbd:serviceParam wikibase:language \"fr,ar,be,bg,bn,ca,cs,da,de,el,en,es,et,fa,fi,he,hi,hu,hy,id,it,ja,jv,ko,nb,nl,eo,pa,pl,pt,ro,ru,sh,sk,sr,sv,sw,te,th,tr,uk,yue,vec,vi,zh\"\n}\n} ORDER BY ?cheval",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?cheval ?chevalLabel ?mere ?pere (year(?naissance) as ?Naissance) (year(?deces) as ?Deces) ?sexe\nwhere {\n{?cheval wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:horse] .} # Instance et sous-classes de [entity:horse]-Cheval\nOPTIONAL{?cheval wdt:[property:mother] ?mere .} # [property:mother] : Mere\nOPTIONAL{?cheval wdt:[property:father] ?pere .} # [property:father] : Pere\nOPTIONAL{?cheval wdt:[property:date of birth] ?naissance .} # [property:date of birth] : Date de naissance\nOPTIONAL{?cheval wdt:[property:inception] ?deces .} # [property:inception] : Date de deces\nOPTIONAL{?cheval wdt:[property:sex or gender] ?sexe .} # [property:sex or gender] : Sexe\nSERVICE wikibase:label { #BabelRainbow\nbd:serviceParam wikibase:language \"fr,ar,be,bg,bn,ca,cs,da,de,el,en,es,et,fa,fi,he,hi,hu,hy,id,it,ja,jv,ko,nb,nl,eo,pa,pl,pt,ro,ru,sh,sk,sr,sv,sw,te,th,tr,uk,yue,vec,vi,zh\"\n}\n} ORDER BY ?cheval",
    "complexity": "medium"
  },
  {
    "id": "28",
    "instruction": "List all individuals who studied at the University of Oxford or its colleges.",
    "query": "SELECT (COUNT(?alum) AS ?count)\nWHERE {\n{ ?alum wdt:P69 wd:Q34433 }\nUNION { ?alum wdt:P69/wdt:P31 wd:Q2581649 }\n}",
    "annotated": "PREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT (COUNT(?alum) AS ?count)\nWHERE {\n{ ?alum wdt:[property:educated at] wd:[entity:University of Oxford] }\nUNION { ?alum wdt:[property:educated at]/wdt:[property:instance of] wd:[entity:college of the University of Oxford] }\n}",
    "complexity": "medium"
  },
  {
    "id": "2117",
    "instruction": "List all geological interest places in Alamedilla.",
    "query": "SELECT ?Alamedilla ?AlamedillaLabel ?coordenadas ?imagen WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?Alamedilla wdt:P131 wd:Q1631944.\n?Alamedilla wdt:P31 wd:Q56528396.\nOPTIONAL { ?Alamedilla wdt:P625 ?coordenadas. }\nOPTIONAL { ?Alamedilla wdt:P18 ?imagen. }\n}\nLIMIT 100",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?Alamedilla ?AlamedillaLabel ?coordenadas ?imagen WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?Alamedilla wdt:[property:located in the administrative territorial entity] wd:[entity:Alamedilla].\n?Alamedilla wdt:[property:instance of] wd:[entity:Lugar de Inter\u00e9s Geol\u00f3gico].\nOPTIONAL { ?Alamedilla wdt:[property:coordinate location] ?coordenadas. }\nOPTIONAL { ?Alamedilla wdt:[property:image] ?imagen. }\n}\nLIMIT 100",
    "complexity": "medium"
  },
  {
    "id": "2219",
    "instruction": "How many research papers shared their datasets in a specific year?",
    "query": "SELECT (str(?year) as ?yearstr) (count (?item) as ?count ){\n?item wdt:P1325 ?dataset;\nwdt:P31 wd:Q13442814;\nwdt:P577 ?date.\nBIND(year(?date) as ?year)\n}\nGROUP By ?year\nORDER by ?count",
    "annotated": "PREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT (str(?year) as ?yearstr) (count (?item) as ?count ){\n?item wdt:[property:external data available at URL] ?dataset;\nwdt:[property:instance of] wd:[entity:scholarly article];\nwdt:[property:publication date] ?date.\nBIND(year(?date) as ?year)\n}\nGROUP By ?year\nORDER by ?count",
    "complexity": "medium"
  },
  {
    "id": "259",
    "instruction": "List all items in the Ashmolean Museum without a known creation date.",
    "query": "SELECT ?item ?inventory WHERE {\n?item p:P195 [ps:P195 wd:Q636400; pq:P217 ?inventory].\nMINUS {?item wdt:P571 []}\nMINUS {?item wdt:P2348 []}\n}",
    "annotated": "PREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?item ?inventory WHERE {\n?item p:[property:collection] [ps:[property:collection] wd:[entity:Ashmolean Museum]; pq:[property:inventory number] ?inventory].\nMINUS {?item wdt:[property:inception] []}\nMINUS {?item wdt:[property:time period] []}\n}",
    "complexity": "medium"
  },
  {
    "id": "115",
    "instruction": "List all works written by Hans Sachs with their publication years and online texts.",
    "query": "SELECT ?work ?workLabel ?year ?text ?wikisource\nWHERE {\n?work wdt:P50 wd:Q19543; # author: Hans Sachs\nwdt:P577 ?pubdate.\nBIND(YEAR(?pubdate) AS ?year)\nOPTIONAL{?wikisource schema:about ?work; schema:isPartOf <https://de.wikisource.org/>} # text of work in German Wikisource\nOPTIONAL{?work wdt:P953 ?text} # link for text of work\nSERVICE wikibase:label {bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],de,en\"}\n} ORDER BY ?year",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?work ?workLabel ?year ?text ?wikisource\nWHERE {\n?work wdt:[property:author] wd:[entity:Hans Sachs]; # author: Hans Sachs\nwdt:[property:publication date] ?pubdate.\nBIND(YEAR(?pubdate) AS ?year)\nOPTIONAL{?wikisource schema:about ?work; schema:isPartOf <https://de.wikisource.org/>} # text of work in German Wikisource\nOPTIONAL{?work wdt:[property:full work available at URL] ?text} # link for text of work\nSERVICE wikibase:label {bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],de,en\"}\n} ORDER BY ?year",
    "complexity": "medium"
  },
  {
    "id": "2818",
    "instruction": "List the places in Riga named after other locations.",
    "query": "SELECT ?loc ?locLabel ?item ?itemLabel ?coord ?layer WHERE {\n?loc wdt:P131 wd:Q1773;\nwdt:P138 ?item.\n?item wdt:P31 ?type;\nwdt:P625 ?coord.\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"lv,en\".\n?type rdfs:label ?layer.\n}\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"lv,en\".\n}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?loc ?locLabel ?item ?itemLabel ?coord ?layer WHERE {\n?loc wdt:[property:located in the administrative territorial entity] wd:[entity:Riga];\nwdt:[property:named after] ?item.\n?item wdt:[property:instance of] ?type;\nwdt:[property:coordinate location] ?coord.\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"lv,en\".\n?type rdfs:label ?layer.\n}\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"lv,en\".\n}\n}",
    "complexity": "medium"
  },
  {
    "id": "2483",
    "instruction": "What are some unique Christmas traditions practiced around the world?",
    "query": "SELECT DISTINCT ?item ?itemLabel ?image ?article\nWHERE\n{\n# Christmas around the world\n{?item wdt:P31?/wdt:P279* wd:Q19809 . }\nUNION\n{?item wdt:P31?/wdt:P279* wd:Q78189229 . }\nUNION\n#Christmas traditions\n{?item wdt:P31?/wdt:P279* wd:Q717040 . }\n?item wdt:P18 ?image .\nOPTIONAL { ?article schema:about ?item ;\nschema:inLanguage \"en\" ;\nschema:isPartOf [ wikibase:wikiGroup \"wikipedia\" ] }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". } # Helps get the label in your language, if not, then en language\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?image ?article\nWHERE\n{\n# Christmas around the world\n{?item wdt:[property:instance of]?/wdt:[property:subclass of]* wd:[entity:Christmas] . }\nUNION\n{?item wdt:[property:instance of]?/wdt:[property:subclass of]* wd:[entity:observance of Christmas by country] . }\nUNION\n#Christmas traditions\n{?item wdt:[property:instance of]?/wdt:[property:subclass of]* wd:[entity:Christmas tradition] . }\n?item wdt:[property:image] ?image .\nOPTIONAL { ?article schema:about ?item ;\nschema:inLanguage \"en\" ;\nschema:isPartOf [ wikibase:wikiGroup \"wikipedia\" ] }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". } # Helps get the label in your language, if not, then en language\n}",
    "complexity": "medium"
  },
  {
    "id": "508",
    "instruction": "Find all Swedish words without a pronunciation for the form identical to the lemma.",
    "query": "SELECT ?l ?lemma ?form ?audio WHERE {\n?l dct:language wd:Q9027;\nwikibase:lemma ?lemma;\nontolex:lexicalForm ?form .\n?form ontolex:representation ?lemma .\nMINUS {?form wdt:P443 ?audio.}\n}",
    "annotated": "PREFIX dct: <http://purl.org/dc/terms/>\nPREFIX ontolex: <http://www.w3.org/ns/lemon/ontolex#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?l ?lemma ?form ?audio WHERE {\n?l dct:language wd:[entity:Swedish];\nwikibase:lemma ?lemma;\nontolex:lexicalForm ?form .\n?form ontolex:representation ?lemma .\nMINUS {?form wdt:[property:pronunciation audio] ?audio.}\n}",
    "complexity": "medium"
  },
  {
    "id": "802",
    "instruction": "List all scientific journals focused on Library and Information Science.",
    "query": "SELECT DISTINCT ?journal ?name WHERE {\n?journal wdt:P31 wd:Q5633421 . # is scientific journal\n{\n{ ?journal wdt:P921 wd:Q199655 } # with topic library science\nUNION { ?journal wdt:P921 wd:Q16387 } # and/or topic information science\nUNION { ?journal wdt:P921 wd:Q13420675 } # and/or topic library and information science\n}\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n?journal rdfs:label ?name .\n}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?journal ?name WHERE {\n?journal wdt:[property:instance of] wd:[entity:scientific journal] . # is scientific journal\n{\n{ ?journal wdt:[property:main subject] wd:[entity:Library and information science] } # with topic library science\nUNION { ?journal wdt:[property:main subject] wd:[entity:information science] } # and/or topic information science\nUNION { ?journal wdt:[property:main subject] wd:[entity:library and information science] } # and/or topic library and information science\n}\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n?journal rdfs:label ?name .\n}\n}",
    "complexity": "medium"
  }
]