[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "1801",
    "instruction": "List all UN member states with their head of government data completeness.",
    "query": "SELECT DISTINCT ?country ?countryLabel ?daysInUN (SUM(?daysInOffice) AS ?daysKnown) ((100* ?daysKnown / ?daysInUN) AS ?filledPercent) WHERE {\n# Current UN Member States\n?country wdt:P31 wd:Q3624078 ; p:P463 ?ms .\n?ms ps:P463 wd:Q1065 ; pq:P580 ?joined .\nFILTER NOT EXISTS { ?ms pq:P582 [] }\nBIND(FLOOR(NOW()-?joined) AS ?daysInUN)\n# what office(s) = head of government, and when?\n?country p:P1313 ?os .\n?os ps:P1313 ?office .\nOPTIONAL { ?os pq:P580 ?officeStart }\nOPTIONAL { ?os pq:P582 ?officeEnd }\nFILTER ( !BOUND(?officeEnd) || (?officeEnd > ?joined) )\n# Who has held office in that period?\nBIND(IF(BOUND(?officeStart), IF(?officeStart < ?joined, ?joined, ?officeStart), ?joined) AS ?effectiveStart)\nBIND(IF(BOUND(?officeEnd), ?officeEnd, NOW()) AS ?effectiveEnd)\n?person wdt:P31 wd:Q5 ; p:P39 ?ps .\n?ps ps:P39 ?office ; pq:P580 ?heldStart .\nOPTIONAL { ?ps pq:P582 ?heldEnd }\nFILTER ( !BOUND(?heldEnd) || (?heldEnd > ?effectiveStart) )\nBIND(IF(BOUND(?heldEnd), ?heldEnd, NOW()) AS ?heldPeriodEnd)\nBIND(IF(?heldStart < ?effectiveStart, ?effectiveStart, ?heldStart) AS ?heldPeriodStart)\nBIND(FLOOR(?heldPeriodEnd - ?heldPeriodStart) AS ?daysInOffice)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?country ?countryLabel ?daysInUN\nORDER BY DESC(?filledPercent) ?countryLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?country ?countryLabel ?daysInUN (SUM(?daysInOffice) AS ?daysKnown) ((100* ?daysKnown / ?daysInUN) AS ?filledPercent) WHERE {\n# Current UN Member States\n?country wdt:[property:instance of] wd:[entity:sovereign state] ; p:[property:member of] ?ms .\n?ms ps:[property:member of] wd:[entity:United Nations] ; pq:[property:start time] ?joined .\nFILTER NOT EXISTS { ?ms pq:[property:end time] [] }\nBIND(FLOOR(NOW()-?joined) AS ?daysInUN)\n# what office(s) = head of government, and when?\n?country p:[property:office held by head of government] ?os .\n?os ps:[property:office held by head of government] ?office .\nOPTIONAL { ?os pq:[property:start time] ?officeStart }\nOPTIONAL { ?os pq:[property:end time] ?officeEnd }\nFILTER ( !BOUND(?officeEnd) || (?officeEnd > ?joined) )\n# Who has held office in that period?\nBIND(IF(BOUND(?officeStart), IF(?officeStart < ?joined, ?joined, ?officeStart), ?joined) AS ?effectiveStart)\nBIND(IF(BOUND(?officeEnd), ?officeEnd, NOW()) AS ?effectiveEnd)\n?person wdt:[property:instance of] wd:[entity:human] ; p:[property:position held] ?ps .\n?ps ps:[property:position held] ?office ; pq:[property:start time] ?heldStart .\nOPTIONAL { ?ps pq:[property:end time] ?heldEnd }\nFILTER ( !BOUND(?heldEnd) || (?heldEnd > ?effectiveStart) )\nBIND(IF(BOUND(?heldEnd), ?heldEnd, NOW()) AS ?heldPeriodEnd)\nBIND(IF(?heldStart < ?effectiveStart, ?effectiveStart, ?heldStart) AS ?heldPeriodStart)\nBIND(FLOOR(?heldPeriodEnd - ?heldPeriodStart) AS ?daysInOffice)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?country ?countryLabel ?daysInUN\nORDER BY DESC(?filledPercent) ?countryLabel",
    "complexity": "complex"
  },
  {
    "id": "40",
    "instruction": "What are the items in the Bodleian Library's collections?",
    "query": "SELECT DISTINCT ?thing ?thingLabel (GROUP_CONCAT(DISTINCT ?year; separator=\", \") as ?years) ?shelfmark (GROUP_CONCAT(DISTINCT ?langLabel ; separator=\", \") as ?languages) WHERE {\n{ ?thing wdt:P195 wd:Q82133} UNION { ?thing p:P217/pq:P195 wd:Q82133 } #wd:Q16147979\nOPTIONAL {?thing wdt:P217 ?shelfmark}\nOPTIONAL {?thing wdt:P571 ?date. BIND(YEAR(?date) AS ?year) }\nOPTIONAL {?thing wdt:P407 ?lang }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" . ?thing rdfs:label ?thingLabel . ?lang rdfs:label ?langLabel }\n} GROUP BY ?thing ?thingLabel ?shelfmark\nORDER BY ?thingLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?thing ?thingLabel (GROUP_CONCAT(DISTINCT ?year; separator=\", \") as ?years) ?shelfmark (GROUP_CONCAT(DISTINCT ?langLabel ; separator=\", \") as ?languages) WHERE {\n{ ?thing wdt:[property:collection] wd:[entity:Bodleian Library]} UNION { ?thing p:[property:inventory number]/pq:[property:collection] wd:[entity:Bodleian Library] } #wd:[entity:Bodleian Libraries]\nOPTIONAL {?thing wdt:[property:inventory number] ?shelfmark}\nOPTIONAL {?thing wdt:[property:inception] ?date. BIND(YEAR(?date) AS ?year) }\nOPTIONAL {?thing wdt:[property:language of work or name] ?lang }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" . ?thing rdfs:label ?thingLabel . ?lang rdfs:label ?langLabel }\n} GROUP BY ?thing ?thingLabel ?shelfmark\nORDER BY ?thingLabel",
    "complexity": "complex"
  },
  {
    "id": "1670",
    "instruction": "List pioneers of photography born before 1901.",
    "query": "SELECT DISTINCT ?wditem ?wditemLabel ?date ?image ?work ?workLabel ?coord WHERE {\nSERVICE <http://dbpedia.org/sparql> {\n?item dct:subject dbc:Pioneers_of_photography ;\n#?item dct:subject|dct:subject/skos:broader|dct:subject/skos:broader/skos:broader dbc:Pioneers_of_photography ;\nowl:sameAs ?wditem FILTER regex (?wditem, \"wikidata.org\") .\n#?item dct:subject|dct:subject/skos:broader|dct:subject/skos:broader/skos:broader dbc:19th_century_in_art .\n}\nSERVICE <https://query.wikidata.org/sparql> {\n{?wditem wdt:P569 ?date FILTER (YEAR(?date)<1901).}\n# UNION\n# {?wditem wdt:P571|wdt:P577|wdt:P580|wdt:P619 ?date.}\n# FILTER (YEAR(?date)<1914).\n#{?wditem wdt:P625 ?coord .}\n# OPTIONAL {?wditem wdt:P800 ?work. ?work rdfs:label ?workLabel FILTER (LANG(?workLabel)=\"en\") .}\nOPTIONAL {?wditem wdt:P18 ?image } .\n?wditem rdfs:label ?wditemLabel FILTER (LANG(?wditemLabel)=\"en\") .\n}\n}",
    "annotated": "PREFIX dct: <http://purl.org/dc/terms/>\nPREFIX owl: <http://www.w3.org/2002/07/owl#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX skos: <http://www.w3.org/2004/02/skos/core#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX dbc: <http://dbpedia.org/resource/Category:>\n\nSELECT DISTINCT ?wditem ?wditemLabel ?date ?image ?work ?workLabel ?coord WHERE {\nSERVICE <http://dbpedia.org/sparql> {\n?item dct:subject dbc:Pioneers_of_photography ;\n#?item dct:subject|dct:subject/skos:broader|dct:subject/skos:broader/skos:broader dbc:Pioneers_of_photography ;\nowl:sameAs ?wditem FILTER regex (?wditem, \"wikidata.org\") .\n#?item dct:subject|dct:subject/skos:broader|dct:subject/skos:broader/skos:broader dbc:19th_century_in_art .\n}\nSERVICE <https://query.wikidata.org/sparql> {\n{?wditem wdt:[property:date of birth] ?date FILTER (YEAR(?date)<1901).}\n# UNION\n# {?wditem wdt:[property:inception]|wdt:[property:publication date]|wdt:[property:start time]|wdt:[property:UTC date of spacecraft launch] ?date.}\n# FILTER (YEAR(?date)<1914).\n#{?wditem wdt:[property:coordinate location] ?coord .}\n# OPTIONAL {?wditem wdt:[property:notable work] ?work. ?work rdfs:label ?workLabel FILTER (LANG(?workLabel)=\"en\") .}\nOPTIONAL {?wditem wdt:[property:image] ?image } .\n?wditem rdfs:label ?wditemLabel FILTER (LANG(?wditemLabel)=\"en\") .\n}\n}",
    "complexity": "complex"
  },
  {
    "id": "1230",
    "instruction": "Show me a map of places where species or higher-order taxa are the main subjects of publications.",
    "query": "SELECT\n?location ?locationLabel\n?geo\n?example_work ?example_workLabel\nWITH {\nSELECT\n?location ?geo\n(SAMPLE(?work) AS ?example_work)\nWHERE {\n# Find works that are marked with main subject of the topic.\n?work wdt:P921 ?topic .\n?topic wdt:P31 wd:Q16521 .\n# Identify co-occuring topic that is geo-locatable.\n?work wdt:P921 ?location .\n?location wdt:P625 ?geo .\n}\nGROUP BY ?location ?geo\n} AS %results\nWHERE {\nINCLUDE %results\n# Label the results\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en,da,de,es,fr,jp,nl,no,ru,sv,zh\".\n}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT\n?location ?locationLabel\n?geo\n?example_work ?example_workLabel\nWITH {\nSELECT\n?location ?geo\n(SAMPLE(?work) AS ?example_work)\nWHERE {\n# Find works that are marked with main subject of the topic.\n?work wdt:[property:main subject] ?topic .\n?topic wdt:[property:instance of] wd:[entity:taxon] .\n# Identify co-occuring topic that is geo-locatable.\n?work wdt:[property:main subject] ?location .\n?location wdt:[property:coordinate location] ?geo .\n}\nGROUP BY ?location ?geo\n} AS %results\nWHERE {\nINCLUDE %results\n# Label the results\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en,da,de,es,fr,jp,nl,no,ru,sv,zh\".\n}\n}",
    "complexity": "complex"
  },
  {
    "id": "783",
    "instruction": "List all individuals who passed away in 1945.",
    "query": "SELECT ?item ?itemLabel ?last_time WHERE {\n{\nSELECT ?item (MAX(?time0) AS ?last_time) WHERE {\n?item wdt:P31 wd:Q5 .\n?item wdt:P570 ?time0 .\nFILTER ( ?time0 >= \"1945-01-01T00:00:00Z\"^^xsd:dateTime && ?time0 <= \"1945-12-31T00:00:00Z\"^^xsd:dateTime ) .\n} GROUP BY ?item\n}\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n} ORDER BY ASC (?last_time)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?last_time WHERE {\n{\nSELECT ?item (MAX(?time0) AS ?last_time) WHERE {\n?item wdt:[property:instance of] wd:[entity:human] .\n?item wdt:[property:date of death] ?time0 .\nFILTER ( ?time0 >= \"1945-01-01T00:00:00Z\"^^xsd:dateTime && ?time0 <= \"1945-12-31T00:00:00Z\"^^xsd:dateTime ) .\n} GROUP BY ?item\n}\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n} ORDER BY ASC (?last_time)",
    "complexity": "complex"
  },
  {
    "id": "1254",
    "instruction": "List all individuals who were members of the Nazi Party and received the Order of Merit of the Federal Republic of Germany.",
    "query": "SELECT ?item ?itemLabel WHERE {\n?item wdt:P31 wd:Q5;\np:P102/ps:P102 wd:Q7320;\nwdt:P166/wdt:P279* wd:Q21164.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel WHERE {\n?item wdt:[property:instance of] wd:[entity:human];\np:[property:member of political party]/ps:[property:member of political party] wd:[entity:Nazi Party];\nwdt:[property:award received]/wdt:[property:subclass of]* wd:[entity:Order of Merit of the Federal Republic of Germany].\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "1272",
    "instruction": "What are the current figure skating competitions happening?",
    "query": "SELECT ?competition ?competitionLabel ?date ?end WHERE {\n{ ?competition wdt:P31 wd:Q2990963. }\nUNION\n{\n?competition wdt:P31 wd:Q16510064.\n?competition wdt:P361 ?comp.\n?comp wdt:P31 wd:Q2990963.\n}\nUNION\n{\n?competition wdt:P361 ?segment.\n?segment wdt:P31 wd:Q16510064.\n}\nOPTIONAL { ?competition wdt:P580 ?start. }\nOPTIONAL { ?competition wdt:P582 ?end. }\nOPTIONAL { ?competition wdt:P585 ?pointInTime. }\nBIND(COALESCE(?start, ?pointInTime) AS ?date)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\nFILTER((BOUND(?start)) || (BOUND(?pointInTime)))\nFILTER(?end >= (NOW() - \"P1D\"^^xsd:duration))\nFILTER((NOW()) >= ?date)\n}\nORDER BY ?date",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?competition ?competitionLabel ?date ?end WHERE {\n{ ?competition wdt:[property:instance of] wd:[entity:figure skating competition]. }\nUNION\n{\n?competition wdt:[property:instance of] wd:[entity:sporting event].\n?competition wdt:[property:part of] ?comp.\n?comp wdt:[property:instance of] wd:[entity:figure skating competition].\n}\nUNION\n{\n?competition wdt:[property:part of] ?segment.\n?segment wdt:[property:instance of] wd:[entity:sporting event].\n}\nOPTIONAL { ?competition wdt:[property:start time] ?start. }\nOPTIONAL { ?competition wdt:[property:end time] ?end. }\nOPTIONAL { ?competition wdt:[property:point in time] ?pointInTime. }\nBIND(COALESCE(?start, ?pointInTime) AS ?date)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\nFILTER((BOUND(?start)) || (BOUND(?pointInTime)))\nFILTER(?end >= (NOW() - \"P1D\"^^xsd:duration))\nFILTER((NOW()) >= ?date)\n}\nORDER BY ?date",
    "complexity": "complex"
  },
  {
    "id": "2118",
    "instruction": "How many Nature articles were published on Sundays in a specific year?",
    "query": "SELECT ?year (COUNT(?i) as ?is) {\n?i wdt:P1433 wd:Q180445 ; wdt:P577 ?date.\nbind((floor(\"2020-12-06\"^^xsd:dateTime - ?date)/7) as ?weeks) .\nbind ((?weeks-floor(?weeks)) as ?fractional) .\nbind (YEAR(?date) as ?year)\nfilter (?fractional = 0) .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?year",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?year (COUNT(?i) as ?is) {\n?i wdt:[property:published in] wd:[entity:Nature] ; wdt:[property:publication date] ?date.\nbind((floor(\"2020-12-06\"^^xsd:dateTime - ?date)/7) as ?weeks) .\nbind ((?weeks-floor(?weeks)) as ?fractional) .\nbind (YEAR(?date) as ?year)\nfilter (?fractional = 0) .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?year",
    "complexity": "complex"
  },
  {
    "id": "1345",
    "instruction": "List all natural arches around the world.",
    "query": "SELECT ?item ?itemLabel ?countryLabel ?coords ?image WHERE {\n?item wdt:P31/wdt:P279* wd:Q954501 .\nOPTIONAL { ?item wdt:P17 ?country . }\nOPTIONAL { ?item wdt:P625 ?coords . }\nOPTIONAL { ?item wdt:P18 ?image . }\nFILTER NOT EXISTS { ?item wdt:P576 ?x }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} ORDER BY ?countryLabel ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?countryLabel ?coords ?image WHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:natural arch] .\nOPTIONAL { ?item wdt:[property:country] ?country . }\nOPTIONAL { ?item wdt:[property:coordinate location] ?coords . }\nOPTIONAL { ?item wdt:[property:image] ?image . }\nFILTER NOT EXISTS { ?item wdt:[property:dissolved, abolished or demolished date] ?x }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} ORDER BY ?countryLabel ?itemLabel",
    "complexity": "complex"
  },
  {
    "id": "1180",
    "instruction": "List all female ministers in African countries.",
    "query": "SELECT ?human ?humanLabel ?positionLabel ?countryLabel WITH {\nSELECT DISTINCT ?human ?position ?country WHERE {\n?human wdt:P31 wd:Q5;\nwdt:P21 wd:Q6581072;\nwdt:P39 ?position.\n?position wdt:P279+ wd:Q83307;\nwdt:P1001 ?country.\n?country wdt:P30 wd:Q15.\n}\n} AS %results WHERE {\nINCLUDE %results.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?human ?humanLabel ?positionLabel ?countryLabel WITH {\nSELECT DISTINCT ?human ?position ?country WHERE {\n?human wdt:[property:instance of] wd:[entity:human];\nwdt:[property:sex or gender] wd:[entity:female];\nwdt:[property:position held] ?position.\n?position wdt:[property:subclass of]+ wd:[entity:minister];\nwdt:[property:applies to jurisdiction] ?country.\n?country wdt:[property:continent] wd:[entity:Africa].\n}\n} AS %results WHERE {\nINCLUDE %results.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "1587",
    "instruction": "List musicians who have a software named after them and show their images.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?after ?image WHERE {\n?item (wdt:P31/wdt:P279*) wd:Q7397.\n?item wdt:P138 ?after.\n?after wdt:P106 ?musician.\n?musician wdt:P279* wd:Q639669.\nOPTIONAL { ?after wdt:P18 ?image. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?after ?image WHERE {\n?item (wdt:[property:instance of]/wdt:[property:subclass of]*) wd:[entity:software].\n?item wdt:[property:named after] ?after.\n?after wdt:[property:occupation] ?musician.\n?musician wdt:[property:subclass of]* wd:[entity:musician].\nOPTIONAL { ?after wdt:[property:image] ?image. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "2548",
    "instruction": "List all Oscar winners from 1929.",
    "query": "SELECT ?human ?humanLabel ?awardEditionLabel ?awardLabel ?awardWork ?awardWorkLabel ?director ?directorLabel ?time\nWHERE\n{\n{\nSELECT (SAMPLE(?human) AS ?human) ?award ?awardWork (SAMPLE(?director) AS ?director) (SAMPLE(?awardEdition) AS ?awardEdition) (SAMPLE(?time) AS ?time) WHERE {\n?award wdt:P31 wd:Q19020 . # All items that are instance of(P31) of Academy awards (Q19020)\n{\n?human wdt:P31 wd:Q5 . # Humans\n?human p:P166 ?awardStat . # with an awarded(P166) statement\n?awardStat ps:P166 ?award ; # that has any of the values of ?award\npq:P805 ?awardEdition ; # Get the award edition (which is \"subject of\" XXth Academy Awards)\npq:P1686 ?awardWork . # The work they have been awarded for\n} UNION {\n?awardWork wdt:P31 wd:Q11424 . # Films\n?awardWork p:P166 ?awardStat . # with an awarded(P166) statement\n?awardStat ps:P166 ?award ; # that has any of the values of ?award\npq:P805 ?awardEdition . # Get the award edition (which is \"subject of\" XXth Academy Awards)\n}\nOPTIONAL {\n?awardEdition wdt:P585 ?time . # the \"point of time\" of the Academy Award\n?awardWork wdt:P57 ?director .\n}\n}\nGROUP BY ?awardWork ?award # We only want every movie once for a category (a 'random' person is selected)\n}\nSERVICE wikibase:label { # ... include the labels\nbd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" .\n}\n}\nORDER BY DESC(?time)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?human ?humanLabel ?awardEditionLabel ?awardLabel ?awardWork ?awardWorkLabel ?director ?directorLabel ?time\nWHERE\n{\n{\nSELECT (SAMPLE(?human) AS ?human) ?award ?awardWork (SAMPLE(?director) AS ?director) (SAMPLE(?awardEdition) AS ?awardEdition) (SAMPLE(?time) AS ?time) WHERE {\n?award wdt:[property:instance of] wd:[entity:Academy Awards] . # All items that are instance of([property:instance of]) of Academy awards ([entity:Academy Awards])\n{\n?human wdt:[property:instance of] wd:[entity:human] . # Humans\n?human p:[property:award received] ?awardStat . # with an awarded([property:award received]) statement\n?awardStat ps:[property:award received] ?award ; # that has any of the values of ?award\npq:[property:statement is subject of] ?awardEdition ; # Get the award edition (which is \"subject of\" XXth Academy Awards)\npq:[property:for work] ?awardWork . # The work they have been awarded for\n} UNION {\n?awardWork wdt:[property:instance of] wd:[entity:film] . # Films\n?awardWork p:[property:award received] ?awardStat . # with an awarded([property:award received]) statement\n?awardStat ps:[property:award received] ?award ; # that has any of the values of ?award\npq:[property:statement is subject of] ?awardEdition . # Get the award edition (which is \"subject of\" XXth Academy Awards)\n}\nOPTIONAL {\n?awardEdition wdt:[property:point in time] ?time . # the \"point of time\" of the Academy Award\n?awardWork wdt:[property:director] ?director .\n}\n}\nGROUP BY ?awardWork ?award # We only want every movie once for a category (a 'random' person is selected)\n}\nSERVICE wikibase:label { # ... include the labels\nbd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" .\n}\n}\nORDER BY DESC(?time)",
    "complexity": "complex"
  },
  {
    "id": "2423",
    "instruction": "Find occupations with different female and male forms in English.",
    "query": "SELECT ?item ?itemLabel ?femaleform ?maleform ?lang WHERE {\nwd:Q12737077 ^wdt:P279*/^wdt:P31 ?item.\n?item wdt:P2521 ?femaleform;\nwdt:P3321 ?maleform;\nrdfs:label ?itemLabel.\nBIND(LANG(?itemLabel) AS ?lang)\nFILTER((LANG(?itemLabel)) = \"en\")\nFILTER((LANG(?femaleform)) = ?lang)\nFILTER((LANG(?maleform)) = ?lang)\nFILTER(?itemLabel = ?maleform)\nFILTER(?itemLabel != ?femaleform)\n}\nLIMIT 100",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?item ?itemLabel ?femaleform ?maleform ?lang WHERE {\nwd:[entity:occupation] ^wdt:[property:subclass of]*/^wdt:[property:instance of] ?item.\n?item wdt:[property:female form of label] ?femaleform;\nwdt:[property:male form of label] ?maleform;\nrdfs:label ?itemLabel.\nBIND(LANG(?itemLabel) AS ?lang)\nFILTER((LANG(?itemLabel)) = \"en\")\nFILTER((LANG(?femaleform)) = ?lang)\nFILTER((LANG(?maleform)) = ?lang)\nFILTER(?itemLabel = ?maleform)\nFILTER(?itemLabel != ?femaleform)\n}\nLIMIT 100",
    "complexity": "complex"
  },
  {
    "id": "809",
    "instruction": "List the subjects commonly depicted in artworks.",
    "query": "SELECT DISTINCT ?depicts (SAMPLE(?dL) AS ?depictsLabel) (COUNT(DISTINCT ?item) AS ?count) WHERE {\n?item wdt:P180 ?depicts .\nOPTIONAL { ?depicts rdfs:label ?dL filter (lang(?dL) = \"en\") . }\n}\nGROUP BY ?depicts\nORDER BY DESC(?count) ?depictsLabel",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT DISTINCT ?depicts (SAMPLE(?dL) AS ?depictsLabel) (COUNT(DISTINCT ?item) AS ?count) WHERE {\n?item wdt:[property:depicts] ?depicts .\nOPTIONAL { ?depicts rdfs:label ?dL filter (lang(?dL) = \"en\") . }\n}\nGROUP BY ?depicts\nORDER BY DESC(?count) ?depictsLabel",
    "complexity": "complex"
  },
  {
    "id": "480",
    "instruction": "Find humans with Belgian citizenship and no Dutch description.",
    "query": "SELECT ?item ?itemLabel ?genderLabel ?occupationLabel ?domainLabel ?positionLabel ?itemDescription WHERE {\n?item wdt:P31 wd:Q5.\n?item wdt:P27 wd:Q31.\noptional{ ?item wdt:P21 ?gender.}\noptional{ ?item wdt:P106 ?occupation.}\noptional{ ?item wdt:P101 ?domain.}\noptional{ ?item wdt:P39 ?position.}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"nl,fr,en,de,it,es,pt,no\". }\nFILTER(NOT EXISTS {\n?item schema:description ?itemdesc.\nFILTER(LANG(?itemdesc) = \"nl\")\n})\n}\norder by ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?genderLabel ?occupationLabel ?domainLabel ?positionLabel ?itemDescription WHERE {\n?item wdt:[property:instance of] wd:[entity:human].\n?item wdt:[property:country of citizenship] wd:[entity:Belgium].\noptional{ ?item wdt:[property:sex or gender] ?gender.}\noptional{ ?item wdt:[property:occupation] ?occupation.}\noptional{ ?item wdt:[property:field of work] ?domain.}\noptional{ ?item wdt:[property:position held] ?position.}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"nl,fr,en,de,it,es,pt,no\". }\nFILTER(NOT EXISTS {\n?item schema:description ?itemdesc.\nFILTER(LANG(?itemdesc) = \"nl\")\n})\n}\norder by ?itemLabel",
    "complexity": "complex"
  },
  {
    "id": "1984",
    "instruction": "List all railway stations in India, Pakistan, and Bangladesh.",
    "query": "SELECT DISTINCT ?cd ?l ?i ?iLabel ?ct ?ctLabel ?rgb ?x WITH{SELECT ?i ?cd ?lat1 ?lon1 ?loc ?x(sample(?op)as?op)WHERE{VALUES ?c1{wd:Q668 wd:Q843 wd:Q902}?i wdt:P31/wdt:P279* wd:Q55488;wdt:P625 ?cd;wdt:P17 ?c1;p:P625/psv:P625 ?y.?y wikibase:geoLatitude ?lat1;wikibase:geoLongitude ?lon1.MINUS{?i wdt:P31/wdt:P279* wd:Q928830}OPTIONAL{?i wdt:P131 ?loc}OPTIONAL{?i wdt:P137 ?op}OPTIONAL{{?i wdt:P5696 ?x}UNION{?i wdt:P6785 ?x}}OPTIONAL{?i wdt:P17 wd:Q902. BIND(\"-\"as?x)}}GROUP BY ?i ?cd ?lat1 ?lon1 ?loc ?x}AS%s\nWITH{SELECT ?l ?ct ?o ?t WHERE{INCLUDE %s.?i p:P197 ?nss.?nss ps:P197 ?ns.?ns p:P625/psv:P625 ?z.?z wikibase:geoLatitude ?lat2;wikibase:geoLongitude ?lon2.OPTIONAL{?nss pq:P81 ?ct.OPTIONAL{?ct wdt:P127 ?o}}OPTIONAL{?nss pq:P5051 ?t}FILTER(STR(?i)< STR(?ns)).BIND(CONCAT('LINESTRING(',STR(?lon1),' ',STR(?lat1),',',STR(?lon2),' ',STR(?lat2),')')AS?str).BIND(STRDT(?str,geo:wktLiteral)AS?l)}}AS%l\nWHERE{{INCLUDE%s}UNION{INCLUDE%l}.BIND(IF(BOUND(?l),IF(BOUND(?ct),IF(BOUND(?t),IF(BOUND(?o),\"00f\",\"4682b4\"),\"40e0d0\"),\"0f0\"),IF(BOUND(?x),IF(BOUND(?loc),IF(BOUND(?op),\"00f\",\"4682b4\"),\"40e0d0\"),\"0f0\"))AS?rgb)SERVICE wikibase:label{bd:serviceParam wikibase:language \"en\".}}#",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?cd ?l ?i ?iLabel ?ct ?ctLabel ?rgb ?x WITH{SELECT ?i ?cd ?lat1 ?lon1 ?loc ?x(sample(?op)as?op)WHERE{VALUES ?c1{wd:[entity:India] wd:[entity:Pakistan] wd:[entity:Bangladesh]}?i wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:railway station];wdt:[property:coordinate location] ?cd;wdt:[property:country] ?c1;p:[property:coordinate location]/psv:[property:coordinate location] ?y.?y wikibase:geoLatitude ?lat1;wikibase:geoLongitude ?lon1.MINUS{?i wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:metro station]}OPTIONAL{?i wdt:[property:located in the administrative territorial entity] ?loc}OPTIONAL{?i wdt:[property:operator] ?op}OPTIONAL{{?i wdt:[property:Indian Railways station code] ?x}UNION{?i wdt:[property:Pakistan Railways station code] ?x}}OPTIONAL{?i wdt:[property:country] wd:[entity:Bangladesh]. BIND(\"-\"as?x)}}GROUP BY ?i ?cd ?lat1 ?lon1 ?loc ?x}AS%s\nWITH{SELECT ?l ?ct ?o ?t WHERE{INCLUDE %s.?i p:[property:adjacent station] ?nss.?nss ps:[property:adjacent station] ?ns.?ns p:[property:coordinate location]/psv:[property:coordinate location] ?z.?z wikibase:geoLatitude ?lat2;wikibase:geoLongitude ?lon2.OPTIONAL{?nss pq:[property:connecting line] ?ct.OPTIONAL{?ct wdt:[property:owned by] ?o}}OPTIONAL{?nss pq:[property:towards] ?t}FILTER(STR(?i)< STR(?ns)).BIND(CONCAT('LINESTRING(',STR(?lon1),' ',STR(?lat1),',',STR(?lon2),' ',STR(?lat2),')')AS?str).BIND(STRDT(?str,geo:wktLiteral)AS?l)}}AS%l\nWHERE{{INCLUDE%s}UNION{INCLUDE%l}.BIND(IF(BOUND(?l),IF(BOUND(?ct),IF(BOUND(?t),IF(BOUND(?o),\"00f\",\"4682b4\"),\"40e0d0\"),\"0f0\"),IF(BOUND(?x),IF(BOUND(?loc),IF(BOUND(?op),\"00f\",\"4682b4\"),\"40e0d0\"),\"0f0\"))AS?rgb)SERVICE wikibase:label{bd:serviceParam wikibase:language \"en\".}}#",
    "complexity": "complex"
  },
  {
    "id": "299",
    "instruction": "List all astrolabes from the History of Science Museum.",
    "query": "SELECT (SUBSTR(STR(?item),32) AS ?wdq) (SUBSTR(STR(?prop),32) AS ?wdp) ?object ?url WHERE {\n?item wdt:P31/wdt:P361? wd:Q164992 ; wdt:P195 wd:Q6941088.\n?item wdt:P973 ?url.\n?item ?p ?statement.\n?prop wikibase:claim ?p; wikibase:statementProperty ?ps FILTER (?prop != wd:P973)\nFILTER (?prop != wd:P18).\n?statement ?ps ?object .\nFILTER NOT EXISTS {?statement prov:wasDerivedFrom []}\n} ORDER BY ?item",
    "annotated": "PREFIX prov: <http://www.w3.org/ns/prov#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT (SUBSTR(STR(?item),32) AS ?wdq) (SUBSTR(STR(?prop),32) AS ?wdp) ?object ?url WHERE {\n?item wdt:[property:instance of]/wdt:[property:part of]? wd:[entity:astrolabe] ; wdt:[property:collection] wd:[entity:History of Science Museum].\n?item wdt:[property:described at URL] ?url.\n?item ?p ?statement.\n?prop wikibase:claim ?p; wikibase:statementProperty ?ps FILTER (?prop != wd:[property:described at URL])\nFILTER (?prop != wd:[property:image]).\n?statement ?ps ?object .\nFILTER NOT EXISTS {?statement prov:wasDerivedFrom []}\n} ORDER BY ?item",
    "complexity": "complex"
  }
]