[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "790",
    "instruction": "What are the metro stations in Paris connected to Line 1?",
    "query": "SELECT ?item ?itemLabel ?adjacent ?adjacentL ?coords WHERE {\n?item wdt:P31/wdt:P279* wd:Q928830 .\n?item wdt:P81 wd:Q13224 .\n?item wdt:P625 ?coords .\nOPTIONAL {\n?item p:P197 ?adjacent_statement .\n?adjacent_statement ps:P197 ?adjacent .\n?adjacent_statement pq:P560 wd:Q585752 .\n?adjacent rdfs:label ?adjacentL filter (lang(?adjacentL) = \"en\")\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} ORDER BY ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?adjacent ?adjacentL ?coords WHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:metro station] .\n?item wdt:[property:connecting line] wd:[entity:Paris M\u00e9tro Line 1] .\n?item wdt:[property:coordinate location] ?coords .\nOPTIONAL {\n?item p:[property:adjacent station] ?adjacent_statement .\n?adjacent_statement ps:[property:adjacent station] ?adjacent .\n?adjacent_statement pq:[property:direction] wd:[entity:Ch\u00e2teau de Vincennes] .\n?adjacent rdfs:label ?adjacentL filter (lang(?adjacentL) = \"en\")\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} ORDER BY ?itemLabel",
    "complexity": "medium"
  },
  {
    "id": "1804",
    "instruction": "List all horses in order of their age at death.",
    "query": "SELECT ?horse ?birthdate ?deathdate ?age ?horseLabel ?horseDescription\nWHERE {\n?horse wdt:P31/wdt:P279* wd:Q726 .\n?horse wdt:P569 ?birthdate .\n?horse wdt:P570 ?deathdate .\nBIND(?deathdate - ?birthdate AS ?age)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],fr\" . }\n}\nORDER BY DESC (?age)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?horse ?birthdate ?deathdate ?age ?horseLabel ?horseDescription\nWHERE {\n?horse wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:horse] .\n?horse wdt:[property:date of birth] ?birthdate .\n?horse wdt:[property:date of death] ?deathdate .\nBIND(?deathdate - ?birthdate AS ?age)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],fr\" . }\n}\nORDER BY DESC (?age)",
    "complexity": "medium"
  },
  {
    "id": "207",
    "instruction": "List the top 10 botanists with the most Wikipedia pages about them.",
    "query": "SELECT ?b ?q ?qLabel (count(?s) AS ?sitelinks) WHERE {\n?q wdt:P428 ?b.\n?s schema:about ?q.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n} GROUP BY ?b ?q ?qLabel\nORDER BY DESC(?sitelinks)\nLIMIT 10",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?b ?q ?qLabel (count(?s) AS ?sitelinks) WHERE {\n?q wdt:[property:botanist author abbreviation] ?b.\n?s schema:about ?q.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n} GROUP BY ?b ?q ?qLabel\nORDER BY DESC(?sitelinks)\nLIMIT 10",
    "complexity": "medium"
  },
  {
    "id": "1586",
    "instruction": "List all cities that were part of the Hanseatic League.",
    "query": "SELECT * WHERE {\n?item wdt:P31*/wdt:P279* wd:Q707813;\nwdt:P625 ?geo .\n}",
    "annotated": "PREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT * WHERE {\n?item wdt:[property:instance of]*/wdt:[property:subclass of]* wd:[entity:Hanseatic city];\nwdt:[property:coordinate location] ?geo .\n}",
    "complexity": "medium"
  },
  {
    "id": "2626",
    "instruction": "What topics did Swedish Parliament members propose motions about in 2020-21?",
    "query": "SELECT ?item1 ?item1Label ?rgb ?item2 ?item2Label ?image2 # ?edgeLabel\nWHERE {\n?edge wdt:P179 wd:Q99037794 ;\nwdt:P921 ?item2 ;\nwdt:P50 ?item1 .\n?item1 wdt:P102/wdt:P465 ?rgb .\n# OPTIONAL { ?item2 wdt:P18 ?image2. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,sv\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item1 ?item1Label ?rgb ?item2 ?item2Label ?image2 # ?edgeLabel\nWHERE {\n?edge wdt:[property:part of the series] wd:[entity:motions of the 2020-2021 legislative session of the Riksdag] ;\nwdt:[property:main subject] ?item2 ;\nwdt:[property:author] ?item1 .\n?item1 wdt:[property:member of political party]/wdt:[property:sRGB color hex triplet] ?rgb .\n# OPTIONAL { ?item2 wdt:[property:image] ?image2. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,sv\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "1899",
    "instruction": "How many paintings by female artists are in the National Gallery?",
    "query": "SELECT (COUNT(?item) AS ?count)\nWHERE {\n?item wdt:P195 wd:Q180788 . #National Gallery\n?item wdt:P170 ?artist.\n?artist wdt:P21 wd:Q6581072. #male = Q6581097\n}",
    "annotated": "PREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT (COUNT(?item) AS ?count)\nWHERE {\n?item wdt:[property:collection] wd:[entity:National Gallery] . #National Gallery\n?item wdt:[property:creator] ?artist.\n?artist wdt:[property:sex or gender] wd:[entity:female]. #male = Q6581097\n}",
    "complexity": "medium"
  },
  {
    "id": "2554",
    "instruction": "List all places named in honor of Saint Valentine or Valentine's Day.",
    "query": "SELECT DISTINCT ?q ?qLabel ?coord ?valentinsLabel WHERE {\nVALUES ?valentins { wd:Q37587 wd:Q192151 wd:Q192151 wd:Q26203089 }\n?q wdt:P625 ?coord ; wdt:P138 ?valentins .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?q ?qLabel ?coord ?valentinsLabel WHERE {\nVALUES ?valentins { wd:[entity:Valentine's Day] wd:[entity:Saint Valentine] wd:[entity:Saint Valentine] wd:[entity:Valentin von R\u00e4tien] }\n?q wdt:[property:coordinate location] ?coord ; wdt:[property:named after] ?valentins .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "1714",
    "instruction": "List bands named after characters or places from Tolkien's stories.",
    "query": "SELECT ?band ?bandLabel\nWHERE {\n?band wdt:P31/wdt:P279* wd:Q215380 ;\nwdt:P138 ?name .\n?name wdt:P1080 wd:Q81738 .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?band ?bandLabel\nWHERE {\n?band wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:musical group] ;\nwdt:[property:named after] ?name .\n?name wdt:[property:from narrative universe] wd:[entity:Tolkien's legendarium] .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "2218",
    "instruction": "Get the list of Wikipedia pages under 'Category:Fodda 2001' using MediaWiki API.",
    "query": "SELECT ?item ?itemLabel ?genderLabel WHERE {\nSERVICE wikibase:mwapi {\nbd:serviceParam wikibase:endpoint \"sv.wikipedia.org\"; # Set the project here\nwikibase:api \"Generator\";\nmwapi:generator \"categorymembers\"; # Selects the content from a category\nmwapi:gcmtitle \"Category:Fodda 2001\";. # Specifies the category (Born in 2001)\n?item wikibase:apiOutputItem mwapi:item.\n}\nFILTER BOUND (?item) # Safeguard to not get a timeout from unbound items when using ?item below\n?item wdt:P21 ?gender . # Example retrieval of a value\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,sv\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?genderLabel WHERE {\nSERVICE wikibase:mwapi {\nbd:serviceParam wikibase:endpoint \"sv.wikipedia.org\"; # Set the project here\nwikibase:api \"Generator\";\nmwapi:generator \"categorymembers\"; # Selects the content from a category\nmwapi:gcmtitle \"Category:Fodda 2001\";. # Specifies the category (Born in 2001)\n?item wikibase:apiOutputItem mwapi:item.\n}\nFILTER BOUND (?item) # Safeguard to not get a timeout from unbound items when using ?item below\n?item wdt:[property:sex or gender] ?gender . # Example retrieval of a value\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,sv\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "1108",
    "instruction": "How many mass shootings have occurred in each country since 1990?",
    "query": "SELECT ?countryLabel (COUNT(DISTINCT ?item) AS ?count)\nWHERE {\n?item wdt:P31/wdt:P279* wd:Q21480300 ; wdt:P585 ?date ; wdt:P17 ?country .\nFILTER (?date >= \"1990-01-01\"^^xsd:dateTime) .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" . }\n}\nGROUP BY ?countryLabel\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?countryLabel (COUNT(DISTINCT ?item) AS ?count)\nWHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:mass shooting] ; wdt:[property:point in time] ?date ; wdt:[property:country] ?country .\nFILTER (?date >= \"1990-01-01\"^^xsd:dateTime) .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" . }\n}\nGROUP BY ?countryLabel\nORDER BY DESC(?count)",
    "complexity": "medium"
  },
  {
    "id": "762",
    "instruction": "What materials were used in each painting?",
    "query": "SELECT ?material ?painting\nWHERE\n{\n?painting wdt:P31/wdt:P279* wd:Q3305213;\np:P186 [ ps:P186 ?material; pq:P518 wd:Q861259 ].\n}",
    "annotated": "PREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?material ?painting\nWHERE\n{\n?painting wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:painting];\np:[property:made from material] [ ps:[property:made from material] ?material; pq:[property:applies to part] wd:[entity:painting support] ].\n}",
    "complexity": "medium"
  },
  {
    "id": "1577",
    "instruction": "List all species of hummingbirds along with their genus and images.",
    "query": "SELECT ?item ?itemLabel ?genus ?genusLabel ?image WHERE {\n?item wdt:P31 wd:Q16521.\n?item wdt:P105 wd:Q7432.\n?item wdt:P171* wd:Q43624.\n?item wdt:P171 ?genus.\nOPTIONAL {?item wdt:P18 ?image.}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?genus ?genusLabel ?image WHERE {\n?item wdt:[property:instance of] wd:[entity:taxon].\n?item wdt:[property:taxon rank] wd:[entity:species].\n?item wdt:[property:parent taxon]* wd:[entity:hummingbird].\n?item wdt:[property:parent taxon] ?genus.\nOPTIONAL {?item wdt:[property:image] ?image.}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "1453",
    "instruction": "List all South African cities with twin cities.",
    "query": "SELECT * WHERE {\n?item wdt:P190 ?sister;\nwdt:P625 ?coord .\n?sister wdt:P131* wd:Q258 .\n}",
    "annotated": "PREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT * WHERE {\n?item wdt:[property:twinned administrative body] ?sister;\nwdt:[property:coordinate location] ?coord .\n?sister wdt:[property:located in the administrative territorial entity]* wd:[entity:South Africa] .\n}",
    "complexity": "medium"
  },
  {
    "id": "2142",
    "instruction": "What works entered the public domain in 2021?",
    "query": "SELECT ?work ?workLabel ?type ?typeLabel ?date ?articles WHERE {\n?work p:P3893/psv:P3893 ?date_node .\n?date_node wikibase:timeValue ?date .\nFILTER( ?date >= \"2021-01-01T00:00:00\"^^xsd:dateTime && ?date < \"2022-01-01T00:00:00\"^^xsd:dateTime )\n?work wdt:P31 ?type ;\nwikibase:sitelinks ?articles .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr,en,de,it,es,nl\" . }\n}\n# Order by number or articles on Wikimedia sites\nORDER BY DESC(?articles)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?work ?workLabel ?type ?typeLabel ?date ?articles WHERE {\n?work p:[property:public domain date]/psv:[property:public domain date] ?date_node .\n?date_node wikibase:timeValue ?date .\nFILTER( ?date >= \"2021-01-01T00:00:00\"^^xsd:dateTime && ?date < \"2022-01-01T00:00:00\"^^xsd:dateTime )\n?work wdt:[property:instance of] ?type ;\nwikibase:sitelinks ?articles .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr,en,de,it,es,nl\" . }\n}\n# Order by number or articles on Wikimedia sites\nORDER BY DESC(?articles)",
    "complexity": "medium"
  },
  {
    "id": "2116",
    "instruction": "List all female racing car drivers with a Wikipedia page in Spanish.",
    "query": "SELECT DISTINCT ?auto ?auto_pag WHERE {\n?auto wdt:P106 wd:Q10349745 ;\nwdt:P21 wd:Q6581072 .\n?art schema:about ?auto;\nschema:isPartOf <https://es.wikipedia.org/> ;\nschema:name ?auto_pag .\n}\nLIMIT 500",
    "annotated": "PREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT DISTINCT ?auto ?auto_pag WHERE {\n?auto wdt:[property:occupation] wd:[entity:racing automobile driver] ;\nwdt:[property:sex or gender] wd:[entity:female] .\n?art schema:about ?auto;\nschema:isPartOf <https://es.wikipedia.org/> ;\nschema:name ?auto_pag .\n}\nLIMIT 500",
    "complexity": "medium"
  },
  {
    "id": "7",
    "instruction": "List all women born in the UK.",
    "query": "SELECT DISTINCT ?p ?pLabel ?pDescription WHERE {\n?p wdt:P31 wd:Q5;\nwdt:P21 wd:Q6581072;\nwdt:P19 wd:Q145.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} ORDER BY ?pLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?p ?pLabel ?pDescription WHERE {\n?p wdt:[property:instance of] wd:[entity:human];\nwdt:[property:sex or gender] wd:[entity:female];\nwdt:[property:place of birth] wd:[entity:United Kingdom].\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} ORDER BY ?pLabel",
    "complexity": "medium"
  },
  {
    "id": "1323",
    "instruction": "List the names of monarchs who were found guilty of killing a king or queen.",
    "query": "SELECT DISTINCT ?monarch ?monarchLabel WHERE {\n?monarch wdt:P31 wd:Q5;\n(wdt:P106|wdt:P39)/(wdt:P31|wdt:P279)* wd:Q116; # occupation or position held: some kind of monarch\nwdt:P1399 wd:Q1475448. # convicted of: regicide\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?monarch ?monarchLabel WHERE {\n?monarch wdt:[property:instance of] wd:[entity:human];\n(wdt:[property:occupation]|wdt:[property:position held])/(wdt:[property:instance of]|wdt:[property:subclass of])* wd:[entity:monarch]; # occupation or position held: some kind of monarch\nwdt:[property:convicted of] wd:[entity:regicide]. # convicted of: regicide\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "949",
    "instruction": "List cities with a population similar to Antwerp's.",
    "query": "SELECT DISTINCT ?city ?cityLabel ?populatie2 ?coor WHERE {\n<http://www.wikidata.org/entity/Q12892> wdt:P1082 ?populatie .\n?city wdt:P1082 ?populatie2 ;\nwdt:P625 ?coor .\nFILTER (abs(?populatie - ?populatie2) < 1000)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"nl\" }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?city ?cityLabel ?populatie2 ?coor WHERE {\n<http://www.wikidata.org/entity/Q12892> wdt:[property:population] ?populatie .\n?city wdt:[property:population] ?populatie2 ;\nwdt:[property:coordinate location] ?coor .\nFILTER (abs(?populatie - ?populatie2) < 1000)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"nl\" }\n}",
    "complexity": "medium"
  },
  {
    "id": "1378",
    "instruction": "Find artworks with images of people.",
    "query": "SELECT ?oeuvre ?oeuvreLabel ?personne_representee_presumeeLabel ?personne_representee_presumee ?img WHERE {\n?oeuvre p:P180 [ ps:P180 ?personne_representee_presumee ;\npq:P1480 wd:Q18122778 ].\n?personne_representee_presumee wdt:P31 wd:Q5.\n?oeuvre wdt:P18 ?img.\nSERVICE wikibase:label { #BabelRainbow\nbd:serviceParam wikibase:language \"fr,en,ar,be,bg,bn,ca,cs,da,de,el,es,et,fa,fi,he,hi,hu,hy,id,it,ja,jv,ko,nb,nl,eo,pa,pl,pt,ro,ru,sh,sk,sr,sv,sw,te,th,tr,uk,yue,vec,vi,zh\"\n}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?oeuvre ?oeuvreLabel ?personne_representee_presumeeLabel ?personne_representee_presumee ?img WHERE {\n?oeuvre p:[property:image]0 [ ps:[property:image]0 ?personne_representee_presumee ;\npq:[property:sourcing circumstances] wd:[entity:presumably] ].\n?personne_representee_presumee wdt:[property:instance of] wd:[entity:human].\n?oeuvre wdt:[property:image] ?img.\nSERVICE wikibase:label { #BabelRainbow\nbd:serviceParam wikibase:language \"fr,en,ar,be,bg,bn,ca,cs,da,de,el,es,et,fa,fi,he,hi,hu,hy,id,it,ja,jv,ko,nb,nl,eo,pa,pl,pt,ro,ru,sh,sk,sr,sv,sw,te,th,tr,uk,yue,vec,vi,zh\"\n}\n}",
    "complexity": "medium"
  },
  {
    "id": "444",
    "instruction": "List UK doctors with their dates of birth and GMC numbers.",
    "query": "SELECT ?person ?personLabel ?date_of_birth ?GMC WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?person wdt:P27 wd:Q145;\nwdt:P106 wd:Q39631.\nOPTIONAL { ?person wdt:P569 ?date_of_birth. }\nOPTIONAL { ?person wdt:P8273 ?GMC. }\n}\nLIMIT 100",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?person ?personLabel ?date_of_birth ?GMC WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?person wdt:[property:country of citizenship] wd:[entity:United Kingdom];\nwdt:[property:occupation] wd:[entity:physician].\nOPTIONAL { ?person wdt:[property:date of birth] ?date_of_birth. }\nOPTIONAL { ?person wdt:[property:GMC registration number] ?GMC. }\n}\nLIMIT 100",
    "complexity": "medium"
  },
  {
    "id": "1674",
    "instruction": "List all the meteor impact craters with their coordinates.",
    "query": "SELECT DISTINCT ?author ?authorLabel ?coord ?image WHERE {\n?author wdt:P31 wd:Q55818 .\n?author wdt:P625 ?coord\nOPTIONAL {?author wdt:P18 ?image .}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en, de, fr, es, it\" }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?author ?authorLabel ?coord ?image WHERE {\n?author wdt:[property:instance of] wd:[entity:impact crater] .\n?author wdt:[property:coordinate location] ?coord\nOPTIONAL {?author wdt:[property:image] ?image .}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en, de, fr, es, it\" }\n}",
    "complexity": "medium"
  },
  {
    "id": "883",
    "instruction": "List all music composers along with their birthplaces.",
    "query": "SELECT ?item ?itemLabel ?_coordinate_location ?_image WHERE {\n?item wdt:P106 wd:Q36834.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n?item wdt:P19 ?place.\n?place wdt:P625 ?_coordinate_location.\n?item wdt:P18 ?_image.\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?_coordinate_location ?_image WHERE {\n?item wdt:[property:occupation] wd:[entity:composer].\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n?item wdt:[property:place of birth] ?place.\n?place wdt:[property:coordinate location] ?_coordinate_location.\n?item wdt:[property:image] ?_image.\n}",
    "complexity": "medium"
  },
  {
    "id": "985",
    "instruction": "List all the winners of Nobel Prize in Chemistry along with their winning years.",
    "query": "SELECT ?winner ?winnerLabel ?when WHERE {\n?winner ?p ?wds.\n?wds ?v wd:Q44585.\n?wdP wikibase:statementProperty ?v.\n?wdP wikibase:claim ?p.\n?wds pq:P585 ?when .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?winner ?winnerLabel ?when WHERE {\n?winner ?p ?wds.\n?wds ?v wd:[entity:Nobel Prize in Chemistry].\n?wdP wikibase:statementProperty ?v.\n?wdP wikibase:claim ?p.\n?wds pq:[property:point in time] ?when .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "477",
    "instruction": "Find places between the Eiffel Tower and the Louvre Museum.",
    "query": "SELECT ?place ?placeLabel ?location WHERE {\nSERVICE wikibase:box {\n?place wdt:P625 ?location .\nbd:serviceParam wikibase:cornerWest \"Point(2.295 48.8738)\"^^geo:wktLiteral .\nbd:serviceParam wikibase:cornerEast \"Point(2.33575 48.861088888)\"^^geo:wktLiteral .\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?place ?placeLabel ?location WHERE {\nSERVICE wikibase:box {\n?place wdt:[property:coordinate location] ?location .\nbd:serviceParam wikibase:cornerWest \"Point(2.295 48.8738)\"^^geo:wktLiteral .\nbd:serviceParam wikibase:cornerEast \"Point(2.33575 48.861088888)\"^^geo:wktLiteral .\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "2140",
    "instruction": "Find people born in Cook Islands and list them.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?itemDescription ?place ?placeLabel ?sitelinks WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?item wikibase:sitelinks ?sitelinks.\n?item wdt:P19 ?place.\n?place wdt:P131* wd:Q26988.\n}\nORDER BY DESC (?sitelinks)\nLIMIT 200",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?itemDescription ?place ?placeLabel ?sitelinks WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?item wikibase:sitelinks ?sitelinks.\n?item wdt:[property:place of birth] ?place.\n?place wdt:[property:located in the administrative territorial entity]* wd:[entity:Cook Islands].\n}\nORDER BY DESC (?sitelinks)\nLIMIT 200",
    "complexity": "medium"
  },
  {
    "id": "2265",
    "instruction": "Find botanists with their signature images and IPNI author IDs.",
    "query": "select distinct ?item ?itemLabel ?itemDescription ?sig ?ipniid\nwhere {\n?item wdt:P31 wd:Q5 .\n?item wdt:P109 ?sig .\n?item wdt:P106 wd:Q2374149 .\nOPTIONAL {?item wdt:P586 ?ipniid} .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nselect distinct ?item ?itemLabel ?itemDescription ?sig ?ipniid\nwhere {\n?item wdt:[property:instance of] wd:[entity:human] .\n?item wdt:[property:signature] ?sig .\n?item wdt:[property:occupation] wd:[entity:botanist] .\nOPTIONAL {?item wdt:[property:IPNI author ID] ?ipniid} .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "940",
    "instruction": "List all treaties with their corresponding dates.",
    "query": "SELECT DISTINCT ?Treaty ?TreatyLabel ?date WHERE {\n?Treaty (wdt:P31/wdt:P279*) wd:Q131569.\n?Treaty wdt:P585 ?date.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?Treaty ?TreatyLabel ?date WHERE {\n?Treaty (wdt:[property:instance of]/wdt:[property:subclass of]*) wd:[entity:treaty].\n?Treaty wdt:[property:point in time] ?date.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "772",
    "instruction": "List all items with their custom labels and mothers.",
    "query": "SELECT ?item ?customItemLabel ?mother ?motherLabel WHERE {\nVALUES (?item ?customItemLabel) { (wd:Q937 \"Einstein\") (wd:Q1339 \"Bach\") }\nOPTIONAL { ?item wdt:P25 ?mother. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?customItemLabel ?mother ?motherLabel WHERE {\nVALUES (?item ?customItemLabel) { (wd:[entity:Albert Einstein] \"Einstein\") (wd:[entity:Johann Sebastian Bach] \"Bach\") }\nOPTIONAL { ?item wdt:[property:mother] ?mother. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "1205",
    "instruction": "List the names of football players born in places with specific coordinates who participated in the 2018 FIFA World Cup.",
    "query": "SELECT ?itemLabel ?pobLabel ?teamLabel ?coord\nWHERE {\n?item wdt:P1344 wd:Q170645.\n?item wdt:P54 ?team.\n?team wdt:P31 wd:Q6979593.\n?item wdt:P19 ?pob.\n?pob wdt:P625 ?coord.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?itemLabel ?pobLabel ?teamLabel ?coord\nWHERE {\n?item wdt:[property:participant in] wd:[entity:2018 FIFA World Cup].\n?item wdt:[property:member of sports team] ?team.\n?team wdt:[property:instance of] wd:[entity:national association football team].\n?item wdt:[property:place of birth] ?pob.\n?pob wdt:[property:coordinate location] ?coord.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "2380",
    "instruction": "List open access journals with their start times.",
    "query": "SELECT ?journal ?journalLabel ?started\nWHERE {\n?journal wdt:P31 wd:Q773668;\n(wdt:P275/wdt:P31) wd:Q196294.\n?journal p:P31/pq:P580 ?started.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?journal ?journalLabel ?started\nWHERE {\n?journal wdt:[property:instance of] wd:[entity:open-access journal];\n(wdt:[property:copyright license]/wdt:[property:instance of]) wd:[entity:free license].\n?journal p:[property:instance of]/pq:[property:start time] ?started.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "1762",
    "instruction": "Show me a map of bus stops in Biscay.",
    "query": "SELECT ?bus_geltokia ?bus_geltokiaLabel ?koordenatuak WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"eu,es,en\". }\n?bus_geltokia wdt:P31 wd:Q953806.\n?bus_geltokia wdt:P131 wd:Q93366.\n?bus_geltokia wdt:P625 ?koordenatuak.\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?bus_geltokia ?bus_geltokiaLabel ?koordenatuak WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"eu,es,en\". }\n?bus_geltokia wdt:[property:instance of] wd:[entity:bus stop].\n?bus_geltokia wdt:[property:located in the administrative territorial entity] wd:[entity:Biscay].\n?bus_geltokia wdt:[property:coordinate location] ?koordenatuak.\n}",
    "complexity": "medium"
  }
]