[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "1375",
    "instruction": "Find a chain of ten people where each person's surname is the same as another person's given name.",
    "query": "SELECT ?person1Label ?person2Label ?person3Label ?person4Label ?person5Label ?person6Label ?person7Label ?person8Label ?person9Label ?person10Label WITH {\nSELECT * WHERE {\n?person1 wdt:P734/^wdt:P1533/^wdt:P735 ?person2.\n?person2 wdt:P734/^wdt:P1533/^wdt:P735 ?person3.\n?person3 wdt:P734/^wdt:P1533/^wdt:P735 ?person4.\n?person4 wdt:P734/^wdt:P1533/^wdt:P735 ?person5.\n?person5 wdt:P734/^wdt:P1533/^wdt:P735 ?person6.\n?person6 wdt:P734/^wdt:P1533/^wdt:P735 ?person7.\n?person7 wdt:P734/^wdt:P1533/^wdt:P735 ?person8.\n?person8 wdt:P734/^wdt:P1533/^wdt:P735 ?person9.\n?person9 wdt:P734/^wdt:P1533/^wdt:P735 ?person10.\n}\nLIMIT 1\n} AS %persons WHERE {\nINCLUDE %persons.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?person1Label ?person2Label ?person3Label ?person4Label ?person5Label ?person6Label ?person7Label ?person8Label ?person9Label ?person10Label WITH {\nSELECT * WHERE {\n?person1 wdt:[property:family name]/^wdt:[property:family name identical to this given name]/^wdt:[property:given name] ?person2.\n?person2 wdt:[property:family name]/^wdt:[property:family name identical to this given name]/^wdt:[property:given name] ?person3.\n?person3 wdt:[property:family name]/^wdt:[property:family name identical to this given name]/^wdt:[property:given name] ?person4.\n?person4 wdt:[property:family name]/^wdt:[property:family name identical to this given name]/^wdt:[property:given name] ?person5.\n?person5 wdt:[property:family name]/^wdt:[property:family name identical to this given name]/^wdt:[property:given name] ?person6.\n?person6 wdt:[property:family name]/^wdt:[property:family name identical to this given name]/^wdt:[property:given name] ?person7.\n?person7 wdt:[property:family name]/^wdt:[property:family name identical to this given name]/^wdt:[property:given name] ?person8.\n?person8 wdt:[property:family name]/^wdt:[property:family name identical to this given name]/^wdt:[property:given name] ?person9.\n?person9 wdt:[property:family name]/^wdt:[property:family name identical to this given name]/^wdt:[property:given name] ?person10.\n}\nLIMIT 1\n} AS %persons WHERE {\nINCLUDE %persons.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "2023",
    "instruction": "What is the average age of companies listed on major stock market indices?",
    "query": "SELECT ?itemLabel (ROUND(AVG(?age)) AS ?avg)\nWHERE\n{\n?item wdt:P31 wd:Q223371.\n?item wdt:P17 ?country.\n?item wdt:P527 ?components.\n?components wdt:P571 ?founding.\nbind( year(now())-year(?founding) as ?age )\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}\nGROUP BY ?itemLabel\nORDER BY ?avg",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?itemLabel (ROUND(AVG(?age)) AS ?avg)\nWHERE\n{\n?item wdt:[property:instance of] wd:[entity:stock market index].\n?item wdt:[property:country] ?country.\n?item wdt:[property:has part(s)] ?components.\n?components wdt:[property:inception] ?founding.\nbind( year(now())-year(?founding) as ?age )\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}\nGROUP BY ?itemLabel\nORDER BY ?avg",
    "complexity": "complex"
  },
  {
    "id": "1682",
    "instruction": "List all authors who have co-authored papers in the Journal of Cheminformatics.",
    "query": "SELECT\n?author1 ?author1Label ?image1 ?rgb\n?author2 ?author2Label ?image2\nWITH {\nSELECT\n?author1 (SAMPLE(?image1_) AS ?image1)\n?author2 (SAMPLE(?image2_) AS ?image2)\n(SAMPLE(?rgb_) AS ?rgb)\nWHERE {\n?work wdt:P50 ?author1 , ?author2 ;\nwdt:P1433 wd:Q6294930 .\n# Only display co-authorship for certain types of documents\n# Journal and conference articles, books, not (yet?) software\nVALUES ?publication_type { wd:Q13442814 wd:Q571 wd:Q26973022 wd:Q17928402 wd:Q947859 }\nFILTER EXISTS { ?work wdt:P31 ?publication_type . }\n# No self-links.\nFILTER (?author1 != ?author2)\n# Images\nOPTIONAL { ?author1 wdt:P18 ?image1_ }\nOPTIONAL { ?author2 wdt:P18 ?image2_ }\n# Coloring of the nodes\nBIND(\"FFFFFF\" AS ?rgb_)\n}\nGROUP BY ?author1 ?author2\n} AS %result\nWHERE {\nINCLUDE %result\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,da,de,es,fr,jp,sv,ru,zh\".\n}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT\n?author1 ?author1Label ?image1 ?rgb\n?author2 ?author2Label ?image2\nWITH {\nSELECT\n?author1 (SAMPLE(?image1_) AS ?image1)\n?author2 (SAMPLE(?image2_) AS ?image2)\n(SAMPLE(?rgb_) AS ?rgb)\nWHERE {\n?work wdt:[property:author] ?author1 , ?author2 ;\nwdt:[property:published in] wd:[entity:Journal of Cheminformatics] .\n# Only display co-authorship for certain types of documents\n# Journal and conference articles, books, not (yet?) software\nVALUES ?publication_type { wd:[entity:scholarly article] wd:[entity:book] wd:Q26973022 wd:[entity:blog post] wd:[entity:research proposal] }\nFILTER EXISTS { ?work wdt:[property:instance of] ?publication_type . }\n# No self-links.\nFILTER (?author1 != ?author2)\n# Images\nOPTIONAL { ?author1 wdt:[property:image] ?image1_ }\nOPTIONAL { ?author2 wdt:[property:image] ?image2_ }\n# Coloring of the nodes\nBIND(\"FFFFFF\" AS ?rgb_)\n}\nGROUP BY ?author1 ?author2\n} AS %result\nWHERE {\nINCLUDE %result\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,da,de,es,fr,jp,sv,ru,zh\".\n}\n}",
    "complexity": "complex"
  },
  {
    "id": "1052",
    "instruction": "List all national flags that do not contain the colors red, white, or blue.",
    "query": "SELECT ?item ?itemLabel ?image WHERE {\n?item wdt:P31 wd:Q186516 ;\nwdt:P18 ?image ;\nwdt:P1001 ?country .\n?country wdt:P31 wd:Q3624078 .\nFILTER NOT EXISTS { ?country wdt:P31 wd:Q3024240 }\nFILTER NOT EXISTS { ?item wdt:P462/wdt:P279* wd:Q3142 }\nFILTER NOT EXISTS { ?item wdt:P462/wdt:P279* wd:Q23444 }\nFILTER NOT EXISTS { ?item wdt:P462/wdt:P279* wd:Q1088 }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} ORDER BY ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?image WHERE {\n?item wdt:[property:instance of] wd:[entity:national flag] ;\nwdt:[property:image] ?image ;\nwdt:[property:applies to jurisdiction] ?country .\n?country wdt:[property:instance of] wd:[entity:sovereign state] .\nFILTER NOT EXISTS { ?country wdt:[property:instance of] wd:[entity:historical country] }\nFILTER NOT EXISTS { ?item wdt:[property:color]/wdt:[property:subclass of]* wd:[entity:red] }\nFILTER NOT EXISTS { ?item wdt:[property:color]/wdt:[property:subclass of]* wd:[entity:white] }\nFILTER NOT EXISTS { ?item wdt:[property:color]/wdt:[property:subclass of]* wd:[entity:blue] }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} ORDER BY ?itemLabel",
    "complexity": "complex"
  },
  {
    "id": "1198",
    "instruction": "List the number of articles about female scientists on each Wikipedia project.",
    "query": "SELECT ?project ?femaleArticles ?allArticles ?percentFemale\nWITH {\nSELECT ?project (COUNT(DISTINCT ?article) AS ?femaleArticles) WHERE {\n?article schema:isPartOf ?project;\nschema:about ?item.\n?project wikibase:wikiGroup \"wikipedia\".\n?item wdt:P31 wd:Q5;\nwdt:P21/wdt:P279* wd:Q6581072;\nwdt:P106/wdt:P279* wd:Q901.\n}\nGROUP BY ?project\n} AS %femaleArticles\nWITH {\nSELECT ?project (COUNT(DISTINCT ?article) AS ?allArticles) WHERE {\n?article schema:isPartOf ?project;\nschema:about ?item.\n?project wikibase:wikiGroup \"wikipedia\".\n?item wdt:P31 wd:Q5;\nwdt:P106/wdt:P279* wd:Q901.\n}\nGROUP BY ?project\n} AS %allArticles\nWHERE {\nINCLUDE %femaleArticles.\nINCLUDE %allArticles.\nBIND(100*?femaleArticles/?allArticles AS ?percentFemale)\n}\nORDER BY DESC(?femaleArticles)",
    "annotated": "PREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?project ?femaleArticles ?allArticles ?percentFemale\nWITH {\nSELECT ?project (COUNT(DISTINCT ?article) AS ?femaleArticles) WHERE {\n?article schema:isPartOf ?project;\nschema:about ?item.\n?project wikibase:wikiGroup \"wikipedia\".\n?item wdt:[property:instance of] wd:[entity:human];\nwdt:[property:sex or gender]/wdt:[property:subclass of]* wd:[entity:female];\nwdt:[property:occupation]/wdt:[property:subclass of]* wd:[entity:scientist].\n}\nGROUP BY ?project\n} AS %femaleArticles\nWITH {\nSELECT ?project (COUNT(DISTINCT ?article) AS ?allArticles) WHERE {\n?article schema:isPartOf ?project;\nschema:about ?item.\n?project wikibase:wikiGroup \"wikipedia\".\n?item wdt:[property:instance of] wd:[entity:human];\nwdt:[property:occupation]/wdt:[property:subclass of]* wd:[entity:scientist].\n}\nGROUP BY ?project\n} AS %allArticles\nWHERE {\nINCLUDE %femaleArticles.\nINCLUDE %allArticles.\nBIND(100*?femaleArticles/?allArticles AS ?percentFemale)\n}\nORDER BY DESC(?femaleArticles)",
    "complexity": "complex"
  },
  {
    "id": "1816",
    "instruction": "List philosophers with different birth dates in DBpedia and Wikidata.",
    "query": "SELECT DISTINCT ?personDBP ?personWD ?personWDLabel ?BirthDateDBP ?BirthDateWD\nWHERE {\nSERVICE <http://dbpedia.org/sparql> {\n?personDBP a dbo:Philosopher ;\ndbo:birthDate ?BirthDate_DBP;\nowl:sameAs ?personWD .\nFILTER regex (?personWD, \"wikidata.org\")\nBIND (xsd:date(?BirthDate_DBP) AS ?BirthDateDBP)\n}\nSERVICE <https://query.wikidata.org/sparql> {\n?personWD wdt:P569 ?BirthDate_WD .\nBIND (xsd:date(?BirthDate_WD) AS ?BirthDateWD)\n}\nFILTER (?BirthDateDBP != ?BirthDateWD)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?BirthDateDBP)\nLIMIT 50",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX owl: <http://www.w3.org/2002/07/owl#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\nPREFIX dbo: <http://dbpedia.org/ontology/>\n\nSELECT DISTINCT ?personDBP ?personWD ?personWDLabel ?BirthDateDBP ?BirthDateWD\nWHERE {\nSERVICE <http://dbpedia.org/sparql> {\n?personDBP a dbo:Philosopher ;\ndbo:birthDate ?BirthDate_DBP;\nowl:sameAs ?personWD .\nFILTER regex (?personWD, \"wikidata.org\")\nBIND (xsd:date(?BirthDate_DBP) AS ?BirthDateDBP)\n}\nSERVICE <https://query.wikidata.org/sparql> {\n?personWD wdt:[property:date of birth] ?BirthDate_WD .\nBIND (xsd:date(?BirthDate_WD) AS ?BirthDateWD)\n}\nFILTER (?BirthDateDBP != ?BirthDateWD)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?BirthDateDBP)\nLIMIT 50",
    "complexity": "complex"
  },
  {
    "id": "2262",
    "instruction": "Show me a map of the birthplaces of trans women and men with articles on Basque Wikipedia.",
    "query": "SELECT ?gizakiLabel ?koord WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?gizaki wdt:P31 wd:Q5.\n{ ?gizaki wdt:P21 wd:Q1052281. }\nUNION\n{ ?gizaki wdt:P21 wd:Q2449503. }\n?wikilink schema:about ?gizaki;\nschema:isPartOf <https://eu.wikipedia.org/>.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"eu\". }\n?gizaki wdt:P19 ?jaiolekua.\n?jaiolekua wdt:P625 ?koord.\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?gizakiLabel ?koord WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?gizaki wdt:[property:instance of] wd:[entity:human].\n{ ?gizaki wdt:[property:sex or gender] wd:[entity:trans woman]. }\nUNION\n{ ?gizaki wdt:[property:sex or gender] wd:[entity:trans man]. }\n?wikilink schema:about ?gizaki;\nschema:isPartOf <https://eu.wikipedia.org/>.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"eu\". }\n?gizaki wdt:[property:place of birth] ?jaiolekua.\n?jaiolekua wdt:[property:coordinate location] ?koord.\n}",
    "complexity": "complex"
  },
  {
    "id": "2420",
    "instruction": "Find the train stations between Narvik and Singapore.",
    "query": "SELECT ?station ?stationLabel ?cds ?line ?layer WHERE {\n{ SERVICE gas:service {\ngas:program gas:gasClass \"com.bigdata.rdf.graph.analytics.BFS\" ; gas:in wd:Q3097173 ; gas:target wd:Q6132101 ; gas:out ?station ; gas:out1 [] ; gas:out2 ?pred .\ngas:program gas:linkType wdt:P197 . } }\nFILTER(?station != wd:Q3097173)\n?pred p:P625/psv:P625/wikibase:geoLatitude ?lat1 ; p:P625/psv:P625/wikibase:geoLongitude ?lon1 .\n?station p:P625/psv:P625/wikibase:geoLatitude ?lat2 ; p:P625/psv:P625/wikibase:geoLongitude ?lon2 .\nBIND(CONCAT('LINESTRING(', STR(?lon1), ' ', STR(?lat1), ',', STR(?lon2), ' ', STR(?lat2), ')') AS ?str) . BIND(STRDT(?str, geo:wktLiteral) AS ?line)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,th\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\nPREFIX gas: <http://www.bigdata.com/rdf/gas#>\n\nSELECT ?station ?stationLabel ?cds ?line ?layer WHERE {\n{ SERVICE gas:service {\ngas:program gas:gasClass \"com.bigdata.rdf.graph.analytics.BFS\" ; gas:in wd:[entity:Narvik] ; gas:target wd:[entity:Woodlands Train Checkpoint] ; gas:out ?station ; gas:out1 [] ; gas:out2 ?pred .\ngas:program gas:linkType wdt:[property:adjacent station] . } }\nFILTER(?station != wd:[entity:Narvik])\n?pred p:[property:coordinate location]/psv:[property:coordinate location]/wikibase:geoLatitude ?lat1 ; p:[property:coordinate location]/psv:[property:coordinate location]/wikibase:geoLongitude ?lon1 .\n?station p:[property:coordinate location]/psv:[property:coordinate location]/wikibase:geoLatitude ?lat2 ; p:[property:coordinate location]/psv:[property:coordinate location]/wikibase:geoLongitude ?lon2 .\nBIND(CONCAT('LINESTRING(', STR(?lon1), ' ', STR(?lat1), ',', STR(?lon2), ' ', STR(?lat2), ')') AS ?str) . BIND(STRDT(?str, geo:wktLiteral) AS ?line)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,th\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "2801",
    "instruction": "List all European Union member countries with their Alpha-3 codes.",
    "query": "SELECT ?state ?stateLabel ?alpha3 WHERE {\n?state p:P463 ?memberOfStatement.\n?memberOfStatement a wikibase:BestRank;\nps:P463 wd:Q458.\nMINUS { ?memberOfStatement pq:P582 ?endTime. }\n?state wdt:P298 ?alpha3.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?state ?stateLabel ?alpha3 WHERE {\n?state p:[property:member of] ?memberOfStatement.\n?memberOfStatement a wikibase:BestRank;\nps:[property:member of] wd:[entity:European Union].\nMINUS { ?memberOfStatement pq:[property:end time] ?endTime. }\n?state wdt:[property:ISO 3166-1 alpha-3 code] ?alpha3.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "2667",
    "instruction": "List the causes of death for prime ministers.",
    "query": "SELECT (count(?item) as ?count) ?heriotzaLabel WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?lehen_ministro wdt:P279 wd:Q14212.\n?item wdt:P31 wd:Q5.\n?item wdt:P39 ?lehen_ministro.\n?item wdt:P509 ?heriotza\n}\nGROUP by ?heriotzaLabel\nORDER by DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT (count(?item) as ?count) ?heriotzaLabel WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?lehen_ministro wdt:[property:subclass of] wd:[entity:prime minister].\n?item wdt:[property:instance of] wd:[entity:human].\n?item wdt:[property:position held] ?lehen_ministro.\n?item wdt:[property:cause of death] ?heriotza\n}\nGROUP by ?heriotzaLabel\nORDER by DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "2056",
    "instruction": "List all invasive species in the European Union.",
    "query": "SELECT ?taxon ?dutch ?nl ?de ?it ?en ?fr WHERE {\nbind(if(bound(?english), \"+\", \"-\") as ?en )\nbind(if(bound(?french), \"+\", \"-\") as ?fr )\nbind(if(bound(?dutch), \"+\", \"-\") as ?nl )\nbind(if(bound(?german), \"+\", \"-\") as ?de )\nbind(if(bound(?italian), \"+\", \"-\") as ?it )\n{SELECT ?taxon ?dutch ?italian ?english ?french ?german WHERE {\n?taxon wdt:P5588 wd:Q458 .\nOPTIONAL {?english schema:about ?taxon .\nFILTER (regex(str(?english), \"https://en.wikipedia\"))}\nOPTIONAL {?dutch schema:about ?taxon .\nFILTER (regex(str(?dutch), \"https://nl.wikipedia\"))}\nOPTIONAL {?french schema:about ?taxon .\nFILTER (regex(str(?french), \"https://fr.wikipedia\"))}\nOPTIONAL {?german schema:about ?taxon .\nFILTER (regex(str(?german), \"https://de.wikipedia\"))}\nOPTIONAL {?italian schema:about ?taxon .\nFILTER (regex(str(?italian), \"https://it.wikipedia\"))}\n}}}",
    "annotated": "PREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?taxon ?dutch ?nl ?de ?it ?en ?fr WHERE {\nbind(if(bound(?english), \"+\", \"-\") as ?en )\nbind(if(bound(?french), \"+\", \"-\") as ?fr )\nbind(if(bound(?dutch), \"+\", \"-\") as ?nl )\nbind(if(bound(?german), \"+\", \"-\") as ?de )\nbind(if(bound(?italian), \"+\", \"-\") as ?it )\n{SELECT ?taxon ?dutch ?italian ?english ?french ?german WHERE {\n?taxon wdt:[property:invasive to] wd:[entity:European Union] .\nOPTIONAL {?english schema:about ?taxon .\nFILTER (regex(str(?english), \"https://en.wikipedia\"))}\nOPTIONAL {?dutch schema:about ?taxon .\nFILTER (regex(str(?dutch), \"https://nl.wikipedia\"))}\nOPTIONAL {?french schema:about ?taxon .\nFILTER (regex(str(?french), \"https://fr.wikipedia\"))}\nOPTIONAL {?german schema:about ?taxon .\nFILTER (regex(str(?german), \"https://de.wikipedia\"))}\nOPTIONAL {?italian schema:about ?taxon .\nFILTER (regex(str(?italian), \"https://it.wikipedia\"))}\n}}}",
    "complexity": "complex"
  },
  {
    "id": "1828",
    "instruction": "List the milestones for the quantity of Johns on Wikidata.",
    "query": "SELECT (SAMPLE(?date) AS ?date) (SUM(?count) AS ?cumulative_count) ?milestone\n{\n{ SELECT ?qid_rounded (count(?item) AS ?count) WHERE {\n?item wdt:P735 wd:Q4925477 .\nBIND( xsd:integer( substr(str(?item), 33)) as ?qid)\nBIND(xsd:integer(?qid/50000) as ?qid_cut)\nBIND(?qid_cut*50000 as ?qid_rounded)\n}\nGROUP BY ?qid_rounded\n}\nwd:Q38074555 p:P1114 ?milestonep .\n?milestonep ps:P1114 ?milestone .\nFILTER(?milestone > ?qid_rounded) .\n?milestonep pq:P585 ?date .\n}\nGROUP BY ?milestone",
    "annotated": "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT (SAMPLE(?date) AS ?date) (SUM(?count) AS ?cumulative_count) ?milestone\n{\n{ SELECT ?qid_rounded (count(?item) AS ?count) WHERE {\n?item wdt:[property:given name] wd:[entity:John] .\nBIND( xsd:integer( substr(str(?item), 33)) as ?qid)\nBIND(xsd:integer(?qid/50000) as ?qid_cut)\nBIND(?qid_cut*50000 as ?qid_rounded)\n}\nGROUP BY ?qid_rounded\n}\nwd:[entity:QID milestone] p:[property:quantity] ?milestonep .\n?milestonep ps:[property:quantity] ?milestone .\nFILTER(?milestone > ?qid_rounded) .\n?milestonep pq:[property:point in time] ?date .\n}\nGROUP BY ?milestone",
    "complexity": "complex"
  },
  {
    "id": "2593",
    "instruction": "List all Wikimedia affiliates with their social media profiles.",
    "query": "SELECT ?item ?itemLabel ?propertyLabel (IRI(CONCAT(SUBSTR(?formatter,1,STRLEN(?formatter)-2), ?value)) AS ?URL) WHERE {\nVALUES ?wm { wd:Q22337472 wd:Q15924535 wd:Q24524653 }\n?item wdt:P31 ?wm .\n?property wdt:P31 wd:Q105388954;\nwikibase:directClaim ?wdt;\nwdt:P1630 ?formatter .\n?item ?wdt ?value .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n} ORDER BY ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?propertyLabel (IRI(CONCAT(SUBSTR(?formatter,1,STRLEN(?formatter)-2), ?value)) AS ?URL) WHERE {\nVALUES ?wm { wd:[entity:Wikimedia user group] wd:[entity:Wikimedia chapter] wd:[entity:Wikimedia thematic organization] }\n?item wdt:[property:instance of] ?wm .\n?property wdt:[property:instance of] wd:[entity:Wikidata property to identify online accounts];\nwikibase:directClaim ?wdt;\nwdt:[property:formatter URL] ?formatter .\n?item ?wdt ?value .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n} ORDER BY ?itemLabel",
    "complexity": "complex"
  },
  {
    "id": "1679",
    "instruction": "Show me the communes in Ille-et-Vilaine that share borders with each other.",
    "query": "SELECT * WHERE {\n?comm1 wdt:P31 wd:Q484170 ; wdt:P131 wd:Q12549 ; wdt:P625 ?coord1 ; wdt:P47 ?comm2.\nMINUS { ?comm1 p:P31 [ ps:P31 wd:Q484170 ; pq:P582 [] ] . }\nMINUS { ?comm2 p:P31 [ ps:P31 wd:Q484170 ; pq:P582 [] ] . }\n?comm2 wdt:P625 ?coord2 .\n?comm1 p:P625 [ ps:P625 []; psv:P625 [ wikibase:geoLongitude ?coord1lon; wikibase:geoLatitude ?coord1lat; ] ].\n?comm2 p:P625 [ ps:P625 []; psv:P625 [ wikibase:geoLongitude ?coord2lon; wikibase:geoLatitude ?coord2lat; ] ].\nBIND(CONCAT('LINESTRING (', STR(?coord1lon), ' ', STR(?coord1lat), ',', STR(?coord2lon), ' ', STR(?coord2lat), ')') AS ?str) .\nBIND(STRDT(?str, geo:wktLiteral) AS ?line)\n}",
    "annotated": "PREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT * WHERE {\n?comm1 wdt:[property:instance of] wd:[entity:commune of France] ; wdt:[property:located in the administrative territorial entity] wd:[entity:Ille-et-Vilaine] ; wdt:[property:coordinate location] ?coord1 ; wdt:[property:shares border with] ?comm2.\nMINUS { ?comm1 p:[property:instance of] [ ps:[property:instance of] wd:[entity:commune of France] ; pq:[property:end time] [] ] . }\nMINUS { ?comm2 p:[property:instance of] [ ps:[property:instance of] wd:[entity:commune of France] ; pq:[property:end time] [] ] . }\n?comm2 wdt:[property:coordinate location] ?coord2 .\n?comm1 p:[property:coordinate location] [ ps:[property:coordinate location] []; psv:[property:coordinate location] [ wikibase:geoLongitude ?coord1lon; wikibase:geoLatitude ?coord1lat; ] ].\n?comm2 p:[property:coordinate location] [ ps:[property:coordinate location] []; psv:[property:coordinate location] [ wikibase:geoLongitude ?coord2lon; wikibase:geoLatitude ?coord2lat; ] ].\nBIND(CONCAT('LINESTRING (', STR(?coord1lon), ' ', STR(?coord1lat), ',', STR(?coord2lon), ' ', STR(?coord2lat), ')') AS ?str) .\nBIND(STRDT(?str, geo:wktLiteral) AS ?line)\n}",
    "complexity": "complex"
  },
  {
    "id": "2487",
    "instruction": "What percentage of action films pass the Bechdel test?",
    "query": "SELECT ?genreLabel (COUNT(DISTINCT ?item)/ ?item_count AS ?share) (xsd:string(?item_count) AS ?number_of_films_with_test_data)\nWITH {\nSELECT ?genre ?item ?bechdel_result WHERE{\nVALUES ?genre {wd:Q1762165\nwd:Q21802675\nwd:Q40831\nwd:Q5937792\nwd:Q21010853\nwd:Q132311\nwd:Q1196408\nwd:Q16575965\nwd:Q842256\nwd:Q6585139\nwd:Q19765983\nwd:Q24925\nwd:Q182015\nwd:Q111956902\nwd:Q21590660}\n?st ps:P5021 wd:Q4165246; pq:P9259 ?bechdel_result.\n?item p:P5021 ?st; wdt:P136/wdt:P279* ?genre; wdt:P31/wdt:P279* wd:Q11424\n}\n} AS %bechdel_by_genre\nWITH {\nSELECT ?genre (COUNT(DISTINCT ?item) AS ?item_count) WHERE{\nINCLUDE %bechdel_by_genre\n}\nGROUP BY ?genre\n} AS %item_count_by_genre\nWHERE {\nINCLUDE %bechdel_by_genre\nINCLUDE %item_count_by_genre\nFILTER(?bechdel_result IN (wd:Q105773168))\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?genreLabel ?item_count",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?genreLabel (COUNT(DISTINCT ?item)/ ?item_count AS ?share) (xsd:string(?item_count) AS ?number_of_films_with_test_data)\nWITH {\nSELECT ?genre ?item ?bechdel_result WHERE{\nVALUES ?genre {wd:[entity:action fiction]\nwd:[entity:adventure fiction]\nwd:[entity:comedy]\nwd:[entity:crime fiction]\nwd:[entity:drama fiction]\nwd:[entity:fantasy]\nwd:[entity:historical fiction]\nwd:[entity:horror fiction]\nwd:[entity:musical film]\nwd:[entity:mystery fiction]\nwd:[entity:romantic fiction]\nwd:[entity:science fiction]\nwd:[entity:thriller]\nwd:[entity:war fiction]\nwd:[entity:Western]}\n?st ps:[property:assessment] wd:[entity:Bechdel test]; pq:[property:assessment outcome] ?bechdel_result.\n?item p:[property:assessment] ?st; wdt:[property:genre]/wdt:[property:subclass of]* ?genre; wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:film]\n}\n} AS %bechdel_by_genre\nWITH {\nSELECT ?genre (COUNT(DISTINCT ?item) AS ?item_count) WHERE{\nINCLUDE %bechdel_by_genre\n}\nGROUP BY ?genre\n} AS %item_count_by_genre\nWHERE {\nINCLUDE %bechdel_by_genre\nINCLUDE %item_count_by_genre\nFILTER(?bechdel_result IN (wd:[entity:passes]))\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?genreLabel ?item_count",
    "complexity": "complex"
  },
  {
    "id": "1061",
    "instruction": "List playwrights who died in 1947 and are now in the public domain.",
    "query": "SELECT ?item ?itemLabel ?dateOfDeath (COUNT(DISTINCT ?sitelink) AS ?sites) WHERE {\n?item wdt:P31 wd:Q5.\n?item (wdt:P106/wdt:P279*) wd:Q214917.\n?item wdt:P570 ?dateOfDeath.\n?sitelink schema:about ?item.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\nFILTER((?dateOfDeath >= \"1947-01-01T00:00:00\"^^xsd:dateTime) && (?dateOfDeath <= \"1947-12-31T23:59:59\"^^xsd:dateTime))\n}\nGROUP BY ?item ?itemLabel ?dateOfDeath\nORDER BY DESC(?sites)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?dateOfDeath (COUNT(DISTINCT ?sitelink) AS ?sites) WHERE {\n?item wdt:[property:instance of] wd:[entity:human].\n?item (wdt:[property:occupation]/wdt:[property:subclass of]*) wd:[entity:playwright].\n?item wdt:[property:date of death] ?dateOfDeath.\n?sitelink schema:about ?item.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\nFILTER((?dateOfDeath >= \"1947-01-01T00:00:00\"^^xsd:dateTime) && (?dateOfDeath <= \"1947-12-31T23:59:59\"^^xsd:dateTime))\n}\nGROUP BY ?item ?itemLabel ?dateOfDeath\nORDER BY DESC(?sites)",
    "complexity": "complex"
  },
  {
    "id": "2529",
    "instruction": "List all water boards in the Netherlands that are currently active.",
    "query": "SELECT ?item ?itemLabel WHERE {\n?item wdt:P31 wd:Q702081 .\nMINUS { ?item wdt:P576 [] }\nMINUS { ?item wdt:P1366 [] }\nMINUS {\n?item p:P31 ?inStatement .\n?inStatement pq:P582 [] .\nMINUS { ?item p:P31 ?p.\n?p ps:P31 wd:Q702081; pq:P580 ?start .\nFILTER NOT EXISTS { ?p pq:P582 []}\n}\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"nl,en\". }\n} ORDER BY ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel WHERE {\n?item wdt:[property:instance of] wd:[entity:water board in the Netherlands] .\nMINUS { ?item wdt:[property:dissolved, abolished or demolished date] [] }\nMINUS { ?item wdt:[property:replaced by] [] }\nMINUS {\n?item p:[property:instance of] ?inStatement .\n?inStatement pq:[property:end time] [] .\nMINUS { ?item p:[property:instance of] ?p.\n?p ps:[property:instance of] wd:[entity:water board in the Netherlands]; pq:[property:start time] ?start .\nFILTER NOT EXISTS { ?p pq:[property:end time] []}\n}\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"nl,en\". }\n} ORDER BY ?itemLabel",
    "complexity": "complex"
  }
]