[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "1397",
    "instruction": "List all albums by Manu Chao and Mano Negra, including their release dates.",
    "query": "SELECT ?album ?performerLabel ?albumLabel ?publication_date WHERE {\nVALUES ?performer {\nwd:Q936474\nwd:Q207898\n}\n?album wdt:P175 ?performer ;\nwdt:P577 ?publication_date .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?album ?performerLabel ?albumLabel ?publication_date WHERE {\nVALUES ?performer {\nwd:[entity:Mano Negra]\nwd:[entity:Manu Chao]\n}\n?album wdt:[property:performer] ?performer ;\nwdt:[property:publication date] ?publication_date .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "2257",
    "instruction": "Find pictures of female programmers.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?itemDescription ?img WHERE {\n?item wdt:P31 wd:Q5;\nwdt:P21 wd:Q6581072 .\n?item wdt:P106/wdt:P279* wd:Q5482740.\n?item wdt:P18 ?img.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"es,en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?itemDescription ?img WHERE {\n?item wdt:[property:instance of] wd:[entity:human];\nwdt:[property:sex or gender] wd:[entity:female] .\n?item wdt:[property:occupation]/wdt:[property:subclass of]* wd:[entity:human]482740.\n?item wdt:[property:image] ?img.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"es,en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "2411",
    "instruction": "List all current and former members of the Czech Chamber of Deputies who have a family relationship.",
    "query": "select ?item1 ?item1Label ?item2 ?item2Label where {\n?item1 wdt:P39 wd:Q19803234 .\n?item2 wdt:P39 wd:Q19803234 .\n?item1 wdt:P1038| wdt:P3373|wdt:P22|wdt:P25|wdt:P40|wdt:P26 ?item2 .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"cs,en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nselect ?item1 ?item1Label ?item2 ?item2Label where {\n?item1 wdt:[property:position held] wd:[entity:Member of the Chamber of Deputies of the Parliament of the Czech Republic] .\n?item2 wdt:[property:position held] wd:[entity:Member of the Chamber of Deputies of the Parliament of the Czech Republic] .\n?item1 wdt:[property:relative]| wdt:[property:sibling]|wdt:[property:father]|wdt:[property:mother]|wdt:[property:child]|wdt:[property:spouse] ?item2 .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"cs,en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "576",
    "instruction": "List all city gates located in Zeeland, Netherlands.",
    "query": "SELECT ?town ?townLabel ?gate ?gateLabel where {\n# Municipalities within the province\n?muni wdt:P31 wd:Q2039348;\nwdt:P131 wd:Q705.\n# Instances of city gate located within any of the municipalities\n?gate wdt:P31 wd:Q82117;\nwdt:P131 ?muni;\n# The Location (usually Town) that the gate is in\nwdt:P276 ?town.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"nl\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?town ?townLabel ?gate ?gateLabel where {\n# Municipalities within the province\n?muni wdt:[property:instance of] wd:[entity:municipality of the Netherlands];\nwdt:[property:located in the administrative territorial entity] wd:[entity:Zeeland].\n# Instances of city gate located within any of the municipalities\n?gate wdt:[property:instance of] wd:[entity:city gate];\nwdt:[property:located in the administrative territorial entity] ?muni;\n# The Location (usually Town) that the gate is in\nwdt:[property:location] ?town.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"nl\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "2710",
    "instruction": "List open-source software projects funded by the Chan Zuckerberg Initiative.",
    "query": "SELECT ?item ?itemLabel ?sitelinks WHERE {\n?item p:P8324 [ ps:P8324 wd:Q21623039 ;\npq:P6195 wd:Q113788223 ] .\n?item wikibase:sitelinks ?sitelinks .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?sitelinks)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?sitelinks WHERE {\n?item p:[property:funder] [ ps:[property:funder] wd:[entity:Chan Zuckerberg Initiative] ;\npq:[property:funding scheme] wd:Q113788223 ] .\n?item wikibase:sitelinks ?sitelinks .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?sitelinks)",
    "complexity": "medium"
  },
  {
    "id": "1671",
    "instruction": "Show me a list of synagogues in the Czech Republic along with their coordinates.",
    "query": "SELECT DISTINCT ?synagoga ?synagogaLabel ?coor ?kategorie_na_Commons ?obr WHERE {\n?synagoga wdt:P31 wd:Q34627;\n?range wd:Q213;\nwdt:P625 ?coor.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"cs\". }\nOPTIONAL { ?synagoga wdt:P373 ?kategorie_na_Commons. }\nOPTIONAL { ?synagoga wdt:P18 ?obr. }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?synagoga ?synagogaLabel ?coor ?kategorie_na_Commons ?obr WHERE {\n?synagoga wdt:[property:instance of] wd:[entity:synagogue];\n?range wd:[entity:Czech Republic];\nwdt:[property:coordinate location] ?coor.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"cs\". }\nOPTIONAL { ?synagoga wdt:[property:Commons category] ?kategorie_na_Commons. }\nOPTIONAL { ?synagoga wdt:[property:image] ?obr. }\n}",
    "complexity": "medium"
  },
  {
    "id": "159",
    "instruction": "What are the parent taxa of Balaenoptera musculus?",
    "query": "SELECT ?item ?itemLabel ?classLabel\nWHERE\n{\nwd:Q42196 wdt:P171* ?item .\n?item wdt:P105 ?class\nSERVICE wikibase:label {bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?classLabel\nWHERE\n{\nwd:[entity:Balaenoptera musculus] wdt:[property:parent taxon]* ?item .\n?item wdt:[property:taxon rank] ?class\nSERVICE wikibase:label {bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}",
    "complexity": "medium"
  },
  {
    "id": "1428",
    "instruction": "Show me the locations where artifacts in Mus\u00e9e Saint-Raymond were discovered.",
    "query": "SELECT ?item ?itemLabel ?coord WHERE {\n?item wdt:P195 wd:Q1376 ; wdt:P189/wdt:P625 ?coord .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?coord WHERE {\n?item wdt:[property:collection] wd:[entity:Mus\u00e9e Saint-Raymond] ; wdt:[property:location of discovery]/wdt:[property:coordinate location] ?coord .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "161",
    "instruction": "List all bird species with their eBird identifier and Wikipedia article count.",
    "query": "SELECT ?wd ?wdLabel ?ebird_id (COUNT(?sitelink) AS ?sites) WHERE {\n?wd wdt:P3444 ?ebird_id.\nOPTIONAL {?sitelink schema:about ?wd FILTER(CONTAINS(str(?link), \".wikipedia.org/\"))}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} GROUP BY ?wd ?wdLabel ?ebird_id",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?wd ?wdLabel ?ebird_id (COUNT(?sitelink) AS ?sites) WHERE {\n?wd wdt:[property:eBird taxon ID] ?ebird_id.\nOPTIONAL {?sitelink schema:about ?wd FILTER(CONTAINS(str(?link), \".wikipedia.org/\"))}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} GROUP BY ?wd ?wdLabel ?ebird_id",
    "complexity": "medium"
  },
  {
    "id": "468",
    "instruction": "List the languages with their corresponding number of items that have a BBC 'Your paintings' artist identifier.",
    "query": "SELECT ?lang (COUNT(DISTINCT ?item) AS ?count) WHERE {\n?item wdt:P1367 ?yp_id . # BBC 'Your paintings' artist identifier\n?article schema:about ?item .\nFILTER (SUBSTR(str(?article), 11, 15) = \".wikipedia.org/\") .\n?article schema:inLanguage ?lang .\n} GROUP BY ?lang\nORDER BY DESC (?count)",
    "annotated": "PREFIX schema: <http://schema.org/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?lang (COUNT(DISTINCT ?item) AS ?count) WHERE {\n?item wdt:[property:Art UK artist ID] ?yp_id . # BBC 'Your paintings' artist identifier\n?article schema:about ?item .\nFILTER (SUBSTR(str(?article), 11, 15) = \".wikipedia.org/\") .\n?article schema:inLanguage ?lang .\n} GROUP BY ?lang\nORDER BY DESC (?count)",
    "complexity": "medium"
  },
  {
    "id": "197",
    "instruction": "List all plant genera depicted in Flora Graeca.",
    "query": "SELECT ?genus ?genusname (COUNT(?art) as ?count) WHERE {\n?art wdt:P1433 wd:Q5460305. # Artwork published in FG\n?art wdt:P180 ?species. # Artwork depicts species\n?species wdt:P171 ?genus. # parent taxon of species\n?genus wdt:P225 ?genusname. # taxon name of genus\n} GROUP BY ?genus ?genusname\nORDER BY ?genusname",
    "annotated": "PREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?genus ?genusname (COUNT(?art) as ?count) WHERE {\n?art wdt:[property:published in] wd:[entity:Flora Graeca]. # Artwork published in FG\n?art wdt:[property:depicts] ?species. # Artwork depicts species\n?species wdt:[property:parent taxon] ?genus. # parent taxon of species\n?genus wdt:[property:taxon name] ?genusname. # taxon name of genus\n} GROUP BY ?genus ?genusname\nORDER BY ?genusname",
    "complexity": "medium"
  },
  {
    "id": "1210",
    "instruction": "List all serial killers along with their birth dates and images.",
    "query": "SELECT distinct ?birthdate ?thumbnail ?author ?authorLabel WHERE {\n?author wdt:P106 wd:Q484188 ;\nwdt:P570 ?birthdate\nOPTIONAL { ?author wdt:P18 ?thumbnail . }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en, fr, de\" }\n}\nORDER BY ?birthdate",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT distinct ?birthdate ?thumbnail ?author ?authorLabel WHERE {\n?author wdt:[property:occupation] wd:[entity:serial killer] ;\nwdt:[property:date of death] ?birthdate\nOPTIONAL { ?author wdt:[property:image] ?thumbnail . }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en, fr, de\" }\n}\nORDER BY ?birthdate",
    "complexity": "medium"
  },
  {
    "id": "2446",
    "instruction": "List all football players born in Crewe who play for Crewe Alexandra F.C.",
    "query": "SELECT ?item ?itemLabel ?itemDescription ?image WHERE {\n?item wdt:P19 wd:Q648810 .\n?item wdt:P106 wd:Q937857 .\n?item wdt:P54 wd:Q19587 .\n?item wdt:P18 ?image\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?itemDescription ?image WHERE {\n?item wdt:[property:place of birth] wd:[entity:Crewe] .\n?item wdt:[property:occupation] wd:[entity:association football player] .\n?item wdt:[property:member of sports team] wd:[entity:Crewe Alexandra F.C.] .\n?item wdt:[property:image] ?image\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "2508",
    "instruction": "List different ways people celebrate New Year's around the world.",
    "query": "SELECT ?New_Year ?New_YearLabel (SAMPLE(?image) as ?img) WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"id,en\". }\n?New_Year wdt:P279/wdt:P279* wd:Q34812.\nOPTIONAL { ?New_Year wdt:P18 ?image. }\n}\nGROUP BY ?New_Year ?New_YearLabel\n#defaultView:ImageGrid",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?New_Year ?New_YearLabel (SAMPLE(?image) as ?img) WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"id,en\". }\n?New_Year wdt:[property:subclass of]/wdt:[property:subclass of]* wd:[entity:New Year].\nOPTIONAL { ?New_Year wdt:[property:image] ?image. }\n}\nGROUP BY ?New_Year ?New_YearLabel\n#defaultView:ImageGrid",
    "complexity": "medium"
  },
  {
    "id": "417",
    "instruction": "List all individuals with the surname Badger and first name starting with E.",
    "query": "SELECT ?item ?itemLabel WHERE {\n?item wdt:P31 wd:Q5 .\n?item wdt:P734 wd:Q16479693 . # Family name Badger\n?item wdt:P735 ?name .\n?name rdfs:label ?nameLabel .\nFILTER (LANG(?nameLabel) = \"en\")\nFILTER (STRSTARTS(?nameLabel, \"E\")) # First initial\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel WHERE {\n?item wdt:[property:instance of] wd:[entity:human] .\n?item wdt:[property:family name] wd:[entity:Badger] . # Family name Badger\n?item wdt:[property:given name] ?name .\n?name rdfs:label ?nameLabel .\nFILTER (LANG(?nameLabel) = \"en\")\nFILTER (STRSTARTS(?nameLabel, \"E\")) # First initial\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "1194",
    "instruction": "List all video game authors along with their publication dates and images.",
    "query": "SELECT DISTINCT ?author ?authorLabel ?image ?date WHERE {\n?author wdt:P31 wd:Q7889 .\n?author wdt:P577 ?date .\n?author wdt:P18 ?image .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en, de, fr, es, it, cz\" }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?author ?authorLabel ?image ?date WHERE {\n?author wdt:[property:instance of] wd:[entity:video game] .\n?author wdt:[property:publication date] ?date .\n?author wdt:[property:image] ?image .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en, de, fr, es, it, cz\" }\n}",
    "complexity": "medium"
  },
  {
    "id": "1405",
    "instruction": "List software applications that can read the most file formats.",
    "query": "SELECT ?app ?appLabel (COUNT(?format) AS ?count) WHERE {\n?app wdt:P1072 ?format.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?app ?appLabel\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?app ?appLabel (COUNT(?format) AS ?count) WHERE {\n?app wdt:[property:readable file format] ?format.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?app ?appLabel\nORDER BY DESC(?count)",
    "complexity": "medium"
  },
  {
    "id": "113",
    "instruction": "List people with excellent articles in Spanish Wikipedia but lacking badges on their English Wikipedia pages.",
    "query": "SELECT ?item ?itemLabel ?itemDescription ?enwp ?eswp WHERE {\n?item wdt:P31 wd:Q5 . # Human beings\n?eswp schema:isPartOf <https://es.wikipedia.org/>; # Spanish article exists\nschema:about ?item;\nwikibase:badge wd:Q17437798 . # Spanish article has Good Article badge\n?enwp schema:isPartOf <https://en.wikipedia.org/>; # English article exists\nschema:about ?item.\nMINUS {?enwp wikibase:badge []} # English article lacks any kind of badge\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,es\" }\n} ORDER BY ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?itemDescription ?enwp ?eswp WHERE {\n?item wdt:[property:instance of] wd:[entity:human] . # Human beings\n?eswp schema:isPartOf <https://es.wikipedia.org/>; # Spanish article exists\nschema:about ?item;\nwikibase:badge wd:[entity:good article badge] . # Spanish article has Good Article badge\n?enwp schema:isPartOf <https://en.wikipedia.org/>; # English article exists\nschema:about ?item.\nMINUS {?enwp wikibase:badge []} # English article lacks any kind of badge\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,es\" }\n} ORDER BY ?itemLabel",
    "complexity": "medium"
  },
  {
    "id": "753",
    "instruction": "Get a list of humans born in 2015 by filtering the results with the year of birth.",
    "query": "SELECT ?item ?itemLabel ?bblid\nWHERE {\n?item wdt:P2580 ?bblid .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\nFILTER(!REGEX(STR(?bblid), \"[\\\\.q]\"))\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?bblid\nWHERE {\n?item wdt:[property:P2580] ?bblid .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\nFILTER(!REGEX(STR(?bblid), \"[\\\\.q]\"))\n}",
    "complexity": "medium"
  },
  {
    "id": "1860",
    "instruction": "What are the top infectious diseases with the highest number of cases?",
    "query": "SELECT ?diseaseLabel (MAX(?cases) AS ?numOfCases)\nWHERE {\n?disease wdt:P31/wdt:P279* wd:Q18123741 . # infectious disease\n?disease wdt:P1603 ?cases . # number of cases\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} GROUP BY ?diseaseLabel ORDER BY DESC(?numOfCases)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?diseaseLabel (MAX(?cases) AS ?numOfCases)\nWHERE {\n?disease wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:infectious disease] . # infectious disease\n?disease wdt:[property:number of cases] ?cases . # number of cases\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} GROUP BY ?diseaseLabel ORDER BY DESC(?numOfCases)",
    "complexity": "medium"
  },
  {
    "id": "142",
    "instruction": "Find Mastodon accounts with their corresponding Twitter usernames.",
    "query": "SELECT ?twit ?item ?itemLabel ?itemDescription ?id WHERE {\n?item wdt:P4033 ?id.\nOPTIONAL {?item wdt:P2002 ?twit}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?twit ?item ?itemLabel ?itemDescription ?id WHERE {\n?item wdt:[property:Mastodon address] ?id.\nOPTIONAL {?item wdt:[property:Twitter (X) username] ?twit}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY ?itemLabel",
    "complexity": "medium"
  },
  {
    "id": "2466",
    "instruction": "List all German cities whose names are also verbs.",
    "query": "SELECT * WHERE {\n?place wdt:P31 wd:Q42744322 ; # German municipalities\nwdt:P1448 ?name . # their official names\nBIND(lcase(?name) as ?lemma) # use the names in lower case as lemma\n?lexeme wikibase:lemma ?lemma ; # lexemes with that lemma\nwikibase:lexicalCategory wd:Q24905; # verbs\ndct:language wd:Q188 # in German\n}",
    "annotated": "PREFIX dct: <http://purl.org/dc/terms/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT * WHERE {\n?place wdt:[property:instance of] wd:[entity:urban municipality in Germany] ; # German municipalities\nwdt:[property:official name] ?name . # their official names\nBIND(lcase(?name) as ?lemma) # use the names in lower case as lemma\n?lexeme wikibase:lemma ?lemma ; # lexemes with that lemma\nwikibase:lexicalCategory wd:[entity:verb]; # verbs\ndct:language wd:[entity:German] # in German\n}",
    "complexity": "medium"
  },
  {
    "id": "714",
    "instruction": "Find the connection between Terrell Buckley and Miami Dolphins.",
    "query": "SELECT ?l\nWHERE {\nwd:Q5571382 ?p wd:Q223243 .\n?property ?ref ?p .\n?property rdf:type wikibase:Property .\n?property rdfs:label ?l FILTER (lang(?l) = \"en\")\n}",
    "annotated": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?l\nWHERE {\nwd:[entity:Terrell Buckley] ?p wd:[entity:Miami Dolphins] .\n?property ?ref ?p .\n?property rdf:type wikibase:Property .\n?property rdfs:label ?l FILTER (lang(?l) = \"en\")\n}",
    "complexity": "medium"
  },
  {
    "id": "1149",
    "instruction": "List all musicians from Cameroon along with their birthplaces.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?image ?placeofbirth ?coord ?gender ?dob\nWHERE {\n?item wdt:P27 wd:Q1009.\n?item wdt:P31 wd:Q5.\n?item wdt:P106/wdt:P279* wd:Q177220.\n?item wdt:P106/wdt:P279* wd:Q753110.\n?item wdt:P106/wdt:P279* wd:Q639669.\nOPTIONAL {?item wdt:P19 ?placeofbirth.\n?placeofbirth wdt:P625 ?coord. }\nOPTIONAL {?item wdt:P18 ?image.}\nOPTIONAL {?item wdt:P569 ?dob.}\nOPTIONAL {?item wdt:P21 ?gender.}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\n#defaultView:Map",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?image ?placeofbirth ?coord ?gender ?dob\nWHERE {\n?item wdt:[property:country of citizenship] wd:[entity:Cameroon].\n?item wdt:[property:instance of] wd:[entity:human].\n?item wdt:[property:occupation]/wdt:[property:country of citizenship]9* wd:[entity:singer].\n?item wdt:[property:occupation]/wdt:[property:country of citizenship]9* wd:[entity:songwriter].\n?item wdt:[property:occupation]/wdt:[property:country of citizenship]9* wd:[entity:musician].\nOPTIONAL {?item wdt:[property:place of birth] ?placeofbirth.\n?placeofbirth wdt:[property:coordinate location] ?coord. }\nOPTIONAL {?item wdt:[property:image] ?image.}\nOPTIONAL {?item wdt:[property:date of birth] ?dob.}\nOPTIONAL {?item wdt:[property:sex or gender] ?gender.}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\n#defaultView:Map",
    "complexity": "medium"
  },
  {
    "id": "1759",
    "instruction": "What languages are used to describe objects connected to Ksamsok?",
    "query": "SELECT ?lang (count(?item) as ?nr)\nWHERE\n{\n?item wdt:P1260 ?KsamURI.\n?item schema:description ?itemDescription\nBIND (lang(?itemDescription) AS ?lang)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"sv\"}\n} group by ?lang",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?lang (count(?item) as ?nr)\nWHERE\n{\n?item wdt:[property:Swedish Open Cultural Heritage URI] ?KsamURI.\n?item schema:description ?itemDescription\nBIND (lang(?itemDescription) AS ?lang)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"sv\"}\n} group by ?lang",
    "complexity": "medium"
  },
  {
    "id": "1599",
    "instruction": "List the days of the week with their corresponding number of songs named after them.",
    "query": "SELECT ?day ?dayLabel (COUNT(DISTINCT ?item) AS ?songCount) WHERE {\n?day wdt:P31 wd:Q41825.\n?item wdt:P31/wdt:P279* wd:Q7366; wdt:P138 ?day.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?day ?dayLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?day ?dayLabel (COUNT(DISTINCT ?item) AS ?songCount) WHERE {\n?day wdt:[property:instance of] wd:[entity:day of the week].\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:song]; wdt:[property:named after] ?day.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?day ?dayLabel",
    "complexity": "medium"
  },
  {
    "id": "1343",
    "instruction": "List the movies featuring transgender actors playing transgender characters.",
    "query": "SELECT ?work ?workLabel ?actor ?actorLabel ?char ?charLabel WHERE {\n?work p:P161 ?distribution .\n?distribution ps:P161 ?actor .\n?distribution pq:P453 ?char .\n?actor wdt:P21 ?actor_gender .\n?char wdt:P21 ?char_gender .\nFILTER(?actor_gender IN (wd:Q1052281, wd:Q2449503)) .\nFILTER(?char_gender IN (wd:Q1052281, wd:Q2449503)) .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} LIMIT 100",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?work ?workLabel ?actor ?actorLabel ?char ?charLabel WHERE {\n?work p:[property:cast member] ?distribution .\n?distribution ps:[property:cast member] ?actor .\n?distribution pq:[property:character role] ?char .\n?actor wdt:[property:sex or gender] ?actor_gender .\n?char wdt:[property:sex or gender] ?char_gender .\nFILTER(?actor_gender IN (wd:[entity:trans woman], wd:[entity:trans man])) .\nFILTER(?char_gender IN (wd:[entity:trans woman], wd:[entity:trans man])) .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} LIMIT 100",
    "complexity": "medium"
  },
  {
    "id": "1969",
    "instruction": "List all former football players who have held a position in the UK parliament.",
    "query": "SELECT DIStiNCT ?item ?itemLabel WHERE {\n?item wdt:P39/wdt:P279* wd:Q16707842; wdt:P106 wd:Q937857 .\nOPTIONAL { ?item wdt:P569 ?dob }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?dob)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DIStiNCT ?item ?itemLabel WHERE {\n?item wdt:[property:position held]/wdt:[property:subclass of]* wd:[entity:Member of Parliament]; wdt:[property:occupation] wd:[entity:association football player] .\nOPTIONAL { ?item wdt:[property:date of birth] ?dob }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?dob)",
    "complexity": "medium"
  },
  {
    "id": "1799",
    "instruction": "List lakes named after a married couple.",
    "query": "SELECT * WHERE {\n?lac1 wdt:P138 ?person1 ; wdt:P131 ?loc ; wdt:P31 wd:Q23397 .\n?lac2 wdt:P138 ?person2 ; wdt:P131 ?loc ; wdt:P31 wd:Q23397 .\n?person1 wdt:P26 ?person2 .\nFILTER ( str(?lac1) > str(?lac2) )\n}\nLIMIT 10",
    "annotated": "PREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT * WHERE {\n?lac1 wdt:[property:named after] ?person1 ; wdt:[property:located in the administrative territorial entity] ?loc ; wdt:[property:instance of] wd:[entity:lake] .\n?lac2 wdt:[property:named after] ?person2 ; wdt:[property:located in the administrative territorial entity] ?loc ; wdt:[property:instance of] wd:[entity:lake] .\n?person1 wdt:[property:spouse] ?person2 .\nFILTER ( str(?lac1) > str(?lac2) )\n}\nLIMIT 10",
    "complexity": "medium"
  },
  {
    "id": "1713",
    "instruction": "List all types of GLAMs in Wikidata.",
    "query": "SELECT ?typeLabel (COUNT(?item) AS ?count) WHERE {\n?item (wdt:P31/(wdt:P279*)) wd:Q1030034;\nwdt:P31 ?type.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?typeLabel\nLIMIT 50",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?typeLabel (COUNT(?item) AS ?count) WHERE {\n?item (wdt:[property:instance of]/(wdt:[property:subclass of]*)) wd:[entity:GLAM];\nwdt:[property:instance of] ?type.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?typeLabel\nLIMIT 50",
    "complexity": "medium"
  }
]