[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "1469",
    "instruction": "Find articles about Swiss items that are only available in one language Wikipedia.",
    "query": "SELECT ?item (SAMPLE(?title) AS ?itemLabel) (SAMPLE(?location) AS ?location) (SAMPLE(?language) AS ?layer) WITH {\nSELECT * WHERE {\nwd:Q39 p:P1332/psv:P1332/wikibase:geoLatitude ?n;\np:P1333/psv:P1333/wikibase:geoLatitude ?s;\np:P1334/psv:P1334/wikibase:geoLongitude ?e;\np:P1335/psv:P1335/wikibase:geoLongitude ?w.\n}\n} AS %switzerlandBoundingBox WHERE {\nVALUES ?wiki { <https://de.wikipedia.org/> <https://fr.wikipedia.org/> <https://it.wikipedia.org/> <https://rm.wikipedia.org/> }\n?item wdt:P17 wd:Q39;\nwdt:P625 ?location.\n?article a schema:Article;\nschema:about ?item;\nschema:isPartOf ?wiki;\nschema:inLanguage ?language;\nschema:name ?title.\n# filter out some stray results that have country Switzerland but coordinates outside it (e. g. rivers)\nINCLUDE %switzerlandBoundingBox.\nBIND(geof:latitude(?location) AS ?lat)\nBIND(geof:longitude(?location) AS ?lon)\nFILTER(?s <= ?lat && ?lat <= ?n &&\n?w <= ?lon && ?lon <= ?e)\n}\nGROUP BY ?item\nHAVING(COUNT(DISTINCT ?wiki) = 1)",
    "annotated": "PREFIX schema: <http://schema.org/>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item (SAMPLE(?title) AS ?itemLabel) (SAMPLE(?location) AS ?location) (SAMPLE(?language) AS ?layer) WITH {\nSELECT * WHERE {\nwd:[entity:Switzerland] p:[property:coordinates of northernmost point]/psv:[property:coordinates of northernmost point]/wikibase:geoLatitude ?n;\np:[property:coordinates of southernmost point]/psv:[property:coordinates of southernmost point]/wikibase:geoLatitude ?s;\np:[property:coordinates of easternmost point]/psv:[property:coordinates of easternmost point]/wikibase:geoLongitude ?e;\np:[property:coordinates of westernmost point]/psv:[property:coordinates of westernmost point]/wikibase:geoLongitude ?w.\n}\n} AS %switzerlandBoundingBox WHERE {\nVALUES ?wiki { <https://de.wikipedia.org/> <https://fr.wikipedia.org/> <https://it.wikipedia.org/> <https://rm.wikipedia.org/> }\n?item wdt:[property:country] wd:[entity:Switzerland];\nwdt:[property:coordinate location] ?location.\n?article a schema:Article;\nschema:about ?item;\nschema:isPartOf ?wiki;\nschema:inLanguage ?language;\nschema:name ?title.\n# filter out some stray results that have country Switzerland but coordinates outside it (e. g. rivers)\nINCLUDE %switzerlandBoundingBox.\nBIND(geof:latitude(?location) AS ?lat)\nBIND(geof:longitude(?location) AS ?lon)\nFILTER(?s <= ?lat && ?lat <= ?n &&\n?w <= ?lon && ?lon <= ?e)\n}\nGROUP BY ?item\nHAVING(COUNT(DISTINCT ?wiki) = 1)",
    "complexity": "complex"
  },
  {
    "id": "315",
    "instruction": "Find digital versions of a work with different editions from the Oxford Text Archive.",
    "query": "SELECT ?edition2 ?title ?year2 ?text2 ?this_is_no ?ota_has_no WHERE {\n?edition1 wdt:P629 ?work;\nwdt:P953 ?text1;\nwdt:P577 ?pubdate1.\nFILTER CONTAINS(STR(?text1),\"ota.ox.ac.uk\") # OTA scan of work\nBIND(YEAR(?pubdate1) as ?year) # publication year\n?edition2 wdt:P629 ?work; # edition of work\nwdt:P953 ?text2;\nwdt:P1476 ?title;\nwdt:P577 ?pubdate2.\nFILTER( ?edition1 != ?edition2 ) # non-OTA scan of work\nBIND(YEAR(?pubdate2) as ?year2) # publication year\nOPTIONAL{ ?edition1 wdt:P393 ?ota_has_no } # edition number\nOPTIONAL{ ?edition2 wdt:P393 ?this_is_no }\n}",
    "annotated": "PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?edition2 ?title ?year2 ?text2 ?this_is_no ?ota_has_no WHERE {\n?edition1 wdt:[property:edition or translation of] ?work;\nwdt:[property:full work available at URL] ?text1;\nwdt:[property:publication date] ?pubdate1.\nFILTER CONTAINS(STR(?text1),\"ota.ox.ac.uk\") # OTA scan of work\nBIND(YEAR(?pubdate1) as ?year) # publication year\n?edition2 wdt:[property:edition or translation of] ?work; # edition of work\nwdt:[property:full work available at URL] ?text2;\nwdt:[property:title] ?title;\nwdt:[property:publication date] ?pubdate2.\nFILTER( ?edition1 != ?edition2 ) # non-OTA scan of work\nBIND(YEAR(?pubdate2) as ?year2) # publication year\nOPTIONAL{ ?edition1 wdt:[property:edition number] ?ota_has_no } # edition number\nOPTIONAL{ ?edition2 wdt:[property:edition number] ?this_is_no }\n}",
    "complexity": "complex"
  },
  {
    "id": "2129",
    "instruction": "List all bathing waters with their distance to the center of the connected lake.",
    "query": "SELECT ?str ?bathwater ?bathwaterLabel ?bathcoord ?lake ?lakeLabel ?lakecoord ?dist ?line ?SJOID ?layer ?EionetBathingWaterIDentifier ?Hav ?VISS WHERE {\n?bathwater wdt:P6104 wd:Q106774536.\n?bathwater wdt:P625 ?xx.\n?bathwater p:P625 [ a wikibase:BestRank ;\npsv:P625 [\nwikibase:geoLatitude ?bathcoordlat ;\nwikibase:geoLongitude ?bathcoordlon ;\nwikibase:geoGlobe ?globe ;\n] ;\nps:P625 ?bathcoord\n]\nOPTIONAL { ?bathwater wdt:P9616 ?EionetBathingWaterIDentifier. }\n{\n?bathwater wdt:P206 ?lake.\n?lake wdt:P625 ?rr.\n?lake p:P625 [a wikibase:BestRank ;\npsv:P625 [\nwikibase:geoLatitude ?lat ;\nwikibase:geoLongitude ?long ;\nwikibase:geoGlobe ?globe2 ;\n] ;\nps:P625 ?lakecoord\n]\nOPTIONAL { ?lake wdt:P761 ?SJOID. }\n}\nBIND(geof:distance(?bathcoord, ?lakecoord) as ?dist) .\n#filter (?dist >= 3)\nBIND (floor(?dist/10)*10 as ?layer)\nBIND(CONCAT('LINESTRING (', STR(?bathcoordlon), ' ', STR(?bathcoordlat), ',', STR(?long), ' ', STR(?lat), ')') AS ?str) .\nBIND(STRDT(?str, geo:wktLiteral) AS ?line)\nBIND(URI(CONCAT(\"https://badplatsen.havochvatten.se/badplatsen/karta/#/bath/\",?EionetBathingWaterIDentifier)) AS ?Hav)\nBIND(URI(CONCAT(\"https://viss.lansstyrelsen.se/Waters.aspx?waterEUID=SE\",?SJOID)) AS ?VISS)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,sv\". }\n}\nORDER BY DESC(?dist)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?str ?bathwater ?bathwaterLabel ?bathcoord ?lake ?lakeLabel ?lakecoord ?dist ?line ?SJOID ?layer ?EionetBathingWaterIDentifier ?Hav ?VISS WHERE {\n?bathwater wdt:[property:maintained by WikiProject] wd:[entity:WikiProject Swedish Bath Waters].\n?bathwater wdt:[property:coordinate location] ?xx.\n?bathwater p:[property:coordinate location] [ a wikibase:BestRank ;\npsv:[property:coordinate location] [\nwikibase:geoLatitude ?bathcoordlat ;\nwikibase:geoLongitude ?bathcoordlon ;\nwikibase:geoGlobe ?globe ;\n] ;\nps:[property:coordinate location] ?bathcoord\n]\nOPTIONAL { ?bathwater wdt:[property:Eionet bathing Water ID] ?EionetBathingWaterIDentifier. }\n{\n?bathwater wdt:[property:located in or next to body of water] ?lake.\n?lake wdt:[property:coordinate location] ?rr.\n?lake p:[property:coordinate location] [a wikibase:BestRank ;\npsv:[property:coordinate location] [\nwikibase:geoLatitude ?lat ;\nwikibase:geoLongitude ?long ;\nwikibase:geoGlobe ?globe2 ;\n] ;\nps:[property:coordinate location] ?lakecoord\n]\nOPTIONAL { ?lake wdt:[property:Lake ID (Sweden)] ?SJOID. }\n}\nBIND(geof:distance(?bathcoord, ?lakecoord) as ?dist) .\n#filter (?dist >= 3)\nBIND (floor(?dist/10)*10 as ?layer)\nBIND(CONCAT('LINESTRING (', STR(?bathcoordlon), ' ', STR(?bathcoordlat), ',', STR(?long), ' ', STR(?lat), ')') AS ?str) .\nBIND(STRDT(?str, geo:wktLiteral) AS ?line)\nBIND(URI(CONCAT(\"https://badplatsen.havochvatten.se/badplatsen/karta/#/bath/\",?EionetBathingWaterIDentifier)) AS ?Hav)\nBIND(URI(CONCAT(\"https://viss.lansstyrelsen.se/Waters.aspx?waterEUID=SE\",?SJOID)) AS ?VISS)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,sv\". }\n}\nORDER BY DESC(?dist)",
    "complexity": "complex"
  },
  {
    "id": "784",
    "instruction": "What works were created by female artists who died in 1945?",
    "query": "select distinct ?item ?itemLabel ?creaLabel ?workLabel (year(?date)as ?year)\nwhere {\n{?item wdt:P170 ?crea .} # P170/creator\nUNION {?item wdt:P50 ?crea .} # P50/author\n#UNION {?item wdt:P86 ?crea .} # P86/composer\n#UNION {?item wdt:P87 ?crea .} # P87/librettist\n#UNION {?item wdt:P110 ?crea .} # P110/illustrator\n#UNION {?item wdt:P655 ?crea .} # P655/translator\n#UNION {?item wdt:P676 ?crea .} # P676/lyrics by\n?crea wdt:P21 wd:Q6581072 . # P21/sex or gender - Q6581072/female\n?crea wdt:P570 ?time0 .\nFILTER ( ?time0 >= \"1945-01-01T00:00:00Z\"^^xsd:dateTime && ?time0 <= \"1945-12-31T00:00:00Z\"^^xsd:dateTime ) # P570/date of death in 1945\nOPTIONAL {{?item wdt:P571 ?date} UNION {?item wdt:P577 ?date }} # P571/inception - P571/publication date\n?item wdt:P31 ?work\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en,ar,be,bg,bn,ca,cs,da,de,el,es,et,fa,fi,fr,he,hi,hu,hy,id,it,ja,jv,ko,nb,nl,eo,pa,pl,pt,ro,ru,sh,sk,sr,sv,sw,te,th,tr,uk,yue,vec,vi,zh\" #BabelRainbow\n}\n}ORDER BY ?creaLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nselect distinct ?item ?itemLabel ?creaLabel ?workLabel (year(?date)as ?year)\nwhere {\n{?item wdt:[property:creator] ?crea .} # [property:creator]/creator\nUNION {?item wdt:[property:author] ?crea .} # [property:author]/author\n#UNION {?item wdt:[property:composer] ?crea .} # [property:composer]/composer\n#UNION {?item wdt:[property:librettist] ?crea .} # [property:librettist]/librettist\n#UNION {?item wdt:[property:illustrator] ?crea .} # [property:illustrator]/illustrator\n#UNION {?item wdt:[property:translator] ?crea .} # [property:translator]/translator\n#UNION {?item wdt:[property:lyrics by] ?crea .} # [property:lyrics by]/lyrics by\n?crea wdt:[property:sex or gender] wd:[entity:female] . # [property:sex or gender]/sex or gender - [entity:female]/female\n?crea wdt:[property:date of death] ?time0 .\nFILTER ( ?time0 >= \"1945-01-01T00:00:00Z\"^^xsd:dateTime && ?time0 <= \"1945-12-31T00:00:00Z\"^^xsd:dateTime ) # [property:date of death]/date of death in 1945\nOPTIONAL {{?item wdt:[property:inception] ?date} UNION {?item wdt:[property:publication date] ?date }} # [property:inception]/inception - [property:inception]/publication date\n?item wdt:[property:instance of] ?work\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en,ar,be,bg,bn,ca,cs,da,de,el,es,et,fa,fi,fr,he,hi,hu,hy,id,it,ja,jv,ko,nb,nl,eo,pa,pl,pt,ro,ru,sh,sk,sr,sv,sw,te,th,tr,uk,yue,vec,vi,zh\" #BabelRainbow\n}\n}ORDER BY ?creaLabel",
    "complexity": "complex"
  },
  {
    "id": "247",
    "instruction": "What languages are used in Wikipedia articles about artists whose work is part of the Ashmolean Museum collection?",
    "query": "SELECT ?languageLabel (COUNT(?sitelink) AS ?count) WITH { SELECT DISTINCT ?artist { ?work wdt:P195 wd:Q636400; wdt:P170 ?artist FILTER (!ISBLANK(?artist)) } } AS %artists WHERE {\nINCLUDE %artists.\n?sitelink schema:about ?artist; schema:inLanguage ?lang FILTER (CONTAINS(STR(?sitelink), \".wikipedia.org\"))\n?language wdt:P218 ?lang.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} GROUP BY ?languageLabel\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?languageLabel (COUNT(?sitelink) AS ?count) WITH { SELECT DISTINCT ?artist { ?work wdt:[property:collection] wd:[entity:Ashmolean Museum]; wdt:[property:creator] ?artist FILTER (!ISBLANK(?artist)) } } AS %artists WHERE {\nINCLUDE %artists.\n?sitelink schema:about ?artist; schema:inLanguage ?lang FILTER (CONTAINS(STR(?sitelink), \".wikipedia.org\"))\n?language wdt:[property:ISO 639-1 code] ?lang.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} GROUP BY ?languageLabel\nORDER BY DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "1604",
    "instruction": "List songs named after famous people.",
    "query": "select ?work ?workLabel ?year ?typeLabel ?namesake ?namesakeLabel ?birthyear ?deathyear\nwhere {\n?work wdt:P31 ?type . ?type wdt:P279* wd:Q7366 .\n# work is a type of song or poem\n?work wdt:P138 ?namesake . ?namesake wdt:P31 wd:Q5 .\n# named after a person\noptional { ?namesake wdt:P569 ?born . bind(year(?born) as ?birthyear) }\noptional { ?namesake wdt:P570 ?died . bind(year(?died) as ?deathyear) }\noptional { ?work wdt:P577|wdt:P571 ?date . bind(year(?date) as ?year) }\n# dates\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nselect ?work ?workLabel ?year ?typeLabel ?namesake ?namesakeLabel ?birthyear ?deathyear\nwhere {\n?work wdt:[property:instance of] ?type . ?type wdt:[property:subclass of]* wd:[entity:song] .\n# work is a type of song or poem\n?work wdt:[property:named after] ?namesake . ?namesake wdt:[property:instance of] wd:[entity:human] .\n# named after a person\noptional { ?namesake wdt:[property:date of birth] ?born . bind(year(?born) as ?birthyear) }\noptional { ?namesake wdt:[property:date of death] ?died . bind(year(?died) as ?deathyear) }\noptional { ?work wdt:[property:publication date]|wdt:[property:inception] ?date . bind(year(?date) as ?year) }\n# dates\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "2435",
    "instruction": "Find properties that have humans as possible values and display their French labels.",
    "query": "SELECT ?property ?propertyLabel ?relation ?relationLabel ?maleform ?femaleform WHERE {\n?property p:P2302 ?statement.\n?statement ps:P2302 wd:Q21510865;\npq:P2308 wd:Q5;\npq:P2309 ?relation.\n?property rdfs:label ?propertyLabel.\n?relation rdfs:label ?relationLabel.\nFILTER((LANG(?propertyLabel)) = \"fr\")\nFILTER((LANG(?relationLabel)) = \"fr\")\nOPTIONAL {\n?property wdt:P2521 ?femaleform.\nFILTER((LANG(?femaleform)) = \"fr\")\n}\nOPTIONAL {\n?property wdt:P3321 ?maleform.\nFILTER((LANG(?maleform)) = \"fr\")\n}\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?property ?propertyLabel ?relation ?relationLabel ?maleform ?femaleform WHERE {\n?property p:[property:property constraint] ?statement.\n?statement ps:[property:property constraint] wd:[entity:value-type constraint];\npq:[property:class] wd:[entity:human];\npq:[property:relation] ?relation.\n?property rdfs:label ?propertyLabel.\n?relation rdfs:label ?relationLabel.\nFILTER((LANG(?propertyLabel)) = \"fr\")\nFILTER((LANG(?relationLabel)) = \"fr\")\nOPTIONAL {\n?property wdt:[property:female form of label] ?femaleform.\nFILTER((LANG(?femaleform)) = \"fr\")\n}\nOPTIONAL {\n?property wdt:[property:male form of label] ?maleform.\nFILTER((LANG(?maleform)) = \"fr\")\n}\n}",
    "complexity": "complex"
  },
  {
    "id": "1256",
    "instruction": "List all Nobel Prize winners who have given TED talks.",
    "query": "SELECT DISTINCT ?place ?img ?twitter ?motivation ?article ?NobelArticle ?coord22 ?TED WHERE {\n?laureate wdt:P2888 ?laureate_nobel_uri .\nOPTIONAL{?laureate wdt:P2002 ?twitterID}\n?laureate wdt:P2611 ?TEDID\nFILTER (strStarts(str(?laureate_nobel_uri), \"http://data.nobelprize.org/resource/laureate/\"))\nOPTIONAL {?laureate wdt:P18 ?img}\nOPTIONAL {?laureate wdt:P19/wdt:P625 ?coord22}\nOPTIONAL {?article schema:about ?laureate .\n?article schema:isPartOf <https://en.wikipedia.org/>}\nOPTIONAL{?laureate wdt:P3188 ?Na}\nBIND (URI(CONCAT(\"https://www.nobelprize.org/nobel_prizes/\",?Na,\"-facts.html\")) AS ?NobelArticle)\nBIND (URI(CONCAT(\"https://twitter.com/\",?twitterID)) AS ?twitter)\nBIND (URI(CONCAT(\"https://www.ted.com/speakers/\",?TEDID)) AS ?TED)\nSERVICE <http://data.nobelprize.org/sparql> {\n?laureate_nobel_uri nobel:laureateAward / nobel:motivation ?motivation .\nFILTER (lang(?motivation) = 'en')\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,de,da,nl\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\nPREFIX nobel: <http://data.nobelprize.org/terms/>\n\nSELECT DISTINCT ?place ?img ?twitter ?motivation ?article ?NobelArticle ?coord22 ?TED WHERE {\n?laureate wdt:[property:exact match] ?laureate_nobel_uri .\nOPTIONAL{?laureate wdt:[property:Twitter (X) username] ?twitterID}\n?laureate wdt:[property:TED speaker ID] ?TEDID\nFILTER (strStarts(str(?laureate_nobel_uri), \"http://data.nobelprize.org/resource/laureate/\"))\nOPTIONAL {?laureate wdt:[property:image] ?img}\nOPTIONAL {?laureate wdt:[property:place of birth]/wdt:[property:coordinate location] ?coord22}\nOPTIONAL {?article schema:about ?laureate .\n?article schema:isPartOf <https://en.wikipedia.org/>}\nOPTIONAL{?laureate wdt:[property:P3188] ?Na}\nBIND (URI(CONCAT(\"https://www.nobelprize.org/nobel_prizes/\",?Na,\"-facts.html\")) AS ?NobelArticle)\nBIND (URI(CONCAT(\"https://twitter.com/\",?twitterID)) AS ?twitter)\nBIND (URI(CONCAT(\"https://www.ted.com/speakers/\",?TEDID)) AS ?TED)\nSERVICE <http://data.nobelprize.org/sparql> {\n?laureate_nobel_uri nobel:laureateAward / nobel:motivation ?motivation .\nFILTER (lang(?motivation) = 'en')\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,de,da,nl\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "1342",
    "instruction": "List awards where more women have received them than men.",
    "query": "SELECT ?award (SAMPLE(?label) AS ?awardLabel) ?women ?men WITH {\nSELECT ?award (SUM(?woman) AS ?women) (SUM(?man) AS ?men) WHERE {\n?person wdt:P31 wd:Q5;\np:P166/ps:P166 ?award.\n{ ?person wdt:P21 wd:Q6581097. BIND(1 AS ?man). } UNION\n{ ?person wdt:P21 wd:Q2449503. BIND(1 AS ?man). } UNION\n{ ?person wdt:P21 wd:Q6581072. BIND(1 AS ?woman). } UNION\n{ ?person wdt:P21 wd:Q1052281. BIND(1 AS ?woman). }\n}\nGROUP BY ?award\nHAVING(\n# more women than men\n?women > ?men &&\n# but exclude women-only awards\n?men > 0\n)\n} AS %results WHERE {\nINCLUDE %results.\nOPTIONAL { ?award wdt:P1448 ?officialName. }\nOPTIONAL { ?award rdfs:label ?enLabel. FILTER(LANG(?enLabel) = \"en\"). }\nOPTIONAL { ?award rdfs:label ?anyLabel. }\nBIND(COALESCE(?officialName, ?enLabel, ?anyLabel) AS ?label).\n}\nGROUP BY ?award ?women ?men\nORDER BY STR(?awardLabel)",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?award (SAMPLE(?label) AS ?awardLabel) ?women ?men WITH {\nSELECT ?award (SUM(?woman) AS ?women) (SUM(?man) AS ?men) WHERE {\n?person wdt:[property:instance of] wd:[entity:human];\np:[property:award received]/ps:[property:award received] ?award.\n{ ?person wdt:[property:sex or gender] wd:[entity:male]. BIND(1 AS ?man). } UNION\n{ ?person wdt:[property:sex or gender] wd:[entity:trans man]. BIND(1 AS ?man). } UNION\n{ ?person wdt:[property:sex or gender] wd:[entity:female]. BIND(1 AS ?woman). } UNION\n{ ?person wdt:[property:sex or gender] wd:[entity:trans woman]. BIND(1 AS ?woman). }\n}\nGROUP BY ?award\nHAVING(\n# more women than men\n?women > ?men &&\n# but exclude women-only awards\n?men > 0\n)\n} AS %results WHERE {\nINCLUDE %results.\nOPTIONAL { ?award wdt:[property:official name] ?officialName. }\nOPTIONAL { ?award rdfs:label ?enLabel. FILTER(LANG(?enLabel) = \"en\"). }\nOPTIONAL { ?award rdfs:label ?anyLabel. }\nBIND(COALESCE(?officialName, ?enLabel, ?anyLabel) AS ?label).\n}\nGROUP BY ?award ?women ?men\nORDER BY STR(?awardLabel)",
    "complexity": "complex"
  },
  {
    "id": "1977",
    "instruction": "List all the ministers in France.",
    "query": "SELECT ?item ?itemLabel ?ministere ?ministereLabel ?datedebut ?datefin ?image WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\". }\n{\n?item p:P39 ?statement.\n?statement ps:P39 ?ministere.\n?ministere (wdt:P279*) wd:Q83307;\nwdt:P17 wd:Q142.\n}\nUNION\n{\n?item p:P39 ?statement.\n?statement ps:P39 ?ministere.\n?ministere (wdt:P279*) wd:Q736559;\nwdt:P17 wd:Q142.\n}\nOPTIONAL { ?statement pq:P580 ?datedebut. }\nOPTIONAL { ?statement pq:P582 ?datefin. }\nOPTIONAL { ?item wdt:P18 ?image. }\n}\nORDER BY DESC (?datedebut)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?ministere ?ministereLabel ?datedebut ?datefin ?image WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\". }\n{\n?item p:[property:position held] ?statement.\n?statement ps:[property:position held] ?ministere.\n?ministere (wdt:[property:subclass of]*) wd:[entity:minister];\nwdt:[property:country] wd:[entity:France].\n}\nUNION\n{\n?item p:[property:position held] ?statement.\n?statement ps:[property:position held] ?ministere.\n?ministere (wdt:[property:subclass of]*) wd:[entity:secretary of state];\nwdt:[property:country] wd:[entity:France].\n}\nOPTIONAL { ?statement pq:[property:start time] ?datedebut. }\nOPTIONAL { ?statement pq:[property:end time] ?datefin. }\nOPTIONAL { ?item wdt:[property:image] ?image. }\n}\nORDER BY DESC (?datedebut)",
    "complexity": "complex"
  },
  {
    "id": "2484",
    "instruction": "List all UK parties that have only had one MP since 1935.",
    "query": "SELECT ?party ?partyLabel ?firstDate ?total_MPs WITH {\nSELECT ?party (MIN(?date) AS ?firstDate) (count(distinct ?mp) as ?total_MPs) WHERE {\n?mp p:P39 ?mpStatement . ?mpStatement ps:P39 ?term . ?term wdt:P279 wd:Q16707842.\n?mpStatement pq:P580 ?date.\n?mpStatement pq:P4100 ?party.\nwd:Q918378 wdt:P585 ?1935elec . filter(?date >= ?1935elec)\n}\nGROUP BY ?party\n} AS %parties WHERE {\nINCLUDE %parties.\nfilter(?total_MPs = 1)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY desc(?firstDate) ?partyLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?party ?partyLabel ?firstDate ?total_MPs WITH {\nSELECT ?party (MIN(?date) AS ?firstDate) (count(distinct ?mp) as ?total_MPs) WHERE {\n?mp p:[property:position held] ?mpStatement . ?mpStatement ps:[property:position held] ?term . ?term wdt:[property:subclass of] wd:[entity:Member of Parliament].\n?mpStatement pq:[property:start time] ?date.\n?mpStatement pq:[property:parliamentary group] ?party.\nwd:[entity:1935 United Kingdom general election] wdt:[property:point in time] ?1935elec . filter(?date >= ?1935elec)\n}\nGROUP BY ?party\n} AS %parties WHERE {\nINCLUDE %parties.\nfilter(?total_MPs = 1)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY desc(?firstDate) ?partyLabel",
    "complexity": "complex"
  },
  {
    "id": "1644",
    "instruction": "Find pictures of animals that are feminine in German and masculine in French.",
    "query": "SELECT ?animal ?deLemmas ?frLemmas ?image\nWITH {\nSELECT ?animal (STRLANG(GROUP_CONCAT(?deLemma; separator = \"/\"), \"de\") AS ?deLemmas) (STRLANG(GROUP_CONCAT(?frLemma; separator = \"/\"), \"fr\") AS ?frLemmas) WHERE {\n?de dct:language wd:Q188;\nwikibase:lexicalCategory wd:Q1084;\nwikibase:lemma ?deLemma;\nwdt:P5185 wd:Q1775415;\nontolex:sense [ wdt:P5137 ?animal ].\n?fr dct:language wd:Q150;\nwikibase:lexicalCategory wd:Q1084;\nwikibase:lemma ?frLemma;\nwdt:P5185 wd:Q499327;\nontolex:sense [ wdt:P5137 ?animal ].\n?animal wdt:P279+ wd:Q729.\n}\nGROUP BY ?animal\n} AS %animals\nWITH {\nSELECT ?animal ?animalLabel ?deLemmas ?frLemmas WHERE {\nINCLUDE %animals.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\n} AS %animalsWithLabels\nWHERE {\nINCLUDE %animalsWithLabels.\nBIND(CONCAT(\"haswbstatement:P180=\", STRAFTER(STR(?animal), STR(wd:))) AS ?search)\nSERVICE wikibase:mwapi {\nbd:serviceParam wikibase:api \"Search\";\nwikibase:endpoint \"commons.wikimedia.org\";\nmwapi:srsearch ?search;\nmwapi:srnamespace \"6\"; # NS_FILE\nmwapi:srlimit \"max\".\n?title wikibase:apiOutput mwapi:title.\n}\nBIND(IRI(CONCAT(\"http://commons.wikimedia.org/wiki/Special:FilePath/\", STRAFTER(?title, \"File:\"))) AS ?image)\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX dct: <http://purl.org/dc/terms/>\nPREFIX ontolex: <http://www.w3.org/ns/lemon/ontolex#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?animal ?deLemmas ?frLemmas ?image\nWITH {\nSELECT ?animal (STRLANG(GROUP_CONCAT(?deLemma; separator = \"/\"), \"de\") AS ?deLemmas) (STRLANG(GROUP_CONCAT(?frLemma; separator = \"/\"), \"fr\") AS ?frLemmas) WHERE {\n?de dct:language wd:[entity:German];\nwikibase:lexicalCategory wd:[entity:noun];\nwikibase:lemma ?deLemma;\nwdt:[property:grammatical gender] wd:[entity:feminine];\nontolex:sense [ wdt:[property:item for this sense] ?animal ].\n?fr dct:language wd:[entity:French];\nwikibase:lexicalCategory wd:[entity:noun];\nwikibase:lemma ?frLemma;\nwdt:[property:grammatical gender] wd:[entity:masculine];\nontolex:sense [ wdt:[property:item for this sense] ?animal ].\n?animal wdt:[property:subclass of]+ wd:[entity:animal].\n}\nGROUP BY ?animal\n} AS %animals\nWITH {\nSELECT ?animal ?animalLabel ?deLemmas ?frLemmas WHERE {\nINCLUDE %animals.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\n} AS %animalsWithLabels\nWHERE {\nINCLUDE %animalsWithLabels.\nBIND(CONCAT(\"haswbstatement:[property:depicts]=\", STRAFTER(STR(?animal), STR(wd:))) AS ?search)\nSERVICE wikibase:mwapi {\nbd:serviceParam wikibase:api \"Search\";\nwikibase:endpoint \"commons.wikimedia.org\";\nmwapi:srsearch ?search;\nmwapi:srnamespace \"6\"; # NS_FILE\nmwapi:srlimit \"max\".\n?title wikibase:apiOutput mwapi:title.\n}\nBIND(IRI(CONCAT(\"http://commons.wikimedia.org/wiki/Special:FilePath/\", STRAFTER(?title, \"File:\"))) AS ?image)\n}",
    "complexity": "complex"
  },
  {
    "id": "2577",
    "instruction": "Find signature images of famous people on a map.",
    "query": "SELECT ?person ?personLabel ?signature ?placeOfBirthCoordinates WITH {\n# get all the actual data\nSELECT ?person (SAMPLE(?signature_) AS ?signature) (SAMPLE(?placeOfBirthCoordinates_) AS ?placeOfBirthCoordinates) WHERE {\n# get some random signature image statements\nSERVICE bd:sample {\n?person wdt:P109 ?signature_.\nbd:serviceParam bd:sample.limit 110 . # a bit over 100 in case some of them happen to be non-humans\n}\n# ensure they're humans (most are but there are some exceptions)\n?person wdt:P31 wd:Q5.\n# for the map display, optionally add the place of birth\nOPTIONAL {\n?person wdt:P19 ?placeOfBirth.\n?placeOfBirth wdt:P625 ?placeOfBirthCoordinates_.\n}\n}\nGROUP BY ?person # avoid multiple results in case of multiple signature / place of death (coordinate) statements\nLIMIT 100\n} AS %results WHERE {\n# add labels\nINCLUDE %results.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?person ?personLabel ?signature ?placeOfBirthCoordinates WITH {\n# get all the actual data\nSELECT ?person (SAMPLE(?signature_) AS ?signature) (SAMPLE(?placeOfBirthCoordinates_) AS ?placeOfBirthCoordinates) WHERE {\n# get some random signature image statements\nSERVICE bd:sample {\n?person wdt:[property:signature] ?signature_.\nbd:serviceParam bd:sample.limit 110 . # a bit over 100 in case some of them happen to be non-humans\n}\n# ensure they're humans (most are but there are some exceptions)\n?person wdt:[property:instance of] wd:[entity:human].\n# for the map display, optionally add the place of birth\nOPTIONAL {\n?person wdt:[property:place of birth] ?placeOfBirth.\n?placeOfBirth wdt:[property:coordinate location] ?placeOfBirthCoordinates_.\n}\n}\nGROUP BY ?person # avoid multiple results in case of multiple signature / place of death (coordinate) statements\nLIMIT 100\n} AS %results WHERE {\n# add labels\nINCLUDE %results.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  }
]