[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "1133",
    "instruction": "Show me a map of ancient structures in Portugal and Spain.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?coords ?image WHERE {\n?item wdt:P31/wdt:P279* wd:Q164240 .\n{ ?item wdt:P17 wd:Q45 . } UNION\n{ ?item wdt:P17 wd:Q29 . } UNION\n{ ?item wdt:P131/wdt:P131 wd:Q12703 } UNION\n{ ?item wdt:P131/wdt:P131 wd:Q12709 }\nOPTIONAL { ?item wdt:P625 ?coords . }\nOPTIONAL { ?item wdt:P18 ?image . }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\" . }\n} ORDER BY ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?coords ?image WHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:megalith] .\n{ ?item wdt:[property:country] wd:[entity:Portugal] . } UNION\n{ ?item wdt:[property:country] wd:[entity:Spain] . } UNION\n{ ?item wdt:[property:located in the administrative territorial entity]/wdt:[property:located in the administrative territorial entity] wd:[entity:Pyr\u00e9n\u00e9es-Atlantiques] } UNION\n{ ?item wdt:[property:located in the administrative territorial entity]/wdt:[property:located in the administrative territorial entity] wd:[entity:Pyr\u00e9n\u00e9es-Orientales] }\nOPTIONAL { ?item wdt:[property:coordinate location] ?coords . }\nOPTIONAL { ?item wdt:[property:image] ?image . }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\" . }\n} ORDER BY ?itemLabel",
    "complexity": "complex"
  },
  {
    "id": "973",
    "instruction": "What are the addresses of embassies in a specific country?",
    "query": "SELECT DISTINCT\n(SAMPLE(?country_label) as ?country) (SAMPLE(?city_label) as ?city) (SAMPLE(?address) as ?address) (SAMPLE(?coordinates) as ?coordinates)\n(SAMPLE(?operator_label) as ?operator) (SAMPLE(?phone) as ?phone) (SAMPLE(?email) as ?email) (SAMPLE(?website) as ?website)\n(SAMPLE(?facebook) as ?facebook) (SAMPLE(?twitter) as ?twitter) (SAMPLE(?image) as ?image) ?wikidata\nWHERE {\n?wikidata wdt:P31 wd:Q3917681.\nOPTIONAL {?wikidata wdt:P131*/wdt:P17 ?countryId. ?countryId rdfs:label ?country_label. filter (lang(?country_label) = \"en\").}\nOPTIONAL {?wikidata wdt:P131 ?cityId. ?cityId rdfs:label ?city_label. filter (lang(?city_label) = \"en\").}\nOPTIONAL {?wikidata wdt:P969 ?address.}\nOPTIONAL {?wikidata wdt:P625 ?coordinates.}\nOPTIONAL {?wikidata wdt:P137 ?operatorId. ?operatorId rdfs:label ?operator_label. filter (lang(?operator_label) = \"en\").}\nOPTIONAL {?wikidata wdt:P1329 ?phone.}\nOPTIONAL {?wikidata wdt:P968 ?email.}\nOPTIONAL {?wikidata wdt:P856 ?website.}\nOPTIONAL {?wikidata wdt:P2013 ?facebook.}\nOPTIONAL {?wikidata wdt:P2002 ?twitter.}\nOPTIONAL {?wikidata wdt:P18 ?image.}\nSERVICE wikibase:label {bd:serviceParam wikibase:language \"en,ru,de,fr,es\"}\n} GROUP BY ?wikidata ?wikidataLabel ORDER BY ASC(?country) ASC(?city) ASC(?operator)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT\n(SAMPLE(?country_label) as ?country) (SAMPLE(?city_label) as ?city) (SAMPLE(?address) as ?address) (SAMPLE(?coordinates) as ?coordinates)\n(SAMPLE(?operator_label) as ?operator) (SAMPLE(?phone) as ?phone) (SAMPLE(?email) as ?email) (SAMPLE(?website) as ?website)\n(SAMPLE(?facebook) as ?facebook) (SAMPLE(?twitter) as ?twitter) (SAMPLE(?image) as ?image) ?wikidata\nWHERE {\n?wikidata wdt:[property:instance of] wd:[entity:embassy].\nOPTIONAL {?wikidata wdt:[property:located in the administrative territorial entity]*/wdt:[property:country] ?countryId. ?countryId rdfs:label ?country_label. filter (lang(?country_label) = \"en\").}\nOPTIONAL {?wikidata wdt:[property:located in the administrative territorial entity] ?cityId. ?cityId rdfs:label ?city_label. filter (lang(?city_label) = \"en\").}\nOPTIONAL {?wikidata wdt:[property:P969] ?address.}\nOPTIONAL {?wikidata wdt:[property:coordinate location] ?coordinates.}\nOPTIONAL {?wikidata wdt:[property:operator] ?operatorId. ?operatorId rdfs:label ?operator_label. filter (lang(?operator_label) = \"en\").}\nOPTIONAL {?wikidata wdt:[property:phone number] ?phone.}\nOPTIONAL {?wikidata wdt:[property:email address] ?email.}\nOPTIONAL {?wikidata wdt:[property:official website] ?website.}\nOPTIONAL {?wikidata wdt:[property:Facebook username] ?facebook.}\nOPTIONAL {?wikidata wdt:[property:Twitter (X) username] ?twitter.}\nOPTIONAL {?wikidata wdt:[property:image] ?image.}\nSERVICE wikibase:label {bd:serviceParam wikibase:language \"en,ru,de,fr,es\"}\n} GROUP BY ?wikidata ?wikidataLabel ORDER BY ASC(?country) ASC(?city) ASC(?operator)",
    "complexity": "complex"
  },
  {
    "id": "20",
    "instruction": "List the current finance ministers of each country.",
    "query": "SELECT ?countryLabel ?postLabel ?post WHERE {\n?post wdt:P279 wd:Q7614320;\nwdt:P17 ?country\nMINUS{ ?post wdt:P576 [] } # Exclude abolished posts\nOPTIONAL{ ?post wdt:P1001 ?jurisdiction }\nFILTER( !(BOUND(?jurisdiction) && ?jurisdiction != ?country) )\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} ORDER BY ?countryLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?countryLabel ?postLabel ?post WHERE {\n?post wdt:[property:subclass of] wd:[entity:finance minister];\nwdt:[property:country] ?country\nMINUS{ ?post wdt:[property:dissolved, abolished or demolished date] [] } # Exclude abolished posts\nOPTIONAL{ ?post wdt:[property:applies to jurisdiction] ?jurisdiction }\nFILTER( !(BOUND(?jurisdiction) && ?jurisdiction != ?country) )\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} ORDER BY ?countryLabel",
    "complexity": "complex"
  },
  {
    "id": "216",
    "instruction": "What are the common properties between items in Tate and Smithsonian collections?",
    "query": "SELECT (?count1 AS ?in_Tate) (?count2 AS ?in_Smithsonian) (CONCAT(?propertyLabel,\": \",?thingLabel)AS ?attribute) WHERE {\n{ SELECT (COUNT(?obj1) AS ?count1) ?property ?thing WHERE {\n?obj1 wdt:P195 wd:Q430682. #Tate\nVALUES ?prop1 {wdt:P180 wdt:P170 wdt:P2348 wdt:P135 wdt:P136 wdt:P941 wdt:P186 wdt:P1071}\n?obj1 ?prop1 ?thing.\n?property ?ref ?prop1 ;\nrdf:type wikibase:Property .\n} GROUP BY ?property ?thing }\n{ SELECT (COUNT(?obj2) AS ?count2) ?property ?thing WHERE {\n?obj2 wdt:P195 wd:Q1192305. #Smithsonian\nVALUES ?prop1 {wdt:P180 wdt:P170 wdt:P2348 wdt:P135 wdt:P136 wdt:P941 wdt:P186 wdt:P1071}\n?obj2 ?prop1 ?thing.\n?property ?ref ?prop1 ;\nrdf:type wikibase:Property .\n} GROUP BY ?property ?thing }\nFILTER (?count2 >2 )\nFILTER (?count1 >2 )\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". ?property rdfs:label ?propertyLabel .?thing rdfs:label ?thingLabel }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT (?count1 AS ?in_Tate) (?count2 AS ?in_Smithsonian) (CONCAT(?propertyLabel,\": \",?thingLabel)AS ?attribute) WHERE {\n{ SELECT (COUNT(?obj1) AS ?count1) ?property ?thing WHERE {\n?obj1 wdt:[property:collection] wd:[entity:Tate]. #Tate\nVALUES ?prop1 {wdt:[property:depicts] wdt:[property:creator] wdt:[property:time period] wdt:[property:movement] wdt:[property:genre] wdt:[property:inspired by] wdt:[property:made from material] wdt:[property:location of creation]}\n?obj1 ?prop1 ?thing.\n?property ?ref ?prop1 ;\nrdf:type wikibase:Property .\n} GROUP BY ?property ?thing }\n{ SELECT (COUNT(?obj2) AS ?count2) ?property ?thing WHERE {\n?obj2 wdt:[property:collection] wd:[entity:Smithsonian American Art Museum]. #Smithsonian\nVALUES ?prop1 {wdt:[property:depicts] wdt:[property:creator] wdt:[property:time period] wdt:[property:movement] wdt:[property:genre] wdt:[property:inspired by] wdt:[property:made from material] wdt:[property:location of creation]}\n?obj2 ?prop1 ?thing.\n?property ?ref ?prop1 ;\nrdf:type wikibase:Property .\n} GROUP BY ?property ?thing }\nFILTER (?count2 >2 )\nFILTER (?count1 >2 )\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". ?property rdfs:label ?propertyLabel .?thing rdfs:label ?thingLabel }\n}",
    "complexity": "complex"
  },
  {
    "id": "1646",
    "instruction": "Show a map of UK Members of Parliament, categorized by their political party.",
    "query": "SELECT distinct ?partyLabel ?seatLabel ?mpLabel ?image ?coords ?rgb (?partyLabel AS ?layer)\nwhere {\n?mp p:P39 ?currps . ?currps ps:P39 ?currterm . ?currterm wdt:P279 wd:Q16707842 .\nfilter not exists { ?currps pq:P582 ?currend } .\n?currps pq:P768 ?seat . ?seat wdt:P625 ?coords . ?currps pq:P4100 ?party .\noptional { ?mp wdt:P18 ?image }\n?party wdt:P465 ?rgb .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\n#defaultView:Map{\"hide\":[\"?coords\", \"?layer\", \"?rgb\"]}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT distinct ?partyLabel ?seatLabel ?mpLabel ?image ?coords ?rgb (?partyLabel AS ?layer)\nwhere {\n?mp p:[property:position held] ?currps . ?currps ps:[property:position held] ?currterm . ?currterm wdt:[property:subclass of] wd:[entity:Member of Parliament] .\nfilter not exists { ?currps pq:[property:end time] ?currend } .\n?currps pq:[property:electoral district] ?seat . ?seat wdt:[property:coordinate location] ?coords . ?currps pq:[property:parliamentary group] ?party .\noptional { ?mp wdt:[property:image] ?image }\n?party wdt:[property:sRGB color hex triplet] ?rgb .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\n#defaultView:Map{\"hide\":[\"?coords\", \"?layer\", \"?rgb\"]}",
    "complexity": "complex"
  },
  {
    "id": "998",
    "instruction": "What are the most common height-to-width ratios of paintings?",
    "query": "SELECT ?ratio (COUNT(?item) AS ?count) WHERE {\n?item wdt:P31/wdt:P279* wd:Q3305213 .\n?item p:P2048/psv:P2048 [\nwikibase:quantityAmount ?baseHeight;\nwikibase:quantityUnit [\np:P2370/psv:P2370 [\nwikibase:quantityAmount ?unitHeight;\nwikibase:quantityUnit wd:Q11573\n]\n]\n].\nBIND(?baseHeight * ?unitHeight AS ?height).\n?item p:P2049/psv:P2049 [\nwikibase:quantityAmount ?baseWidth;\nwikibase:quantityUnit [\np:P2370/psv:P2370 [\nwikibase:quantityAmount ?unitWidth;\nwikibase:quantityUnit wd:Q11573\n]\n]\n].\nBIND(?baseWidth * ?unitWidth AS ?width).\nBIND(?height / ?width AS ?r) .\nBIND(IF(?r<0.5,\"< 0.5\",\nIF(?r<0.6,\"0.5 - 0.6\",\nIF(?r<0.7,\"0.6 - 0.7\",\nIF(?r<0.8,\"0.7 - 0.8\",\nIF(?r<0.9,\"0.8 - 0.9\",\nIF(?r<1.0,\"0.9 - 1.0\",\nIF(?r<1.1,\"1.0 - 1.1\",\nIF(?r<1.2,\"1.1 - 1.2\",\nIF(?r<1.3,\"1.2 - 1.3\",\nIF(?r<1.4,\"1.3 - 1.4\",\nIF(?r<1.5,\"1.4 - 1.5\", \"> 1.5\"))))))))))) AS ?ratio) .\n}\nGROUP BY ?ratio\nORDER BY DESC(?count)",
    "annotated": "PREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?ratio (COUNT(?item) AS ?count) WHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:painting] .\n?item p:[property:height]/psv:[property:height] [\nwikibase:quantityAmount ?baseHeight;\nwikibase:quantityUnit [\np:[property:conversion to SI unit]/psv:[property:conversion to SI unit] [\nwikibase:quantityAmount ?unitHeight;\nwikibase:quantityUnit wd:[entity:metre]\n]\n]\n].\nBIND(?baseHeight * ?unitHeight AS ?height).\n?item p:[property:width]/psv:[property:width] [\nwikibase:quantityAmount ?baseWidth;\nwikibase:quantityUnit [\np:[property:conversion to SI unit]/psv:[property:conversion to SI unit] [\nwikibase:quantityAmount ?unitWidth;\nwikibase:quantityUnit wd:[entity:metre]\n]\n]\n].\nBIND(?baseWidth * ?unitWidth AS ?width).\nBIND(?height / ?width AS ?r) .\nBIND(IF(?r<0.5,\"< 0.5\",\nIF(?r<0.6,\"0.5 - 0.6\",\nIF(?r<0.7,\"0.6 - 0.7\",\nIF(?r<0.8,\"0.7 - 0.8\",\nIF(?r<0.9,\"0.8 - 0.9\",\nIF(?r<1.0,\"0.9 - 1.0\",\nIF(?r<1.1,\"1.0 - 1.1\",\nIF(?r<1.2,\"1.1 - 1.2\",\nIF(?r<1.3,\"1.2 - 1.3\",\nIF(?r<1.4,\"1.3 - 1.4\",\nIF(?r<1.5,\"1.4 - 1.5\", \"> 1.5\"))))))))))) AS ?ratio) .\n}\nGROUP BY ?ratio\nORDER BY DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "1963",
    "instruction": "Show me the Stockholm metro map with colored lines and layers.",
    "query": "SELECT ?station ?stationLabel ?coords ?line ?layer ?rgb WHERE {\n?station wdt:P31 wd:Q928830;\nwdt:P131* wd:Q104231;\nwdt:P625 ?coords;\np:P197 [ps:P197 ?pred;\npq:P81 ?subwayLine].\n?pred wdt:P625 ?cds;\nwdt:P31 wd:Q928830.\nBIND(IF(xsd:double(?depth/10) = xsd:integer(?depth/10),?cds,\"\") as ?coords)\n?pred p:P625/psv:P625/wikibase:geoLatitude ?lat1 ; p:P625/psv:P625/wikibase:geoLongitude ?lon1 .\n?station p:P625/psv:P625/wikibase:geoLatitude ?lat2 ; p:P625/psv:P625/wikibase:geoLongitude ?lon2 .\nBIND(CONCAT('LINESTRING(', STR(?lon1), ' ', STR(?lat1), ',', STR(?lon2), ' ', STR(?lat2), ')') AS ?str) . BIND(STRDT(?str, geo:wktLiteral) AS ?line)\n?subwayLine wdt:P465 ?rgb .\nVALUES (?subwayLine ?layer) {\n(wd:Q1185773 \"Grona linjen\") #Green line\n(wd:Q766945 \"Roda linjen\") #Red line\n(wd:Q887043 \"Bla linjen\") #Blue line\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"sv\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?station ?stationLabel ?coords ?line ?layer ?rgb WHERE {\n?station wdt:[property:instance of] wd:[entity:metro station];\nwdt:[property:located in the administrative territorial entity]* wd:[entity:Stockholm County];\nwdt:[property:coordinate location] ?coords;\np:[property:adjacent station] [ps:[property:adjacent station] ?pred;\npq:[property:connecting line] ?subwayLine].\n?pred wdt:[property:coordinate location] ?cds;\nwdt:[property:instance of] wd:[entity:metro station].\nBIND(IF(xsd:double(?depth/10) = xsd:integer(?depth/10),?cds,\"\") as ?coords)\n?pred p:[property:coordinate location]/psv:[property:coordinate location]/wikibase:geoLatitude ?lat1 ; p:[property:coordinate location]/psv:[property:coordinate location]/wikibase:geoLongitude ?lon1 .\n?station p:[property:coordinate location]/psv:[property:coordinate location]/wikibase:geoLatitude ?lat2 ; p:[property:coordinate location]/psv:[property:coordinate location]/wikibase:geoLongitude ?lon2 .\nBIND(CONCAT('LINESTRING(', STR(?lon1), ' ', STR(?lat1), ',', STR(?lon2), ' ', STR(?lat2), ')') AS ?str) . BIND(STRDT(?str, geo:wktLiteral) AS ?line)\n?subwayLine wdt:[property:sRGB color hex triplet] ?rgb .\nVALUES (?subwayLine ?layer) {\n(wd:[entity:Green Line] \"Grona linjen\") #Green line\n(wd:[entity:Red Line] \"Roda linjen\") #Red line\n(wd:[entity:Blue Line] \"Bla linjen\") #Blue line\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"sv\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "2321",
    "instruction": "List all English Wikipedia articles about women with a good article badge that do not have a Spanish version.",
    "query": "SELECT DISTINCT ?item ?itemLabel WHERE {\n?featuredArticle schema:about ?item.\n?featuredArticle schema:inLanguage \"en\".\n?featuredArticle wikibase:badge ?insignia.\n?item wdt:P31 wd:Q5 ;\nwdt:P21 wd:Q6581072 .\nVALUES (?insignia) {\n(wd:Q17437796)\n(wd:Q17437798)\n}\nOPTIONAL {\n?esp schema:about ?item.\n?esp schema:inLanguage \"es\".\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"es,en\". }\nFILTER(!BOUND(?esp))\n}\nORDER BY ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel WHERE {\n?featuredArticle schema:about ?item.\n?featuredArticle schema:inLanguage \"en\".\n?featuredArticle wikibase:badge ?insignia.\n?item wdt:[property:instance of] wd:[entity:human] ;\nwdt:[property:sex or gender] wd:[entity:female] .\nVALUES (?insignia) {\n(wd:[entity:featured article badge])\n(wd:[entity:good article badge])\n}\nOPTIONAL {\n?esp schema:about ?item.\n?esp schema:inLanguage \"es\".\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"es,en\". }\nFILTER(!BOUND(?esp))\n}\nORDER BY ?itemLabel",
    "complexity": "complex"
  },
  {
    "id": "473",
    "instruction": "What are the maximum and minimum latitudes and longitudes for places in Paris?",
    "query": "SELECT (COUNT(?a) AS ?count) (MIN(?lat) AS ?min_lat) (MIN(?long) AS ?min_long) (MAX(?lat) AS ?max_lat) (MAX(?long) AS ?max_long) WHERE {\n?a wdt:P131+ wd:Q90 . # administrative territorial entity = Paris\n?a p:P625 ?statement . # coordinate-location statement\n?statement psv:P625 ?coordinate_node .\n?coordinate_node wikibase:geoLatitude ?lat .\n?coordinate_node wikibase:geoLongitude ?long .\n{\nSELECT ?a (COUNT(?a) AS ?count_stmt) WHERE {\n?a wdt:P131+ wd:Q90 .\n?a p:P625 ?statement\n} GROUP BY ?a HAVING (?count_stmt < 2)\n}\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT (COUNT(?a) AS ?count) (MIN(?lat) AS ?min_lat) (MIN(?long) AS ?min_long) (MAX(?lat) AS ?max_lat) (MAX(?long) AS ?max_long) WHERE {\n?a wdt:[property:located in the administrative territorial entity]+ wd:[entity:Paris] . # administrative territorial entity = Paris\n?a p:[property:coordinate location] ?statement . # coordinate-location statement\n?statement psv:[property:coordinate location] ?coordinate_node .\n?coordinate_node wikibase:geoLatitude ?lat .\n?coordinate_node wikibase:geoLongitude ?long .\n{\nSELECT ?a (COUNT(?a) AS ?count_stmt) WHERE {\n?a wdt:[property:located in the administrative territorial entity]+ wd:[entity:Paris] .\n?a p:[property:coordinate location] ?statement\n} GROUP BY ?a HAVING (?count_stmt < 2)\n}\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n}",
    "complexity": "complex"
  },
  {
    "id": "2511",
    "instruction": "What are the things that were created 20 years ago?",
    "query": "SELECT ?thing ?thingLabel WHERE {\nhint:Query hint:optimizer \"None\".\nBIND(NOW() - \"P20Y\"^^xsd:duration AS ?thenPrecise)\nBIND(STRDT(REPLACE(STR(?thenPrecise), \"T.*\", \"T00:00:00Z\"), xsd:dateTime) AS ?then)\n?thing p:P571|p:P580 [\npsv:P571|psv:P580 [\nwikibase:timeValue ?then;\nwikibase:timePrecision 11 # day\n];\na wikibase:BestRank\n].\nMINUS { ?thing wdt:P576|wdt:P582 ?end. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX hint: <http://www.bigdata.com/queryHints#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?thing ?thingLabel WHERE {\nhint:Query hint:optimizer \"None\".\nBIND(NOW() - \"P20Y\"^^xsd:duration AS ?thenPrecise)\nBIND(STRDT(REPLACE(STR(?thenPrecise), \"T.*\", \"T00:00:00Z\"), xsd:dateTime) AS ?then)\n?thing p:[property:inception]|p:[property:start time] [\npsv:[property:inception]|psv:[property:start time] [\nwikibase:timeValue ?then;\nwikibase:timePrecision 11 # day\n];\na wikibase:BestRank\n].\nMINUS { ?thing wdt:[property:dissolved, abolished or demolished date]|wdt:[property:end time] ?end. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "1481",
    "instruction": "List flags with more than 5 stars.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?jurisdictionLabel ?count ?image WHERE {\n?item wdt:P31/wdt:P279* wd:Q14660 ;\nwdt:P18 ?image ;\nwdt:P1001 ?jurisdiction ;\np:P180 ?statement .\n?statement ps:P180/wdt:P279* wd:Q836708 ;\npq:P1114 ?count .\nFILTER ( ?count >= 5 )\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} ORDER BY DESC(?count) ?jurisdictionLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?jurisdictionLabel ?count ?image WHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:flag] ;\nwdt:[property:image] ?image ;\nwdt:[property:applies to jurisdiction] ?jurisdiction ;\np:[property:image]0 ?statement .\n?statement ps:[property:image]0/wdt:[property:subclass of]* wd:[entity:star polygon] ;\npq:[property:quantity] ?count .\nFILTER ( ?count >= 5 )\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} ORDER BY DESC(?count) ?jurisdictionLabel",
    "complexity": "complex"
  },
  {
    "id": "493",
    "instruction": "List authors with a Wikispecies page and their publication count.",
    "query": "SELECT ?author ?authorLabel ?count\nWITH {\nSELECT ?author (COUNT(?paper) AS ?count)\nWHERE {\n?article schema:about ?author ;\nschema:isPartOf <https://species.wikimedia.org/> .\n?author wdt:P31 wd:Q5.\n?paper wdt:P50 ?author.\n}\nGROUP BY ?author\nORDER BY DESC(?count)\nLIMIT 200\n} AS %i\nWHERE {\nINCLUDE %i\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" . }\n}\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?author ?authorLabel ?count\nWITH {\nSELECT ?author (COUNT(?paper) AS ?count)\nWHERE {\n?article schema:about ?author ;\nschema:isPartOf <https://species.wikimedia.org/> .\n?author wdt:[property:instance of] wd:[entity:human].\n?paper wdt:[property:author] ?author.\n}\nGROUP BY ?author\nORDER BY DESC(?count)\nLIMIT 200\n} AS %i\nWHERE {\nINCLUDE %i\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" . }\n}\nORDER BY DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "2032",
    "instruction": "What is the longest time gap between a video game and its direct sequel?",
    "query": "SELECT ?series ?seriesLabel ?years ?interval ?game ?gameLabel ?original_date_game ?sequel ?sequelLabel ?original_date_sequel WHERE {{\nSELECT ?game ?gameLabel (MIN(?game_date) AS ?original_date_game) ?sequel ?sequelLabel (MIN(?sequel_date) AS ?original_date_sequel) ?series ?seriesLabel WHERE {\n?game (wdt:P31/(wdt:P279*)) wd:Q7889; # All video games...\nwdt:P577 ?game_date. # with their publication date(s)...\n{?game p:P179 ?series_statement. # (Unpacking the series statement)\n?series_statement ps:P179 ?series; # ...in a series...\npq:P156 ?sequel. # ...with a sequel...\n} UNION { # ...or...\n?game wdt:P156 ?sequel. # ...with a sequel...\nOPTIONAL {\n?game wdt:P179 ?series # ...maybe with a series\n}}\n?sequel wdt:P577 ?sequel_date. # with its own publication date(s)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }}\nGROUP BY ?game ?gameLabel ?sequel ?sequelLabel ?series ?seriesLabel}\nBIND(?original_date_sequel - ?original_date_game AS ?interval) # Calculating the time gap between the original releases...\nBIND(ROUND(?interval / 365 ) AS ?years) # ...and converting to years, for convenience.\nFILTER(?interval > 0 ) # Only keeping sequels published after (filtering out some bad data)\n}\nORDER BY DESC (?interval)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?series ?seriesLabel ?years ?interval ?game ?gameLabel ?original_date_game ?sequel ?sequelLabel ?original_date_sequel WHERE {{\nSELECT ?game ?gameLabel (MIN(?game_date) AS ?original_date_game) ?sequel ?sequelLabel (MIN(?sequel_date) AS ?original_date_sequel) ?series ?seriesLabel WHERE {\n?game (wdt:[property:instance of]/(wdt:[property:subclass of]*)) wd:[entity:video game]; # All video games...\nwdt:[property:publication date] ?game_date. # with their publication date(s)...\n{?game p:[property:part of the series] ?series_statement. # (Unpacking the series statement)\n?series_statement ps:[property:part of the series] ?series; # ...in a series...\npq:[property:followed by] ?sequel. # ...with a sequel...\n} UNION { # ...or...\n?game wdt:[property:followed by] ?sequel. # ...with a sequel...\nOPTIONAL {\n?game wdt:[property:part of the series] ?series # ...maybe with a series\n}}\n?sequel wdt:[property:publication date] ?sequel_date. # with its own publication date(s)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }}\nGROUP BY ?game ?gameLabel ?sequel ?sequelLabel ?series ?seriesLabel}\nBIND(?original_date_sequel - ?original_date_game AS ?interval) # Calculating the time gap between the original releases...\nBIND(ROUND(?interval / 365 ) AS ?years) # ...and converting to years, for convenience.\nFILTER(?interval > 0 ) # Only keeping sequels published after (filtering out some bad data)\n}\nORDER BY DESC (?interval)",
    "complexity": "complex"
  },
  {
    "id": "1722",
    "instruction": "What are the upcoming figure skating competitions?",
    "query": "SELECT ?competition ?competitionLabel ?date ?end WHERE {\n{ ?competition wdt:P31 wd:Q2990963. }\nUNION\n{\n?competition wdt:P31 wd:Q16510064.\n?competition wdt:P361 ?comp.\n?comp wdt:P31 wd:Q2990963.\n}\nUNION\n{\n?competition wdt:P361 ?segment.\n?segment wdt:P31 wd:Q16510064.\n}\nOPTIONAL { ?competition wdt:P580 ?start. }\nOPTIONAL { ?competition wdt:P582 ?end. }\nOPTIONAL { ?competition wdt:P585 ?pointInTime. }\nBIND(COALESCE(?start, ?pointInTime) AS ?date)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\nFILTER((BOUND(?start)) || (BOUND(?pointInTime)))\nFILTER(?date >= (NOW() - \"P1D\"^^xsd:duration))\n}\nORDER BY ?date",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?competition ?competitionLabel ?date ?end WHERE {\n{ ?competition wdt:[property:instance of] wd:[entity:figure skating competition]. }\nUNION\n{\n?competition wdt:[property:instance of] wd:[entity:sporting event].\n?competition wdt:[property:part of] ?comp.\n?comp wdt:[property:instance of] wd:[entity:figure skating competition].\n}\nUNION\n{\n?competition wdt:[property:part of] ?segment.\n?segment wdt:[property:instance of] wd:[entity:sporting event].\n}\nOPTIONAL { ?competition wdt:[property:start time] ?start. }\nOPTIONAL { ?competition wdt:[property:end time] ?end. }\nOPTIONAL { ?competition wdt:[property:point in time] ?pointInTime. }\nBIND(COALESCE(?start, ?pointInTime) AS ?date)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\nFILTER((BOUND(?start)) || (BOUND(?pointInTime)))\nFILTER(?date >= (NOW() - \"P1D\"^^xsd:duration))\n}\nORDER BY ?date",
    "complexity": "complex"
  },
  {
    "id": "1763",
    "instruction": "List all properties with unknown values.",
    "query": "select distinct ?property ?propertyLabel (count(distinct ?item) as ?count)\nwhere { ?item ?property wd:Q24238356 .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} group by ?propertyLabel ?property order by desc(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nselect distinct ?property ?propertyLabel (count(distinct ?item) as ?count)\nwhere { ?item ?property wd:[entity:unknown] .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} group by ?propertyLabel ?property order by desc(?count)",
    "complexity": "complex"
  }
]