[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "2742",
    "instruction": "Show me a map of Welsh parishes with their coordinates.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?coords ?esgobLabel ?layer\nwhere {\n?item wdt:P31 wd:Q102496 .\n?item wdt:P7352 ?id .\n?item wdt:P625 ?coords .\nOPTIONAL { ?item wdt:P708 ?esgob . }\nVALUES ?gender { wd:Q6581097 wd:Q6581072 }\nBIND (\nIF(?esgob = wd:Q3028621, \"St Asaph\",\nIF(?esgob = wd:Q2376211, \"St Davids\",\nIF(?esgob = wd:Q1403394, \"Bangor\",\nIF(?esgob = wd:Q1230651, \"Llandaf\",\n\"\")))) AS ?layer).\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY ?esgobLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?coords ?esgobLabel ?layer\nwhere {\n?item wdt:[property:instance of] wd:[entity:parish] .\n?item wdt:[property:GENUKI ID] ?id .\n?item wdt:[property:coordinate location] ?coords .\nOPTIONAL { ?item wdt:[property:diocese] ?esgob . }\nVALUES ?gender { wd:[entity:male] wd:[entity:female] }\nBIND (\nIF(?esgob = wd:[entity:Diocese of St Asaph], \"St Asaph\",\nIF(?esgob = wd:[entity:Diocese of St David's], \"St Davids\",\nIF(?esgob = wd:[entity:Diocese of Bangor], \"Bangor\",\nIF(?esgob = wd:[entity:Diocese of Llandaff], \"Llandaf\",\n\"\")))) AS ?layer).\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY ?esgobLabel",
    "complexity": "complex"
  },
  {
    "id": "1981",
    "instruction": "List the oldest UK members of parliament at the time of their election.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?start ?parl_start ?age ?dob ?dod WHERE {\nVALUES ?parl {wd:Q16707842 wd:Q18015642 wd:Q18018860}\n?item p:P39 ?pos_stmt .\n?pos_stmt ps:P39 ?pos .\n?pos wdt:P279 ?parl .\nOPTIONAL {\n?pos_stmt pq:P580 ?start .\n}\nOPTIONAL {\n?pos wdt:P571 ?parl_start .\n}\nBIND(COALESCE(?start, ?parl_start) AS ?best_start) .\n?item p:P569 ?dob_stmt .\n?dob_stmt ps:P569 ?dob .\nFILTER(isLiteral(?dob)) .\n?dob_stmt psv:P569/wikibase:timePrecision ?dob_precision .\nFILTER(?dob_precision > 8) .\nBIND (((?best_start - ?dob)/365.24) AS ?age) .\nOPTIONAL {?item wdt:P570 ?dod} .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY DESC(?age)\nLIMIT 200",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?start ?parl_start ?age ?dob ?dod WHERE {\nVALUES ?parl {wd:[entity:Member of Parliament] wd:[entity:Member of Parliament of Great Britain] wd:[entity:Member of Parliament in the Parliament of England]}\n?item p:[property:position held] ?pos_stmt .\n?pos_stmt ps:[property:position held] ?pos .\n?pos wdt:[property:subclass of] ?parl .\nOPTIONAL {\n?pos_stmt pq:[property:start time] ?start .\n}\nOPTIONAL {\n?pos wdt:[property:inception] ?parl_start .\n}\nBIND(COALESCE(?start, ?parl_start) AS ?best_start) .\n?item p:[property:date of birth] ?dob_stmt .\n?dob_stmt ps:[property:date of birth] ?dob .\nFILTER(isLiteral(?dob)) .\n?dob_stmt psv:[property:date of birth]/wikibase:timePrecision ?dob_precision .\nFILTER(?dob_precision > 8) .\nBIND (((?best_start - ?dob)/365.24) AS ?age) .\nOPTIONAL {?item wdt:[property:date of death] ?dod} .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY DESC(?age)\nLIMIT 200",
    "complexity": "complex"
  },
  {
    "id": "822",
    "instruction": "List all economists along with their birthplaces and coordinates.",
    "query": "SELECT ?person ?name ?coord ?place ?birthplace ?birthyear WHERE {\n{?person wdt:P106 wd:Q188094 .} UNION {?person wd:P101 wd:Q8134.}. MINUS {?person wdt:P106 wd:Q188094. ?person wd:P101 wd:Q8134.}\n?person wdt:P19 ?place .\n?place wdt:P625 ?coord .\nOPTIONAL { ?person wdt:P569 ?dob .}.\nBIND(YEAR(?dob) as ?birthyear).\n?person rdfs:label ?name filter (lang(?name) = \"en\")\n?place rdfs:label ?birthplace filter (lang(?birthplace) = \"en\")\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?person ?name ?coord ?place ?birthplace ?birthyear WHERE {\n{?person wdt:[property:occupation] wd:[entity:economist] .} UNION {?person wd:[property:field of work] wd:[entity:economics].}. MINUS {?person wdt:[property:occupation] wd:[entity:economist]. ?person wd:[property:field of work] wd:[entity:economics].}\n?person wdt:[property:place of birth] ?place .\n?place wdt:[property:coordinate location] ?coord .\nOPTIONAL { ?person wdt:[property:date of birth] ?dob .}.\nBIND(YEAR(?dob) as ?birthyear).\n?person rdfs:label ?name filter (lang(?name) = \"en\")\n?place rdfs:label ?birthplace filter (lang(?birthplace) = \"en\")\n}",
    "complexity": "complex"
  },
  {
    "id": "919",
    "instruction": "What are the most common causes of death among noble people?",
    "query": "SELECT ?cause ?causeLabel (COUNT(?person) AS ?count)\nWHERE\n{\n?person wdt:P31 wd:Q5;\nwdt:P509 ?cause;\nwdt:P53 [].\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nGROUP BY ?cause ?causeLabel\nHAVING(?count > 1)\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?cause ?causeLabel (COUNT(?person) AS ?count)\nWHERE\n{\n?person wdt:[property:instance of] wd:[entity:human];\nwdt:[property:cause of death] ?cause;\nwdt:[property:family] [].\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nGROUP BY ?cause ?causeLabel\nHAVING(?count > 1)\nORDER BY DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "1136",
    "instruction": "How many articles about humans are categorized by gender on Welsh Wikipedia?",
    "query": "SELECT ?genderLabel (COUNT(DISTINCT ?article) AS ?count)\nWHERE {\n?item wdt:P31 wd:Q5 .\n?item wdt:P21 ?gender .\n?article schema:about ?item .\n?article schema:isPartOf <https://cy.wikipedia.org/>\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} GROUP BY ?genderLabel\nORDER BY DESC(?linkcount)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?genderLabel (COUNT(DISTINCT ?article) AS ?count)\nWHERE {\n?item wdt:[property:instance of] wd:[entity:human] .\n?item wdt:[property:sex or gender] ?gender .\n?article schema:about ?item .\n?article schema:isPartOf <https://cy.wikipedia.org/>\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} GROUP BY ?genderLabel\nORDER BY DESC(?linkcount)",
    "complexity": "complex"
  },
  {
    "id": "2676",
    "instruction": "What grammatical features are used in French words?",
    "query": "SELECT ?grammaticalFeature ?grammaticalFeatureLabel (COUNT(DISTINCT ?lexeme) AS ?count) (SAMPLE(?lexeme) AS ?sample) {\n?lexeme dct:language wd:Q150 ; ontolex:lexicalForm/wikibase:grammaticalFeature ?grammaticalFeature .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}\nGROUP BY ?grammaticalFeature ?grammaticalFeatureLabel\nORDER BY DESC(?count) ?grammaticalFeatureLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX dct: <http://purl.org/dc/terms/>\nPREFIX ontolex: <http://www.w3.org/ns/lemon/ontolex#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?grammaticalFeature ?grammaticalFeatureLabel (COUNT(DISTINCT ?lexeme) AS ?count) (SAMPLE(?lexeme) AS ?sample) {\n?lexeme dct:language wd:[entity:French] ; ontolex:lexicalForm/wikibase:grammaticalFeature ?grammaticalFeature .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}\nGROUP BY ?grammaticalFeature ?grammaticalFeatureLabel\nORDER BY DESC(?count) ?grammaticalFeatureLabel",
    "complexity": "complex"
  },
  {
    "id": "2624",
    "instruction": "List all French heads of government in chronological order.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?positionLabel ?start ?fonction ?fonctionLabel WHERE {\n?item wdt:P31 wd:Q5;\np:P39 ?position_statement.\n?position_statement ps:P39 ?position;\npq:P580 ?start.\nFILTER(?start >= \"1800-01-01T00:00:00Z\"^^xsd:dateTime)\n?position (wdt:P279*) wd:Q15135541.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\nOPTIONAL { ?item wdt:P39 ?fonction. }\n}\nORDER BY DESC (?start) (?itemLabel)\nLIMIT 10000",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?positionLabel ?start ?fonction ?fonctionLabel WHERE {\n?item wdt:[property:instance of] wd:[entity:human];\np:[property:position held] ?position_statement.\n?position_statement ps:[property:position held] ?position;\npq:[property:start time] ?start.\nFILTER(?start >= \"1800-01-01T00:00:00Z\"^^xsd:dateTime)\n?position (wdt:[property:subclass of]*) wd:[entity:head of government of France].\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\nOPTIONAL { ?item wdt:[property:position held] ?fonction. }\n}\nORDER BY DESC (?start) (?itemLabel)\nLIMIT 10000",
    "complexity": "complex"
  },
  {
    "id": "907",
    "instruction": "List all mountain peaks in the Alps with an elevation of at least 4,000 meters.",
    "query": "SELECT ?item ?itemLabel ?massifLabel ?elevation ?prominence ?isolation ?coords WHERE {\n?item wdt:P361 ?massif .\n?massif wdt:P361* wd:Q1286 .\n?item wdt:P2044 ?elevation .\nOPTIONAL { ?item wdt:P2660 ?prominence . }\nOPTIONAL { ?item wdt:P2659 ?isolation . }\n?item wdt:P625 ?coords .\nFILTER ( ?elevation >= 4000 )\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n}\nORDER BY DESC(?elevation) ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?massifLabel ?elevation ?prominence ?isolation ?coords WHERE {\n?item wdt:[property:part of] ?massif .\n?massif wdt:[property:part of]* wd:[entity:Alps] .\n?item wdt:[property:elevation above sea level] ?elevation .\nOPTIONAL { ?item wdt:[property:topographic prominence] ?prominence . }\nOPTIONAL { ?item wdt:[property:topographic isolation] ?isolation . }\n?item wdt:[property:coordinate location] ?coords .\nFILTER ( ?elevation >= 4000 )\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n}\nORDER BY DESC(?elevation) ?itemLabel",
    "complexity": "complex"
  },
  {
    "id": "2337",
    "instruction": "What are the subclasses of publication?",
    "query": "SELECT ?subclass ?subclassLabel ?class ?classLabel ?depth WHERE\n{\nSERVICE gas:service {\ngas:program gas:gasClass \"com.bigdata.rdf.graph.analytics.BFS\" ; gas:in wd:Q732577 ; gas:linkType wdt:P279 ; gas:traversalDirection \"Reverse\"; gas:out ?subclass ; gas:out1 ?depth ; gas:out2 ?class .\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n} order by ?depth",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\nPREFIX gas: <http://www.bigdata.com/rdf/gas#>\n\nSELECT ?subclass ?subclassLabel ?class ?classLabel ?depth WHERE\n{\nSERVICE gas:service {\ngas:program gas:gasClass \"com.bigdata.rdf.graph.analytics.BFS\" ; gas:in wd:[entity:publication] ; gas:linkType wdt:[property:subclass of] ; gas:traversalDirection \"Reverse\"; gas:out ?subclass ; gas:out1 ?depth ; gas:out2 ?class .\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n} order by ?depth",
    "complexity": "complex"
  },
  {
    "id": "278",
    "instruction": "What are the historical Chinese states in the Imperial period?",
    "query": "SELECT ?dynasty ?dynastyLabel ?start ?end (SAMPLE(?image) AS ?img) WHERE {\n?dynasty wdt:P31 wd:Q50068795;\nwdt:P571 ?start;\nwdt:P576 ?end.\nVALUES ?prop {wdt:P27 wdt:P2348}\nOPTIONAL {?dynasty wdt:P242 ?image}\nOPTIONAL {?thing wdt:P18 ?image;\n?prop ?dynasty}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} GROUP BY ?dynasty ?dynastyLabel ?start ?end\nORDER BY ?start ?end",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?dynasty ?dynastyLabel ?start ?end (SAMPLE(?image) AS ?img) WHERE {\n?dynasty wdt:[property:instance of] wd:[entity:historical Chinese state];\nwdt:[property:inception] ?start;\nwdt:[property:dissolved, abolished or demolished date] ?end.\nVALUES ?prop {wdt:[property:country of citizenship] wdt:[property:time period]}\nOPTIONAL {?dynasty wdt:[property:locator map image] ?image}\nOPTIONAL {?thing wdt:[property:image] ?image;\n?prop ?dynasty}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} GROUP BY ?dynasty ?dynastyLabel ?start ?end\nORDER BY ?start ?end",
    "complexity": "complex"
  },
  {
    "id": "782",
    "instruction": "What are the countries with the largest elevation spans?",
    "query": "SELECT DISTINCT ?item ?itemLabel ?high ?highl ?high_elevation ?low ?lowl ?low_elevation ?span WHERE {\n#?item wdt:P31 wd:Q160016 .\n?item wdt:P610 ?high .\n?item p:P610 ?high_statement .\n{ ?high wdt:P2044 ?high_elevation } UNION { ?high_statement pq:P2044 ?high_elevation }\nOPTIONAL { ?high rdfs:label ?highl filter (lang(?highl) = \"en\") . }\n?item wdt:P1589 ?low .\n?item p:P1589 ?low_statement .\n?low_statement pq:P2044 ?low_elevation .\nOPTIONAL { ?low rdfs:label ?lowl filter (lang(?lowl) = \"en\") . }\nBIND( ?high_elevation - ?low_elevation as ?span )\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n} ORDER BY DESC(?span) DESC(?low_elevation) DESC(?high_elevation) ?high ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?high ?highl ?high_elevation ?low ?lowl ?low_elevation ?span WHERE {\n#?item wdt:[property:instance of] wd:[entity:member states of the United Nations] .\n?item wdt:[property:highest point] ?high .\n?item p:[property:highest point] ?high_statement .\n{ ?high wdt:[property:elevation above sea level] ?high_elevation } UNION { ?high_statement pq:[property:elevation above sea level] ?high_elevation }\nOPTIONAL { ?high rdfs:label ?highl filter (lang(?highl) = \"en\") . }\n?item wdt:[property:lowest point] ?low .\n?item p:[property:lowest point] ?low_statement .\n?low_statement pq:[property:elevation above sea level] ?low_elevation .\nOPTIONAL { ?low rdfs:label ?lowl filter (lang(?lowl) = \"en\") . }\nBIND( ?high_elevation - ?low_elevation as ?span )\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n} ORDER BY DESC(?span) DESC(?low_elevation) DESC(?high_elevation) ?high ?itemLabel",
    "complexity": "complex"
  },
  {
    "id": "2564",
    "instruction": "List all free software licenses used in describing software.",
    "query": "SELECT ?licenseLabel (count(DISTINCT ?software) as ?count)\nWITH {\nSELECT ?software ?license WHERE {\n?license wdt:P31/wdt:P279* wd:Q3943414.\n?software wdt:P31/wdt:P279* wd:Q7397;\nwdt:P275 ?license.\n}\n} AS %result\nWHERE {\nINCLUDE %result\n?license rdfs:label ?licenseLabel. FILTER(lang(?licenseLabel)=\"en\")\n}\nGROUP BY ?licenseLabel\nORDER by DESC(?count)",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?licenseLabel (count(DISTINCT ?software) as ?count)\nWITH {\nSELECT ?software ?license WHERE {\n?license wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:free software license].\n?software wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:software];\nwdt:[property:copyright license] ?license.\n}\n} AS %result\nWHERE {\nINCLUDE %result\n?license rdfs:label ?licenseLabel. FILTER(lang(?licenseLabel)=\"en\")\n}\nGROUP BY ?licenseLabel\nORDER by DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "2396",
    "instruction": "List the percentage of female Nobel Prize winners by decade.",
    "query": "SELECT ?decade (SUM(?female) AS ?count_females) (SUM(?male) AS ?count_males) (COUNT(*) AS ?count) ((100 * ?count_females) / ?count AS ?share_female) WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n?award wdt:P279 wd:Q7191.\n?item p:P166 _:b1;\nwdt:P21 ?gender.\n_:b1 ps:P166 ?award;\npq:P585 ?date.\nBIND(CONCAT(STR(ROUND((YEAR(?date)) / 10 )), \"0\") AS ?decade)\nBIND(IF(?gender IN(wd:Q6581097, wd:Q2449503), 1 , 0 ) AS ?male)\nBIND(IF(?gender IN(wd:Q6581072, wd:Q1052281), 1 , 0 ) AS ?female)\n}\nGROUP BY ?decade\nORDER BY DESC (?decade)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?decade (SUM(?female) AS ?count_females) (SUM(?male) AS ?count_males) (COUNT(*) AS ?count) ((100 * ?count_females) / ?count AS ?share_female) WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n?award wdt:[property:subclass of] wd:[entity:Nobel Prize].\n?item p:[property:award received] _:b1;\nwdt:[property:sex or gender] ?gender.\n_:b1 ps:[property:award received] ?award;\npq:[property:point in time] ?date.\nBIND(CONCAT(STR(ROUND((YEAR(?date)) / 10 )), \"0\") AS ?decade)\nBIND(IF(?gender IN(wd:[entity:male], wd:[entity:trans man]), 1 , 0 ) AS ?male)\nBIND(IF(?gender IN(wd:[entity:female], wd:[entity:trans woman]), 1 , 0 ) AS ?female)\n}\nGROUP BY ?decade\nORDER BY DESC (?decade)",
    "complexity": "complex"
  },
  {
    "id": "1647",
    "instruction": "What is the lowest recorded temperature on Earth?",
    "query": "SELECT ?degrees_Celsius ?degrees_Fahrenheit ?item ?itemLabel ?location ?locationLabel ?date ?coor ?layer\nWHERE\n{\n?item p:P7422 ?st .\n{\n?st psv:P7422 [ wikibase:quantityAmount ?degrees_Celsius ; wikibase:quantityUnit wd:Q25267 ]\nBIND ( ROUND ( ?degrees_Celsius * 1.8 + 32 ) as ?degrees_Fahrenheit )\n}\nUNION\n{\n?st psv:P7422 [ wikibase:quantityAmount ?degrees_Fahrenheit ; wikibase:quantityUnit wd:Q42289 ]\nBIND( ROUND( ( ?degrees_Fahrenheit - 32 ) / 1.8 * 10)/10 as ?degrees_Celsius )\n}\nOPTIONAL { ?st pq:P276 ?location OPTIONAL { ?location wdt:P625 ?coor0 } }\nOPTIONAL { ?st pq:P585 ?date }\nOPTIONAL { ?item wdt:P625 ?coor1 }\nBIND( COALESCE(?coor0, ?coor1) as ?coor)\nBIND( CONCAT(str(Floor(?degrees_Celsius / 10)),\"0s degC\") as ?layer)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}\nORDER BY ASC(?degrees_Celsius)\nLIMIT 1000",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?degrees_Celsius ?degrees_Fahrenheit ?item ?itemLabel ?location ?locationLabel ?date ?coor ?layer\nWHERE\n{\n?item p:[property:minimum temperature record] ?st .\n{\n?st psv:[property:minimum temperature record] [ wikibase:quantityAmount ?degrees_Celsius ; wikibase:quantityUnit wd:[entity:degree Celsius] ]\nBIND ( ROUND ( ?degrees_Celsius * 1.8 + 32 ) as ?degrees_Fahrenheit )\n}\nUNION\n{\n?st psv:[property:minimum temperature record] [ wikibase:quantityAmount ?degrees_Fahrenheit ; wikibase:quantityUnit wd:[entity:degree Fahrenheit] ]\nBIND( ROUND( ( ?degrees_Fahrenheit - 32 ) / 1.8 * 10)/10 as ?degrees_Celsius )\n}\nOPTIONAL { ?st pq:[property:location] ?location OPTIONAL { ?location wdt:[property:coordinate location] ?coor0 } }\nOPTIONAL { ?st pq:[property:point in time] ?date }\nOPTIONAL { ?item wdt:[property:coordinate location] ?coor1 }\nBIND( COALESCE(?coor0, ?coor1) as ?coor)\nBIND( CONCAT(str(Floor(?degrees_Celsius / 10)),\"0s degC\") as ?layer)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}\nORDER BY ASC(?degrees_Celsius)\nLIMIT 1000",
    "complexity": "complex"
  },
  {
    "id": "2640",
    "instruction": "List the chemical structures found in ocean organisms like fish, cyanobacteria, and corals.",
    "query": "SELECT DISTINCT ?structure ?structureLabel ?structure_smiles ?reference ?referenceLabel ?reference_doi\nWITH {\nSELECT ?child WHERE {\nVALUES ?taxon {\nwd:Q152 # fishes\nwd:Q93315 # cyanobacteria\nwd:Q103169 # red algae\nwd:Q264543 # chlorohyta\nwd:Q18960 # sponges\nwd:Q28524 # corals\n}\n?child (wdt:P171*) ?taxon.\n}\n}\nAS %child\nWHERE {\nINCLUDE %child\n?structure wdt:P233 ?structure_smiles;\np:P703[\nps:P703 ?child;\n(prov:wasDerivedFrom/pr:P248) ?reference ].\n?reference wdt:P356 ?reference_doi.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX prov: <http://www.w3.org/ns/prov#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pr: <http://www.wikidata.org/prop/reference/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?structure ?structureLabel ?structure_smiles ?reference ?referenceLabel ?reference_doi\nWITH {\nSELECT ?child WHERE {\nVALUES ?taxon {\nwd:[entity:fish] # fishes\nwd:[entity:Cyanobacteria] # cyanobacteria\nwd:[entity:Rhodophyta] # red algae\nwd:[entity:Chlorophyta] # chlorohyta\nwd:[entity:Porifera] # sponges\nwd:[entity:Anthozoa] # corals\n}\n?child (wdt:[property:parent taxon]*) ?taxon.\n}\n}\nAS %child\nWHERE {\nINCLUDE %child\n?structure wdt:[property:canonical SMILES] ?structure_smiles;\np:[property:found in taxon][\nps:[property:found in taxon] ?child;\n(prov:wasDerivedFrom/pr:[property:stated in]) ?reference ].\n?reference wdt:[property:DOI] ?reference_doi.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "1805",
    "instruction": "List all organizations affiliated with Peace Action in the USA.",
    "query": "SELECT ?item ?itemLabel ?localeLabel ?inception ?official_website ?Twitter_username ?image WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?item wdt:P1416 wd:Q7157308.\nOPTIONAL { ?item wdt:P856 ?official_website. }\nOPTIONAL {\n?item (wdt:P131/(wdt:P131*)) ?locale.\n?locale wdt:P31 wd:Q35657.\n}\nOPTIONAL { ?item wdt:P2002 ?Twitter_username. }\nOPTIONAL { ?item wdt:P571 ?inception. }\nOPTIONAL { ?item wdt:P18 ?image. }\n}\nORDER BY (?localeLabel)\nLIMIT 1000",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?localeLabel ?inception ?official_website ?Twitter_username ?image WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?item wdt:[property:affiliation] wd:[entity:Peace Action].\nOPTIONAL { ?item wdt:[property:official website] ?official_website. }\nOPTIONAL {\n?item (wdt:[property:located in the administrative territorial entity]/(wdt:[property:located in the administrative territorial entity]*)) ?locale.\n?locale wdt:[property:instance of] wd:[entity:U.S. state].\n}\nOPTIONAL { ?item wdt:[property:Twitter (X) username] ?Twitter_username. }\nOPTIONAL { ?item wdt:[property:inception] ?inception. }\nOPTIONAL { ?item wdt:[property:image] ?image. }\n}\nORDER BY (?localeLabel)\nLIMIT 1000",
    "complexity": "complex"
  },
  {
    "id": "792",
    "instruction": "List all museums in Barcelona along with their coordinates.",
    "query": "SELECT DISTINCT ?item ?name ?coord ?lat ?lon WHERE {\n?item wdt:P131* wd:Q1492 .\n?item wdt:P31/wdt:P279* wd:Q33506 .\n?item wdt:P625 ?coord .\n?item p:P625 ?coordinate .\n?coordinate psv:P625 ?coordinate_node .\n?coordinate_node wikibase:geoLatitude ?lat .\n?coordinate_node wikibase:geoLongitude ?lon .\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"ca\" .\n?item rdfs:label ?name\n}\n}\nORDER BY ASC (?name)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?name ?coord ?lat ?lon WHERE {\n?item wdt:[property:located in the administrative territorial entity]* wd:[entity:Barcelona] .\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:museum] .\n?item wdt:[property:coordinate location] ?coord .\n?item p:[property:coordinate location] ?coordinate .\n?coordinate psv:[property:coordinate location] ?coordinate_node .\n?coordinate_node wikibase:geoLatitude ?lat .\n?coordinate_node wikibase:geoLongitude ?lon .\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"ca\" .\n?item rdfs:label ?name\n}\n}\nORDER BY ASC (?name)",
    "complexity": "complex"
  },
  {
    "id": "2528",
    "instruction": "List the first women who practiced a particular sport.",
    "query": "select ?sportswoman ?sportswomanLabel ?professionLabel ?first with {\nselect distinct ?profession where {\n?profession wdt:P279* wd:Q2066131 .\n} } as %sport_professions with {\nselect ?sportswoman ?profession ?date_of_birth where {\ninclude %sport_professions\n?sportswoman wdt:P21 wd:Q6581072 .\n?sportswoman wdt:P569 ?date_of_birth .\n?sportswoman wdt:P106 ?profession .\n} } as %sportswomen with {\nselect ?profession (MIN(?date_of_birth) as ?first) where {\ninclude %sportswomen\n} group by ?profession } as %world_firsts with {\nselect ?sportswoman ?profession ?first where {\ninclude %sportswomen\ninclude %world_firsts\nFILTER( ?first = ?date_of_birth && BOUND(?profession))\n} } as %final_results where {\ninclude %final_results\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nselect ?sportswoman ?sportswomanLabel ?professionLabel ?first with {\nselect distinct ?profession where {\n?profession wdt:[property:subclass of]* wd:[entity:athlete] .\n} } as %sport_professions with {\nselect ?sportswoman ?profession ?date_of_birth where {\ninclude %sport_professions\n?sportswoman wdt:[property:sex or gender] wd:[entity:female] .\n?sportswoman wdt:[property:date of birth] ?date_of_birth .\n?sportswoman wdt:[property:occupation] ?profession .\n} } as %sportswomen with {\nselect ?profession (MIN(?date_of_birth) as ?first) where {\ninclude %sportswomen\n} group by ?profession } as %world_firsts with {\nselect ?sportswoman ?profession ?first where {\ninclude %sportswomen\ninclude %world_firsts\nFILTER( ?first = ?date_of_birth && BOUND(?profession))\n} } as %final_results where {\ninclude %final_results\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "83",
    "instruction": "List works with a first line in a different language than the original work.",
    "query": "SELECT ?work ?workLabel ?authorLabel ?langLabel ?langlineLabel WHERE {\n?work wdt:P1922 ?line;\nwdt:P407 ?lang\nOPTIONAL {?work wdt:P50 ?author}\nBIND(lang(?line) AS ?langlinecode)\n?langline wdt:P218 ?langlinecode\nFILTER (?langline != ?lang)\nSERVICE wikibase:label {bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,de,fr,ru\"}\n} ORDER BY ?langLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?work ?workLabel ?authorLabel ?langLabel ?langlineLabel WHERE {\n?work wdt:[property:first line] ?line;\nwdt:[property:language of work or name] ?lang\nOPTIONAL {?work wdt:[property:author] ?author}\nBIND(lang(?line) AS ?langlinecode)\n?langline wdt:[property:ISO 639-1 code] ?langlinecode\nFILTER (?langline != ?lang)\nSERVICE wikibase:label {bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,de,fr,ru\"}\n} ORDER BY ?langLabel",
    "complexity": "complex"
  },
  {
    "id": "1738",
    "instruction": "List all places within Scottish local government areas.",
    "query": "select ?item ?itemLabel ?coords ?elseLabel (?else as ?layer)\nwhere {\n?item wdt:P131 ?else . ?else wdt:P131+ wd:Q22 .\n?item wdt:P625 ?coords .\nfilter not exists { ?item wdt:P131 ?else2 . filter(str(?else2) != str(?else)) }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". } }\n#defaultView:Map",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nselect ?item ?itemLabel ?coords ?elseLabel (?else as ?layer)\nwhere {\n?item wdt:[property:located in the administrative territorial entity] ?else . ?else wdt:[property:located in the administrative territorial entity]+ wd:[entity:Scotland] .\n?item wdt:[property:coordinate location] ?coords .\nfilter not exists { ?item wdt:[property:located in the administrative territorial entity] ?else2 . filter(str(?else2) != str(?else)) }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". } }\n#defaultView:Map",
    "complexity": "complex"
  }
]