[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "2788",
    "instruction": "List the number of composers born in each province of Spain, along with their birth year.",
    "query": "SELECT ?year (COUNT(?herrialdea) AS ?count) (SAMPLE(?herrialdeaLabel) AS ?label) WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"eu,es,fr,en\". }\n?Bertsosaio wdt:P31 wd:Q8247090.\n?Bertsosaio wdt:P710 ?bertsolari.\n?bertsolari wdt:P19 ?jaiolekua.\n?jaiolekua (wdt:P131*) ?herrialdea.\n{?herrialdea wdt:P31 wd:Q162620.}\nUNION\n{?herrialdea wdt:P31 wd:Q34876.}\n?Bertsosaio wdt:P582 ?data.\nBIND(STR(YEAR(?data)) AS ?year)\n?herrialdea rdfs:label ?herrialdeaLabel FILTER((LANG(?herrialdeaLabel)) = \"eu\") .\n}\nGROUP BY ?herrialdeaLabel ?year",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?year (COUNT(?herrialdea) AS ?count) (SAMPLE(?herrialdeaLabel) AS ?label) WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"eu,es,fr,en\". }\n?Bertsosaio wdt:[property:instance of] wd:[entity:Bertsolari Txapelketa Nagusia].\n?Bertsosaio wdt:[property:participant] ?bertsolari.\n?bertsolari wdt:[property:place of birth] ?jaiolekua.\n?jaiolekua (wdt:[property:located in the administrative territorial entity]*) ?herrialdea.\n{?herrialdea wdt:[property:instance of] wd:[entity:province of Spain].}\nUNION\n{?herrialdea wdt:[property:instance of] wd:[entity:province].}\n?Bertsosaio wdt:[property:end time] ?data.\nBIND(STR(YEAR(?data)) AS ?year)\n?herrialdea rdfs:label ?herrialdeaLabel FILTER((LANG(?herrialdeaLabel)) = \"eu\") .\n}\nGROUP BY ?herrialdeaLabel ?year",
    "complexity": "complex"
  },
  {
    "id": "1262",
    "instruction": "List all relationships people have with their spouses besides being a spouse.",
    "query": "SELECT ?property ?propertyLabel ?count WHERE {\n# First find other additional relations and their count:\n{SELECT ?directProperty (COUNT(*) as ?count)\nWHERE {\nBIND( wdt:P26 as ?firstRelation) # spouse; can be changed to anything\n?item ?firstRelation ?item2 .\n?item ?directProperty ?item2\nFILTER(?directProperty != ?firstRelation)\n} GROUP BY ?directProperty\n}\n# Then find the property entity for this relation and fetch its label:\n?property wikibase:directClaim ?directProperty\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?property ?propertyLabel ?count WHERE {\n# First find other additional relations and their count:\n{SELECT ?directProperty (COUNT(*) as ?count)\nWHERE {\nBIND( wdt:[property:spouse] as ?firstRelation) # spouse; can be changed to anything\n?item ?firstRelation ?item2 .\n?item ?directProperty ?item2\nFILTER(?directProperty != ?firstRelation)\n} GROUP BY ?directProperty\n}\n# Then find the property entity for this relation and fetch its label:\n?property wikibase:directClaim ?directProperty\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "1191",
    "instruction": "List the most frequently cited surnames in academic papers.",
    "query": "SELECT\n?count\n?surname ?surnameLabel\nWITH {\nSELECT\n(COUNT(*) AS ?count)\n?surname\nWHERE {\n[] wdt:P2860 / wdt:P50 / wdt:P734 ?surname .\n}\nGROUP BY ?surname\n} AS %results\nWHERE {\nINCLUDE %results\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT\n?count\n?surname ?surnameLabel\nWITH {\nSELECT\n(COUNT(*) AS ?count)\n?surname\nWHERE {\n[] wdt:[property:cites work] / wdt:[property:author] / wdt:[property:family name] ?surname .\n}\nGROUP BY ?surname\n} AS %results\nWHERE {\nINCLUDE %results\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "1660",
    "instruction": "Find all Wikidata items related to Saint George and show their locations on a map.",
    "query": "SELECT ?thing ?label ?img ?loc ?layer ?propertyLabel WHERE {\nVALUES $ST_GEORGE { wd:Q48438 }\n?thing ?p $ST_GEORGE .\n?thing wdt:P18 ?img .\n?thing wdt:P625 ?loc .\n?property wikibase:directClaim ?p . # needed to get property labels\n# does the item have English labels?\nOPTIONAL {\n?thing rdfs:label ?label\nFILTER (LANG(?label) = \"en\")\n}\nBIND(IF(BOUND(?label), \"Items with English Labels\", \"Items without English Labels\") AS ?layer)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?thing ?label ?img ?loc ?layer ?propertyLabel WHERE {\nVALUES $ST_GEORGE { wd:[entity:Saint George] }\n?thing ?p $ST_GEORGE .\n?thing wdt:[property:image] ?img .\n?thing wdt:[property:coordinate location] ?loc .\n?property wikibase:directClaim ?p . # needed to get property labels\n# does the item have English labels?\nOPTIONAL {\n?thing rdfs:label ?label\nFILTER (LANG(?label) = \"en\")\n}\nBIND(IF(BOUND(?label), \"Items with English Labels\", \"Items without English Labels\") AS ?layer)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "2786",
    "instruction": "List all notable pairs of doctoral students and their advisors where at least one of them is part of the NZThesisProject.",
    "query": "SELECT DISTINCT ?person1 ?person2 ?person1Label ?person2Label ?person1wp ?person2wp WHERE {\n?person1 wdt:P5008 wd:Q111645234 . #person1 is in NZThesisProject and has enWp page\n?person1 wdt:P31 wd:Q5 .\n?person1wp schema:about ?person1;\nschema:isPartOf <https://en.wikipedia.org/>.\n?person2 wdt:P31 wd:Q5 . #person2 is human and has enWp page\n?person2wp schema:about ?person2;\nschema:isPartOf <https://en.wikipedia.org/>.\n{?person1 wdt:P184 ?person2 } #person1 is doctoral advisor of person2\nUNION\n{?person2 wdt:P184 ?person1 } #person2 is doctoral advisor of person1\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY (?person1Label)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?person1 ?person2 ?person1Label ?person2Label ?person1wp ?person2wp WHERE {\n?person1 wdt:[property:on focus list of Wikimedia project] wd:[entity:NZThesisProject] . #person1 is in NZThesisProject and has enWp page\n?person1 wdt:[property:instance of] wd:[entity:human] .\n?person1wp schema:about ?person1;\nschema:isPartOf <https://en.wikipedia.org/>.\n?person2 wdt:[property:instance of] wd:[entity:human] . #person2 is human and has enWp page\n?person2wp schema:about ?person2;\nschema:isPartOf <https://en.wikipedia.org/>.\n{?person1 wdt:[property:doctoral advisor] ?person2 } #person1 is doctoral advisor of person2\nUNION\n{?person2 wdt:[property:doctoral advisor] ?person1 } #person2 is doctoral advisor of person1\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY (?person1Label)",
    "complexity": "complex"
  },
  {
    "id": "1192",
    "instruction": "Find the birthplaces of people who have had species named after them on a map.",
    "query": "SELECT ?person ?personLabel ?taxon ?taxonLabel ?rank ?rankLabel ?geoloc ?personimage ?taxonimage ?pob ?pobLabel WHERE {\n?person wdt:P31 wd:Q5 ;\nwdt:P19 ?pob .\n?taxon wdt:P31 wd:Q16521 ;\nwdt:P225 ?taxonname ;\nwdt:P105 ?rank ;\nwdt:P138 ?person .\n?pob wdt:P625 ?geoloc .\nOPTIONAL { ?person wdt:P18 ?personimage }\nOPTIONAL { ?taxon wdt:P18 ?taxonimage }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?person ?personLabel ?taxon ?taxonLabel ?rank ?rankLabel ?geoloc ?personimage ?taxonimage ?pob ?pobLabel WHERE {\n?person wdt:[property:instance of] wd:[entity:human] ;\nwdt:[property:place of birth] ?pob .\n?taxon wdt:[property:instance of] wd:[entity:taxon] ;\nwdt:[property:taxon name] ?taxonname ;\nwdt:[property:taxon rank] ?rank ;\nwdt:[property:named after] ?person .\n?pob wdt:[property:coordinate location] ?geoloc .\nOPTIONAL { ?person wdt:[property:image] ?personimage }\nOPTIONAL { ?taxon wdt:[property:image] ?taxonimage }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "2555",
    "instruction": "List the Olympic gold medal winners by their age.",
    "query": "SELECT DISTINCT ?winner ?winnerLabel ?sport ?sportLabel ?eventTime ?age WHERE {\n?winner wdt:P31 wd:Q5;\nwdt:P569 ?dob.\nMINUS { ?winner p:P569/psv:P569 [\nwikibase:timePrecision \"7\"^^xsd:integer ; # Century\nwikibase:timeValue ?dob] } # Meant to remove those born \"19th century\"\nFILTER (! wikibase:isSomeValue(?dob) ) # Removes those with unknown birth date\n?sport wdt:P1346 ?winner ;\nwdt:P31 wd:Q18536594.\n# Work-around due to inconsistent modeling of the time of events\nOPTIONAL { ?sport wdt:P585 ?eventPoint }\nOPTIONAL { ?sport wdt:P582 ?eventEnd }\nOPTIONAL { ?sport wdt:P361/wdt:P585 ?olympicPoint }\nBIND(COALESCE(?eventEnd,?eventPoint,?olympicPoint) AS ?eventTime)\n# Quick and dirty way to calculate age\nBIND ((ROUND(((?eventTime - ?dob)/3.6524))/100) AS ?age )\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n} ORDER BY ?age",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?winner ?winnerLabel ?sport ?sportLabel ?eventTime ?age WHERE {\n?winner wdt:[property:instance of] wd:[entity:human];\nwdt:[property:date of birth] ?dob.\nMINUS { ?winner p:[property:date of birth]/psv:[property:date of birth] [\nwikibase:timePrecision \"7\"^^xsd:integer ; # Century\nwikibase:timeValue ?dob] } # Meant to remove those born \"19th century\"\nFILTER (! wikibase:isSomeValue(?dob) ) # Removes those with unknown birth date\n?sport wdt:[property:winner] ?winner ;\nwdt:[property:instance of] wd:[entity:Olympic sporting event].\n# Work-around due to inconsistent modeling of the time of events\nOPTIONAL { ?sport wdt:[property:point in time] ?eventPoint }\nOPTIONAL { ?sport wdt:[property:end time] ?eventEnd }\nOPTIONAL { ?sport wdt:[property:part of]/wdt:[property:point in time] ?olympicPoint }\nBIND(COALESCE(?eventEnd,?eventPoint,?olympicPoint) AS ?eventTime)\n# Quick and dirty way to calculate age\nBIND ((ROUND(((?eventTime - ?dob)/3.6524))/100) AS ?age )\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n} ORDER BY ?age",
    "complexity": "complex"
  },
  {
    "id": "1288",
    "instruction": "What are the most common properties used to describe cats in Wikidata?",
    "query": "SELECT ?prop ?propLabel ?count WHERE {\n{\nSELECT ?prop (COUNT(DISTINCT ?item) AS ?count) WHERE {\nhint:Query hint:optimizer \"None\" .\n?item wdt:P31 wd:Q146 .\n?item ?p ?id .\n?prop wikibase:directClaim ?p .\n} GROUP BY ?prop\n}\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n} ORDER BY DESC (?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX hint: <http://www.bigdata.com/queryHints#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?prop ?propLabel ?count WHERE {\n{\nSELECT ?prop (COUNT(DISTINCT ?item) AS ?count) WHERE {\nhint:Query hint:optimizer \"None\" .\n?item wdt:[property:instance of] wd:[entity:house cat] .\n?item ?p ?id .\n?prop wikibase:directClaim ?p .\n} GROUP BY ?prop\n}\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n} ORDER BY DESC (?count)",
    "complexity": "complex"
  },
  {
    "id": "1044",
    "instruction": "Find the list of people who held a position as head of state or government and have an Erd\u0151s number.",
    "query": "SELECT ?person ?personLabel ?positionLabel ?erdos_number WHERE {\n?person wdt:P31 wd:Q5 ;\nwdt:P39 ?position ;\nwdt:P2021 ?erdos_number .\n{ ?position wdt:P279* wd:Q48352 . } UNION\n{ ?position wdt:P279* wd:Q2285706 . }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} ORDER BY ASC(?erdos_number) ?personLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?person ?personLabel ?positionLabel ?erdos_number WHERE {\n?person wdt:[property:instance of] wd:[entity:human] ;\nwdt:[property:position held] ?position ;\nwdt:[property:Erd\u0151s number] ?erdos_number .\n{ ?position wdt:[property:subclass of]* wd:[entity:head of state] . } UNION\n{ ?position wdt:[property:subclass of]* wd:[entity:head of government] . }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} ORDER BY ASC(?erdos_number) ?personLabel",
    "complexity": "complex"
  },
  {
    "id": "2352",
    "instruction": "What are the most common instances of featured articles on fr.wikipedia.org?",
    "query": "SELECT ?instance ?instanceLabel (COUNT(*) AS ?count) WHERE {\nSERVICE wikibase:mwapi {\nbd:serviceParam wikibase:endpoint \"fr.wikipedia.org\";\nwikibase:api \"Generator\";\nmwapi:generator \"categorymembers\";\nmwapi:gcmtitle \"Categorie:Article de qualite\";\nmwapi:gcmprop \"title\".\n?item wikibase:apiOutputItem mwapi:item.\n?title wikibase:apiOutput mwapi:title .\n?namespace wikibase:apiOutput \"@ns\" .\n}\nFILTER (?namespace = \"0\")\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?item wdt:P31 ?instance .\n}\nGROUP BY ?instance ?instanceLabel\nORDER BY DESC(?count )",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?instance ?instanceLabel (COUNT(*) AS ?count) WHERE {\nSERVICE wikibase:mwapi {\nbd:serviceParam wikibase:endpoint \"fr.wikipedia.org\";\nwikibase:api \"Generator\";\nmwapi:generator \"categorymembers\";\nmwapi:gcmtitle \"Categorie:Article de qualite\";\nmwapi:gcmprop \"title\".\n?item wikibase:apiOutputItem mwapi:item.\n?title wikibase:apiOutput mwapi:title .\n?namespace wikibase:apiOutput \"@ns\" .\n}\nFILTER (?namespace = \"0\")\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?item wdt:[property:instance of] ?instance .\n}\nGROUP BY ?instance ?instanceLabel\nORDER BY DESC(?count )",
    "complexity": "complex"
  },
  {
    "id": "139",
    "instruction": "List the types of entities that have Twitter accounts.",
    "query": "SELECT ?type ?typeLabel (COUNT(?thing) AS ?things) WHERE {\n?thing wdt:P2002 ?tw;\nwdt:P31 ?type.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} GROUP BY ?type ?typeLabel\nORDER BY DESC(?things)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?type ?typeLabel (COUNT(?thing) AS ?things) WHERE {\n?thing wdt:[property:Twitter (X) username] ?tw;\nwdt:[property:instance of] ?type.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} GROUP BY ?type ?typeLabel\nORDER BY DESC(?things)",
    "complexity": "complex"
  },
  {
    "id": "1596",
    "instruction": "Show me the tram stops in Ulm on a map.",
    "query": "SELECT DISTINCT ?coordinates ?line ?item ?itemLabel ?connectLabel ?image ?code ?rgb\nWITH {\nSELECT ?item (SAMPLE(?coordinates) AS ?coordinates) (SAMPLE(?image) AS ?image) (sample(?lat1) as ?lat1) (sample(?lon1) as ?lon1) (sample(?code) as ?code) WHERE {\n?item wdt:P31 wd:Q2175765.\n?item wdt:P131 wd:Q3012.\n?item wdt:P625 ?coordinates .\n?item p:P625 / psv:P625 / wikibase:geoLatitude ?lat1 .\n?item p:P625 / psv:P625 / wikibase:geoLongitude ?lon1 .\nOPTIONAL { ?item wdt:P18 ?image }.\nOPTIONAL { ?item wdt:P5696 ?code }.\n} GROUP BY ?item\n} AS %stations\nWITH {\nSELECT ?nextstation (sample(?lat2) as ?lat2) (sample(?lon2) as ?lon2) WHERE {\n?nextstation wdt:P31 wd:Q2175765 .\n?nextstation wdt:P131 wd:Q3012 .\n?nextstation p:P625 / psv:P625 / wikibase:geoLatitude ?lat2 .\n?nextstation p:P625 / psv:P625 / wikibase:geoLongitude ?lon2 .\n} GROUP BY ?nextstation\n} AS %nextstations\nWITH {\nSELECT ?line ?connect (\"9B0058\" as ?rgb) WHERE {\nINCLUDE %stations .\nINCLUDE %nextstations .\n?item p:P197 ?nextstationstatement .\n?nextstationstatement ps:P197 ?nextstation .\n?nextstationstatement pq:P81 ?connect .\nFILTER(STR(?item) < STR(?nextstation)) .\nBIND(CONCAT('LINESTRING (', STR(?lon1), ' ', STR(?lat1), ',', STR(?lon2), ' ', STR(?lat2), ')') AS ?str) .\nBIND(STRDT(?str, geo:wktLiteral) AS ?line)\n}\n} AS %lines\nWHERE {\n{ INCLUDE %stations } UNION { INCLUDE %lines } .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?coordinates ?line ?item ?itemLabel ?connectLabel ?image ?code ?rgb\nWITH {\nSELECT ?item (SAMPLE(?coordinates) AS ?coordinates) (SAMPLE(?image) AS ?image) (sample(?lat1) as ?lat1) (sample(?lon1) as ?lon1) (sample(?code) as ?code) WHERE {\n?item wdt:[property:instance of] wd:[entity:tram stop].\n?item wdt:[property:located in the administrative territorial entity] wd:[entity:Ulm].\n?item wdt:[property:coordinate location] ?coordinates .\n?item p:[property:coordinate location] / psv:[property:coordinate location] / wikibase:geoLatitude ?lat1 .\n?item p:[property:coordinate location] / psv:[property:coordinate location] / wikibase:geoLongitude ?lon1 .\nOPTIONAL { ?item wdt:[property:image] ?image }.\nOPTIONAL { ?item wdt:[property:Indian Railways station code] ?code }.\n} GROUP BY ?item\n} AS %stations\nWITH {\nSELECT ?nextstation (sample(?lat2) as ?lat2) (sample(?lon2) as ?lon2) WHERE {\n?nextstation wdt:[property:instance of] wd:[entity:tram stop] .\n?nextstation wdt:[property:located in the administrative territorial entity] wd:[entity:Ulm] .\n?nextstation p:[property:coordinate location] / psv:[property:coordinate location] / wikibase:geoLatitude ?lat2 .\n?nextstation p:[property:coordinate location] / psv:[property:coordinate location] / wikibase:geoLongitude ?lon2 .\n} GROUP BY ?nextstation\n} AS %nextstations\nWITH {\nSELECT ?line ?connect (\"9B0058\" as ?rgb) WHERE {\nINCLUDE %stations .\nINCLUDE %nextstations .\n?item p:[property:adjacent station] ?nextstationstatement .\n?nextstationstatement ps:[property:adjacent station] ?nextstation .\n?nextstationstatement pq:[property:connecting line] ?connect .\nFILTER(STR(?item) < STR(?nextstation)) .\nBIND(CONCAT('LINESTRING (', STR(?lon1), ' ', STR(?lat1), ',', STR(?lon2), ' ', STR(?lat2), ')') AS ?str) .\nBIND(STRDT(?str, geo:wktLiteral) AS ?line)\n}\n} AS %lines\nWHERE {\n{ INCLUDE %stations } UNION { INCLUDE %lines } .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "1427",
    "instruction": "Show me a map of railway things in Berlin.",
    "query": "SELECT ?railwayThing ?geometry (SAMPLE(?label) AS ?label) ?layer WHERE {\nSERVICE <http://linkedgeodata.org/sparql> {\n?railwayThing a lgdo:RailwayThing;\ngeom:geometry [ geo:asWKT ?geometry ].\nFILTER(bif:st_intersects(?geometry, bif:st_point(13.383333, 52.516667), 0.1))\nOPTIONAL { ?railwayThing rdfs:label ?label. }\nOPTIONAL { ?railwayThing a lgdo:Subway. BIND(\"subway\"@en AS ?subway) }\nOPTIONAL { ?railwayThing a lgdo:Rail. BIND(\"rail\"@en AS ?rail) }\nOPTIONAL { ?railwayThing a lgdo:LightRail. BIND(\"light rail\"@en AS ?lightrail) }\nOPTIONAL { ?railwayThing a lgdo:Tramway. BIND(\"tramway\"@en AS ?tramway) }\nOPTIONAL { ?railwayThing a lgdo:Platform. BIND(\"platform\"@en AS ?platform) }\nOPTIONAL { ?railwayThing a lgdo:AbandonedRailway. BIND(\"abandoned railway\"@en AS ?abandoned) }\nOPTIONAL { ?railwayThing a lgdo:HistoricThing. BIND(\"historic\"@en AS ?historic) }\n}\nBIND(COALESCE(?subway, ?lightrail, ?rail, ?tramway, ?platform, ?abandoned, ?historic, \"other\"@en) AS ?layer)\n}\nGROUP BY ?railwayThing ?geometry ?layer",
    "annotated": "PREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX lgdo: <http://linkedgeodata.org/ontology/>\nPREFIX geom: <http://geovocab.org/geometry#>\nPREFIX bif: <http://www.openlinksw.com/schemas/bif#>\n\nSELECT ?railwayThing ?geometry (SAMPLE(?label) AS ?label) ?layer WHERE {\nSERVICE <http://linkedgeodata.org/sparql> {\n?railwayThing a lgdo:RailwayThing;\ngeom:geometry [ geo:asWKT ?geometry ].\nFILTER(bif:st_intersects(?geometry, bif:st_point(13.383333, 52.516667), 0.1))\nOPTIONAL { ?railwayThing rdfs:label ?label. }\nOPTIONAL { ?railwayThing a lgdo:Subway. BIND(\"subway\"@en AS ?subway) }\nOPTIONAL { ?railwayThing a lgdo:Rail. BIND(\"rail\"@en AS ?rail) }\nOPTIONAL { ?railwayThing a lgdo:LightRail. BIND(\"light rail\"@en AS ?lightrail) }\nOPTIONAL { ?railwayThing a lgdo:Tramway. BIND(\"tramway\"@en AS ?tramway) }\nOPTIONAL { ?railwayThing a lgdo:Platform. BIND(\"platform\"@en AS ?platform) }\nOPTIONAL { ?railwayThing a lgdo:AbandonedRailway. BIND(\"abandoned railway\"@en AS ?abandoned) }\nOPTIONAL { ?railwayThing a lgdo:HistoricThing. BIND(\"historic\"@en AS ?historic) }\n}\nBIND(COALESCE(?subway, ?lightrail, ?rail, ?tramway, ?platform, ?abandoned, ?historic, \"other\"@en) AS ?layer)\n}\nGROUP BY ?railwayThing ?geometry ?layer",
    "complexity": "complex"
  },
  {
    "id": "1602",
    "instruction": "List all microscopists along with their birth dates and notable works.",
    "query": "SELECT DISTINCT ?wditem ?wditemLabel ?date ?image ?work ?workLabel WHERE {\nSERVICE <http://dbpedia.org/sparql> {\n?item dct:subject|dct:subject/skos:broader|dct:subject/skos:broader/skos:broader dbc:Microscopists ;\nowl:sameAs ?wditem FILTER regex (?wditem, \"wikidata.org\") .\n}\nSERVICE <https://query.wikidata.org/sparql> {\n{?wditem wdt:P569 ?date .}\n# UNION\n# {?wditem wdt:P571|wdt:P577 ?date .}\nOPTIONAL {?wditem wdt:P800 ?work. ?work rdfs:label ?workLabel FILTER (LANG(?workLabel)=\"en\") .}\nOPTIONAL {?wditem wdt:P18 ?image } .\n?wditem rdfs:label ?wditemLabel FILTER (LANG(?wditemLabel)=\"en\") .\n}\n}",
    "annotated": "PREFIX dct: <http://purl.org/dc/terms/>\nPREFIX owl: <http://www.w3.org/2002/07/owl#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX skos: <http://www.w3.org/2004/02/skos/core#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX dbc: <http://dbpedia.org/resource/Category:>\n\nSELECT DISTINCT ?wditem ?wditemLabel ?date ?image ?work ?workLabel WHERE {\nSERVICE <http://dbpedia.org/sparql> {\n?item dct:subject|dct:subject/skos:broader|dct:subject/skos:broader/skos:broader dbc:Microscopists ;\nowl:sameAs ?wditem FILTER regex (?wditem, \"wikidata.org\") .\n}\nSERVICE <https://query.wikidata.org/sparql> {\n{?wditem wdt:[property:date of birth] ?date .}\n# UNION\n# {?wditem wdt:[property:inception]|wdt:[property:publication date] ?date .}\nOPTIONAL {?wditem wdt:[property:notable work] ?work. ?work rdfs:label ?workLabel FILTER (LANG(?workLabel)=\"en\") .}\nOPTIONAL {?wditem wdt:[property:image] ?image } .\n?wditem rdfs:label ?wditemLabel FILTER (LANG(?wditemLabel)=\"en\") .\n}\n}",
    "complexity": "complex"
  },
  {
    "id": "138",
    "instruction": "List all things situated in cities but are more than 60 kilometers away from them.",
    "query": "SELECT DISTINCT ?thing ?thingLabel ?city ?cityLabel ?distnum WHERE {\n?thing wdt:P131 ?city; wdt:P625 ?thingloc.\n?city wdt:P31 wd:Q515; wdt:P625 ?cityloc.\nBIND(geof:distance(?thingloc, ?cityloc) AS ?distnum)\nFILTER (?distnum > 60)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY DESC(?distnum)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?thing ?thingLabel ?city ?cityLabel ?distnum WHERE {\n?thing wdt:[property:located in the administrative territorial entity] ?city; wdt:[property:coordinate location] ?thingloc.\n?city wdt:[property:instance of] wd:[entity:city]; wdt:[property:coordinate location] ?cityloc.\nBIND(geof:distance(?thingloc, ?cityloc) AS ?distnum)\nFILTER (?distnum > 60)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY DESC(?distnum)",
    "complexity": "complex"
  },
  {
    "id": "1774",
    "instruction": "List languages without lexical entries in Wikidata.",
    "query": "SELECT ?language ?languageLabel ?coord WHERE {\n?language wdt:P31 wd:Q34770 ; wdt:P625 ?coord .\nMINUS { ?l a ontolex:LexicalEntry ; dct:language ?language }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX dct: <http://purl.org/dc/terms/>\nPREFIX ontolex: <http://www.w3.org/ns/lemon/ontolex#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?language ?languageLabel ?coord WHERE {\n?language wdt:[property:instance of] wd:[entity:language] ; wdt:[property:coordinate location] ?coord .\nMINUS { ?l a ontolex:LexicalEntry ; dct:language ?language }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "2328",
    "instruction": "Show me a graph view of US presidents and UK monarchs.",
    "query": "SELECT DISTINCT ?p ?pLabel ?pImage ?m ?mLabel ?mImage\nWITH{SELECT DISTINCT ?m ?m_s ?m_e WHERE{\nINCLUDE %start_US . VALUES $MONARCH{wd:Q116 wd:Q12097 wd:Q16511993} VALUES $GB_UK {wd:Q145 wd:Q174193 wd:Q161885}\n?m wdt:P31 wd:Q5;p:P39 ?ph.?ph pq:P580 ?m_s{?ph ps:P39 wd:Q9134365}UNION{?ph ps:P39 $MONARCH; pq:P642 $GB_UK}\nOPTIONAL{?ph pq:P582 ?m_e}FILTER(?m_s >= ?start_US || ?m_e >= ?start_US)\nBIND(NOW() AS ?today)BIND(COALESCE(?m_e, ?today) as ?m_e)}}AS %monarchs\nWITH{SELECT ?start_US WHERE{?x wdt:P31 wd:Q5;p:P39 ?ph.?ph ps:P39 wd:Q11696;pq:P1545 ?number;pq:P580 ?start_US.\nFILTER(?number = \"1\")}}AS %start_US\nWHERE{INCLUDE %monarchs.\n?p wdt:P31 wd:Q5;p:P39 ?node.?node ps:P39 wd:Q11696;pq:P580 ?p_s;pq:P1545 ?number.OPTIONAL{?node pq:P582 ?p_e}\nBIND(NOW() AS ?today)BIND(COALESCE(?p_e, ?today) as ?p_e)FILTER( (?m_s >= ?p_s && ?m_s <= ?p_e)||(?m_e >= ?p_s && ?m_e <= ?p_e )||(?p_s >= ?m_s && ?p_s <= ?m_e)||(?p_e >= ?m_s && ?p_e <= ?m_e))\nOPTIONAL{?m wdt:P18 ?mImage}BIND(COALESCE(?mImage, <http://commons.wikimedia.org/wiki/Special:FilePath/IIH.png>) as ?mImage)\nOPTIONAL{?p wdt:P18 ?pImage}BIND(COALESCE(?pImage, <http://commons.wikimedia.org/wiki/Special:FilePath/IIH.png>) as ?pImage)\nSERVICE wikibase:label{bd:serviceParam wikibase:language \"en\".}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?p ?pLabel ?pImage ?m ?mLabel ?mImage\nWITH{SELECT DISTINCT ?m ?m_s ?m_e WHERE{\nINCLUDE %start_US . VALUES $MONARCH{wd:[entity:monarch] wd:[entity:king] wd:[entity:queen]} VALUES $GB_UK {wd:[entity:United Kingdom] wd:[entity:United Kingdom of Great Britain and Ireland] wd:[entity:Kingdom of Great Britain]}\n?m wdt:[property:instance of] wd:[entity:human];p:[property:position held] ?ph.?ph pq:[property:start time] ?m_s{?ph ps:[property:position held] wd:[entity:monarch of the United Kingdom]}UNION{?ph ps:[property:position held] $MONARCH; pq:[property:of] $GB_UK}\nOPTIONAL{?ph pq:[property:end time] ?m_e}FILTER(?m_s >= ?start_US || ?m_e >= ?start_US)\nBIND(NOW() AS ?today)BIND(COALESCE(?m_e, ?today) as ?m_e)}}AS %monarchs\nWITH{SELECT ?start_US WHERE{?x wdt:[property:instance of] wd:[entity:human];p:[property:position held] ?ph.?ph ps:[property:position held] wd:[entity:President of the United States];pq:[property:series ordinal] ?number;pq:[property:start time] ?start_US.\nFILTER(?number = \"1\")}}AS %start_US\nWHERE{INCLUDE %monarchs.\n?p wdt:[property:instance of] wd:[entity:human];p:[property:position held] ?node.?node ps:[property:position held] wd:[entity:President of the United States];pq:[property:start time] ?p_s;pq:[property:series ordinal] ?number.OPTIONAL{?node pq:[property:end time] ?p_e}\nBIND(NOW() AS ?today)BIND(COALESCE(?p_e, ?today) as ?p_e)FILTER( (?m_s >= ?p_s && ?m_s <= ?p_e)||(?m_e >= ?p_s && ?m_e <= ?p_e )||(?p_s >= ?m_s && ?p_s <= ?m_e)||(?p_e >= ?m_s && ?p_e <= ?m_e))\nOPTIONAL{?m wdt:[property:image] ?mImage}BIND(COALESCE(?mImage, <http://commons.wikimedia.org/wiki/Special:FilePath/IIH.png>) as ?mImage)\nOPTIONAL{?p wdt:[property:image] ?pImage}BIND(COALESCE(?pImage, <http://commons.wikimedia.org/wiki/Special:FilePath/IIH.png>) as ?pImage)\nSERVICE wikibase:label{bd:serviceParam wikibase:language \"en\".}\n}",
    "complexity": "complex"
  },
  {
    "id": "1431",
    "instruction": "List the properties with the most disputed statements.",
    "query": "SELECT ?property ?propertyLabel (COUNT(?statement) AS ?count) WHERE {\n?property a wikibase:Property;\nwikibase:claim ?p.\n?entity ?p ?statement.\n?statement pq:P1310 [].\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?property ?propertyLabel\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?property ?propertyLabel (COUNT(?statement) AS ?count) WHERE {\n?property a wikibase:Property;\nwikibase:claim ?p.\n?entity ?p ?statement.\n?statement pq:[property:statement disputed by] [].\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?property ?propertyLabel\nORDER BY DESC(?count)",
    "complexity": "complex"
  }
]