[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "1696",
    "instruction": "What is the proportion of female to male organizers at conferences?",
    "query": "SELECT\n(?female_organizers / (?male_organizers + ?female_organizers) AS ?organizer_ratio)\n?female_organizers ?male_organizers\n(?female_authors / (?male_authors + ?female_authors) AS ?author_ratio)\n?female_authors ?male_authors\n?event ?eventLabel ?eventDescription\n{\n{\nSELECT\n?event\n(COUNT(DISTINCT ?male_organizer) AS ?male_organizers)\n(COUNT(DISTINCT ?female_organizer) AS ?female_organizers)\n(COUNT(DISTINCT ?male_author) AS ?male_authors)\n(COUNT(DISTINCT ?female_author) AS ?female_authors)\n{\nVALUES ?event_type { wd:Q2020153 wd:Q40444998 }\n?event wdt:P31 ?event_type .\n?proceedings wdt:P4745 ?event .\n{\n?event wdt:P664 ?male_organizer .\n?male_organizer wdt:P21 wd:Q6581097 .\n}\nUNION\n{\n?event wdt:P664 ?female_organizer .\n?female_organizer wdt:P21 wd:Q6581072 .\n}\n{\n?work wdt:P1433 ?proceedings ; wdt:P50 ?male_author .\n?male_author wdt:P21 wd:Q6581097 .\n}\nUNION\n{\n?work wdt:P1433 ?proceedings ; wdt:P50 ?female_author .\n?female_author wdt:P21 wd:Q6581072 .\n}\n}\nGROUP BY ?event\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?male_organizers)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT\n(?female_organizers / (?male_organizers + ?female_organizers) AS ?organizer_ratio)\n?female_organizers ?male_organizers\n(?female_authors / (?male_authors + ?female_authors) AS ?author_ratio)\n?female_authors ?male_authors\n?event ?eventLabel ?eventDescription\n{\n{\nSELECT\n?event\n(COUNT(DISTINCT ?male_organizer) AS ?male_organizers)\n(COUNT(DISTINCT ?female_organizer) AS ?female_organizers)\n(COUNT(DISTINCT ?male_author) AS ?male_authors)\n(COUNT(DISTINCT ?female_author) AS ?female_authors)\n{\nVALUES ?event_type { wd:[entity:academic conference] wd:[entity:academic workshop] }\n?event wdt:[property:instance of] ?event_type .\n?proceedings wdt:[property:is proceedings from] ?event .\n{\n?event wdt:[property:organizer] ?male_organizer .\n?male_organizer wdt:[property:sex or gender] wd:[entity:male] .\n}\nUNION\n{\n?event wdt:[property:organizer] ?female_organizer .\n?female_organizer wdt:[property:sex or gender] wd:[entity:female] .\n}\n{\n?work wdt:[property:published in] ?proceedings ; wdt:[property:author] ?male_author .\n?male_author wdt:[property:sex or gender] wd:[entity:male] .\n}\nUNION\n{\n?work wdt:[property:published in] ?proceedings ; wdt:[property:author] ?female_author .\n?female_author wdt:[property:sex or gender] wd:[entity:female] .\n}\n}\nGROUP BY ?event\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?male_organizers)",
    "complexity": "complex"
  },
  {
    "id": "1630",
    "instruction": "List all sculptures in Japanese museums created by British artists.",
    "query": "SELECT DISTINCT ?name ?work_link ?work ?creatorLabel ?date\nWITH {\nSELECT ?creator WHERE {\nVALUES ?citizenship {wd:Q145 wd:Q174193} . # UK, Britain & Ireland\n?creator wdt:P6698 []; # Only get things with a Japan Search ID\nwdt:P27 ?citizenship; wdt:P106 wd:Q1281618} # sculptors\n} AS %creators\nWHERE {\ninclude %creators\nSERVICE <https://jpsearch.go.jp/rdf/sparql/> {\n?jps_creator owl:sameAs ?creator . # convert Wikidata ID to Japan Search ID\n?work schema:creator ?jps_creator . # Works by this artist\nOPTIONAL {?work schema:name ?name } # This will return separate names in English and Japanese names\nOPTIONAL {?work schema:dateCreated ?date}\n}\nFILTER (lang(?name)=\"en\") # Show only the English name\nBIND(URI( REPLACE(STR(?work), \"/data/\", \"/item/\") ) AS ?work_link)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY ?date",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX owl: <http://www.w3.org/2002/07/owl#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?name ?work_link ?work ?creatorLabel ?date\nWITH {\nSELECT ?creator WHERE {\nVALUES ?citizenship {wd:[entity:United Kingdom] wd:[entity:United Kingdom of Great Britain and Ireland]} . # UK, Britain & Ireland\n?creator wdt:[property:Japan Search name ID] []; # Only get things with a Japan Search ID\nwdt:[property:country of citizenship] ?citizenship; wdt:[property:occupation] wd:[entity:sculptor]} # sculptors\n} AS %creators\nWHERE {\ninclude %creators\nSERVICE <https://jpsearch.go.jp/rdf/sparql/> {\n?jps_creator owl:sameAs ?creator . # convert Wikidata ID to Japan Search ID\n?work schema:creator ?jps_creator . # Works by this artist\nOPTIONAL {?work schema:name ?name } # This will return separate names in English and Japanese names\nOPTIONAL {?work schema:dateCreated ?date}\n}\nFILTER (lang(?name)=\"en\") # Show only the English name\nBIND(URI( REPLACE(STR(?work), \"/data/\", \"/item/\") ) AS ?work_link)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY ?date",
    "complexity": "complex"
  },
  {
    "id": "1233",
    "instruction": "List all Nobel Prize winners with their images and Twitter handles.",
    "query": "SELECT DISTINCT ?place ?img (sample(?twitter) AS ?twitter) (sample(?offweb) AS ?offweb) ?motivation ?article ?NobelArticle WHERE {\n?laureate wdt:P2888 ?laureate_nobel_uri .\n{\n{?laureate wdt:P2002 ?twitterID}\nUNION\n{?laureate wdt:P856 ?offweb}\n}\nFILTER (strStarts(str(?laureate_nobel_uri), \"http://data.nobelprize.org/resource/laureate/\"))\nOPTIONAL {?laureate wdt:P18 ?img}\nOPTIONAL {?article schema:about ?laureate .\n?article schema:isPartOf <https://en.wikipedia.org/>}\nOPTIONAL{?laureate wdt:P3188 ?Na}\nBIND (URI(CONCAT(\"https://www.nobelprize.org/nobel_prizes/\",?Na,\"-facts.html\")) AS ?NobelArticle)\nBIND (URI(CONCAT(\"https://twitter.com/\",?twitterID)) AS ?twitter)\nSERVICE <http://data.nobelprize.org/sparql> {\n?laureate_nobel_uri nobel:laureateAward / nobel:motivation ?motivation .\nFILTER (lang(?motivation) = 'en')\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,de,da,nl\". }\n} Group By ?place ?img ?motivation ?article ?NobelArticle ?coord22",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\nPREFIX nobel: <http://data.nobelprize.org/terms/>\n\nSELECT DISTINCT ?place ?img (sample(?twitter) AS ?twitter) (sample(?offweb) AS ?offweb) ?motivation ?article ?NobelArticle WHERE {\n?laureate wdt:[property:exact match] ?laureate_nobel_uri .\n{\n{?laureate wdt:[property:Twitter (X) username] ?twitterID}\nUNION\n{?laureate wdt:[property:official website] ?offweb}\n}\nFILTER (strStarts(str(?laureate_nobel_uri), \"http://data.nobelprize.org/resource/laureate/\"))\nOPTIONAL {?laureate wdt:[property:image] ?img}\nOPTIONAL {?article schema:about ?laureate .\n?article schema:isPartOf <https://en.wikipedia.org/>}\nOPTIONAL{?laureate wdt:[property:P3188] ?Na}\nBIND (URI(CONCAT(\"https://www.nobelprize.org/nobel_prizes/\",?Na,\"-facts.html\")) AS ?NobelArticle)\nBIND (URI(CONCAT(\"https://twitter.com/\",?twitterID)) AS ?twitter)\nSERVICE <http://data.nobelprize.org/sparql> {\n?laureate_nobel_uri nobel:laureateAward / nobel:motivation ?motivation .\nFILTER (lang(?motivation) = 'en')\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,de,da,nl\". }\n} Group By ?place ?img ?motivation ?article ?NobelArticle ?coord22",
    "complexity": "complex"
  },
  {
    "id": "1560",
    "instruction": "What types of historical objects are protected in Loire-Atlantique, France?",
    "query": "SELECT DISTINCT ?type ?typeLabel (COUNT(?item) AS ?count) WHERE {\n{ ?item wdt:P481 ?palissy ;\nwdt:P131 ?commune . } UNION\n{ ?item wdt:P361 ?group .\n?group wdt:P481 ?palissy ;\nwdt:P131 ?commune . }\n?item wdt:P31 ?type .\n?commune wdt:P131 wd:Q3068 .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?type ?typeLabel\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?type ?typeLabel (COUNT(?item) AS ?count) WHERE {\n{ ?item wdt:[property:Palissy ID] ?palissy ;\nwdt:[property:located in the administrative territorial entity] ?commune . } UNION\n{ ?item wdt:[property:part of] ?group .\n?group wdt:[property:Palissy ID] ?palissy ;\nwdt:[property:located in the administrative territorial entity] ?commune . }\n?item wdt:[property:instance of] ?type .\n?commune wdt:[property:located in the administrative territorial entity] wd:[entity:Loire-Atlantique] .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?type ?typeLabel\nORDER BY DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "695",
    "instruction": "What are the most commonly used authority control properties for identifying artworks?",
    "query": "SELECT ?propertyLabel ?propertyDescription (COUNT(?propertyclaim) AS ?count) WHERE {\n?item wdt:P31 wd:Q3305213 .\n?property wikibase:propertyType wikibase:ExternalId .\n?property wdt:P31 wd:Q44847669 .\n?property wikibase:claim ?propertyclaim .\n?item ?propertyclaim [] .\nSERVICE wikibase:label { # ... include the labels\nbd:serviceParam wikibase:language \"en\" .\n}\n} GROUP BY ?propertyLabel ?propertyDescription ORDER BY DESC (?count)\nLIMIT 100",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?propertyLabel ?propertyDescription (COUNT(?propertyclaim) AS ?count) WHERE {\n?item wdt:[property:instance of] wd:[entity:painting] .\n?property wikibase:propertyType wikibase:ExternalId .\n?property wdt:[property:instance of] wd:[entity:Wikidata property to identify artworks] .\n?property wikibase:claim ?propertyclaim .\n?item ?propertyclaim [] .\nSERVICE wikibase:label { # ... include the labels\nbd:serviceParam wikibase:language \"en\" .\n}\n} GROUP BY ?propertyLabel ?propertyDescription ORDER BY DESC (?count)\nLIMIT 100",
    "complexity": "complex"
  },
  {
    "id": "2072",
    "instruction": "What is the age of US presidents and UK prime ministers when they took office?",
    "query": "SELECT ?date ?age ?layer WHERE {\n{\n?usPresident wdt:P31 wd:Q5;\np:P39 [\nps:P39 wd:Q11696;\npq:P580 ?usPresidentStart\n];\nwdt:P569 ?usPresidentDob.\nBIND(xsd:integer((?usPresidentStart - ?usPresidentDob) / 365.2425) AS ?usPresidentAge)\nBIND(?usPresidentStart AS ?date)\nBIND(?usPresidentAge AS ?age)\nBIND(\"US president\"@en AS ?layer)\n} UNION {\n?ukPrimeMinister wdt:P31 wd:Q5;\np:P39 [\nps:P39 wd:Q14211;\npq:P580 ?ukPrimeMinisterStart\n];\nwdt:P569 ?ukPrimeMinisterDob.\nBIND(xsd:integer((?ukPrimeMinisterStart - ?ukPrimeMinisterDob) / 365.2425) AS ?ukPrimeMinisterAge)\nBIND(?ukPrimeMinisterStart AS ?date)\nBIND(?ukPrimeMinisterAge AS ?age)\nBIND(\"UK Prime Minister\"@en AS ?layer)\n} UNION {\nwd:Q21 p:P4442 [\nps:P4442 ?englandMeanAge;\npq:P585 ?englandMeanAgeTime\n].\nBIND(?englandMeanAgeTime AS ?date)\nBIND(?englandMeanAge AS ?age)\nBIND(\"England\"@en AS ?layer)\n}\n# FILTER(?date >= \"1989\"^^xsd:dateTime)\n}",
    "annotated": "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?date ?age ?layer WHERE {\n{\n?usPresident wdt:[property:instance of] wd:[entity:human];\np:[property:position held] [\nps:[property:position held] wd:[entity:President of the United States];\npq:[property:start time] ?usPresidentStart\n];\nwdt:[property:date of birth] ?usPresidentDob.\nBIND(xsd:integer((?usPresidentStart - ?usPresidentDob) / 365.2425) AS ?usPresidentAge)\nBIND(?usPresidentStart AS ?date)\nBIND(?usPresidentAge AS ?age)\nBIND(\"US president\"@en AS ?layer)\n} UNION {\n?ukPrimeMinister wdt:[property:instance of] wd:[entity:human];\np:[property:position held] [\nps:[property:position held] wd:[entity:Prime Minister of the United Kingdom];\npq:[property:start time] ?ukPrimeMinisterStart\n];\nwdt:[property:date of birth] ?ukPrimeMinisterDob.\nBIND(xsd:integer((?ukPrimeMinisterStart - ?ukPrimeMinisterDob) / 365.2425) AS ?ukPrimeMinisterAge)\nBIND(?ukPrimeMinisterStart AS ?date)\nBIND(?ukPrimeMinisterAge AS ?age)\nBIND(\"UK Prime Minister\"@en AS ?layer)\n} UNION {\nwd:[entity:England] p:[property:mean age] [\nps:[property:mean age] ?englandMeanAge;\npq:[property:point in time] ?englandMeanAgeTime\n].\nBIND(?englandMeanAgeTime AS ?date)\nBIND(?englandMeanAge AS ?age)\nBIND(\"England\"@en AS ?layer)\n}\n# FILTER(?date >= \"1989\"^^xsd:dateTime)\n}",
    "complexity": "complex"
  },
  {
    "id": "1812",
    "instruction": "What are the occupations of contributors to Jacob Heyblocq's vriendenboek?",
    "query": "SELECT ?occ ?occLabel (COUNT(?occLabel) AS ?occ_count) WHERE {\nBIND(wd:Q72752496 as ?album)\n#VALUES ?school {}\n#VALUES ?university {}\n#VALUES ?religion {}\n#VALUES ?health {}\n#VALUES ?art {}\n#VALUES ?science {}\n?album wdt:P767 ?contributor.\n?contributor wdt:P106 ?occ.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}\nGROUP BY ?occ ?occLabel\nORDER BY DESC(?occ_count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?occ ?occLabel (COUNT(?occLabel) AS ?occ_count) WHERE {\nBIND(wd:[entity:Album amicorum of Jacobus Heyblocq (1623-1690), rector of the Latin school in Amsterdam] as ?album)\n#VALUES ?school {}\n#VALUES ?university {}\n#VALUES ?religion {}\n#VALUES ?health {}\n#VALUES ?art {}\n#VALUES ?science {}\n?album wdt:[property:contributor to the creative work or subject] ?contributor.\n?contributor wdt:[property:occupation] ?occ.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}\nGROUP BY ?occ ?occLabel\nORDER BY DESC(?occ_count)",
    "complexity": "complex"
  },
  {
    "id": "160",
    "instruction": "What are the leaf taxa under mammals, along with their three super-taxa and the rank of the highest super-taxon?",
    "query": "SELECT ?item ?itemLabel ?item2Label ?item3Label ?item4Label ?item4rankLabel\nWHERE {\n?item wdt:P171+ wd:Q7377 .\nFILTER NOT EXISTS { [] wdt:P171 ?item } # Leaf nodes only\n?item wdt:P171 ?item2 .\n?item2 wdt:P171 ?item3 .\n?item3 wdt:P171 ?item4 .\n?item4 wdt:P105 ?item4rank\nSERVICE wikibase:label {bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} ORDER BY ?item4Label ?item3Label",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?item2Label ?item3Label ?item4Label ?item4rankLabel\nWHERE {\n?item wdt:[property:parent taxon]+ wd:[entity:mammal] .\nFILTER NOT EXISTS { [] wdt:[property:parent taxon] ?item } # Leaf nodes only\n?item wdt:[property:parent taxon] ?item2 .\n?item2 wdt:[property:parent taxon] ?item3 .\n?item3 wdt:[property:parent taxon] ?item4 .\n?item4 wdt:[property:taxon rank] ?item4rank\nSERVICE wikibase:label {bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} ORDER BY ?item4Label ?item3Label",
    "complexity": "complex"
  },
  {
    "id": "808",
    "instruction": "List all women born in 1921 or later with the most sitelinks and no image.",
    "query": "SELECT ?s ?desc (COUNT(DISTINCT ?sitelink) as ?linkcount) WHERE {\n?s wdt:P31 wd:Q5 .\n?s wdt:P21 wd:Q6581072 .\n?s wdt:P569 ?born .\nFILTER (?born > \"1920-01-01T00:00:00Z\"^^xsd:dateTime) .\n?sitelink schema:about ?s .\nOPTIONAL {\n?s wdt:P18 ?dummy\n}\nFILTER ( !bound(?dummy) ) .\nOPTIONAL {\n?s rdfs:label ?desc filter (lang(?desc) = \"en\").\n}\n} GROUP BY ?s ?desc ORDER BY DESC(?linkcount) LIMIT 50",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?s ?desc (COUNT(DISTINCT ?sitelink) as ?linkcount) WHERE {\n?s wdt:[property:instance of] wd:[entity:human] .\n?s wdt:[property:sex or gender] wd:[entity:female] .\n?s wdt:[property:date of birth] ?born .\nFILTER (?born > \"1920-01-01T00:00:00Z\"^^xsd:dateTime) .\n?sitelink schema:about ?s .\nOPTIONAL {\n?s wdt:[property:image] ?dummy\n}\nFILTER ( !bound(?dummy) ) .\nOPTIONAL {\n?s rdfs:label ?desc filter (lang(?desc) = \"en\").\n}\n} GROUP BY ?s ?desc ORDER BY DESC(?linkcount) LIMIT 50",
    "complexity": "complex"
  },
  {
    "id": "2011",
    "instruction": "List all railway stations in Czechia along with their adjacent stations.",
    "query": "SELECT * WHERE {\n?comm1 wdt:P31 wd:Q55488 ; wdt:P17 wd:Q213 ; wdt:P625 ?coord1 ; wdt:P197 ?comm2.\nMINUS { ?comm1 p:P31 [ ps:P31 wd:Q55488 ; pq:P582 [] ] . }\nMINUS { ?comm2 p:P31 [ ps:P31 wd:Q55488 ; pq:P582 [] ] . }\n?comm2 wdt:P625 ?coord2 .\n?comm1 p:P625 [ ps:P625 []; psv:P625 [ wikibase:geoLongitude ?coord1lon; wikibase:geoLatitude ?coord1lat; ] ].\n?comm2 p:P625 [ ps:P625 []; psv:P625 [ wikibase:geoLongitude ?coord2lon; wikibase:geoLatitude ?coord2lat; ] ].\nBIND(CONCAT('LINESTRING (', STR(?coord1lon), ' ', STR(?coord1lat), ',', STR(?coord2lon), ' ', STR(?coord2lat), ')') AS ?str) .\nBIND(STRDT(?str, geo:wktLiteral) AS ?line)\n}",
    "annotated": "PREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT * WHERE {\n?comm1 wdt:[property:instance of] wd:[entity:railway station] ; wdt:[property:country] wd:[entity:Czech Republic] ; wdt:[property:coordinate location] ?coord1 ; wdt:[property:adjacent station] ?comm2.\nMINUS { ?comm1 p:[property:instance of] [ ps:[property:instance of] wd:[entity:railway station] ; pq:[property:end time] [] ] . }\nMINUS { ?comm2 p:[property:instance of] [ ps:[property:instance of] wd:[entity:railway station] ; pq:[property:end time] [] ] . }\n?comm2 wdt:[property:coordinate location] ?coord2 .\n?comm1 p:[property:coordinate location] [ ps:[property:coordinate location] []; psv:[property:coordinate location] [ wikibase:geoLongitude ?coord1lon; wikibase:geoLatitude ?coord1lat; ] ].\n?comm2 p:[property:coordinate location] [ ps:[property:coordinate location] []; psv:[property:coordinate location] [ wikibase:geoLongitude ?coord2lon; wikibase:geoLatitude ?coord2lat; ] ].\nBIND(CONCAT('LINESTRING (', STR(?coord1lon), ' ', STR(?coord1lat), ',', STR(?coord2lon), ' ', STR(?coord2lat), ')') AS ?str) .\nBIND(STRDT(?str, geo:wktLiteral) AS ?line)\n}",
    "complexity": "complex"
  },
  {
    "id": "1472",
    "instruction": "List the top software developers by the number of titles they have developed.",
    "query": "SELECT ?developer ?developerLabel (COUNT(?software) AS ?count) WHERE {\n?software (p:P31/ps:P31/wdt:P279*) wd:Q7397.\n?software wdt:P178 ?developer.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nGROUP BY ?developer ?developerLabel\nORDER BY DESC(?count)\nLIMIT 100",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?developer ?developerLabel (COUNT(?software) AS ?count) WHERE {\n?software (p:[property:instance of]/ps:[property:instance of]/wdt:[property:subclass of]*) wd:[entity:software].\n?software wdt:[property:developer] ?developer.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nGROUP BY ?developer ?developerLabel\nORDER BY DESC(?count)\nLIMIT 100",
    "complexity": "complex"
  },
  {
    "id": "234",
    "instruction": "List the top ten languages with the most manuscripts.",
    "query": "SELECT (SUBSTR(STR(?lang),32) AS ?wd) (COUNT(DISTINCT ?q) AS ?mcount)\nWHERE {\n?q (wdt:P31/wdt:P279*) wd:Q87167.\n?q p:P195 ?s. ?s ps:P195 ?collection . MINUS {?s pq:P582 []}.\nMINUS { ?s ps:P195 wd:Q1322278 }\n?q wdt:P407 ?lang\n}\nGROUP BY ?lang\nORDER BY DESC(?mcount)\nLIMIT 10",
    "annotated": "PREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT (SUBSTR(STR(?lang),32) AS ?wd) (COUNT(DISTINCT ?q) AS ?mcount)\nWHERE {\n?q (wdt:[property:instance of]/wdt:[property:subclass of]*) wd:[entity:manuscript].\n?q p:[property:collection] ?s. ?s ps:[property:collection] ?collection . MINUS {?s pq:[property:end time] []}.\nMINUS { ?s ps:[property:collection] wd:[entity:Matenadaran] }\n?q wdt:[property:language of work or name] ?lang\n}\nGROUP BY ?lang\nORDER BY DESC(?mcount)\nLIMIT 10",
    "complexity": "complex"
  },
  {
    "id": "650",
    "instruction": "List actors who played the same character in two different movies released more than 40 years apart.",
    "query": "SELECT DISTINCT ?actor ?actorLabel ?characterLabel ?movie1Label ?movie2Label WHERE {\n?movie1 p:P161 [\nps:P161 ?actor;\npq:P453 ?character\n];\nwdt:P577 ?movie1Publication.\n?movie2 p:P161 [\nps:P161 ?actor;\npq:P453 ?character\n];\nwdt:P577 ?movie2Publication.\nMINUS{?movie1 wdt:P31/wdt:P279? wd:Q24856} # Not a series\nMINUS{?movie2 wdt:P31/wdt:P279? wd:Q24856} # Not a series\nFILTER(?character != wd:Q18086706). # Not as \"themselves\"\nFILTER(?movie1Publication + \"P40Y\"^^xsd:duration < ?movie2Publication) # 40 years between them\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?actor ?actorLabel ?characterLabel ?movie1Label ?movie2Label WHERE {\n?movie1 p:[property:cast member] [\nps:[property:cast member] ?actor;\npq:[property:character role] ?character\n];\nwdt:[property:publication date] ?movie1Publication.\n?movie2 p:[property:cast member] [\nps:[property:cast member] ?actor;\npq:[property:character role] ?character\n];\nwdt:[property:publication date] ?movie2Publication.\nMINUS{?movie1 wdt:[property:instance of]/wdt:[property:subclass of]? wd:[entity:film series]} # Not a series\nMINUS{?movie2 wdt:[property:instance of]/wdt:[property:subclass of]? wd:[entity:film series]} # Not a series\nFILTER(?character != wd:[entity:self]). # Not as \"themselves\"\nFILTER(?movie1Publication + \"P40Y\"^^xsd:duration < ?movie2Publication) # 40 years between them\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "2001",
    "instruction": "List the MPs with the most children or in-laws who also became MPs.",
    "query": "SELECT DISTINCT ?item2 ?item2Label (count(distinct ?item1) as ?count)\nWITH {\nSELECT DISTINCT ?item1 WHERE {\nVALUES ?mp {wd:Q16707842 wd:Q18015642 wd:Q18018860} .\n{ ?item1 wdt:P39 ?p . ?p ps:P39 ?t . ?t wdt:P279 ?mp } union { ?item1 wdt:P1614 [] }\n}\n} AS %mps\nWHERE {\n{INCLUDE %mps . ?item1 wdt:P26 ?spouse . ?spouse wdt:P22|wdt:P25 ?item2 }\nunion\n{INCLUDE %mps . ?item1 wdt:P22|wdt:P25 ?item2 }\nOPTIONAL {\nVALUES ?mp {wd:Q16707842 wd:Q18015642 wd:Q18018860} .\n?item2 wdt:P39 ?p . ?p ps:P39 ?t . ?t wdt:P279 ?mp .\n}\nOPTIONAL {?item2 wdt:P1614 ?hpID} .\nFILTER (bound(?mp) || bound(?hpID)) .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} group by ?item2 ?item2Label order by desc(?count) ?item2Label",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item2 ?item2Label (count(distinct ?item1) as ?count)\nWITH {\nSELECT DISTINCT ?item1 WHERE {\nVALUES ?mp {wd:[entity:Member of Parliament] wd:[entity:Member of Parliament of Great Britain] wd:[entity:Member of Parliament in the Parliament of England]} .\n{ ?item1 wdt:[property:position held] ?p . ?p ps:[property:position held] ?t . ?t wdt:[property:subclass of] ?mp } union { ?item1 wdt:[property:History of Parliament ID] [] }\n}\n} AS %mps\nWHERE {\n{INCLUDE %mps . ?item1 wdt:[property:spouse] ?spouse . ?spouse wdt:[property:father]|wdt:[property:mother] ?item2 }\nunion\n{INCLUDE %mps . ?item1 wdt:[property:father]|wdt:[property:mother] ?item2 }\nOPTIONAL {\nVALUES ?mp {wd:[entity:Member of Parliament] wd:[entity:Member of Parliament of Great Britain] wd:[entity:Member of Parliament in the Parliament of England]} .\n?item2 wdt:[property:position held] ?p . ?p ps:[property:position held] ?t . ?t wdt:[property:subclass of] ?mp .\n}\nOPTIONAL {?item2 wdt:[property:History of Parliament ID] ?hpID} .\nFILTER (bound(?mp) || bound(?hpID)) .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} group by ?item2 ?item2Label order by desc(?count) ?item2Label",
    "complexity": "complex"
  },
  {
    "id": "1368",
    "instruction": "What are the oldest given names on Wikidata?",
    "query": "SELECT ?name ?nameLabel ?minDob WITH {\nSELECT ?name (MIN(?dob) AS ?minDob) WHERE {\n?person wdt:P31 wd:Q5;\nwdt:P569 ?dob;\nwdt:P735 ?name.\nFILTER(!ISBLANK(?dob) && !ISBLANK(?name)).\nFILTER(DATATYPE(?dob) = xsd:dateTime). #T94064?\n}\nGROUP BY ?name\nHAVING(COUNT(DISTINCT ?person) > 1)\nORDER BY ASC(?minDob)\nLIMIT 100\n} AS %names WHERE {\nINCLUDE %names.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nORDER BY ASC(?minDob)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?name ?nameLabel ?minDob WITH {\nSELECT ?name (MIN(?dob) AS ?minDob) WHERE {\n?person wdt:[property:instance of] wd:[entity:human];\nwdt:[property:date of birth] ?dob;\nwdt:[property:given name] ?name.\nFILTER(!ISBLANK(?dob) && !ISBLANK(?name)).\nFILTER(DATATYPE(?dob) = xsd:dateTime). #T94064?\n}\nGROUP BY ?name\nHAVING(COUNT(DISTINCT ?person) > 1)\nORDER BY ASC(?minDob)\nLIMIT 100\n} AS %names WHERE {\nINCLUDE %names.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nORDER BY ASC(?minDob)",
    "complexity": "complex"
  },
  {
    "id": "1837",
    "instruction": "What are the topics discussed in 'In Our Time' radio programme?",
    "query": "select distinct ?episode ?episodeLabel ?date ?bbc_link\n(GROUP_CONCAT(DISTINCT ?panelistLabel;separator=\"; \") as ?panelists)\n(count(DISTINCT ?panelist) as ?panelists_on_wd)\n(count(DISTINCT ?wp) as ?panelists_on_wp)\n?topic # (GROUP_CONCAT(DISTINCT ?topic;separator=\" ; \") as ?wikipedia_topics)\nwhere\n{ ?episode wdt:P31 wd:Q57608327 . ?episode wdt:P179 wd:Q3149655 . optional { ?episode wdt:P577 ?date }\noptional { ?episode wdt:P710 ?panelist . optional { ?wp schema:about ?panelist . ?wp schema:isPartOf <https://en.wikipedia.org/>. } }\noptional { ?episode wdt:P953 ?bbc_link }\noptional { ?episode wdt:P921 ?subj . ?topic schema:about ?subj . ?topic schema:isPartOf <https://en.wikipedia.org/>. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\".\n?panelist rdfs:label ?panelistLabel .\n?episode rdfs:label ?episodeLabel . }\n} group by ?episode ?episodeLabel ?date ?bbc_link ?topic order by desc(?date)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nselect distinct ?episode ?episodeLabel ?date ?bbc_link\n(GROUP_CONCAT(DISTINCT ?panelistLabel;separator=\"; \") as ?panelists)\n(count(DISTINCT ?panelist) as ?panelists_on_wd)\n(count(DISTINCT ?wp) as ?panelists_on_wp)\n?topic # (GROUP_CONCAT(DISTINCT ?topic;separator=\" ; \") as ?wikipedia_topics)\nwhere\n{ ?episode wdt:[property:instance of] wd:[entity:radio series episode] . ?episode wdt:[property:part of the series] wd:[entity:In Our Time] . optional { ?episode wdt:[property:publication date] ?date }\noptional { ?episode wdt:[property:participant] ?panelist . optional { ?wp schema:about ?panelist . ?wp schema:isPartOf <https://en.wikipedia.org/>. } }\noptional { ?episode wdt:[property:full work available at URL] ?bbc_link }\noptional { ?episode wdt:[property:main subject] ?subj . ?topic schema:about ?subj . ?topic schema:isPartOf <https://en.wikipedia.org/>. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\".\n?panelist rdfs:label ?panelistLabel .\n?episode rdfs:label ?episodeLabel . }\n} group by ?episode ?episodeLabel ?date ?bbc_link ?topic order by desc(?date)",
    "complexity": "complex"
  },
  {
    "id": "167",
    "instruction": "List all physical tools with a Commons category but no image.",
    "query": "SELECT ?thing ?thingLabel ?cat WHERE {\n?thing wdt:P373 ?cat;\nwdt:P31/wdt:P279* wd:Q39546\nMINUS { ?thing wdt:P18 [] }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} LIMIT 50",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?thing ?thingLabel ?cat WHERE {\n?thing wdt:[property:Commons category] ?cat;\nwdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:physical tool]\nMINUS { ?thing wdt:[property:image] [] }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} LIMIT 50",
    "complexity": "complex"
  }
]