[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "2360",
    "instruction": "List the UK Prime Ministers who were in office when each English Premier League/First Division title winner last won the championship.",
    "query": "SELECT ?date ?winner ?winnerLabel ?pm ?pmLabel ?pm_image WITH {\nSELECT DISTINCT ?winner ?d WHERE { # all the winners of the English Premier League or First Division\nVALUES $ENGLISH_FIRST { wd:Q754839 wd:Q9448 wd:Q213347 }\n?x wdt:P3450 $ENGLISH_FIRST .\n?x wdt:P1346 ?winner .\n?x wdt:P582 ?d\nMINUS { ?x wdt:P2499 [] } # make sure this is really the Top league\n}} AS %winners\nWITH {\nSELECT (MAX(?d) AS ?date) ?winner WHERE { # get the latest (MAX) date\nINCLUDE %winners\n} GROUP BY ?winner} AS %winner_and_date\nWHERE { # determine who was the Prime minister on a particular date\nINCLUDE %winner_and_date\n?pm p:P39 ?ph_stmt .\nOPTIONAL { ?pm wdt:P18 ?pm_image }\n?ph_stmt ps:P39 wd:Q14211 .\n?ph_stmt pq:P580 ?pm_start .\nOPTIONAL { ?ph_stmt pq:P582 ?pm_end }\nBIND(COALESCE(?pm_end, NOW()) AS ?pm_end)\nFILTER (?pm_start <= ?date && ?pm_end >= ?date)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY ?date",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?date ?winner ?winnerLabel ?pm ?pmLabel ?pm_image WITH {\nSELECT DISTINCT ?winner ?d WHERE { # all the winners of the English Premier League or First Division\nVALUES $ENGLISH_FIRST { wd:[entity:Football League First Division] wd:[entity:Premier League] wd:[entity:English Football League] }\n?x wdt:[property:sports season of league or competition] $ENGLISH_FIRST .\n?x wdt:[property:winner] ?winner .\n?x wdt:[property:end time] ?d\nMINUS { ?x wdt:[property:league level above] [] } # make sure this is really the Top league\n}} AS %winners\nWITH {\nSELECT (MAX(?d) AS ?date) ?winner WHERE { # get the latest (MAX) date\nINCLUDE %winners\n} GROUP BY ?winner} AS %winner_and_date\nWHERE { # determine who was the Prime minister on a particular date\nINCLUDE %winner_and_date\n?pm p:[property:position held] ?ph_stmt .\nOPTIONAL { ?pm wdt:[property:image] ?pm_image }\n?ph_stmt ps:[property:position held] wd:[entity:Prime Minister of the United Kingdom] .\n?ph_stmt pq:[property:start time] ?pm_start .\nOPTIONAL { ?ph_stmt pq:[property:end time] ?pm_end }\nBIND(COALESCE(?pm_end, NOW()) AS ?pm_end)\nFILTER (?pm_start <= ?date && ?pm_end >= ?date)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY ?date",
    "complexity": "complex"
  },
  {
    "id": "854",
    "instruction": "List all French communes with names ending in 'ac'.",
    "query": "SELECT ?item ?itemLabel ?coord\nWHERE {\n?item wdt:P31/wdt:P279* wd:Q484170;\nwdt:P17 wd:Q142;\nrdfs:label ?itemLabel;\nwdt:P625 ?coord;\nFILTER (lang(?itemLabel) = \"fr\").\nFILTER regex (?itemLabel, \"ac$\").\nFILTER not exists { ?item wdt:P131 wd:Q33788 } # excluding Koumac, New Caledonia...\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?item ?itemLabel ?coord\nWHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:commune of France];\nwdt:[property:country] wd:[entity:France];\nrdfs:label ?itemLabel;\nwdt:[property:coordinate location] ?coord;\nFILTER (lang(?itemLabel) = \"fr\").\nFILTER regex (?itemLabel, \"ac$\").\nFILTER not exists { ?item wdt:[property:located in the administrative territorial entity] wd:[entity:New Caledonia] } # excluding Koumac, New Caledonia...\n}",
    "complexity": "complex"
  },
  {
    "id": "1444",
    "instruction": "List all Starfleet members with their ranks and images.",
    "query": "SELECT\n?person\n?personLabel\n(GROUP_CONCAT(DISTINCT ?myRanklabel;separator=', ') as ?myRanklabel)\n?image\n(COUNT(DISTINCT ?languageArticle) as ?languageArticleCount)\nWHERE {\n?person wdt:P463 wd:Q718644 .\nOPTIONAL {\n?person wdt:P410 ?rank .\n?rank rdfs:label ?myRanklabel\nFILTER (lang(?myRanklabel) = 'en' )\n}\nOPTIONAL { ?person wdt:P18 ?image . }\n?languageArticle schema:about ?person\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" .}\n}\nGROUP BY\n?person ?personLabel ?rankLabel ?image\nORDER BY\nDESC(?languageArticleCount)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT\n?person\n?personLabel\n(GROUP_CONCAT(DISTINCT ?myRanklabel;separator=', ') as ?myRanklabel)\n?image\n(COUNT(DISTINCT ?languageArticle) as ?languageArticleCount)\nWHERE {\n?person wdt:[property:member of] wd:[entity:Starfleet] .\nOPTIONAL {\n?person wdt:[property:military rank] ?rank .\n?rank rdfs:label ?myRanklabel\nFILTER (lang(?myRanklabel) = 'en' )\n}\nOPTIONAL { ?person wdt:[property:image] ?image . }\n?languageArticle schema:about ?person\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" .}\n}\nGROUP BY\n?person ?personLabel ?rankLabel ?image\nORDER BY\nDESC(?languageArticleCount)",
    "complexity": "complex"
  },
  {
    "id": "2731",
    "instruction": "List all members of the Swedish Riksdag from 2022 to 2026.",
    "query": "SELECT ?item ?itemLabel ?partiLabel ?valkretsLabel WHERE {\n?item wdt:P31 wd:Q5; p:P39 ?parl.\n?parl ps:P39 wd:Q10655178; pq:P580 ?start ; pq:P2937 wd:Q110585041 .\nFILTER NOT EXISTS { ?parl pq:P582 []}\n?parl pq:P768 ?valkrets .\n?parl pq:P4100 ?parti .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"sv\". }\n}\nORDER BY ?item",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?partiLabel ?valkretsLabel WHERE {\n?item wdt:[property:instance of] wd:[entity:human]; p:[property:position held] ?parl.\n?parl ps:[property:position held] wd:[entity:member of the Swedish Riksdag]; pq:[property:start time] ?start ; pq:[property:parliamentary term] wd:[entity:2022\u20132026 parliamentary term of the Swedish Riksdag] .\nFILTER NOT EXISTS { ?parl pq:[property:end time] []}\n?parl pq:[property:electoral district] ?valkrets .\n?parl pq:[property:parliamentary group] ?parti .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"sv\". }\n}\nORDER BY ?item",
    "complexity": "complex"
  },
  {
    "id": "2248",
    "instruction": "Find the birthplaces of women with biographies on Basque Wikipedia.",
    "query": "SELECT ?gizakiLabel ?koord WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?gizaki wdt:P31 wd:Q5;\nwdt:P21 wd:Q6581072.\n?wikilink schema:about ?gizaki;\nschema:isPartOf <https://eu.wikipedia.org/>.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"eu\". }\n?gizaki wdt:P19 ?jaiolekua.\n?jaiolekua wdt:P625 ?koord.\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?gizakiLabel ?koord WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?gizaki wdt:[property:instance of] wd:[entity:human];\nwdt:[property:sex or gender] wd:[entity:female].\n?wikilink schema:about ?gizaki;\nschema:isPartOf <https://eu.wikipedia.org/>.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"eu\". }\n?gizaki wdt:[property:place of birth] ?jaiolekua.\n?jaiolekua wdt:[property:coordinate location] ?koord.\n}",
    "complexity": "complex"
  },
  {
    "id": "2087",
    "instruction": "List Chilean ministers who didn't attend high school.",
    "query": "SELECT distinct ?politician ?politicianLabel WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?politician wdt:P27 wd:Q298;\nwdt:P39 ?position.\n?position wdt:P279* wd:Q3304818.\nMINUS { ?politician wdt:P570 ?death. }\nMINUS {\n?politician wdt:P69 ?institution.\n?institution wdt:P31 wd:Q9826.\n}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT distinct ?politician ?politicianLabel WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?politician wdt:[property:country of citizenship] wd:[entity:Chile];\nwdt:[property:position held] ?position.\n?position wdt:[property:country of citizenship]9* wd:[entity:minister of Chile].\nMINUS { ?politician wdt:[property:date of death] ?death. }\nMINUS {\n?politician wdt:[property:educated at] ?institution.\n?institution wdt:[property:instance of] wd:[entity:high school].\n}\n}",
    "complexity": "complex"
  },
  {
    "id": "2643",
    "instruction": "List actors who have portrayed the same real-life politician multiple times.",
    "query": "SELECT ?actor ?actorLabel ?characterLabel ?count WITH {\nSELECT ?actor ?character (COUNT(DISTINCT ?film) AS ?count) WHERE {\n?film wdt:P31/wdt:P279* wd:Q11424;\np:P161 [\nps:P161 ?actor;\npq:P453 ?character\n].\nFILTER(?actor != ?character)\n?character wdt:P31 wd:Q5;\nwdt:P39 ?position.\n}\nGROUP BY ?actor ?character\nHAVING(?count > 1)\nORDER BY DESC(?count)\nLIMIT 100\n} AS %results WHERE {\nINCLUDE %results.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?count)\nLIMIT 100",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?actor ?actorLabel ?characterLabel ?count WITH {\nSELECT ?actor ?character (COUNT(DISTINCT ?film) AS ?count) WHERE {\n?film wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:film];\np:[property:cast member] [\nps:[property:cast member] ?actor;\npq:[property:character role] ?character\n].\nFILTER(?actor != ?character)\n?character wdt:[property:instance of] wd:[entity:human];\nwdt:[property:position held] ?position.\n}\nGROUP BY ?actor ?character\nHAVING(?count > 1)\nORDER BY DESC(?count)\nLIMIT 100\n} AS %results WHERE {\nINCLUDE %results.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?count)\nLIMIT 100",
    "complexity": "complex"
  },
  {
    "id": "1014",
    "instruction": "Find statements with two references where one source cites the other.",
    "query": "SELECT ?subject ?subjectLabel ?propertyLabel ?objectLabel ?source1Label ?source2Label\nWITH { # subquery that actually finds the statements and sources (written as named subquery to ensure it's only run once, independently of the rest of the query; see https://wiki.blazegraph.com/wiki/index.php/NamedSubquery)\nSELECT ?statement ?source1 ?source2 WHERE {\n?statement prov:wasDerivedFrom/pr:P248 ?source1, ?source2. # statement has two \"stated in\" references\n?source1 wdt:P2860 ?source2. # first source cites the second one\nFILTER(?source1 != ?source2). # apparently some items cite themselves?\n}\n} AS %results WHERE {\nINCLUDE %results.\n# auxiliary query to find the subject, property and object of the statement, as well as labels\n?subject ?p ?statement.\n?statement ?ps ?object.\n?property a wikibase:Property;\nwikibase:claim ?p;\nwikibase:statementProperty ?ps.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX prov: <http://www.w3.org/ns/prov#>\nPREFIX pr: <http://www.wikidata.org/prop/reference/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?subject ?subjectLabel ?propertyLabel ?objectLabel ?source1Label ?source2Label\nWITH { # subquery that actually finds the statements and sources (written as named subquery to ensure it's only run once, independently of the rest of the query; see https://wiki.blazegraph.com/wiki/index.php/NamedSubquery)\nSELECT ?statement ?source1 ?source2 WHERE {\n?statement prov:wasDerivedFrom/pr:[property:stated in] ?source1, ?source2. # statement has two \"stated in\" references\n?source1 wdt:[property:cites work] ?source2. # first source cites the second one\nFILTER(?source1 != ?source2). # apparently some items cite themselves?\n}\n} AS %results WHERE {\nINCLUDE %results.\n# auxiliary query to find the subject, property and object of the statement, as well as labels\n?subject ?p ?statement.\n?statement ?ps ?object.\n?property a wikibase:Property;\nwikibase:claim ?p;\nwikibase:statementProperty ?ps.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "2474",
    "instruction": "List the doctoral advisors and their students at London School of Economics.",
    "query": "SELECT ?author1 ?author1Label ?rgb ?author2 ?author2Label\nWITH {\nSELECT ?author1 ?author2 ?rgb WHERE {\n{ ?author1 wdt:P108 wd:Q174570 . } union { ?author1 wdt:P1416 [ wdt:P361* wd:Q174570 ] . } union { ?author1 wdt:P69 wd:Q174570 . }\n{ ?author2 wdt:P108 wd:Q174570 . } union { ?author2 wdt:P1416 [ wdt:P361* wd:Q174570 ] . } union { ?author1 wdt:P69 wd:Q174570 . }\n{?author1 wdt:P184 ?author2 }\nUNION\n{?author2 wdt:P185 ?author1 }\n?author1 wdt:P21 ?gender1 .\nBIND ( IF(?gender1 = wd:Q6581097, \"3182BD\", \"E6550D\") AS ?rgb)\n}\n} AS %result\nWHERE {\nINCLUDE %result\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,da,de,es,fr,jp,sv,ru,zh\".\n}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?author1 ?author1Label ?rgb ?author2 ?author2Label\nWITH {\nSELECT ?author1 ?author2 ?rgb WHERE {\n{ ?author1 wdt:[property:employer] wd:[entity:London School of Economics and Political Science] . } union { ?author1 wdt:[property:affiliation] [ wdt:[property:part of]* wd:[entity:London School of Economics and Political Science] ] . } union { ?author1 wdt:[property:educated at] wd:[entity:London School of Economics and Political Science] . }\n{ ?author2 wdt:[property:employer] wd:[entity:London School of Economics and Political Science] . } union { ?author2 wdt:[property:affiliation] [ wdt:[property:part of]* wd:[entity:London School of Economics and Political Science] ] . } union { ?author1 wdt:[property:educated at] wd:[entity:London School of Economics and Political Science] . }\n{?author1 wdt:[property:doctoral advisor] ?author2 }\nUNION\n{?author2 wdt:[property:doctoral student] ?author1 }\n?author1 wdt:[property:sex or gender] ?gender1 .\nBIND ( IF(?gender1 = wd:[entity:male], \"3182BD\", \"E6550D\") AS ?rgb)\n}\n} AS %result\nWHERE {\nINCLUDE %result\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,da,de,es,fr,jp,sv,ru,zh\".\n}\n}",
    "complexity": "complex"
  },
  {
    "id": "1009",
    "instruction": "What are the names of all continents on Wikidata?",
    "query": "SELECT DISTINCT ?item ?itemLabel ?map WHERE {\n{ ?item wdt:P31 wd:Q5107 . } UNION { ?item wdt:P31 wd:Q55833 .}\nFILTER NOT EXISTS { ?item wdt:P31 wd:Q2284298 }\nOPTIONAL { ?item wdt:P242 ?map . }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} ORDER BY ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?map WHERE {\n{ ?item wdt:[property:instance of] wd:[entity:continent] . } UNION { ?item wdt:[property:instance of] wd:[entity:supercontinent] .}\nFILTER NOT EXISTS { ?item wdt:[property:instance of] wd:[entity:paleocontinent] }\nOPTIONAL { ?item wdt:[property:locator map image] ?map . }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} ORDER BY ?itemLabel",
    "complexity": "complex"
  },
  {
    "id": "303",
    "instruction": "List the astrolabes in order of their diameter from largest to smallest.",
    "query": "SELECT (str(?item) as ?name) ?diam WHERE {\n?item wdt:P31 wd:Q164992; p:P2386/psv:P2386 ?valuenode. # astrolabes with a diameter property\n?valuenode wikibase:quantityAmount ?length; wikibase:quantityUnit ?unit.\nBIND(IF(?unit = wd:Q174728, ?length * 10,?length) as ?diam) # diameter in millimetres (unit is cm or mm)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". ?item rdfs:label ?itemLabel }\n} ORDER BY DESC(?diam)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT (str(?item) as ?name) ?diam WHERE {\n?item wdt:[property:instance of] wd:[entity:astrolabe]; p:[property:diameter]/psv:[property:diameter] ?valuenode. # astrolabes with a diameter property\n?valuenode wikibase:quantityAmount ?length; wikibase:quantityUnit ?unit.\nBIND(IF(?unit = wd:[entity:centimetre], ?length * 10,?length) as ?diam) # diameter in millimetres (unit is cm or mm)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". ?item rdfs:label ?itemLabel }\n} ORDER BY DESC(?diam)",
    "complexity": "complex"
  },
  {
    "id": "979",
    "instruction": "What are the different types of squirrels?",
    "query": "select ?child ?childLabel ?parent ?parentLabel {\n{\n?parent wdt:P225 \"Sciuridae\" .\n?child wdt:P171* ?parent .\n?child wdt:P31 wd:Q16521 .\n?child wdt:P105 wd:Q2455704 .\n} UNION {\n?top wdt:P225 \"Sciuridae\" .\n?parent wdt:P171* ?top .\n?parent wdt:P31 wd:Q16521 .\n?parent wdt:P105 wd:Q2455704 .\n?child wdt:P171* ?parent .\n?child wdt:P31 wd:Q16521 .\n?child wdt:P105 wd:Q34740 .\n} UNION {\n?top wdt:P225 \"Sciuridae\" .\n?parent wdt:P171* ?top .\n?sf wdt:P31 wd:Q16521 .\n?sf wdt:P105 wd:Q2455704 .\n?parent wdt:P171* ?sf .\n?parent wdt:P31 wd:Q16521 .\n?parent wdt:P105 wd:Q34740 .\n?child wdt:P171* ?parent .\n?child wdt:P31 wd:Q16521 .\n?child wdt:P105 wd:Q7432 .\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nselect ?child ?childLabel ?parent ?parentLabel {\n{\n?parent wdt:[property:taxon name] \"Sciuridae\" .\n?child wdt:[property:parent taxon]* ?parent .\n?child wdt:[property:instance of] wd:[entity:taxon] .\n?child wdt:[property:taxon rank] wd:Q2455704 .\n} UNION {\n?top wdt:[property:taxon name] \"Sciuridae\" .\n?parent wdt:[property:parent taxon]* ?top .\n?parent wdt:[property:instance of] wd:[entity:taxon] .\n?parent wdt:[property:taxon rank] wd:Q2455704 .\n?child wdt:[property:parent taxon]* ?parent .\n?child wdt:[property:instance of] wd:[entity:taxon] .\n?child wdt:[property:taxon rank] wd:[entity:genus] .\n} UNION {\n?top wdt:[property:taxon name] \"Sciuridae\" .\n?parent wdt:[property:parent taxon]* ?top .\n?sf wdt:[property:instance of] wd:[entity:taxon] .\n?sf wdt:[property:taxon rank] wd:Q2455704 .\n?parent wdt:[property:parent taxon]* ?sf .\n?parent wdt:[property:instance of] wd:[entity:taxon] .\n?parent wdt:[property:taxon rank] wd:[entity:genus] .\n?child wdt:[property:parent taxon]* ?parent .\n?child wdt:[property:instance of] wd:[entity:taxon] .\n?child wdt:[property:taxon rank] wd:[entity:species] .\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}",
    "complexity": "complex"
  },
  {
    "id": "2190",
    "instruction": "Find English language forms without an audio pronunciation.",
    "query": "SELECT distinct ?l ?lemma ?audio WHERE {\n?l dct:language wd:Q1860;\nwikibase:lemma ?lemma;\nontolex:lexicalForm ?form .\n?form ontolex:representation ?lemma .\nminus {?form wdt:P443 ?audio.}\n# Exclude affixes\nminus {?l wikibase:lexicalCategory wd:Q62155.}\n}",
    "annotated": "PREFIX dct: <http://purl.org/dc/terms/>\nPREFIX ontolex: <http://www.w3.org/ns/lemon/ontolex#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT distinct ?l ?lemma ?audio WHERE {\n?l dct:language wd:[entity:English];\nwikibase:lemma ?lemma;\nontolex:lexicalForm ?form .\n?form ontolex:representation ?lemma .\nminus {?form wdt:[property:pronunciation audio] ?audio.}\n# Exclude affixes\nminus {?l wikibase:lexicalCategory wd:[entity:affix].}\n}",
    "complexity": "complex"
  },
  {
    "id": "2472",
    "instruction": "List the ages of Hawthorn FC players who are still alive.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?age ?birth_date WHERE {\n?item wdt:P31 wd:Q5;\n(p:P569/psv:P569) _:b8.\n_:b8 wikibase:timeValue ?birth_date;\nwikibase:timePrecision ?precision.\n?item wdt:P106 wd:Q13414980;\nwdt:P54 wd:Q1034556.\nFILTER(NOT EXISTS { ?item wdt:P570 ?dead. })\nBIND(((YEAR(NOW())) - (YEAR(?birth_date))) - (IF(((MONTH(NOW())) < (MONTH(?birth_date))) || (((MONTH(NOW())) = (MONTH(?birth_date))) && ((DAY(NOW())) < (DAY(?birth_date)))), 1 , 0 )) AS ?age)\nFILTER(?age >= 80 )\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nORDER BY DESC (?age)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?age ?birth_date WHERE {\n?item wdt:[property:instance of] wd:[entity:human];\n(p:[property:date of birth]/psv:[property:date of birth]) _:b8.\n_:b8 wikibase:timeValue ?birth_date;\nwikibase:timePrecision ?precision.\n?item wdt:[property:occupation] wd:[entity:Australian rules football player];\nwdt:[property:member of sports team] wd:[entity:Hawthorn Football Club].\nFILTER(NOT EXISTS { ?item wdt:[property:date of death] ?dead. })\nBIND(((YEAR(NOW())) - (YEAR(?birth_date))) - (IF(((MONTH(NOW())) < (MONTH(?birth_date))) || (((MONTH(NOW())) = (MONTH(?birth_date))) && ((DAY(NOW())) < (DAY(?birth_date)))), 1 , 0 )) AS ?age)\nFILTER(?age >= 80 )\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nORDER BY DESC (?age)",
    "complexity": "complex"
  },
  {
    "id": "1965",
    "instruction": "How many statues of women are there in each country?",
    "query": "SELECT ?country ?countryLabel (COUNT(DISTINCT ?item) AS ?count) WHERE {\n?item wdt:P31/wdt:P279* wd:Q179700 ; wdt:P17 ?country ; wdt:P180 ?depicts .\n?depicts wdt:P31 wd:Q5 ; wdt:P21 wd:Q6581072 .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?country ?countryLabel\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?country ?countryLabel (COUNT(DISTINCT ?item) AS ?count) WHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:statue] ; wdt:[property:country] ?country ; wdt:[property:depicts] ?depicts .\n?depicts wdt:[property:instance of] wd:[entity:human] ; wdt:[property:sex or gender] wd:[entity:female] .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?country ?countryLabel\nORDER BY DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "699",
    "instruction": "List the types of relationships between anonymous painters and their works.",
    "query": "SELECT ?qualifierpropertyLabel (COUNT(?creatorqualifier) AS ?count) WHERE {\n?item wdt:P31 wd:Q3305213 .\n?item wdt:P170 wd:Q4233718 .\nOPTIONAL { ?item p:P170 ?creatorstatement .\n?creatorstatement rdf:type wikibase:BestRank .\n?creatorstatement ?qualifier ?creatorqualifier .\n?qualifierproperty wikibase:qualifier ?qualifier }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n} GROUP BY ?qualifierpropertyLabel\nHAVING (?count > 2)\nLIMIT 2000",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?qualifierpropertyLabel (COUNT(?creatorqualifier) AS ?count) WHERE {\n?item wdt:[property:instance of] wd:[entity:painting] .\n?item wdt:[property:creator] wd:[entity:anonymous] .\nOPTIONAL { ?item p:[property:creator] ?creatorstatement .\n?creatorstatement rdf:type wikibase:BestRank .\n?creatorstatement ?qualifier ?creatorqualifier .\n?qualifierproperty wikibase:qualifier ?qualifier }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n} GROUP BY ?qualifierpropertyLabel\nHAVING (?count > 2)\nLIMIT 2000",
    "complexity": "complex"
  },
  {
    "id": "1680",
    "instruction": "Find the connections between Welsh landscape prints and their printing locations.",
    "query": "SELECT ?print ?printLabel ?image ?pop ?popLabel ?popCoords ?subject ?subjectLabel ?subjectCoords ?line ?layer WHERE {\n$print wdt:P361 wd:Q21542493 ;\nwdt:P291 ?pop .\nOPTIONAL { ?print wdt:P18 ?image .}\n?pop wdt:P625 ?popCoords .\n?pop p:P625 [ ps:P625 []; psv:P625 [ wikibase:geoLongitude ?poplon; wikibase:geoLatitude ?poplat; ] ].\n$print p:P921 ?printstmt .\n?printstmt ps:P921 ?subject .\n?subject wdt:P625 ?subjectCoords .\n?subject p:P625 [\nps:P625 [];\npsv:P625 [\nwikibase:geoLongitude ?subjectlon;\nwikibase:geoLatitude ?subjectlat;\n]\n].\n?pop rdfs:label ?layer .\nFILTER (LANG(?layer) = \"en\")\nBIND(CONCAT('LINESTRING (', STR(?poplon), ' ', STR(?poplat), ',', STR(?subjectlon), ' ', STR(?subjectlat), ')') AS ?str) .\nBIND(STRDT(?str, geo:wktLiteral) AS ?line)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?print ?printLabel ?image ?pop ?popLabel ?popCoords ?subject ?subjectLabel ?subjectCoords ?line ?layer WHERE {\n$print wdt:[property:part of] wd:[entity:Welsh Landscape Collection] ;\nwdt:[property:place of publication] ?pop .\nOPTIONAL { ?print wdt:[property:image] ?image .}\n?pop wdt:[property:coordinate location] ?popCoords .\n?pop p:[property:coordinate location] [ ps:[property:coordinate location] []; psv:[property:coordinate location] [ wikibase:geoLongitude ?poplon; wikibase:geoLatitude ?poplat; ] ].\n$print p:[property:main subject] ?printstmt .\n?printstmt ps:[property:main subject] ?subject .\n?subject wdt:[property:coordinate location] ?subjectCoords .\n?subject p:[property:coordinate location] [\nps:[property:coordinate location] [];\npsv:[property:coordinate location] [\nwikibase:geoLongitude ?subjectlon;\nwikibase:geoLatitude ?subjectlat;\n]\n].\n?pop rdfs:label ?layer .\nFILTER (LANG(?layer) = \"en\")\nBIND(CONCAT('LINESTRING (', STR(?poplon), ' ', STR(?poplat), ',', STR(?subjectlon), ' ', STR(?subjectlat), ')') AS ?str) .\nBIND(STRDT(?str, geo:wktLiteral) AS ?line)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "2814",
    "instruction": "Show me a map of places named after locations in Rennes, with colors based on their distance from the city.",
    "query": "SELECT ?loc ?locLabel ?item ?itemLabel ?coordRennes ?dist ?rgb WHERE {\n?loc wdt:P131 wd:Q647 ;\nwdt:P138 ?item ;\nwdt:P625 ?coordRennes .\n?item wdt:P31 ?type ; wdt:P625 ?coord .\nBIND(ROUND(geof:distance(?coordRennes, ?coord)*10)/10 AS ?dist ).\nBIND( IF( ?dist < 400 , \"FBB806\", IF ( ?dist < 1000 , \"DE4710\" , IF ( ?dist < 2000 , \"DE4710\" , \"940E0E\" ) ) ) AS ?rgb).\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?loc ?locLabel ?item ?itemLabel ?coordRennes ?dist ?rgb WHERE {\n?loc wdt:[property:located in the administrative territorial entity] wd:[entity:Rennes] ;\nwdt:[property:named after] ?item ;\nwdt:[property:coordinate location] ?coordRennes .\n?item wdt:[property:instance of] ?type ; wdt:[property:coordinate location] ?coord .\nBIND(ROUND(geof:distance(?coordRennes, ?coord)*10)/10 AS ?dist ).\nBIND( IF( ?dist < 400 , \"FBB806\", IF ( ?dist < 1000 , \"DE4710\" , IF ( ?dist < 2000 , \"DE4710\" , \"940E0E\" ) ) ) AS ?rgb).\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  }
]