[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "1115",
    "instruction": "List women without Wikipedia articles, sorted by the number of statements about them.",
    "query": "SELECT ?woman ?womanLabel ?womanDescription ?statements\nWITH {\nSELECT ?woman ?statements WHERE {\n?woman wdt:P31 wd:Q5;\nwdt:P21 wd:Q6581072.\nMINUS {\n?article schema:isPartOf [ wikibase:wikiGroup \"wikipedia\" ];\nschema:about ?woman.\n}\n?woman wikibase:statements ?statements. hint:Prior hint:rangeSafe true.\n}\nORDER BY DESC(?statements)\nLIMIT 1000\n} AS %women WHERE {\nINCLUDE %women.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?statements)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX hint: <http://www.bigdata.com/queryHints#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?woman ?womanLabel ?womanDescription ?statements\nWITH {\nSELECT ?woman ?statements WHERE {\n?woman wdt:[property:instance of] wd:[entity:human];\nwdt:[property:sex or gender] wd:[entity:female].\nMINUS {\n?article schema:isPartOf [ wikibase:wikiGroup \"wikipedia\" ];\nschema:about ?woman.\n}\n?woman wikibase:statements ?statements. hint:Prior hint:rangeSafe true.\n}\nORDER BY DESC(?statements)\nLIMIT 1000\n} AS %women WHERE {\nINCLUDE %women.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?statements)",
    "complexity": "complex"
  },
  {
    "id": "892",
    "instruction": "List all places with an elevation of less than 10 meters above sea level.",
    "query": "SELECT ?p ?location ?el ?image WHERE {\n?p p:P2044/psv:P2044 ?pel.\n?pel wikibase:quantityAmount ?el.\n?pel wikibase:quantityUnit ?unit.\nbind(0.01 as ?km).\nfilter( (?el < ?km*1000 && ?unit = wd:Q11573) ||\n(?el < ?km*3281 && ?unit = wd:Q3710)\n|| (?el < ?km && ?unit = wd:Q828224) ).\n?p wdt:P625 ?location.\noptional { ?p wdt:P18 ?image }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?p ?location ?el ?image WHERE {\n?p p:[property:elevation above sea level]/psv:[property:elevation above sea level] ?pel.\n?pel wikibase:quantityAmount ?el.\n?pel wikibase:quantityUnit ?unit.\nbind(0.01 as ?km).\nfilter( (?el < ?km*1000 && ?unit = wd:[entity:metre]) ||\n(?el < ?km*3281 && ?unit = wd:[entity:foot])\n|| (?el < ?km && ?unit = wd:[entity:kilometre]) ).\n?p wdt:[property:coordinate location] ?location.\noptional { ?p wdt:[property:image] ?image }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}",
    "complexity": "complex"
  },
  {
    "id": "1633",
    "instruction": "What properties are commonly used to connect military personnel to their organizations?",
    "query": "SELECT ?count ?property ?propertyLabel ?samp WHERE {\n{\nSELECT (COUNT(?item) AS ?count) ?property (SAMPLE(?item) AS ?samp) WHERE {\nhint:Query hint:optimizer \"None\".\n?org_class wdt:P279* wd:Q17149090.\n?org wdt:P31? ?org_class .\n?item ?prop ?org .\n?item wdt:P106 ?role .\n?role wdt:P279* wd:Q1250916 .\n?property wikibase:directClaim ?prop .\n} GROUP BY ?property\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC (?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX hint: <http://www.bigdata.com/queryHints#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?count ?property ?propertyLabel ?samp WHERE {\n{\nSELECT (COUNT(?item) AS ?count) ?property (SAMPLE(?item) AS ?samp) WHERE {\nhint:Query hint:optimizer \"None\".\n?org_class wdt:[property:subclass of]* wd:[entity:armed organization].\n?org wdt:[property:instance of]? ?org_class .\n?item ?prop ?org .\n?item wdt:[property:occupation] ?role .\n?role wdt:[property:subclass of]* wd:[entity:warrior] .\n?property wikibase:directClaim ?prop .\n} GROUP BY ?property\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC (?count)",
    "complexity": "complex"
  },
  {
    "id": "2135",
    "instruction": "List the most extreme cities in the UK, including their coordinates.",
    "query": "SELECT ?item ?itemLabel ?desc ?coords WITH {\nSELECT ?item ?lon ?lat ?coords WHERE {\n?item wdt:P31 wd:Q515 .\n?item wdt:P17 wd:Q145 .\n?item p:P625 [\nps:P625 ?coords;\npsv:P625 [\nwikibase:geoLongitude ?lon;\nwikibase:geoLatitude ?lat;\n]\n] .\nFILTER (?lat > 40) # filtering out British Oversea Terrroties\n} } AS %cities\nWITH { SELECT ?item ?desc ?coords {\nINCLUDE %cities\nBIND (\"Most easterly\" AS ?desc)\n} ORDER BY DESC (?lon)\nLIMIT 1 } AS %easterly\nWITH { SELECT ?item ?desc ?coords {\nINCLUDE %cities\nBIND (\"Most westerly\" AS ?desc)\n} ORDER BY ASC (?lon)\nLIMIT 1 } AS %westerly\nWITH { SELECT ?item ?desc ?coords {\nINCLUDE %cities\nBIND (\"Most northerly\" AS ?desc)\n} ORDER BY DESC (?lat)\nLIMIT 1 } AS %northerly\nWITH { SELECT ?item ?desc ?coords {\nINCLUDE %cities\nBIND (\"Most southernly\" AS ?desc)\n} ORDER BY ASC (?lat)\nLIMIT 1 } AS %southerly\nWHERE {\n{ INCLUDE %easterly }\nUNION\n{ INCLUDE %westerly }\nUNION\n{ INCLUDE %northerly }\nUNION\n{ INCLUDE %southerly }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?desc ?coords WITH {\nSELECT ?item ?lon ?lat ?coords WHERE {\n?item wdt:[property:instance of] wd:[entity:city] .\n?item wdt:[property:country] wd:[entity:United Kingdom] .\n?item p:[property:coordinate location] [\nps:[property:coordinate location] ?coords;\npsv:[property:coordinate location] [\nwikibase:geoLongitude ?lon;\nwikibase:geoLatitude ?lat;\n]\n] .\nFILTER (?lat > 40) # filtering out British Oversea Terrroties\n} } AS %cities\nWITH { SELECT ?item ?desc ?coords {\nINCLUDE %cities\nBIND (\"Most easterly\" AS ?desc)\n} ORDER BY DESC (?lon)\nLIMIT 1 } AS %easterly\nWITH { SELECT ?item ?desc ?coords {\nINCLUDE %cities\nBIND (\"Most westerly\" AS ?desc)\n} ORDER BY ASC (?lon)\nLIMIT 1 } AS %westerly\nWITH { SELECT ?item ?desc ?coords {\nINCLUDE %cities\nBIND (\"Most northerly\" AS ?desc)\n} ORDER BY DESC (?lat)\nLIMIT 1 } AS %northerly\nWITH { SELECT ?item ?desc ?coords {\nINCLUDE %cities\nBIND (\"Most southernly\" AS ?desc)\n} ORDER BY ASC (?lat)\nLIMIT 1 } AS %southerly\nWHERE {\n{ INCLUDE %easterly }\nUNION\n{ INCLUDE %westerly }\nUNION\n{ INCLUDE %northerly }\nUNION\n{ INCLUDE %southerly }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "1037",
    "instruction": "What are the upcoming creative works, including films and TV series, that will be released soon?",
    "query": "SELECT ?work ?workLabel ?classLabel ?date WHERE {\n{\nSELECT DISTINCT ?work (SAMPLE(?class) AS ?class) (MIN(?date) AS ?date) WHERE {\n?work wdt:P31 ?class;\nwdt:P577 ?date.\n?class wdt:P279* wd:Q386724.\nFILTER(?date > NOW()).\n}\nGROUP BY ?work\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\", \"de\". }\n}\nORDER BY ?date",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?work ?workLabel ?classLabel ?date WHERE {\n{\nSELECT DISTINCT ?work (SAMPLE(?class) AS ?class) (MIN(?date) AS ?date) WHERE {\n?work wdt:[property:instance of] ?class;\nwdt:[property:publication date] ?date.\n?class wdt:[property:subclass of]* wd:[entity:work].\nFILTER(?date > NOW()).\n}\nGROUP BY ?work\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\", \"de\". }\n}\nORDER BY ?date",
    "complexity": "complex"
  },
  {
    "id": "1573",
    "instruction": "What is the decrease in sex ratio for mandals of West Godavari district between 2001 and 2011?",
    "query": "SELECT DISTINCT ?vLabel ?pop {\n?v wdt:P31 wd:Q13005188 .\n?v wdt:P131* wd:Q15404.\n?v p:P1539 ?fps11. ?fps11 ps:P1539 ?fp11. ?fps11 pq:P585 ?fp11d. FILTER(year(?fp11d) = 2011).\n?v p:P1539 ?fps01. ?fps01 ps:P1539 ?fp01. ?fps01 pq:P585 ?fp01d. FILTER(year(?fp01d) = 2001).\n?v p:P1540 ?mps11. ?mps11 ps:P1540 ?mp11. ?mps11 pq:P585 ?mp11d. FILTER(year(?mp11d) = 2011).\n?v p:P1540 ?mps01. ?mps01 ps:P1540 ?mp01. ?mps01 pq:P585 ?mp01d. FILTER(year(?mp01d) = 2001).\nBIND((xsd:integer(?mp11)/xsd:integer(?fp11)) - (xsd:integer(?mp01)/xsd:integer(?fp01)) as ?change)\nBIND(IF(?change < 0, -1 * ?change, 0) as ?pop).\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"te,en\" }\n}\nGROUP BY ?pop ?vLabel\nORDER BY DESC(?pop)\n#",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?vLabel ?pop {\n?v wdt:[property:instance of] wd:Q13005188 .\n?v wdt:[property:located in the administrative territorial entity]* wd:[entity:West Godavari district].\n?v p:[property:female population] ?fps11. ?fps11 ps:[property:female population] ?fp11. ?fps11 pq:[property:point in time] ?fp11d. FILTER(year(?fp11d) = 2011).\n?v p:[property:female population] ?fps01. ?fps01 ps:[property:female population] ?fp01. ?fps01 pq:[property:point in time] ?fp01d. FILTER(year(?fp01d) = 2001).\n?v p:[property:male population] ?mps11. ?mps11 ps:[property:male population] ?mp11. ?mps11 pq:[property:point in time] ?mp11d. FILTER(year(?mp11d) = 2011).\n?v p:[property:male population] ?mps01. ?mps01 ps:[property:male population] ?mp01. ?mps01 pq:[property:point in time] ?mp01d. FILTER(year(?mp01d) = 2001).\nBIND((xsd:integer(?mp11)/xsd:integer(?fp11)) - (xsd:integer(?mp01)/xsd:integer(?fp01)) as ?change)\nBIND(IF(?change < 0, -1 * ?change, 0) as ?pop).\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"te,en\" }\n}\nGROUP BY ?pop ?vLabel\nORDER BY DESC(?pop)\n#",
    "complexity": "complex"
  },
  {
    "id": "2217",
    "instruction": "Find places named after L. L. Zamenhof or the language he created.",
    "query": "SELECT DISTINCT ?item ?itemLabel WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE]\". }\n{ SELECT DISTINCT ?item WHERE { ?item (p:P31/ps:P31/(wdt:P279*)) wd:Q75762. } }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE]\". }\n{ SELECT DISTINCT ?item WHERE { ?item (p:[property:instance of]/ps:[property:instance of]/(wdt:[property:subclass of]*)) wd:[entity:Zamenhof-Esperanto object]. } }\n}",
    "complexity": "complex"
  },
  {
    "id": "1327",
    "instruction": "List people born on a watercraft or at the sea.",
    "query": "SELECT DISTINCT ?person ?personLabel ?placeLabel ?dob WHERE {\n?person wdt:P19 ?place.\n{ ?place wdt:P31/wdt:P279* wd:Q165. } UNION { ?place wdt:P31/wdt:P279* wd:Q1229765. }\nOPTIONAL { ?person wdt:P569 ?dob. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nORDER BY ?dob ?placeLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?person ?personLabel ?placeLabel ?dob WHERE {\n?person wdt:[property:place of birth] ?place.\n{ ?place wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:sea]. } UNION { ?place wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:watercraft]. }\nOPTIONAL { ?person wdt:[property:date of birth] ?dob. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nORDER BY ?dob ?placeLabel",
    "complexity": "complex"
  },
  {
    "id": "1058",
    "instruction": "List the most common birth years in Wikidata.",
    "query": "SELECT ?yearOfBirth (SUM(?count) AS ?total) WHERE {\n{\nSELECT ?dateOfBirth (COUNT(?item) AS ?count) WHERE {\nVALUES ?precision { \"9\"^^xsd:integer \"10\"^^xsd:integer \"11\"^^xsd:integer }\n?item wdt:P31 wd:Q5;\np:P569/psv:P569 [\nwikibase:timeValue ?dateOfBirth;\nwikibase:timePrecision ?precision\n].\n}\nGROUP BY ?dateOfBirth\n}\nBIND(YEAR(?dateOfBirth) AS ?yearOfBirth)\n}\nGROUP BY ?yearOfBirth\nORDER BY DESC(?total)\nLIMIT 100",
    "annotated": "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?yearOfBirth (SUM(?count) AS ?total) WHERE {\n{\nSELECT ?dateOfBirth (COUNT(?item) AS ?count) WHERE {\nVALUES ?precision { \"9\"^^xsd:integer \"10\"^^xsd:integer \"11\"^^xsd:integer }\n?item wdt:[property:instance of] wd:[entity:human];\np:[property:date of birth]/psv:[property:date of birth] [\nwikibase:timeValue ?dateOfBirth;\nwikibase:timePrecision ?precision\n].\n}\nGROUP BY ?dateOfBirth\n}\nBIND(YEAR(?dateOfBirth) AS ?yearOfBirth)\n}\nGROUP BY ?yearOfBirth\nORDER BY DESC(?total)\nLIMIT 100",
    "complexity": "complex"
  },
  {
    "id": "1240",
    "instruction": "Find the nearest library to each public bookcase in Vienna.",
    "query": "SELECT ?item ?itemLabel ?location ?layer ?nearestitemLabel ?nearestitem\nWITH {\nSELECT ?bookcase ?location1 (MIN(?distance) AS ?minDistance) WHERE {\n?bookcase wdt:P31 wd:Q294297;\nwdt:P625 ?location1;\nwdt:P131 wd:Q1741.\n?library wdt:P31 wd:Q28564;\nwdt:P625 ?location2;\nwdt:P131 wd:Q1741.\nBIND(geof:distance(?location1, ?location2) AS ?distance)\n}\nGROUP BY ?bookcase ?location1\n} AS %bookcasesWithDistance\nWITH {\nSELECT ?bookcase ?location1 ?library ?location2 ?distance WHERE {\nINCLUDE %bookcasesWithDistance.\n?library wdt:P31 wd:Q28564;\nwdt:P625 ?location2;\nwdt:P131 wd:Q1741.\nBIND(geof:distance(?location1, ?location2) AS ?distance)\nFILTER(?distance = ?minDistance)\n}\n} AS %bookcasesWithLibraries\nWHERE {\nINCLUDE %bookcasesWithLibraries.\nVALUES ?switch { true false }\nBIND(IF(?switch, \"Bucherschrank\"@de, \"Bibliothek\"@de) AS ?layer)\nBIND(IF(?switch, ?bookcase, ?library) AS ?item)\nBIND(IF(?switch, ?location1, ?location2) AS ?location)\nBIND(IF(?switch, ?library, ?bookcase) AS ?nearestitem)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,de\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?location ?layer ?nearestitemLabel ?nearestitem\nWITH {\nSELECT ?bookcase ?location1 (MIN(?distance) AS ?minDistance) WHERE {\n?bookcase wdt:[property:instance of] wd:[entity:public bookcase];\nwdt:[property:coordinate location] ?location1;\nwdt:[property:located in the administrative territorial entity] wd:[entity:Vienna].\n?library wdt:[property:instance of] wd:[entity:public library];\nwdt:[property:coordinate location] ?location2;\nwdt:[property:located in the administrative territorial entity] wd:[entity:Vienna].\nBIND(geof:distance(?location1, ?location2) AS ?distance)\n}\nGROUP BY ?bookcase ?location1\n} AS %bookcasesWithDistance\nWITH {\nSELECT ?bookcase ?location1 ?library ?location2 ?distance WHERE {\nINCLUDE %bookcasesWithDistance.\n?library wdt:[property:instance of] wd:[entity:public library];\nwdt:[property:coordinate location] ?location2;\nwdt:[property:located in the administrative territorial entity] wd:[entity:Vienna].\nBIND(geof:distance(?location1, ?location2) AS ?distance)\nFILTER(?distance = ?minDistance)\n}\n} AS %bookcasesWithLibraries\nWHERE {\nINCLUDE %bookcasesWithLibraries.\nVALUES ?switch { true false }\nBIND(IF(?switch, \"Bucherschrank\"@de, \"Bibliothek\"@de) AS ?layer)\nBIND(IF(?switch, ?bookcase, ?library) AS ?item)\nBIND(IF(?switch, ?location1, ?location2) AS ?location)\nBIND(IF(?switch, ?library, ?bookcase) AS ?nearestitem)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,de\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "1824",
    "instruction": "List all lexemes with their corresponding lemmas and languages where the lemma's length matches its numeric value.",
    "query": "SELECT ?lexeme ?lemma ?languageLabel ?number WHERE {\n?lexeme wikibase:lemma ?lemma;\ndct:language ?language;\nontolex:sense/wdt:P5137 [\nwdt:P31 wd:Q21199; # exclude ordinal numbers (\"fifth\" is 5 letters long)\nwdt:P1181 ?number\n].\nFILTER(STRLEN(?lemma) = ?number)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY ?number",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX dct: <http://purl.org/dc/terms/>\nPREFIX ontolex: <http://www.w3.org/ns/lemon/ontolex#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?lexeme ?lemma ?languageLabel ?number WHERE {\n?lexeme wikibase:lemma ?lemma;\ndct:language ?language;\nontolex:sense/wdt:[property:item for this sense] [\nwdt:[property:instance of] wd:[entity:natural number]; # exclude ordinal numbers (\"fifth\" is 5 letters long)\nwdt:[property:numeric value] ?number\n].\nFILTER(STRLEN(?lemma) = ?number)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY ?number",
    "complexity": "complex"
  },
  {
    "id": "178",
    "instruction": "List the most common properties of a television series on Wikipedia, excluding external IDs.",
    "query": "SELECT ?id ?idlabel (round(?count*1000/?total)/10 AS ?percent)\nWITH {\nSELECT ?item WHERE {\n?item wdt:P31/wdt:P279? wd:Q5398426 .\n?arwp schema:about ?item ; schema:isPartOf <https://ary.wikipedia.org/>\n}\n} AS %list\nWITH {\nSELECT (COUNT(?item) AS ?total) WHERE {\ninclude %list\n}\n} AS %total\nWITH {\nSELECT ?id (COUNT(DISTINCT ?item) AS ?count) WHERE {\ninclude %list\n?item ?p [] .\n?id wikibase:claim ?p . FILTER(?p != p:P31)\nMINUS { ?id wikibase:propertyType wikibase:ExternalId }\n}\nGROUP BY ?id\n} AS %props\nWHERE {\ninclude %props\ninclude %total\n?id rdfs:label ?idlabel . FILTER (lang(?idlabel) = \"en\")\n}\nORDER BY DESC(?percent)\nLIMIT 50",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?id ?idlabel (round(?count*1000/?total)/10 AS ?percent)\nWITH {\nSELECT ?item WHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]? wd:[entity:television series] .\n?arwp schema:about ?item ; schema:isPartOf <https://ary.wikipedia.org/>\n}\n} AS %list\nWITH {\nSELECT (COUNT(?item) AS ?total) WHERE {\ninclude %list\n}\n} AS %total\nWITH {\nSELECT ?id (COUNT(DISTINCT ?item) AS ?count) WHERE {\ninclude %list\n?item ?p [] .\n?id wikibase:claim ?p . FILTER(?p != p:[property:instance of])\nMINUS { ?id wikibase:propertyType wikibase:ExternalId }\n}\nGROUP BY ?id\n} AS %props\nWHERE {\ninclude %props\ninclude %total\n?id rdfs:label ?idlabel . FILTER (lang(?idlabel) = \"en\")\n}\nORDER BY DESC(?percent)\nLIMIT 50",
    "complexity": "complex"
  },
  {
    "id": "660",
    "instruction": "List the names of Indian actresses who are still alive.",
    "query": "SELECT ?item ?itemLabel ?itemDescription (SAMPLE(?img) AS ?image) (SAMPLE(?dob) AS ?dob) ?sl\nWHERE {\n?item wdt:P106 wd:Q33999 ;\nwdt:P27 wd:Q668 ;\nwdt:P21 wd:Q6581072 .\nMINUS { ?item wdt:P570 [] }\nOPTIONAL { ?item wdt:P18 ?img }\nOPTIONAL { ?item wdt:P569 ?dob }\nOPTIONAL { ?item wikibase:sitelinks ?sl }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\"}\n} GROUP BY ?item ?itemLabel ?itemDescription ?sl\nORDER BY DESC(?sl)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?itemDescription (SAMPLE(?img) AS ?image) (SAMPLE(?dob) AS ?dob) ?sl\nWHERE {\n?item wdt:[property:occupation] wd:[entity:actor] ;\nwdt:[property:country of citizenship] wd:[entity:India] ;\nwdt:[property:sex or gender] wd:[entity:female] .\nMINUS { ?item wdt:[property:date of death] [] }\nOPTIONAL { ?item wdt:[property:image] ?img }\nOPTIONAL { ?item wdt:[property:date of birth] ?dob }\nOPTIONAL { ?item wikibase:sitelinks ?sl }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\"}\n} GROUP BY ?item ?itemLabel ?itemDescription ?sl\nORDER BY DESC(?sl)",
    "complexity": "complex"
  },
  {
    "id": "572",
    "instruction": "What are the buildings that exist in more than one country?",
    "query": "SELECT ?item ?itemLabel ?count\nWHERE\n{\n{\nSELECT ?item (COUNT(DISTINCT ?country) AS ?count) WHERE {\n?item wdt:P31/wdt:P279* wd:Q41176 .\n?item wdt:P17 ?country .\nFILTER NOT EXISTS { ?country wdt:P576 ?end }\n}\nGROUP BY ?item\n}\nFILTER ( ?count > 1 )\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n}\nORDER BY DESC(?count) ?itemL",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?count\nWHERE\n{\n{\nSELECT ?item (COUNT(DISTINCT ?country) AS ?count) WHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:building] .\n?item wdt:[property:country] ?country .\nFILTER NOT EXISTS { ?country wdt:[property:dissolved, abolished or demolished date] ?end }\n}\nGROUP BY ?item\n}\nFILTER ( ?count > 1 )\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n}\nORDER BY DESC(?count) ?itemL",
    "complexity": "complex"
  },
  {
    "id": "2151",
    "instruction": "List all UK parliamentary career seat-party-start pairs for a specific MP.",
    "query": "SELECT distinct ?mp ?mpLabel ?pLabel ?sLabel ?start (min(?end)as ?end2)(round(?end2- ?start)as ?days)(concat(?sLabel,' (',?pLabel,'), ',str(year(?start)),'-',str(year(?end2))) as ?string)\nwhere{VALUES ?mp{wd:Q160852}#set MP here\n#seat-party-start pairs for each continuing office period\n{SELECT distinct ?mp ?mpLabel ?pLabel ?sLabel ?start\nWHERE{?mp p:P39 ?ps.?ps ps:P39 ?t;pq:P768 ?s;pq:P4100 ?p;pq:P580 ?start.?t wdt:P279 wd:Q16707842.\nminus{?ps pq:P2715 ?elec.?elec wdt:P31 wd:Q15283424.?mp p:P39[ps:P39 ?t0; pq:P4100 ?p; pq:P768 ?s; pq:P1534 wd:Q741182].?t0 wdt:P156 ?t}\nminus{?ps pq:P1534 wd:Q50393121} # omit untaken double-return seats\nSERVICE wikibase:label{bd:serviceParam wikibase:language \"en\"}}ORDER BY ?mp ?start}\n#corresponding seat-party-end pairs\n{SELECT distinct ?mp ?mpLabel ?pLabel ?sLabel ?end\nWHERE{?mp p:P39 ?ps.?ps ps:P39 ?t;pq:P768 ?s;pq:P4100 ?p;pq:P582 ?end.?t wdt:P279 wd:Q16707842.\nminus{?ps pq:P1534 wd:Q741182.?mp p:P39[ps:P39 ?t2;pq:P4100 ?p;pq:P768 ?s;pq:P2715 ?elec].?t2 wdt:P155 ?t.?elec wdt:P31 wd:Q15283424}\nminus{?ps pq:P1534 wd:Q50393121}#omit untaken double-return seats\nSERVICE wikibase:label{bd:serviceParam wikibase:language \"en\"}}ORDER BY ?mp ?end}\nfilter(?end > ?start)#> not >=\n}group by ?mp ?mpLabel ?pLabel ?sLabel ?start order by ?start",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT distinct ?mp ?mpLabel ?pLabel ?sLabel ?start (min(?end)as ?end2)(round(?end2- ?start)as ?days)(concat(?sLabel,' (',?pLabel,'), ',str(year(?start)),'-',str(year(?end2))) as ?string)\nwhere{VALUES ?mp{wd:[entity:William Ewart Gladstone]}#set MP here\n#seat-party-start pairs for each continuing office period\n{SELECT distinct ?mp ?mpLabel ?pLabel ?sLabel ?start\nWHERE{?mp p:[property:position held] ?ps.?ps ps:[property:position held] ?t;pq:[property:electoral district] ?s;pq:[property:parliamentary group] ?p;pq:[property:start time] ?start.?t wdt:[property:subclass of] wd:[entity:Member of Parliament].\nminus{?ps pq:[property:elected in] ?elec.?elec wdt:[property:instance of] wd:[entity:United Kingdom general election].?mp p:[property:position held][ps:[property:position held] ?t0; pq:[property:parliamentary group] ?p; pq:[property:electoral district] ?s; pq:[property:end cause] wd:[entity:dissolution of parliament]].?t0 wdt:[property:followed by] ?t}\nminus{?ps pq:[property:end cause] wd:[entity:returned for another seat and chose to sit there]} # omit untaken double-return seats\nSERVICE wikibase:label{bd:serviceParam wikibase:language \"en\"}}ORDER BY ?mp ?start}\n#corresponding seat-party-end pairs\n{SELECT distinct ?mp ?mpLabel ?pLabel ?sLabel ?end\nWHERE{?mp p:[property:position held] ?ps.?ps ps:[property:position held] ?t;pq:[property:electoral district] ?s;pq:[property:parliamentary group] ?p;pq:[property:end time] ?end.?t wdt:[property:subclass of] wd:[entity:Member of Parliament].\nminus{?ps pq:[property:end cause] wd:[entity:dissolution of parliament].?mp p:[property:position held][ps:[property:position held] ?t2;pq:[property:parliamentary group] ?p;pq:[property:electoral district] ?s;pq:[property:elected in] ?elec].?t2 wdt:[property:follows] ?t.?elec wdt:[property:instance of] wd:[entity:United Kingdom general election]}\nminus{?ps pq:[property:end cause] wd:[entity:returned for another seat and chose to sit there]}#omit untaken double-return seats\nSERVICE wikibase:label{bd:serviceParam wikibase:language \"en\"}}ORDER BY ?mp ?end}\nfilter(?end > ?start)#> not >=\n}group by ?mp ?mpLabel ?pLabel ?sLabel ?start order by ?start",
    "complexity": "complex"
  },
  {
    "id": "379",
    "instruction": "List all the women with their birth and death dates.",
    "query": "SELECT ?personLabel ?person ?enwp (SAMPLE(?image) AS ?img) ?birthdate ?birthdatePrecision ?deaddate ?deaddatePrecision WHERE {\nVALUES ?person {wd:Q234816 wd:Q62530 wd:Q234421 wd:Q231549 wd:Q246135 wd:Q101638 wd:Q15994440 wd:Q230120 wd:Q260378 wd:Q1377789 wd:Q5322139 wd:Q254858 wd:Q6766368 wd:Q7259 wd:Q4949015 wd:Q47152 wd:Q272077 wd:Q198984 wd:Q1284275 wd:Q651786 wd:Q460152 wd:Q230507 wd:Q3263690 wd:Q270855 wd:Q5362637 wd:Q23620545 wd:Q27728558 wd:Q17892 wd:Q36322 wd:Q57286 wd:Q18576000 wd:Q45410399 wd:Q7207} .\n?enwp schema:about ?person ; schema:isPartOf <https://en.wikipedia.org/>\nOPTIONAL{ ?person wdt:P18 ?image }\nOPTIONAL{ ?person p:P569/psv:P569 ?birthdateStatementNode .\n?birthdateStatementNode wikibase:timeValue ?birthdate .\n?birthdateStatementNode wikibase:timePrecision ?birthdatePrecision .}\nOPTIONAL{ ?person p:P570/psv:P570 ?deaddateStatementNode .\n?deaddateStatementNode wikibase:timeValue ?deaddate .\n?deaddateStatementNode wikibase:timePrecision ?deaddatePrecision .}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} GROUP BY ?personLabel ?person ?enwp ?birthdate ?birthdatePrecision ?deaddate ?deaddatePrecision",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?personLabel ?person ?enwp (SAMPLE(?image) AS ?img) ?birthdate ?birthdatePrecision ?deaddate ?deaddatePrecision WHERE {\nVALUES ?person {wd:[entity:Christine de Pizan] wd:[entity:Maria Sibylla Merian] wd:[entity:Mary Read] wd:[entity:Anne Bonny] wd:[entity:Mary Lacy] wd:[entity:Mary Wollstonecraft] wd:[entity:Mabel Purefoy FitzGerald] wd:[entity:Julia Margaret Cameron] wd:[entity:Victoria Woodhull] wd:[entity:Emily Hobhouse] wd:[entity:E. S. Drower] wd:[entity:Emily Davison] wd:[entity:Marjory Wardrop] wd:[entity:Ada Lovelace] wd:[entity:Mary Frith] wd:[entity:Mary Shelley] wd:[entity:Ise] wd:[entity:Ono no Komachi] wd:[entity:Saig\u016b no Ny\u014dgo] wd:[entity:Kodai no Kimi] wd:[entity:Nakatsukasa] wd:[entity:Saint Margaret of Scotland] wd:[entity:Louise Bourgeois Boursier] wd:[entity:Mary Toft] wd:[entity:Elizabeth Creed] wd:[entity:Sybil Pye] wd:[entity:Elizabeth Hunter Holt] wd:[entity:Sappho] wd:[entity:Jane Austen] wd:[entity:Fanny Mendelssohn] wd:[entity:Clara Mordan] wd:[entity:Mary Ferrar] wd:[entity:Elizabeth I of England]} .\n?enwp schema:about ?person ; schema:isPartOf <https://en.wikipedia.org/>\nOPTIONAL{ ?person wdt:[property:image] ?image }\nOPTIONAL{ ?person p:[property:date of birth]/psv:[property:date of birth] ?birthdateStatementNode .\n?birthdateStatementNode wikibase:timeValue ?birthdate .\n?birthdateStatementNode wikibase:timePrecision ?birthdatePrecision .}\nOPTIONAL{ ?person p:[property:date of death]/psv:[property:date of death] ?deaddateStatementNode .\n?deaddateStatementNode wikibase:timeValue ?deaddate .\n?deaddateStatementNode wikibase:timePrecision ?deaddatePrecision .}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} GROUP BY ?personLabel ?person ?enwp ?birthdate ?birthdatePrecision ?deaddate ?deaddatePrecision",
    "complexity": "complex"
  }
]