[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "1367",
    "instruction": "List the birthplaces of French presidential candidates since 1958.",
    "query": "SELECT DISTINCT ?candidat ?candidatLabel ?naissanceLieuLabel ?naissanceLieuCoords WHERE {\n?election wdt:P31 wd:Q890055 ;\nwdt:P726 ?candidat .\n?candidat wdt:P19 ?naissanceLieu .\n?naissanceLieu wdt:P625 ?naissanceLieuCoords .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\" . }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?candidat ?candidatLabel ?naissanceLieuLabel ?naissanceLieuCoords WHERE {\n?election wdt:[property:instance of] wd:[entity:presidential election in France] ;\nwdt:[property:candidate] ?candidat .\n?candidat wdt:[property:place of birth] ?naissanceLieu .\n?naissanceLieu wdt:[property:coordinate location] ?naissanceLieuCoords .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\" . }\n}",
    "complexity": "medium"
  },
  {
    "id": "68",
    "instruction": "Show me the birthplaces of painters in the Rijksmuseum collection on a map.",
    "query": "SELECT DISTINCT ?painter ?painterLabel ?birthplaceLabel ?geoloc where {\n?painting wdt:P31/wdt:P279* wd:Q3305213 ; # any painting (or type of painting)\nwdt:P195 wd:Q190804 ; # in collection Rijksmuseum\nwdt:P170 ?painter . # get painter\n?painter wdt:P19 ?birthplace . # get painter's birthplace\n?birthplace wdt:P625 ?geoloc . #latitude and longitude\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,fr,es\"\n}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?painter ?painterLabel ?birthplaceLabel ?geoloc where {\n?painting wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:painting] ; # any painting (or type of painting)\nwdt:[property:collection] wd:[entity:Rijksmuseum] ; # in collection Rijksmuseum\nwdt:[property:creator] ?painter . # get painter\n?painter wdt:[property:place of birth] ?birthplace . # get painter's birthplace\n?birthplace wdt:[property:coordinate location] ?geoloc . #latitude and longitude\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,fr,es\"\n}\n}",
    "complexity": "medium"
  },
  {
    "id": "793",
    "instruction": "List all female dog sled racers.",
    "query": "select distinct ?musher ?musherLabel\nwhere {\n{ ?musher wdt:P31 wd:Q5 .\n?musher wdt:P106 wd:Q500097 .\n?musher wdt:P21 wd:Q6581072}\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"fr,en\" . }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nselect distinct ?musher ?musherLabel\nwhere {\n{ ?musher wdt:[property:instance of] wd:[entity:human] .\n?musher wdt:[property:occupation] wd:[entity:human]00097 .\n?musher wdt:[property:sex or gender] wd:[entity:female]}\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"fr,en\" . }\n}",
    "complexity": "medium"
  },
  {
    "id": "1441",
    "instruction": "List all the winners of Humanitarian of the Year award.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?when (YEAR(?when) as ?date) ?pic\nWHERE {\n?item p:P166 ?awardStat . # ... with an awarded(P166) statement\n?awardStat ps:P166 wd:Q33232596 .\n?awardStat pq:P585 ?when .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\nOPTIONAL { ?item wdt:P18 ?pic }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?when (YEAR(?when) as ?date) ?pic\nWHERE {\n?item p:[property:award received] ?awardStat . # ... with an awarded([property:award received]) statement\n?awardStat ps:[property:award received] wd:[entity:Humanitarian of the Year] .\n?awardStat pq:[property:point in time] ?when .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\nOPTIONAL { ?item wdt:[property:image] ?pic }\n}",
    "complexity": "medium"
  },
  {
    "id": "70",
    "instruction": "List African American female visual artists and their artworks.",
    "query": "SELECT ?person ?personLabel ?personimage ?work ?workLabel ?workimage WHERE {\n?person wdt:P172 wd:Q49085 ; # African American\nwdt:P21 wd:Q6581072 ; # women\nwdt:P106/wdt:P279* wd:Q3391743 . # visual artists\nOPTIONAL{ ?person wdt:P18 ?personimage }\n?work wdt:P170 ?person . # and their work\nOPTIONAL{ ?work wdt:P18 ?workimage }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?person ?personLabel ?personimage ?work ?workLabel ?workimage WHERE {\n?person wdt:[property:ethnic group] wd:[entity:African Americans] ; # African American\nwdt:[property:sex or gender] wd:[entity:female] ; # women\nwdt:[property:occupation]/wdt:[property:subclass of]* wd:[entity:visual artist] . # visual artists\nOPTIONAL{ ?person wdt:[property:image] ?personimage }\n?work wdt:[property:creator] ?person . # and their work\nOPTIONAL{ ?work wdt:[property:image] ?workimage }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}",
    "complexity": "medium"
  },
  {
    "id": "2719",
    "instruction": "List the streets in Milan named after men.",
    "query": "SELECT ?street ?streetLabel ?layer ?coords WHERE {\n?street wdt:P31 wd:Q79007;\nwdt:P131 wd:Q490;\nwdt:P138 ?namedafter;\nwdt:P625 ?coords.\n?namedafter wdt:P21 ?gender.\nBIND(IF(?gender = wd:Q6581072, \"female\", \"male\") AS ?layer)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?street ?streetLabel ?layer ?coords WHERE {\n?street wdt:[property:instance of] wd:[entity:street];\nwdt:[property:located in the administrative territorial entity] wd:[entity:Milan];\nwdt:[property:named after] ?namedafter;\nwdt:[property:coordinate location] ?coords.\n?namedafter wdt:[property:sex or gender] ?gender.\nBIND(IF(?gender = wd:[entity:female], \"female\", \"male\") AS ?layer)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "1581",
    "instruction": "List all fictional swords from various narrative universes.",
    "query": "SELECT ?item ?itemLabel ?ownerLabel ?workLabel ?universeLabel WHERE {\n?item wdt:P31/wdt:P279* wd:Q15720873 .\nOPTIONAL { ?item wdt:P1080 ?universe }\nOPTIONAL { ?item wdt:P1441 ?work }\nOPTIONAL { ?item wdt:P127 ?owner }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY ?universeLabel ?itemLabel ?ownerLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?ownerLabel ?workLabel ?universeLabel WHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:fictional sword] .\nOPTIONAL { ?item wdt:[property:from narrative universe] ?universe }\nOPTIONAL { ?item wdt:[property:present in work] ?work }\nOPTIONAL { ?item wdt:[property:owned by] ?owner }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY ?universeLabel ?itemLabel ?ownerLabel",
    "complexity": "medium"
  },
  {
    "id": "1154",
    "instruction": "List video games set in the Star Wars Expanded Universe and their game modes.",
    "query": "SELECT ?application ?applicationLabel ?modeLabel WHERE {\n?application (wdt:P31/wdt:P279*) wd:Q7889.\n?application wdt:P1434 wd:Q3551295.\nOPTIONAL {?application wdt:P404 ?mode}.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?application ?applicationLabel ?modeLabel WHERE {\n?application (wdt:[property:instance of]/wdt:[property:subclass of]*) wd:[entity:video game].\n?application wdt:[property:takes place in fictional universe] wd:[entity:Star Wars Legends].\nOPTIONAL {?application wdt:[property:game mode] ?mode}.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "538",
    "instruction": "Find items with a GTAA ID and their corresponding articles on English and Dutch Wikipedia.",
    "query": "SELECT ?item ?itemLabel ?gtaa ?_articleEN ?_articleNL where {\n?item wdt:P1741 ?gtaa. # GTAA id\nOPTIONAL {\n?_articleEN schema:about ?item.\n?_articleNL schema:about ?item.\n?_articleEN schema:isPartOf <https://en.wikipedia.org/>.\n?_articleNL schema:isPartOf <https://nl.wikipedia.org/>.\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,nl\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?gtaa ?_articleEN ?_articleNL where {\n?item wdt:[property:GTAA ID] ?gtaa. # GTAA id\nOPTIONAL {\n?_articleEN schema:about ?item.\n?_articleNL schema:about ?item.\n?_articleEN schema:isPartOf <https://en.wikipedia.org/>.\n?_articleNL schema:isPartOf <https://nl.wikipedia.org/>.\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,nl\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "1312",
    "instruction": "List all mathematical formulas that use HTML escapes.",
    "query": "SELECT ?item ?itemLabel ?formula WHERE {\n?item wdt:P2534 ?formula.\nFILTER(CONTAINS(?formula, \"&\") || CONTAINS(?formula, \"\")).\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?formula WHERE {\n?item wdt:[property:defining formula] ?formula.\nFILTER(CONTAINS(?formula, \"&\") || CONTAINS(?formula, \"\")).\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "1854",
    "instruction": "Show me a map of traditional Upper Lusatian houses with their locations.",
    "query": "SELECT * WHERE {\n?item (wdt:P31*/wdt:P279*) wd:Q1362233.\n?item wdt:P625 ?geo.\nOPTIONAL { ?item wdt:P6375 ?Adresse. filter(lang(?Adresse)=\"de\")}\nOPTIONAL { ?item wdt:P18 ?Bild. }\n}",
    "annotated": "PREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT * WHERE {\n?item (wdt:[property:instance of]*/wdt:[property:subclass of]*) wd:[entity:Upper Lusatian house].\n?item wdt:[property:coordinate location] ?geo.\nOPTIONAL { ?item wdt:[property:street address] ?Adresse. filter(lang(?Adresse)=\"de\")}\nOPTIONAL { ?item wdt:[property:image] ?Bild. }\n}",
    "complexity": "medium"
  },
  {
    "id": "906",
    "instruction": "List the different types of historical monuments.",
    "query": "SELECT DISTINCT ?identifier (SAMPLE(?identifierL) AS ?label) (count(*) AS ?count) WHERE {\n?item wdt:P380 ?merimee .\n?item wdt:P31 ?identifier .\n?identifier rdfs:label ?identifierL filter (lang(?identifierL) = \"fr\") .\n}\nGROUP BY ?identifier\nORDER BY DESC(?count) ?label",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT DISTINCT ?identifier (SAMPLE(?identifierL) AS ?label) (count(*) AS ?count) WHERE {\n?item wdt:[property:M\u00e9rim\u00e9e ID] ?merimee .\n?item wdt:[property:instance of] ?identifier .\n?identifier rdfs:label ?identifierL filter (lang(?identifierL) = \"fr\") .\n}\nGROUP BY ?identifier\nORDER BY DESC(?count) ?label",
    "complexity": "medium"
  },
  {
    "id": "716",
    "instruction": "Find all Wikicite items with a DOI that contains the word 'Figshare'.",
    "query": "SELECT DISTINCT ?wikiciteLabel ?doi WHERE {\n?wikicite p:P356/ps:P356 ?doi .\n?statement prov:wasDerivedFrom ?ref .\n?ref pr:P356 ?doi .\nFILTER (CONTAINS(lcase(?doi), \"figshare\"))\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX prov: <http://www.w3.org/ns/prov#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pr: <http://www.wikidata.org/prop/reference/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?wikiciteLabel ?doi WHERE {\n?wikicite p:[property:DOI]/ps:[property:DOI] ?doi .\n?statement prov:wasDerivedFrom ?ref .\n?ref pr:[property:DOI] ?doi .\nFILTER (CONTAINS(lcase(?doi), \"figshare\"))\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "823",
    "instruction": "Show me a map of paintings with their locations and the number of paintings at each location.",
    "query": "SELECT ?locationLabel ?coord (count(*) as ?count)\nWHERE {\n?painting wdt:P31 wd:Q3305213 .\n?painting wdt:P276 ?location .\n?location wdt:P625 ?coord\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}\nGROUP BY ?locationLabel ?coord",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?locationLabel ?coord (count(*) as ?count)\nWHERE {\n?painting wdt:[property:instance of] wd:[entity:painting] .\n?painting wdt:[property:location] ?location .\n?location wdt:[property:coordinate location] ?coord\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}\nGROUP BY ?locationLabel ?coord",
    "complexity": "medium"
  },
  {
    "id": "42",
    "instruction": "List notable people whose doctoral advisor graduated from the University of Edinburgh.",
    "query": "SELECT ?alum ?alumLabel ?supervisee ?superviseeLabel ?fieldLabel\nWHERE {\n?alum wdt:P69 wd:Q160302.\n?supervisee wdt:P184 ?alum.\nOPTIONAL {?supervisee wdt:P101 ?field.}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?alum ?alumLabel ?supervisee ?superviseeLabel ?fieldLabel\nWHERE {\n?alum wdt:[property:educated at] wd:[entity:University of Edinburgh].\n?supervisee wdt:[property:doctoral advisor] ?alum.\nOPTIONAL {?supervisee wdt:[property:field of work] ?field.}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}",
    "complexity": "medium"
  },
  {
    "id": "60",
    "instruction": "What are the names of planets and their moons inspired by?",
    "query": "SELECT DISTINCT ?planet ?planetLabel ?planetDescription ?nom ?nomLabel ?nomDescription\nWHERE {\n?planet wdt:P31/wdt:P279* wd:Q3132741 .\n?planet wdt:P138 ?nom.\n?planet wdt:P397 ?parent.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }.\n} ORDER BY DESC(?parent)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?planet ?planetLabel ?planetDescription ?nom ?nomLabel ?nomDescription\nWHERE {\n?planet wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:substellar object] .\n?planet wdt:[property:named after] ?nom.\n?planet wdt:[property:parent astronomical body] ?parent.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }.\n} ORDER BY DESC(?parent)",
    "complexity": "medium"
  },
  {
    "id": "2506",
    "instruction": "List all the birthplaces of Roman Catholic Popes on a map.",
    "query": "select distinct ?item ?itemLabel ?itemDescription ?pob ?coord where {\n?item wdt:P31 wd:Q5;\nwdt:P39 wd:Q19546;\nwdt:P19 ?pob.\n?pob wdt:P625 ?coord.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}\nORDER BY DESC(?sitelinks)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nselect distinct ?item ?itemLabel ?itemDescription ?pob ?coord where {\n?item wdt:[property:instance of] wd:[entity:human];\nwdt:[property:position held] wd:[entity:pope];\nwdt:[property:place of birth] ?pob.\n?pob wdt:[property:coordinate location] ?coord.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}\nORDER BY DESC(?sitelinks)",
    "complexity": "medium"
  },
  {
    "id": "2434",
    "instruction": "What are the most common surnames of people born in Puy-de-D\u00f4me, France?",
    "query": "SELECT ?nom ?nomLabel (COUNT(?q) AS ?ct) WHERE {\n?q (wdt:P19/(wdt:P131*)) wd:Q12694;\nwdt:P734 ?nom.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?nom ?nomLabel\nLIMIT 30",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?nom ?nomLabel (COUNT(?q) AS ?ct) WHERE {\n?q (wdt:[property:place of birth]/(wdt:[property:located in the administrative territorial entity]*)) wd:[entity:Puy-de-D\u00f4me];\nwdt:[property:family name] ?nom.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?nom ?nomLabel\nLIMIT 30",
    "complexity": "medium"
  },
  {
    "id": "511",
    "instruction": "Find English lexemes with pictures and descriptions from Wikidata concepts.",
    "query": "SELECT DISTINCT ?lexemeId ?lemma ?q_concept ?q_conceptDescription ?picture\nWHERE {\n?lexemeId dct:language wd:Q1860;\nwikibase:lemma ?lemma;\nontolex:sense ?sense.\n?sense wdt:P5137 ?q_concept.\n?q_concept wdt:P18 ?picture.\n# if you wish to only browse certain items you can insert a FILTER\n# regular expression here, like in the example above.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY lcase(?lemma) # order a-z",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX dct: <http://purl.org/dc/terms/>\nPREFIX ontolex: <http://www.w3.org/ns/lemon/ontolex#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?lexemeId ?lemma ?q_concept ?q_conceptDescription ?picture\nWHERE {\n?lexemeId dct:language wd:[entity:English];\nwikibase:lemma ?lemma;\nontolex:sense ?sense.\n?sense wdt:[property:item for this sense] ?q_concept.\n?q_concept wdt:[property:image] ?picture.\n# if you wish to only browse certain items you can insert a FILTER\n# regular expression here, like in the example above.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY lcase(?lemma) # order a-z",
    "complexity": "medium"
  },
  {
    "id": "147",
    "instruction": "List all fictional characters and what they were named after.",
    "query": "SELECT DISTINCT ?char ?charLabel ?charDescription ?after ?afterLabel ?afterDescription WHERE {\n?char wdt:P31/wdt:P279? wd:Q95074 ;\nwdt:P138 ?after .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} ORDER BY ?charLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?char ?charLabel ?charDescription ?after ?afterLabel ?afterDescription WHERE {\n?char wdt:[property:instance of]/wdt:[property:subclass of]? wd:[entity:fictional character] ;\nwdt:[property:named after] ?after .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} ORDER BY ?charLabel",
    "complexity": "medium"
  },
  {
    "id": "2530",
    "instruction": "List all US Presidents along with their birthplaces and coordinates.",
    "query": "select distinct ?item ?itemLabel ?itemDescription ?pob ?coord where {\n?item wdt:P31 wd:Q5;\nwdt:P39 wd:Q11696;\nwdt:P19 ?pob.\n?pob wdt:P625 ?coord.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}\nORDER BY DESC(?sitelinks)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nselect distinct ?item ?itemLabel ?itemDescription ?pob ?coord where {\n?item wdt:[property:instance of] wd:[entity:human];\nwdt:[property:position held] wd:[entity:President of the United States];\nwdt:[property:place of birth] ?pob.\n?pob wdt:[property:coordinate location] ?coord.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}\nORDER BY DESC(?sitelinks)",
    "complexity": "medium"
  },
  {
    "id": "2044",
    "instruction": "Show me the locations of markets in Surabaya on a map.",
    "query": "SELECT ?market ?marketLabel ?coordinate_location WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"id\". }\n?market wdt:P31 wd:Q330284;\nwdt:P276 wd:Q11462;\nwdt:P625 ?coordinate_location.\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?market ?marketLabel ?coordinate_location WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"id\". }\n?market wdt:[property:instance of] wd:[entity:marketplace];\nwdt:[property:location] wd:[entity:Surabaya];\nwdt:[property:coordinate location] ?coordinate_location.\n}",
    "complexity": "medium"
  },
  {
    "id": "525",
    "instruction": "List all Wikibase properties along with their types and labels.",
    "query": "SELECT ?property ?propertyType ?propertyLabel ?propertyDescription ?propertyAltLabel WHERE {\n?property wikibase:propertyType ?propertyType .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY ASC(xsd:integer(STRAFTER(STR(?property), 'P')))",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?property ?propertyType ?propertyLabel ?propertyDescription ?propertyAltLabel WHERE {\n?property wikibase:propertyType ?propertyType .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY ASC(xsd:integer(STRAFTER(STR(?property), 'P')))",
    "complexity": "medium"
  },
  {
    "id": "408",
    "instruction": "What are the top 10 most populated countries?",
    "query": "SELECT DISTINCT ?country ?countryLabel ?population ?ended\nWHERE\n{\n?country wdt:P31/wdt:P279* wd:Q3624078; #countries\nwdt:P1082 ?population; #with their population\nMINUS\n{\n?country wdt:P576 ?ended.\n} # exclude \"former\" countries\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nORDER BY DESC(?population) # most populous countries - descending population\nLIMIT 10",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?country ?countryLabel ?population ?ended\nWHERE\n{\n?country wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:sovereign state]; #countries\nwdt:[property:population] ?population; #with their population\nMINUS\n{\n?country wdt:[property:dissolved, abolished or demolished date] ?ended.\n} # exclude \"former\" countries\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nORDER BY DESC(?population) # most populous countries - descending population\nLIMIT 10",
    "complexity": "medium"
  },
  {
    "id": "2736",
    "instruction": "List all species found only in New Zealand along with their type locality.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?localityLabel ?cords WHERE {\n?item (wdt:P31/(wdt:P279*)) wd:Q16521.\n?item (wdt:P183/(wdt:P279*)) wd:Q664.\n?item wdt:P5304 ?locality.\n?locality wdt:P625 ?cords.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nLIMIT 1000",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?localityLabel ?cords WHERE {\n?item (wdt:[property:instance of]/(wdt:[property:subclass of]*)) wd:[entity:taxon].\n?item (wdt:[property:endemic to]/(wdt:[property:subclass of]*)) wd:[entity:New Zealand].\n?item wdt:[property:type locality (biology)] ?locality.\n?locality wdt:[property:coordinate location] ?cords.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nLIMIT 1000",
    "complexity": "medium"
  },
  {
    "id": "2647",
    "instruction": "Find the directors who have worked with Jean-Louis Trintignant.",
    "query": "SELECT DISTINCT ?director ?directorLabel (COUNT(*) AS ?count) WHERE {\n?item wdt:P161 wd:Q106204;\nwdt:P57 ?director.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?director ?directorLabel\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?director ?directorLabel (COUNT(*) AS ?count) WHERE {\n?item wdt:[property:cast member] wd:[entity:Jean-Louis Trintignant];\nwdt:[property:director] ?director.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?director ?directorLabel\nORDER BY DESC(?count)",
    "complexity": "medium"
  },
  {
    "id": "2463",
    "instruction": "List the number of football players who died each year.",
    "query": "SELECT (?year_d as ?year) (COUNT(?futbolari)as ?count) WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?futbolari wdt:P106 wd:Q937857.\n?futbolari wdt:P570 ?heriotza_data.\n?futbolari wdt:P569 ?jaiotza_data.\nBIND (year(?heriotza_data) as ?year_d).\nBIND (year(?jaiotza_data) as ?year_j).\nBIND (?year_d - ?year_j as ?age).\nFILTER (?age < 40)\n}\nGROUP by ?year_d",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT (?year_d as ?year) (COUNT(?futbolari)as ?count) WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?futbolari wdt:[property:occupation] wd:[entity:association football player].\n?futbolari wdt:[property:date of death] ?heriotza_data.\n?futbolari wdt:[property:date of birth] ?jaiotza_data.\nBIND (year(?heriotza_data) as ?year_d).\nBIND (year(?jaiotza_data) as ?year_j).\nBIND (?year_d - ?year_j as ?age).\nFILTER (?age < 40)\n}\nGROUP by ?year_d",
    "complexity": "medium"
  },
  {
    "id": "2240",
    "instruction": "List the mountains located in the Basque Country.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?coor ?image WHERE {\n?item wdt:P131* ?non.\nwd:Q47588 wdt:P527 ?non.\n?item wdt:P31 wd:Q8502.\nOPTIONAL { ?item wdt:P625 ?coor. }\nOPTIONAL { ?item wdt:P18 ?image. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"eu,es\". }\n}\nORDER BY ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?coor ?image WHERE {\n?item wdt:[property:located in the administrative territorial entity]* ?non.\nwd:[entity:Basque Country] wdt:[property:has part(s)] ?non.\n?item wdt:[property:instance of] wd:[entity:mountain].\nOPTIONAL { ?item wdt:[property:coordinate location] ?coor. }\nOPTIONAL { ?item wdt:[property:image] ?image. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"eu,es\". }\n}\nORDER BY ?itemLabel",
    "complexity": "medium"
  },
  {
    "id": "1043",
    "instruction": "List all individuals who have no recorded father or mother.",
    "query": "SELECT DISTINCT ?item ?itemLabel WHERE {\n{ ?item a wdno:P22. }\nUNION\n{ ?item a wdno:P25. }\nMINUS { ?item wikibase:rank []. } # filter out statement nodes\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdno: <http://www.wikidata.org/prop/novalue/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel WHERE {\n{ ?item a wdno:[property:father]. }\nUNION\n{ ?item a wdno:[property:mother]. }\nMINUS { ?item wikibase:rank []. } # filter out statement nodes\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "1510",
    "instruction": "List all metro stations in Bilbao with their coordinates.",
    "query": "SELECT ?item ?coords ?itemLabel (?connecting_line AS ?layer) WHERE {\n?item (wdt:P31/wdt:P279*) wd:Q928830.\n?item wdt:P625 ?coords.\n?item wdt:P361 wd:Q325309.\n?item wdt:P81 ?connecting_line.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"eu\". }\nOPTIONAL { ?item wdt:P197 ?adjacent_station. }\n}\nORDER BY ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?coords ?itemLabel (?connecting_line AS ?layer) WHERE {\n?item (wdt:[property:instance of]/wdt:[property:subclass of]*) wd:[entity:metro station].\n?item wdt:[property:coordinate location] ?coords.\n?item wdt:[property:part of] wd:[entity:Metro Bilbao].\n?item wdt:[property:connecting line] ?connecting_line.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"eu\". }\nOPTIONAL { ?item wdt:[property:adjacent station] ?adjacent_station. }\n}\nORDER BY ?itemLabel",
    "complexity": "medium"
  }
]