[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "1651",
    "instruction": "List the American Sign Language signs for each letter of the English alphabet.",
    "query": "SELECT ?English_alphabet ?English_alphabetLabel ?media WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?English_alphabet wdt:P361 wd:Q754673.\nOPTIONAL { ?English_alphabet p:P2919 ?label_in_sign_language.\n?label_in_sign_language ps:P2919 ?media.\n?label_in_sign_language pq:P407 wd:Q14759.\nFILTER(regex(str(?media), \"\\\\.svg$\", \"i\"))\n}\n}\nORDER BY ?English_alphabetLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?English_alphabet ?English_alphabetLabel ?media WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?English_alphabet wdt:[property:part of] wd:[entity:English alphabet].\nOPTIONAL { ?English_alphabet p:[property:label in sign language] ?label_in_sign_language.\n?label_in_sign_language ps:[property:label in sign language] ?media.\n?label_in_sign_language pq:[property:language of work or name] wd:[entity:American Sign Language].\nFILTER(regex(str(?media), \"\\\\.svg$\", \"i\"))\n}\n}\nORDER BY ?English_alphabetLabel",
    "complexity": "complex"
  },
  {
    "id": "2582",
    "instruction": "What is the shortest rail route from Narvik to Singapore passing through Finland and Kazakhstan?",
    "query": "SELECT ?station ?stationLabel ?cds ?line ?layer WHERE {\n{ SERVICE gas:service {\ngas:program gas:gasClass \"com.bigdata.rdf.graph.analytics.BFS\" ; gas:in wd:Q3097173 ; gas:target wd:Q6132101 ; gas:out ?station ; gas:out1 [] ; gas:out2 ?pred .\ngas:program gas:linkType wdt:P197 . } }\nFILTER(?station != wd:Q3097173)\n?pred p:P625/psv:P625/wikibase:geoLatitude ?lat1 ; p:P625/psv:P625/wikibase:geoLongitude ?lon1 .\n?station p:P625/psv:P625/wikibase:geoLatitude ?lat2 ; p:P625/psv:P625/wikibase:geoLongitude ?lon2 .\nBIND(CONCAT('LINESTRING(', STR(?lon1), ' ', STR(?lat1), ',', STR(?lon2), ' ', STR(?lat2), ')') AS ?str) . BIND(STRDT(?str, geo:wktLiteral) AS ?line)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"bn,en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\nPREFIX gas: <http://www.bigdata.com/rdf/gas#>\n\nSELECT ?station ?stationLabel ?cds ?line ?layer WHERE {\n{ SERVICE gas:service {\ngas:program gas:gasClass \"com.bigdata.rdf.graph.analytics.BFS\" ; gas:in wd:[entity:Narvik] ; gas:target wd:[entity:Woodlands Train Checkpoint] ; gas:out ?station ; gas:out1 [] ; gas:out2 ?pred .\ngas:program gas:linkType wdt:[property:adjacent station] . } }\nFILTER(?station != wd:[entity:Narvik])\n?pred p:[property:coordinate location]/psv:[property:coordinate location]/wikibase:geoLatitude ?lat1 ; p:[property:coordinate location]/psv:[property:coordinate location]/wikibase:geoLongitude ?lon1 .\n?station p:[property:coordinate location]/psv:[property:coordinate location]/wikibase:geoLatitude ?lat2 ; p:[property:coordinate location]/psv:[property:coordinate location]/wikibase:geoLongitude ?lon2 .\nBIND(CONCAT('LINESTRING(', STR(?lon1), ' ', STR(?lat1), ',', STR(?lon2), ' ', STR(?lat2), ')') AS ?str) . BIND(STRDT(?str, geo:wktLiteral) AS ?line)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"bn,en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "2747",
    "instruction": "List bands with the most members.",
    "query": "SELECT DISTINCT ?band ?bandLabel ?workingtime (COUNT(?members) as ?numberOfMembers) WHERE {\n?band wdt:P31 wd:Q215380 .\n?band p:P527 ?members.\nOPTIONAL {?band wdt:P2031 ?inception.\n?band wdt:P2032 ?end.\nbind(year(?end)-year(?inception) as ?workingtime)}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\ngroup by ?band ?bandLabel ?workingtime\norder by DESC (?numberOfMembers)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?band ?bandLabel ?workingtime (COUNT(?members) as ?numberOfMembers) WHERE {\n?band wdt:[property:instance of] wd:[entity:musical group] .\n?band p:[property:has part(s)] ?members.\nOPTIONAL {?band wdt:[property:work period (start)] ?inception.\n?band wdt:[property:work period (end)] ?end.\nbind(year(?end)-year(?inception) as ?workingtime)}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\ngroup by ?band ?bandLabel ?workingtime\norder by DESC (?numberOfMembers)",
    "complexity": "complex"
  },
  {
    "id": "2586",
    "instruction": "List the female defense ministers from various countries.",
    "query": "SELECT ?menteri ?menteriLabel ?jabatan ?jabatanLabel ?negaraLabel ?gambar ?menjabat WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"id,en\". }\n?menteri wdt:P31 wd:Q5.\n?menteri wdt:P21 wd:Q6581072.\n?menteri wdt:P39 ?jabatan.\n?jabatan wdt:P279 wd:Q2518691.\nOPTIONAL { ?jabatan wdt:P17 ?negara. }\nOPTIONAL { ?menteri wdt:P18 ?gambar. }\n?menteri p:P39 ?st.\n?st ps:P39 ?jabatan.\n?st pq:P580 ?mulai.\nBIND(YEAR(?mulai) as ?mulai2).\nOPTIONAL {?st pq:P582 ?selesai.\nBIND(xsd:integer(YEAR(?selesai)) AS ?selesai2).\n}\nBIND(CONCAT(STR(?mulai2),\"-\",If(?selesai2>0,str(?selesai2),\"sekarang\")) as ?menjabat).\n}\n#defaultView:ImageGrid",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?menteri ?menteriLabel ?jabatan ?jabatanLabel ?negaraLabel ?gambar ?menjabat WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"id,en\". }\n?menteri wdt:[property:instance of] wd:[entity:human].\n?menteri wdt:[property:sex or gender] wd:[entity:female].\n?menteri wdt:[property:position held] ?jabatan.\n?jabatan wdt:[property:subclass of] wd:[entity:defence minister].\nOPTIONAL { ?jabatan wdt:[property:country] ?negara. }\nOPTIONAL { ?menteri wdt:[property:image] ?gambar. }\n?menteri p:[property:position held] ?st.\n?st ps:[property:position held] ?jabatan.\n?st pq:[property:start time] ?mulai.\nBIND(YEAR(?mulai) as ?mulai2).\nOPTIONAL {?st pq:[property:end time] ?selesai.\nBIND(xsd:integer(YEAR(?selesai)) AS ?selesai2).\n}\nBIND(CONCAT(STR(?mulai2),\"-\",If(?selesai2>0,str(?selesai2),\"sekarang\")) as ?menjabat).\n}\n#defaultView:ImageGrid",
    "complexity": "complex"
  },
  {
    "id": "611",
    "instruction": "List all CAS registry numbers that are shared by multiple chemical compounds in Wikidata.",
    "query": "SELECT ?cas ?items\nWHERE\n{\n{SELECT DISTINCT ?cas (count(?compound) as ?items) WHERE {\n?compound wdt:P231 ?cas .\n}\nGROUP BY ?cas }\nFILTER (?items >1)\n}\nORDER BY desc(?items)",
    "annotated": "PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?cas ?items\nWHERE\n{\n{SELECT DISTINCT ?cas (count(?compound) as ?items) WHERE {\n?compound wdt:[property:CAS Registry Number] ?cas .\n}\nGROUP BY ?cas }\nFILTER (?items >1)\n}\nORDER BY desc(?items)",
    "complexity": "complex"
  },
  {
    "id": "274",
    "instruction": "List all items in the Pitt Rivers Museum with their descriptions.",
    "query": "SELECT (SUBSTR(STR(?item),32) AS ?wdq) (SUBSTR(STR(?prop),32) AS ?wdp) ?object ?url WHERE {\n?item wdt:P195 wd:Q1456119.\n?item wdt:P973 ?url FILTER CONTAINS(STR(?url), \"ox.ac.uk\").\n?item ?p ?statement.\n?prop wikibase:claim ?p; wikibase:statementProperty ?ps FILTER (?prop != wd:P973) FILTER (?prop != wd:P953)\nFILTER (?prop != wd:P18) FILTER (?prop != wd:P571).\n?statement ?ps ?object .\nFILTER NOT EXISTS {?statement prov:wasDerivedFrom ?derivedFrom}\n} ORDER BY ?item",
    "annotated": "PREFIX prov: <http://www.w3.org/ns/prov#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT (SUBSTR(STR(?item),32) AS ?wdq) (SUBSTR(STR(?prop),32) AS ?wdp) ?object ?url WHERE {\n?item wdt:[property:collection] wd:[entity:Pitt Rivers Museum].\n?item wdt:[property:described at URL] ?url FILTER CONTAINS(STR(?url), \"ox.ac.uk\").\n?item ?p ?statement.\n?prop wikibase:claim ?p; wikibase:statementProperty ?ps FILTER (?prop != wd:[property:described at URL]) FILTER (?prop != wd:[property:full work available at URL])\nFILTER (?prop != wd:[property:image]) FILTER (?prop != wd:[property:inception]).\n?statement ?ps ?object .\nFILTER NOT EXISTS {?statement prov:wasDerivedFrom ?derivedFrom}\n} ORDER BY ?item",
    "complexity": "complex"
  },
  {
    "id": "1894",
    "instruction": "List films with less than 2 female cast members that pass the Bechdel test.",
    "query": "SELECT DISTINCT ?item ?itemLabel (MIN(YEAR(?date)) AS ?year) (COUNT(DISTINCT ?actor) AS ?number_of_cast_members) (COUNT(DISTINCT ?actress) AS ?number_of_female_cast_members) WHERE {\n?item wdt:P31/wdt:P279* wd:Q11424; wdt:P1552 wd:Q45171911.\nOPTIONAL{?item (p:P161/ps:P161|p:P725/ps:P725) ?actor\nOPTIONAL{?actor wdt:P21 wd:Q6581072. BIND(?actor AS ?actress)}\n}\nOPTIONAL{?item wdt:P577 ?date}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?item ?itemLabel\nHAVING (COUNT(DISTINCT ?actress) <2)\nORDER BY ?year",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel (MIN(YEAR(?date)) AS ?year) (COUNT(DISTINCT ?actor) AS ?number_of_cast_members) (COUNT(DISTINCT ?actress) AS ?number_of_female_cast_members) WHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:film]; wdt:[property:has characteristic] wd:[entity:Q45171911].\nOPTIONAL{?item (p:[property:cast member]/ps:[property:cast member]|p:[property:voice actor]/ps:[property:voice actor]) ?actor\nOPTIONAL{?actor wdt:[property:sex or gender] wd:[entity:female]. BIND(?actor AS ?actress)}\n}\nOPTIONAL{?item wdt:[property:publication date] ?date}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?item ?itemLabel\nHAVING (COUNT(DISTINCT ?actress) <2)\nORDER BY ?year",
    "complexity": "complex"
  },
  {
    "id": "502",
    "instruction": "List all mayors that are a type of domesticated animal.",
    "query": "SELECT ?image ?speciesLabel ?mayorLabel ?placeLabel WHERE {\n?species wdt:P279* wd:Q622852 .\n?mayor wdt:P31 ?species .\n?mayor p:P39 ?node .\n?node ps:P39 wd:Q30185 .\n?node pq:P642 ?place .\nOPTIONAL {?mayor wdt:P18 ?image}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?image ?speciesLabel ?mayorLabel ?placeLabel WHERE {\n?species wdt:[property:subclass of]* wd:[entity:domesticated animal] .\n?mayor wdt:[property:instance of] ?species .\n?mayor p:[property:position held] ?node .\n?node ps:[property:position held] wd:[entity:mayor] .\n?node pq:[property:of] ?place .\nOPTIONAL {?mayor wdt:[property:image] ?image}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "1140",
    "instruction": "List all German municipalities with names ending in -ing and their corresponding -ingen pairs.",
    "query": "SELECT ?item1 ?item1Coords (?ing AS ?item1Label) ?item2 ?item2Coords (?ingen AS ?item2Label) (?ing AS ?layer) WITH {\nSELECT ?item1 ?ing ?item2 ?ingen WHERE {\n?item1 wdt:P31 wd:Q262166;\nrdfs:label ?ing.\nFILTER(LANG(?ing) = \"de\")\nFILTER(STRENDS(?ing, \"ing\"@de))\nBIND(CONCAT(?ing, \"en\"@de) AS ?ingen)\n?item2 rdfs:label ?ingen;\nwdt:P31 wd:Q262166.\n}\n} AS %ings WHERE {\nINCLUDE %ings.\n?item1 wdt:P625 ?item1Coords.\n?item2 wdt:P625 ?item2Coords.\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?item1 ?item1Coords (?ing AS ?item1Label) ?item2 ?item2Coords (?ingen AS ?item2Label) (?ing AS ?layer) WITH {\nSELECT ?item1 ?ing ?item2 ?ingen WHERE {\n?item1 wdt:[property:instance of] wd:[entity:municipality in Germany];\nrdfs:label ?ing.\nFILTER(LANG(?ing) = \"de\")\nFILTER(STRENDS(?ing, \"ing\"@de))\nBIND(CONCAT(?ing, \"en\"@de) AS ?ingen)\n?item2 rdfs:label ?ingen;\nwdt:[property:instance of] wd:[entity:municipality in Germany].\n}\n} AS %ings WHERE {\nINCLUDE %ings.\n?item1 wdt:[property:coordinate location] ?item1Coords.\n?item2 wdt:[property:coordinate location] ?item2Coords.\n}",
    "complexity": "complex"
  },
  {
    "id": "759",
    "instruction": "What astronauts have been to the moon or are members of Apollo 13?",
    "query": "SELECT ?astronaut ?astronautLabel\nWHERE\n{\n?astronaut wdt:P31 wd:Q5;\nwdt:P106 wd:Q11631.\nOPTIONAL {\n?astronaut wdt:P450 ?mission.\n?mission wdt:P31 wd:Q495307.\n}\nOPTIONAL {\n?astronaut wdt:P450 wd:Q182252.\nBIND(wd:Q182252 AS ?mission).\n}\nFILTER(BOUND(?mission)).\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE]\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?astronaut ?astronautLabel\nWHERE\n{\n?astronaut wdt:[property:instance of] wd:[entity:human];\nwdt:[property:occupation] wd:[entity:astronaut].\nOPTIONAL {\n?astronaut wdt:[property:astronaut mission] ?mission.\n?mission wdt:[property:instance of] wd:[entity:Moon landing].\n}\nOPTIONAL {\n?astronaut wdt:[property:astronaut mission] wd:[entity:Apollo 13].\nBIND(wd:[entity:Apollo 13] AS ?mission).\n}\nFILTER(BOUND(?mission)).\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE]\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "2096",
    "instruction": "List all philosophers born between 0 and 500 AD, grouped by the decade they lived.",
    "query": "SELECT DISTINCT ?i_p ?i_pLabel ?i_pDescription ?iu_p ?ii_p ?rn_t_dobLabel ?ic_dob ?rn_t_dodLabel ?ic_dod ?ic_milyear ?ic_cent ?ic_dec ?rn_country ?i_country ?i_countryLabel ?i_countryDecription\nWHERE{{\nSELECT ?ic_dec ?ic_cent WHERE{\n?p wdt:P106 wd:Q4964182; wdt:P569 ?dob.\nFILTER ((YEAR(?dob) > 100) && (YEAR(?dob) < 500)).\nBIND (xsd:integer(FLOOR(YEAR(?dob) / 10) * 10) AS ?ic_dec).\nBIND (xsd:integer(FLOOR(YEAR(?dob) / 100) * 100) AS ?ic_cent).\n}}UNION{\nSELECT ?ic_cent ?ic_milyear WHERE{\n?p wdt:P106 wd:Q4964182; wdt:P569 ?dob.\nFILTER ((YEAR(?dob) > 100) && (YEAR(?dob) < 500)).\nBIND (xsd:integer(FLOOR(YEAR(?dob) / 100) * 100) AS ?ic_cent).\nBIND (xsd:integer(FLOOR(YEAR(?dob) / 1000) * 1000) AS ?ic_milyear).\n}}UNION{\nSELECT ?i_p ?iu_p ?ii_p ?ic_dec ?rn_t_dob ?ic_dob ?rn_t_dod ?ic_dod ?rn_country ?i_country WHERE{\n?i_p wdt:P106 wd:Q4964182; wdt:P569 ?ic_dob.\nFILTER ((YEAR(?ic_dob) > 100) && (YEAR(?ic_dob) < 500)).\nBIND (xsd:integer(FLOOR(YEAR(?ic_dob) / 10) * 10) AS ?ic_dec).\n?rn_t_dob wikibase:directClaim wdt:P569.\nOPTIONAL { ?i_p wdt:P570 ?ic_dod. ?rn_t_dod wikibase:directClaim wdt:P570. }\nBIND (CONCAT (STR (?i_p), \"SSif\") AS ?iu_p).\nOPTIONAL { ?i_p wdt:P18 ?ii_p. }\nBIND (\"country\" AS ?rn_country).\nOPTIONAL { ?i_p wdt:P27 ?i_country. }\n}}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?i_p ?i_pLabel ?i_pDescription ?iu_p ?ii_p ?rn_t_dobLabel ?ic_dob ?rn_t_dodLabel ?ic_dod ?ic_milyear ?ic_cent ?ic_dec ?rn_country ?i_country ?i_countryLabel ?i_countryDecription\nWHERE{{\nSELECT ?ic_dec ?ic_cent WHERE{\n?p wdt:[property:occupation] wd:[entity:philosopher]; wdt:[property:date of birth] ?dob.\nFILTER ((YEAR(?dob) > 100) && (YEAR(?dob) < 500)).\nBIND (xsd:integer(FLOOR(YEAR(?dob) / 10) * 10) AS ?ic_dec).\nBIND (xsd:integer(FLOOR(YEAR(?dob) / 100) * 100) AS ?ic_cent).\n}}UNION{\nSELECT ?ic_cent ?ic_milyear WHERE{\n?p wdt:[property:occupation] wd:[entity:philosopher]; wdt:[property:date of birth] ?dob.\nFILTER ((YEAR(?dob) > 100) && (YEAR(?dob) < 500)).\nBIND (xsd:integer(FLOOR(YEAR(?dob) / 100) * 100) AS ?ic_cent).\nBIND (xsd:integer(FLOOR(YEAR(?dob) / 1000) * 1000) AS ?ic_milyear).\n}}UNION{\nSELECT ?i_p ?iu_p ?ii_p ?ic_dec ?rn_t_dob ?ic_dob ?rn_t_dod ?ic_dod ?rn_country ?i_country WHERE{\n?i_p wdt:[property:occupation] wd:[entity:philosopher]; wdt:[property:date of birth] ?ic_dob.\nFILTER ((YEAR(?ic_dob) > 100) && (YEAR(?ic_dob) < 500)).\nBIND (xsd:integer(FLOOR(YEAR(?ic_dob) / 10) * 10) AS ?ic_dec).\n?rn_t_dob wikibase:directClaim wdt:[property:date of birth].\nOPTIONAL { ?i_p wdt:[property:date of death] ?ic_dod. ?rn_t_dod wikibase:directClaim wdt:[property:date of death]. }\nBIND (CONCAT (STR (?i_p), \"SSif\") AS ?iu_p).\nOPTIONAL { ?i_p wdt:[property:image] ?ii_p. }\nBIND (\"country\" AS ?rn_country).\nOPTIONAL { ?i_p wdt:[property:country of citizenship] ?i_country. }\n}}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "1567",
    "instruction": "List all the world days and awareness days in calendar order.",
    "query": "SELECT DISTINCT ?month_int ?monthLabel (?day_int as ?d) ?world_dayLabel (?world_day as ?link) (GROUP_CONCAT(DISTINCT ?countryLabel; separator=\", \") as ?countries) WHERE {\n{ SELECT ?month_int ?month ?day_int ?world_day ?country WHERE {\n?month wdt:P31 wd:Q47018901; wdt:P1545 ?month_ordinal.\n?day p:P361 [ps:P361 ?month; pq:P1545 ?day_ordinal ].\nBIND(xsd:integer(?month_ordinal) AS ?month_int)\nBIND(xsd:integer(?day_ordinal) AS ?day_int)\nVALUES ?type {wd:Q2558684 wd:Q422695} # World ___ day; Awareness day\n?world_day wdt:P31 ?type; wdt:P837 ?day\nOPTIONAL {?world_day wdt:P17 ?country}\n} }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\".\n?month rdfs:label ?monthLabel. ?world_day rdfs:label ?world_dayLabel. ?country rdfs:label ?countryLabel }\n} GROUP BY ?month_int ?monthLabel ?day_int ?world_dayLabel ?world_day\nORDER BY ?month_int ?d",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?month_int ?monthLabel (?day_int as ?d) ?world_dayLabel (?world_day as ?link) (GROUP_CONCAT(DISTINCT ?countryLabel; separator=\", \") as ?countries) WHERE {\n{ SELECT ?month_int ?month ?day_int ?world_day ?country WHERE {\n?month wdt:[property:instance of] wd:[entity:calendar month]; wdt:[property:series ordinal] ?month_ordinal.\n?day p:[property:part of] [ps:[property:part of] ?month; pq:[property:series ordinal] ?day_ordinal ].\nBIND(xsd:integer(?month_ordinal) AS ?month_int)\nBIND(xsd:integer(?day_ordinal) AS ?day_int)\nVALUES ?type {wd:[entity:world day] wd:[entity:awareness day]} # World ___ day; Awareness day\n?world_day wdt:[property:instance of] ?type; wdt:[property:day in year for periodic occurrence] ?day\nOPTIONAL {?world_day wdt:[property:country] ?country}\n} }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\".\n?month rdfs:label ?monthLabel. ?world_day rdfs:label ?world_dayLabel. ?country rdfs:label ?countryLabel }\n} GROUP BY ?month_int ?monthLabel ?day_int ?world_dayLabel ?world_day\nORDER BY ?month_int ?d",
    "complexity": "complex"
  },
  {
    "id": "575",
    "instruction": "What are the 10 largest islands in the world?",
    "query": "SELECT ?island ?islandLabel ?islandImage\nWITH {\nSELECT DISTINCT *\nWHERE {\n# Instances of island (or of subclasses of island)\n?island (wdt:P31/wdt:P279*) wd:Q23442.\n# Optionally with an image\nOPTIONAL { ?island wdt:P18 ?islandImage. }\n# Get the area of the island\n# Use the psn: prefix to normalize the values to a common unit of area\n?island p:P2046/psn:P2046/wikibase:quantityAmount ?islandArea.\n}\nORDER BY DESC(?islandArea)\nLIMIT 10\n} AS %i\nWHERE {\nINCLUDE %i\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" . }\n}\nORDER BY DESC(?islandArea)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psn: <http://www.wikidata.org/prop/statement/value-normalized/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?island ?islandLabel ?islandImage\nWITH {\nSELECT DISTINCT *\nWHERE {\n# Instances of island (or of subclasses of island)\n?island (wdt:[property:instance of]/wdt:[property:subclass of]*) wd:[entity:island].\n# Optionally with an image\nOPTIONAL { ?island wdt:[property:image] ?islandImage. }\n# Get the area of the island\n# Use the psn: prefix to normalize the values to a common unit of area\n?island p:[property:area]/psn:[property:area]/wikibase:quantityAmount ?islandArea.\n}\nORDER BY DESC(?islandArea)\nLIMIT 10\n} AS %i\nWHERE {\nINCLUDE %i\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" . }\n}\nORDER BY DESC(?islandArea)",
    "complexity": "complex"
  },
  {
    "id": "814",
    "instruction": "List the characters played by multiple actors.",
    "query": "SELECT ?character ?characterLabel (COUNT(?actor) AS ?count)\nWHERE {\n{\nSELECT DISTINCT ?character ?actor\nWHERE {\n?film p:P161 [\nps:P161 ?actor;\npq:P453 ?character\n].\n#?character wdt:P31 wd:Q5. # uncomment to filter for real people\n}\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nGROUP BY ?character ?characterLabel\nORDER BY DESC(?count)\nLIMIT 25",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?character ?characterLabel (COUNT(?actor) AS ?count)\nWHERE {\n{\nSELECT DISTINCT ?character ?actor\nWHERE {\n?film p:[property:cast member] [\nps:[property:cast member] ?actor;\npq:[property:character role] ?character\n].\n#?character wdt:[property:instance of] wd:[entity:human]. # uncomment to filter for real people\n}\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nGROUP BY ?character ?characterLabel\nORDER BY DESC(?count)\nLIMIT 25",
    "complexity": "complex"
  },
  {
    "id": "2826",
    "instruction": "List railway stations named after famous books or poems.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?itemCountry ?itemCountryLabel ?work ?workLabel WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n?item wdt:P31/wdt:P279* wd:Q55488;\nwdt:P17 ?itemCountry;\np:P138 ?statement.\n?statement ps:P138/wdt:P138* ?work.\n?work wdt:P31/wdt:P279* wd:Q7725634.\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?itemCountry ?itemCountryLabel ?work ?workLabel WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:railway station];\nwdt:[property:country] ?itemCountry;\np:[property:named after] ?statement.\n?statement ps:[property:named after]/wdt:[property:named after]* ?work.\n?work wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:literary work].\n}",
    "complexity": "complex"
  },
  {
    "id": "1404",
    "instruction": "What occupations have the highest homicide death rates?",
    "query": "SELECT ?occupation ?occupationLabel ?homicides ?total ?rate WITH {\nSELECT ?occupation (SUM(?homicide) AS ?homicides) (COUNT(?person) AS ?total) WHERE {\n?person wdt:P31 wd:Q5;\nwdt:P106 ?occupation;\nwdt:P1196 ?manner.\nFILTER(!ISBLANK(?occupation)).\nBIND(IF(?manner = wd:Q149086, 1, 0) AS ?homicide).\n}\nGROUP BY ?occupation\nHAVING(?total > 5)\nORDER BY DESC(?homicides/?total)\nLIMIT 100\n} AS %results WHERE {\nINCLUDE %results.\nBIND(?homicides/?total AS ?rate).\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nORDER BY DESC(?rate) DESC(?total)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?occupation ?occupationLabel ?homicides ?total ?rate WITH {\nSELECT ?occupation (SUM(?homicide) AS ?homicides) (COUNT(?person) AS ?total) WHERE {\n?person wdt:[property:instance of] wd:[entity:human];\nwdt:[property:occupation] ?occupation;\nwdt:[property:manner of death] ?manner.\nFILTER(!ISBLANK(?occupation)).\nBIND(IF(?manner = wd:[entity:homicide], 1, 0) AS ?homicide).\n}\nGROUP BY ?occupation\nHAVING(?total > 5)\nORDER BY DESC(?homicides/?total)\nLIMIT 100\n} AS %results WHERE {\nINCLUDE %results.\nBIND(?homicides/?total AS ?rate).\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nORDER BY DESC(?rate) DESC(?total)",
    "complexity": "complex"
  },
  {
    "id": "327",
    "instruction": "List all humans without an occupation in Wikidata.",
    "query": "SELECT ?person ?personLabel ?personDescription ?ee\nWHERE {\n?person wdt:P3429 ?ee;\nwdt:P31 wd:Q5\nMINUS{?person wdt:P106 [] }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,fr,de,es\" }\n} ORDER BY ?ee",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?person ?personLabel ?personDescription ?ee\nWHERE {\n?person wdt:[property:Electronic Enlightenment ID] ?ee;\nwdt:[property:instance of] wd:[entity:human]\nMINUS{?person wdt:[property:occupation] [] }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,fr,de,es\" }\n} ORDER BY ?ee",
    "complexity": "complex"
  }
]