[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "2343",
    "instruction": "List all aviation accidents with only one survivor and more than 50 deaths.",
    "query": "SELECT ?accident ?accidentLabel ?operatorLabel ?deaths ?survivors ?date WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?accident wdt:P31 wd:Q744913;\nwdt:P1120 ?deaths;\nwdt:P1561 ?survivors;\nwdt:P137 ?operator.\nFILTER(?deaths > 50 )\nFilter(?survivors = 1)\nOPTIONAL { ?accident wdt:P585 ?date. }\nOPTIONAL { ?accident wdt:P828 ?cause. }\nOPTIONAL { ?accident wdt:P276 ?Ort. }\n}\nORDER BY DESC (?date)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?accident ?accidentLabel ?operatorLabel ?deaths ?survivors ?date WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?accident wdt:[property:instance of] wd:[entity:aviation accident];\nwdt:[property:number of deaths] ?deaths;\nwdt:[property:number of survivors] ?survivors;\nwdt:[property:operator] ?operator.\nFILTER(?deaths > 50 )\nFilter(?survivors = 1)\nOPTIONAL { ?accident wdt:[property:point in time] ?date. }\nOPTIONAL { ?accident wdt:[property:has cause] ?cause. }\nOPTIONAL { ?accident wdt:[property:location] ?Ort. }\n}\nORDER BY DESC (?date)",
    "complexity": "complex"
  },
  {
    "id": "201",
    "instruction": "List all places that have been visited by multiple expeditions.",
    "query": "SELECT ?layer ?loc ?placename ?coords WHERE {\n{ SELECT ?exp (COUNT(?loc) AS ?count) WHERE {\n?exp wdt:P31/wdt:P279* wd:Q2401485.\n?exp wdt:P276 ?loc.\n} GROUP BY ?exp }\nFILTER (?count > 1)\n?exp wdt:P276 ?loc.\n?loc wdt:P625 ?coords.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". ?exp rdfs:label ?layer. ?loc rdfs:label ?placename }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?layer ?loc ?placename ?coords WHERE {\n{ SELECT ?exp (COUNT(?loc) AS ?count) WHERE {\n?exp wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:expedition].\n?exp wdt:[property:location] ?loc.\n} GROUP BY ?exp }\nFILTER (?count > 1)\n?exp wdt:[property:location] ?loc.\n?loc wdt:[property:coordinate location] ?coords.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". ?exp rdfs:label ?layer. ?loc rdfs:label ?placename }\n}",
    "complexity": "complex"
  },
  {
    "id": "1758",
    "instruction": "List the chief ministers of Haryana and Maharashtra along with their tenure.",
    "query": "select ?flight ?flightLabel ?image ?start ?end where {\n?flight p:P39 ?pstmt.\n{?pstmt ps:P39 wd:Q55018634}\nUNION\n{?pstmt ps:P39 wd:Q221922}\n?pstmt pq:P580 ?start . OPTIONAL {?pstmt pq:P582 ?end_tmp}.\nBIND(IF(BOUND(?end_tmp),?end_tmp,NOW()) as ?end)\nOPTIONAL { ?flight wdt:P18 ?image }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nselect ?flight ?flightLabel ?image ?start ?end where {\n?flight p:[property:position held] ?pstmt.\n{?pstmt ps:[property:position held] wd:[entity:Chief Minister of Haryana]}\nUNION\n{?pstmt ps:[property:position held] wd:[entity:Chief Minister of Maharashtra]}\n?pstmt pq:[property:start time] ?start . OPTIONAL {?pstmt pq:[property:end time] ?end_tmp}.\nBIND(IF(BOUND(?end_tmp),?end_tmp,NOW()) as ?end)\nOPTIONAL { ?flight wdt:[property:image] ?image }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "1511",
    "instruction": "What is the highest point in each department of France?",
    "query": "SELECT DISTINCT ?department ?departmentLabel ?highest_pointLabel ?elevation ?coords ?image WHERE {\n?department wdt:P31/wdt:P279* wd:Q6465 ;\nwdt:P610 ?highest_point .\n?highest_point wdt:P625 ?coords ;\np:P2044/psv:P2044 [\nwikibase:quantityAmount ?baseElevation;\nwikibase:quantityUnit [\np:P2370/psv:P2370 [\nwikibase:quantityAmount ?unitElevation;\nwikibase:quantityUnit wd:Q11573\n]\n]\n] .\nBIND(ROUND(?baseElevation * ?unitElevation) AS ?elevation)\nOPTIONAL { ?highest_point wdt:P18 ?image }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\" . }\n} ORDER BY ?elevation ?departmentLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?department ?departmentLabel ?highest_pointLabel ?elevation ?coords ?image WHERE {\n?department wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:department of France] ;\nwdt:[property:highest point] ?highest_point .\n?highest_point wdt:[property:coordinate location] ?coords ;\np:[property:elevation above sea level]/psv:[property:elevation above sea level] [\nwikibase:quantityAmount ?baseElevation;\nwikibase:quantityUnit [\np:[property:conversion to SI unit]/psv:[property:conversion to SI unit] [\nwikibase:quantityAmount ?unitElevation;\nwikibase:quantityUnit wd:[entity:metre]\n]\n]\n] .\nBIND(ROUND(?baseElevation * ?unitElevation) AS ?elevation)\nOPTIONAL { ?highest_point wdt:[property:image] ?image }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\" . }\n} ORDER BY ?elevation ?departmentLabel",
    "complexity": "complex"
  },
  {
    "id": "2657",
    "instruction": "List all French rugby teams organized by their founding year.",
    "query": "SELECT ?annee (COUNT(?equipe) AS ?nombre) WHERE {\n?equipe wdt:P31 wd:Q14645593 ;\nwdt:P17 wd:Q142 .\nOPTIONAL { ?equipe wdt:P571 ?date . }\nBIND ( STR(YEAR(?date)) AS ?year )\nBIND(IF(BOUND(?year),?year,\"sans date\") AS ?annee)\n}\nGROUP BY ?annee",
    "annotated": "PREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?annee (COUNT(?equipe) AS ?nombre) WHERE {\n?equipe wdt:[property:instance of] wd:[entity:rugby union team] ;\nwdt:[property:country] wd:[entity:France] .\nOPTIONAL { ?equipe wdt:[property:inception] ?date . }\nBIND ( STR(YEAR(?date)) AS ?year )\nBIND(IF(BOUND(?year),?year,\"sans date\") AS ?annee)\n}\nGROUP BY ?annee",
    "complexity": "complex"
  },
  {
    "id": "1419",
    "instruction": "List all geographical features in the UK without Welsh labels.",
    "query": "SELECT DISTINCT ?item ?itemLabel WHERE {\n?item (wdt:P31/wdt:P279*) wd:Q618123.\n?item wdt:P17 wd:Q145.\n?item rdfs:label ?itemLabel.\nMINUS {\n?item rdfs:label ?label2.\nFILTER((LANG(?label2)) = \"cy\")\n}\nFILTER((LANG(?itemLabel)) = \"en\")\n}\nLIMIT 1000",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT DISTINCT ?item ?itemLabel WHERE {\n?item (wdt:[property:instance of]/wdt:[property:subclass of]*) wd:[entity:geographical feature].\n?item wdt:[property:country] wd:[entity:United Kingdom].\n?item rdfs:label ?itemLabel.\nMINUS {\n?item rdfs:label ?label2.\nFILTER((LANG(?label2)) = \"cy\")\n}\nFILTER((LANG(?itemLabel)) = \"en\")\n}\nLIMIT 1000",
    "complexity": "complex"
  },
  {
    "id": "2473",
    "instruction": "List famous people who died on their 50th birthday.",
    "query": "SELECT ?item ?itemLabel ?dob ?dod WHERE {\n?item (p:P569/psv:P569) _:b44.\n_:b44 wikibase:timePrecision 11;\nwikibase:timeValue ?dob.\n?item (p:P570/psv:P570) _:b45.\n_:b45 wikibase:timePrecision 11;\nwikibase:timeValue ?dod.\n#FILTER(?precisionDob = 11 )\n#FILTER(?precisionDod = 11 )\nFILTER((DAY(?dob)) = (DAY(?dod)))\nFILTER((MONTH(?dob)) = (MONTH(?dod)))\nFILTER( ((YEAR(?dod)) - (YEAR(?dob))) = 50)\n?item rdfs:label ?itemLabel. FILTER(LANG(?itemLabel)=\"de\")\n}\nLIMIT 5",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?dob ?dod WHERE {\n?item (p:[property:date of birth]/psv:[property:date of birth]) _:b44.\n_:b44 wikibase:timePrecision 11;\nwikibase:timeValue ?dob.\n?item (p:[property:date of death]/psv:[property:date of death]) _:b45.\n_:b45 wikibase:timePrecision 11;\nwikibase:timeValue ?dod.\n#FILTER(?precisionDob = 11 )\n#FILTER(?precisionDod = 11 )\nFILTER((DAY(?dob)) = (DAY(?dod)))\nFILTER((MONTH(?dob)) = (MONTH(?dod)))\nFILTER( ((YEAR(?dod)) - (YEAR(?dob))) = 50)\n?item rdfs:label ?itemLabel. FILTER(LANG(?itemLabel)=\"de\")\n}\nLIMIT 5",
    "complexity": "complex"
  },
  {
    "id": "230",
    "instruction": "List all notable manuscripts and their collections.",
    "query": "SELECT ?q ?qLabel (GROUP_CONCAT(DISTINCT ?collplusinv; separator=\" !!! \") AS ?where) (GROUP_CONCAT(DISTINCT ?lang; separator=\" \") AS ?languages) ?linkcount (SAMPLE(?image) AS ?image)\nWHERE { {SELECT ?q (COUNT(?sitelink) AS ?linkcount) WHERE { ?q (wdt:P31/wdt:P279*) wd:Q87167. OPTIONAL {?sitelink schema:about ?q} }\nGROUP BY ?q }\n?q p:P195 ?s. ?s ps:P195 ?collection . MINUS {?s pq:P582 []}.\nMINUS {?s ps:P195 wd:Q1322278 }\nOPTIONAL{ ?s pq:P217 ?inventory}\nOPTIONAL{ ?q wdt:P18 ?image }\nBIND( IF(BOUND(?inventory), CONCAT(STR(?collection),\" \",?inventory), STR(?collection)) AS ?collplusinv).\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en,fr,it,de,es,ru,bg,ca,cs,nl,zh,ja\".\n?q rdfs:label ?qLabel.\n}\nOPTIONAL{ ?q wdt:P407 ?lang }\n}\nGROUP BY ?q ?qLabel ?linkcount\nORDER BY DESC(?linkcount)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?q ?qLabel (GROUP_CONCAT(DISTINCT ?collplusinv; separator=\" !!! \") AS ?where) (GROUP_CONCAT(DISTINCT ?lang; separator=\" \") AS ?languages) ?linkcount (SAMPLE(?image) AS ?image)\nWHERE { {SELECT ?q (COUNT(?sitelink) AS ?linkcount) WHERE { ?q (wdt:[property:instance of]/wdt:[property:subclass of]*) wd:[entity:manuscript]. OPTIONAL {?sitelink schema:about ?q} }\nGROUP BY ?q }\n?q p:[property:collection] ?s. ?s ps:[property:collection] ?collection . MINUS {?s pq:[property:end time] []}.\nMINUS {?s ps:[property:collection] wd:[entity:Matenadaran] }\nOPTIONAL{ ?s pq:[property:inventory number] ?inventory}\nOPTIONAL{ ?q wdt:[property:image] ?image }\nBIND( IF(BOUND(?inventory), CONCAT(STR(?collection),\" \",?inventory), STR(?collection)) AS ?collplusinv).\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en,fr,it,de,es,ru,bg,ca,cs,nl,zh,ja\".\n?q rdfs:label ?qLabel.\n}\nOPTIONAL{ ?q wdt:[property:language of work or name] ?lang }\n}\nGROUP BY ?q ?qLabel ?linkcount\nORDER BY DESC(?linkcount)",
    "complexity": "complex"
  },
  {
    "id": "2615",
    "instruction": "What are the most cited works on archaeology published in the 1970s?",
    "query": "#defaultView:Table\nSELECT ?count ?cited_work ?cited_workLabel\nWITH {\n  SELECT (count(?work) as ?count) ?cited_work WHERE {\n    { ?work wdt:P921/wdt:P31*/wdt:P279* wd:Q23498 . }\n    union { ?work wdt:P921/wdt:P361+ wd:Q23498 . }\n    union { ?work wdt:P921/wdt:P1269+ wd:Q23498 . }\n    ?work wdt:P2860 ?cited_work .\n    ?cited_work wdt:P577 ?publicationdate .\nFILTER (?publicationdate > \"1969-12-31T00:00:00\"^^xsd:dateTime) . #works published on the subject after a certain date\nFILTER (?publicationdate < \"1980-01-01T00:00:00\"^^xsd:dateTime) . #works published on the subject before a certain date\n  }\n\n  GROUP BY ?cited_work\n} AS %result\nWHERE {\n  INCLUDE %result\n  SERVICE wikibase:label { bd:serviceParam wikibase:language \"en,da,de,es,fr,jp,nl,no,ru,sv,zh\" . } \n}\nORDER BY DESC(?count)\nLIMIT 10",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\n#defaultView:Table\nSELECT ?count ?cited_work ?cited_workLabel\nWITH {\n  SELECT (count(?work) as ?count) ?cited_work WHERE {\n    { ?work wdt:[property:main subject]/wdt:[property:instance of]*/wdt:[property:subclass of]* wd:[entity:archaeology] . }\n    union { ?work wdt:[property:main subject]/wdt:[property:part of]+ wd:[entity:archaeology] . }\n    union { ?work wdt:[property:main subject]/wdt:[property:facet of]+ wd:[entity:archaeology] . }\n    ?work wdt:[property:cites work] ?cited_work .\n    ?cited_work wdt:[property:publication date] ?publicationdate .\nFILTER (?publicationdate > \"1969-12-31T00:00:00\"^^xsd:dateTime) . #works published on the subject after a certain date\nFILTER (?publicationdate < \"1980-01-01T00:00:00\"^^xsd:dateTime) . #works published on the subject before a certain date\n  }\n\n  GROUP BY ?cited_work\n} AS %result\nWHERE {\n  INCLUDE %result\n  SERVICE wikibase:label { bd:serviceParam wikibase:language \"en,da,de,es,fr,jp,nl,no,ru,sv,zh\" . } \n}\nORDER BY DESC(?count)\nLIMIT 10",
    "complexity": "complex"
  },
  {
    "id": "1789",
    "instruction": "List artists in Wikidata with a National Museum Sweden ID but no Europeana entity.",
    "query": "SELECT ?item ?itemLabel ?itemDescription ?SwedishNationalmuseum WHERE {\n?item wdt:P2538 ?NatMusID.\nminus {?item wdt:P7704 ?EropeanaentityID}\nBIND(URI(CONCAT(\"http://data.europeana.eu/\",?EropeanaentityID)) AS ?Eropeanaentity)\nBIND(URI(CONCAT(\"http://collection.nationalmuseum.se/eMuseumPlus?service=ExternalInterface&module=artist&objectId=\",?NatMusID)) AS ?SwedishNationalmuseum)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,de,nl,sv\". }\n} order by ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?itemDescription ?SwedishNationalmuseum WHERE {\n?item wdt:[property:Nationalmuseum Sweden ID] ?NatMusID.\nminus {?item wdt:[property:Europeana entity] ?EropeanaentityID}\nBIND(URI(CONCAT(\"http://data.europeana.eu/\",?EropeanaentityID)) AS ?Eropeanaentity)\nBIND(URI(CONCAT(\"http://collection.nationalmuseum.se/eMuseumPlus?service=ExternalInterface&module=artist&objectId=\",?NatMusID)) AS ?SwedishNationalmuseum)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,de,nl,sv\". }\n} order by ?itemLabel",
    "complexity": "complex"
  },
  {
    "id": "308",
    "instruction": "List all artists with IIIF links in Wikidata.",
    "query": "SELECT ?creator ?creatorLabel ?creatorDescription (COUNT(?art) AS ?count) WHERE {\n?art wdt:P6108 []; wdt:P170 ?creator.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} GROUP BY ?creator ?creatorLabel ?creatorDescription\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?creator ?creatorLabel ?creatorDescription (COUNT(?art) AS ?count) WHERE {\n?art wdt:[property:IIIF manifest URL] []; wdt:[property:creator] ?creator.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} GROUP BY ?creator ?creatorLabel ?creatorDescription\nORDER BY DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "248",
    "instruction": "List all people depicted in artworks at the Ashmolean Museum.",
    "query": "SELECT ?person ?personLabel ?personDescription (SAMPLE(?image) AS ?img) (COUNT(?item) AS ?count) WHERE {\n?item wdt:P195 wd:Q636400; wdt:P973 ?url FILTER (STRSTARTS(STR(?url),\"http://jameelcentre\") ).\n?item wdt:P180 ?person.\nMINUS {?person wdt:P625 []}\nOPTIONAL {?person wdt:P18 ?image}\nSERVICE wikibase:label {bd:serviceParam wikibase:language \"en\". }\n} GROUP BY ?person ?personLabel ?personDescription ORDER BY UCASE(?personLabel)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?person ?personLabel ?personDescription (SAMPLE(?image) AS ?img) (COUNT(?item) AS ?count) WHERE {\n?item wdt:[property:collection] wd:[entity:Ashmolean Museum]; wdt:[property:described at URL] ?url FILTER (STRSTARTS(STR(?url),\"http://jameelcentre\") ).\n?item wdt:[property:image]0 ?person.\nMINUS {?person wdt:[property:coordinate location] []}\nOPTIONAL {?person wdt:[property:image] ?image}\nSERVICE wikibase:label {bd:serviceParam wikibase:language \"en\". }\n} GROUP BY ?person ?personLabel ?personDescription ORDER BY UCASE(?personLabel)",
    "complexity": "complex"
  },
  {
    "id": "1919",
    "instruction": "List all chemical compounds found in specific species, excluding humans.",
    "query": "SELECT ?compound ?compoundLabel ?speciesLabel ?source ?sourceLabel ?doi ?wpid WHERE {\n?compound wdt:P31 wd:Q11173.\nMINUS { ?compound wdt:P31 wd:Q8054. }\n?compound p:P703 ?statement.\n?statement rdf:type wikibase:BestRank.\n?statement ps:P703 ?species.\nFILTER ( ?species != wd:Q15978631 )\nOPTIONAL {\n?statement (prov:wasDerivedFrom/pr:P248) ?source.\nOPTIONAL { ?source wdt:P2410 ?wpid. }\nOPTIONAL { ?source wdt:P356 ?doi. }\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nORDER BY ASC(?compound)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX prov: <http://www.w3.org/ns/prov#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pr: <http://www.wikidata.org/prop/reference/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?compound ?compoundLabel ?speciesLabel ?source ?sourceLabel ?doi ?wpid WHERE {\n?compound wdt:[property:instance of] wd:[entity:chemical compound].\nMINUS { ?compound wdt:[property:instance of] wd:[entity:protein]. }\n?compound p:[property:found in taxon] ?statement.\n?statement rdf:type wikibase:BestRank.\n?statement ps:[property:found in taxon] ?species.\nFILTER ( ?species != wd:[entity:Homo sapiens] )\nOPTIONAL {\n?statement (prov:wasDerivedFrom/pr:[property:stated in]) ?source.\nOPTIONAL { ?source wdt:[property:WikiPathways ID] ?wpid. }\nOPTIONAL { ?source wdt:[property:DOI] ?doi. }\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nORDER BY ASC(?compound)",
    "complexity": "complex"
  },
  {
    "id": "655",
    "instruction": "List the top film directors with the most films and sitelinks.",
    "query": "SELECT ?director ?director_label ?films ?sitelinks ((?films * ?sitelinks) as ?rank)\nWHERE {\n{SELECT ?director (count(DISTINCT ?film) as ?films) (count(DISTINCT ?sitelink) as ?sitelinks)\nWHERE {\n?director wdt:P106 wd:Q2526255 . # has \"film director\" as occupation\n?film wdt:P57 ?director . # get all films directed by the director\n?sitelink schema:about ?director . # get all the sitelinks about the director\n} GROUP BY ?director }\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". # Get label if it exists\n?director rdfs:label ?director_label }\n} ORDER BY DESC(?rank)\nLIMIT 100",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?director ?director_label ?films ?sitelinks ((?films * ?sitelinks) as ?rank)\nWHERE {\n{SELECT ?director (count(DISTINCT ?film) as ?films) (count(DISTINCT ?sitelink) as ?sitelinks)\nWHERE {\n?director wdt:[property:occupation] wd:[entity:film director] . # has \"film director\" as occupation\n?film wdt:[property:director] ?director . # get all films directed by the director\n?sitelink schema:about ?director . # get all the sitelinks about the director\n} GROUP BY ?director }\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". # Get label if it exists\n?director rdfs:label ?director_label }\n} ORDER BY DESC(?rank)\nLIMIT 100",
    "complexity": "complex"
  },
  {
    "id": "1131",
    "instruction": "List books sorted by their weight in kilograms.",
    "query": "SELECT\n?book ?bookLabel\n?kilogram ?weight ?unit ?unitLabel\nWITH {\nSELECT * WHERE {\n?book wdt:P31 wd:Q3331189 .\n?book p:P2067 / psv:P2067 ?weight_value .\n?weight_value wikibase:quantityAmount ?weight .\n?weight_value wikibase:quantityUnit ?unit .\n?unit wdt:P2370 ?factor .\nBIND(?weight * ?factor AS ?kilogram)\n}\n} AS %results\nWHERE {\nINCLUDE %results\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY ?kilogram",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT\n?book ?bookLabel\n?kilogram ?weight ?unit ?unitLabel\nWITH {\nSELECT * WHERE {\n?book wdt:[property:instance of] wd:[entity:version, edition or translation] .\n?book p:[property:mass] / psv:[property:mass] ?weight_value .\n?weight_value wikibase:quantityAmount ?weight .\n?weight_value wikibase:quantityUnit ?unit .\n?unit wdt:[property:conversion to SI unit] ?factor .\nBIND(?weight * ?factor AS ?kilogram)\n}\n} AS %results\nWHERE {\nINCLUDE %results\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY ?kilogram",
    "complexity": "complex"
  },
  {
    "id": "1338",
    "instruction": "What paintings by Vermeer feature maps?",
    "query": "SELECT DISTINCT ?item ?itemLabel (YEAR(?date) AS ?year) ?dimensions ?locationLabel ?countryLabel ?image WHERE {\n?item wdt:P170 wd:Q41264 .\n{ ?item wdt:P180/wdt:P31/wdt:P279* wd:Q4006 } UNION { ?item wdt:P180/wdt:P279* wd:Q4006 }\nOPTIONAL { ?item p:P276 ?statement . ?statement ps:P276 ?location . FILTER NOT EXISTS { ?statement pq:P582 ?x } OPTIONAL { ?location wdt:P17 ?country } }\nOPTIONAL { ?item wdt:P18 ?image }\nOPTIONAL { ?item wdt:P2048 ?length }\nOPTIONAL { ?item wdt:P2049 ?width }\nOPTIONAL { ?item wdt:P571 ?date }\nBIND (CONCAT(STR(?length),\"x\",STR(?width)) AS ?dimensions)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} ORDER BY ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel (YEAR(?date) AS ?year) ?dimensions ?locationLabel ?countryLabel ?image WHERE {\n?item wdt:[property:country]0 wd:[entity:Johannes Vermeer] .\n{ ?item wdt:[property:image]0/wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:map] } UNION { ?item wdt:[property:image]0/wdt:[property:subclass of]* wd:[entity:map] }\nOPTIONAL { ?item p:[property:location] ?statement . ?statement ps:[property:location] ?location . FILTER NOT EXISTS { ?statement pq:[property:end time] ?x } OPTIONAL { ?location wdt:[property:country] ?country } }\nOPTIONAL { ?item wdt:[property:image] ?image }\nOPTIONAL { ?item wdt:[property:height] ?length }\nOPTIONAL { ?item wdt:[property:width] ?width }\nOPTIONAL { ?item wdt:[property:inception] ?date }\nBIND (CONCAT(STR(?length),\"x\",STR(?width)) AS ?dimensions)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} ORDER BY ?itemLabel",
    "complexity": "complex"
  },
  {
    "id": "1655",
    "instruction": "List all the significant events in the history of telecommunications.",
    "query": "SELECT DISTINCT ?wditem ?wditemLabel ?date ?image ?work ?workLabel WHERE {\nSERVICE <http://dbpedia.org/sparql> {\n?item dct:subject|dct:subject/skos:broader dbc:History_of_telecommunications ;\nowl:sameAs ?wditem FILTER regex (?wditem, \"wikidata.org\") .\n}\nSERVICE <https://query.wikidata.org/sparql> {\n{?wditem wdt:P569 ?date FILTER (YEAR(?date)>1700).}\nUNION\n{?wditem wdt:P571|wdt:P577|wdt:P580 ?date .}\nOPTIONAL {?wditem wdt:P800 ?work. ?work rdfs:label ?workLabel FILTER (LANG(?workLabel)=\"en\") .}\nOPTIONAL {?wditem wdt:P18 ?image } .\n?wditem rdfs:label ?wditemLabel FILTER (LANG(?wditemLabel)=\"en\") .\n}\n}",
    "annotated": "PREFIX dct: <http://purl.org/dc/terms/>\nPREFIX owl: <http://www.w3.org/2002/07/owl#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX skos: <http://www.w3.org/2004/02/skos/core#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX dbc: <http://dbpedia.org/resource/Category:>\n\nSELECT DISTINCT ?wditem ?wditemLabel ?date ?image ?work ?workLabel WHERE {\nSERVICE <http://dbpedia.org/sparql> {\n?item dct:subject|dct:subject/skos:broader dbc:History_of_telecommunications ;\nowl:sameAs ?wditem FILTER regex (?wditem, \"wikidata.org\") .\n}\nSERVICE <https://query.wikidata.org/sparql> {\n{?wditem wdt:[property:date of birth] ?date FILTER (YEAR(?date)>1700).}\nUNION\n{?wditem wdt:[property:inception]|wdt:[property:publication date]|wdt:[property:start time] ?date .}\nOPTIONAL {?wditem wdt:[property:notable work] ?work. ?work rdfs:label ?workLabel FILTER (LANG(?workLabel)=\"en\") .}\nOPTIONAL {?wditem wdt:[property:image] ?image } .\n?wditem rdfs:label ?wditemLabel FILTER (LANG(?wditemLabel)=\"en\") .\n}\n}",
    "complexity": "complex"
  },
  {
    "id": "1852",
    "instruction": "List all UK Members of Parliament born after their father's death.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?born ?father ?fatherLabel ?fatherdied ?days_posthumous WHERE {\n?item p:P39 ?statement. ?statement ps:P39 ?position . ?position wdt:P279* wd:Q16707842 .\n?item wdt:P569 ?born .\n?item wdt:P22 ?father . ?father wdt:P570 ?fatherdied . filter(?fatherdied < ?born) .\nbind(round((?born-?fatherdied)) as ?days_posthumous) .\nfilter(?days_posthumous < 1000) # omit one massively wrong\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} order by ?born",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?born ?father ?fatherLabel ?fatherdied ?days_posthumous WHERE {\n?item p:[property:position held] ?statement. ?statement ps:[property:position held] ?position . ?position wdt:[property:subclass of]* wd:[entity:Member of Parliament] .\n?item wdt:[property:date of birth] ?born .\n?item wdt:[property:father] ?father . ?father wdt:[property:date of death] ?fatherdied . filter(?fatherdied < ?born) .\nbind(round((?born-?fatherdied)) as ?days_posthumous) .\nfilter(?days_posthumous < 1000) # omit one massively wrong\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} order by ?born",
    "complexity": "complex"
  },
  {
    "id": "1458",
    "instruction": "What are the key dates in Hans Adolf Krebs' life?",
    "query": "SELECT DISTINCT ?t ?rrLabel ?valueLabel ?image\nWHERE\n{\n{wd:Q57191 ?prop ?t FILTER (datatype(?t)=xsd:dateTime) .\n?value wikibase:directClaim ?prop. }\nUNION\n{\nwd:Q57191 ?q ?statement FILTER regex (STR(?q),\"prop/P\") .\n?statement ?p ?t FILTER regex (STR(?p), \"prop/qualifier/P\") FILTER (datatype(?t)=xsd:dateTime) .\n?statement ?r ?value FILTER regex (STR(?r),\"prop/statement/\") .\nBIND(IRI(CONCAT(CONCAT(SUBSTR(STR(?r),1,29),\"direct/\"),SUBSTR(STR(?r),40))) as ?rprop)\n?rr wikibase:directClaim ?rprop .\nOPTIONAL {?value wdt:P18 ?image}\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?t ?rrLabel ?valueLabel ?image\nWHERE\n{\n{wd:[entity:Hans Krebs] ?prop ?t FILTER (datatype(?t)=xsd:dateTime) .\n?value wikibase:directClaim ?prop. }\nUNION\n{\nwd:[entity:Hans Krebs] ?q ?statement FILTER regex (STR(?q),\"prop/P\") .\n?statement ?p ?t FILTER regex (STR(?p), \"prop/qualifier/P\") FILTER (datatype(?t)=xsd:dateTime) .\n?statement ?r ?value FILTER regex (STR(?r),\"prop/statement/\") .\nBIND(IRI(CONCAT(CONCAT(SUBSTR(STR(?r),1,29),\"direct/\"),SUBSTR(STR(?r),40))) as ?rprop)\n?rr wikibase:directClaim ?rprop .\nOPTIONAL {?value wdt:[property:image] ?image}\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "1721",
    "instruction": "List all married couples where both partners have the same gender but no sexual orientation is specified.",
    "query": "SELECT DISTINCT ?person1 ?person2 ?person1Label ?person1Description ?person2Label ?person2Description WHERE {\n?person1 wdt:P31 wd:Q5;\nwdt:P21 ?gender;\nwdt:P569 ?dob1;\nwdt:P26 ?person2.\n?person2 wdt:P31 wd:Q5;\nwdt:P569 ?dob2;\nwdt:P21 ?gender.\nMINUS { ?person1 wdt:P91 ?orientation. }\nMINUS { ?person2 wdt:P91 ?orientation. }\n# arbitrarily filter out some early results, we're more likely to find references for recent people\nFILTER(?dob1 >= \"1950-01-01\"^^xsd:dateTime)\nFILTER(?dob2 >= \"1950-01-01\"^^xsd:dateTime)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?person1 ?person2 ?person1Label ?person1Description ?person2Label ?person2Description WHERE {\n?person1 wdt:[property:instance of] wd:[entity:human];\nwdt:[property:sex or gender] ?gender;\nwdt:[property:date of birth] ?dob1;\nwdt:[property:spouse] ?person2.\n?person2 wdt:[property:instance of] wd:[entity:human];\nwdt:[property:date of birth] ?dob2;\nwdt:[property:sex or gender] ?gender.\nMINUS { ?person1 wdt:[property:sexual orientation] ?orientation. }\nMINUS { ?person2 wdt:[property:sexual orientation] ?orientation. }\n# arbitrarily filter out some early results, we're more likely to find references for recent people\nFILTER(?dob1 >= \"1950-01-01\"^^xsd:dateTime)\nFILTER(?dob2 >= \"1950-01-01\"^^xsd:dateTime)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  }
]