[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "2635",
    "instruction": "List the roles of Thomas Telford in different buildings.",
    "query": "SELECT ?role (count(distinct ?item) as ?count)\nWITH {\nSELECT DISTINCT ?item ?property ?property_label WHERE {\n?item ?predicate wd:Q380875. hint:Prior hint:runFirst true.\n?item wdt:P31/wdt:P279* wd:Q811430 .hint:Prior hint:gearing \"forward\".\n?property wikibase:directClaim ?predicate .\n?property rdfs:label ?property_label . FILTER(lang(?property_label) = 'en') .\n}\n} AS %items\nWITH {\nSELECT ?item (GROUP_CONCAT(?property_label; separator = ' + ') AS ?role) WHERE {\nINCLUDE %items\n} GROUP BY ?item\n} AS %roles\nWHERE {\nINCLUDE %roles .\n} GROUP BY ?role ORDER BY DESC(?count)",
    "annotated": "PREFIX hint: <http://www.bigdata.com/queryHints#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?role (count(distinct ?item) as ?count)\nWITH {\nSELECT DISTINCT ?item ?property ?property_label WHERE {\n?item ?predicate wd:[entity:Thomas Telford]. hint:Prior hint:runFirst true.\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:fixed construction] .hint:Prior hint:gearing \"forward\".\n?property wikibase:directClaim ?predicate .\n?property rdfs:label ?property_label . FILTER(lang(?property_label) = 'en') .\n}\n} AS %items\nWITH {\nSELECT ?item (GROUP_CONCAT(?property_label; separator = ' + ') AS ?role) WHERE {\nINCLUDE %items\n} GROUP BY ?item\n} AS %roles\nWHERE {\nINCLUDE %roles .\n} GROUP BY ?role ORDER BY DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "132",
    "instruction": "List all types of things that have a geoshape on Commons.",
    "query": "SELECT (COUNT(?item) AS ?count) ?type ?typeLabel WHERE {\n?item wdt:P3896 []; wdt:P31 ?type\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} GROUP BY ?type ?typeLabel\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT (COUNT(?item) AS ?count) ?type ?typeLabel WHERE {\n?item wdt:[property:geoshape] []; wdt:[property:instance of] ?type\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} GROUP BY ?type ?typeLabel\nORDER BY DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "1222",
    "instruction": "List the institutions where Canadians got their PhDs.",
    "query": "SELECT DISTINCT ?institution ?institutionLabel ?academics ?academicsLabel ?degree ?degreeLabel ?geoloc ?image WHERE {\n?academics wdt:P31 wd:Q5 ; # instances (P31) of humans (Q5)\nwdt:P27 wd:Q16 ; # country of citizenship\np:P69 ?statement . # check for an \"educated at\" (P69) statement\nOPTIONAL { ?academics wdt:P18 ?image }. #image\n?statement ps:P69 ?institution . # get value of the \"educated at\" statement, i.e. the institution\n?institution wdt:P625 ?geoloc . # get the geolocation of the institution\n?statement pq:P512 ?degree . # get qualifier \"academic degree\" (P512)\n?degree wdt:P31*/wdt:P279* wd:Q849697 . # filter for doctoral degrees\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?institution ?institutionLabel ?academics ?academicsLabel ?degree ?degreeLabel ?geoloc ?image WHERE {\n?academics wdt:[property:instance of] wd:[entity:human] ; # instances ([property:instance of]) of humans ([entity:human])\nwdt:[property:country of citizenship] wd:[entity:Canada] ; # country of citizenship\np:[property:educated at] ?statement . # check for an \"educated at\" ([property:educated at]) statement\nOPTIONAL { ?academics wdt:[property:image] ?image }. #image\n?statement ps:[property:educated at] ?institution . # get value of the \"educated at\" statement, i.e. the institution\n?institution wdt:[property:coordinate location] ?geoloc . # get the geolocation of the institution\n?statement pq:[property:academic degree] ?degree . # get qualifier \"academic degree\" ([property:academic degree])\n?degree wdt:[property:instance of]*/wdt:[property:country of citizenship]9* wd:[entity:doctorate] . # filter for doctoral degrees\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "1694",
    "instruction": "List music bands inspired by Tolkien's works, categorized by genre.",
    "query": "SELECT ?cid ?genre (COUNT(*) AS ?count) WHERE {\n?item wdt:P31 wd:Q215380;\nwdt:P138 ?ref.\n?ref wdt:P1080 wd:Q81738.\n?item wdt:P136 ?cid.\nOPTIONAL {\n?cid rdfs:label ?genre.\nFILTER((LANG(?genre)) = \"en\")\n}\n}\nGROUP BY ?cid ?genre\nORDER BY DESC (?count) (?genre)",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?cid ?genre (COUNT(*) AS ?count) WHERE {\n?item wdt:[property:instance of] wd:[entity:musical group];\nwdt:[property:named after] ?ref.\n?ref wdt:[property:from narrative universe] wd:[entity:Tolkien's legendarium].\n?item wdt:[property:genre] ?cid.\nOPTIONAL {\n?cid rdfs:label ?genre.\nFILTER((LANG(?genre)) = \"en\")\n}\n}\nGROUP BY ?cid ?genre\nORDER BY DESC (?count) (?genre)",
    "complexity": "complex"
  },
  {
    "id": "2389",
    "instruction": "List all Nigerian women with a Basque Wikipedia article.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?image ?jarduera ?jardueraLabel ?jaiotza_data ?heriotza_data WHERE {\n?item wdt:P21 wd:Q6581072.\n{ ?item wdt:P17 wd:Q1033. }\nUNION\n{\n?item wdt:P19 ?pob.\n?pob (wdt:P131*) wd:Q1033.\n}\nOPTIONAL {\n?sitelink schema:about ?item;\nschema:inLanguage \"eu\".\n}\n?item wdt:P31 wd:Q5.\nFILTER(BOUND(?sitelink))\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"eu,es, en\". }\nOPTIONAL { ?item wdt:P106 ?jarduera. }\nOPTIONAL { ?item wdt:P569 ?jaiotza_data. }\nOPTIONAL { ?item wdt:P570 ?heriotza_data. }\n}\nLIMIT 1000",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?image ?jarduera ?jardueraLabel ?jaiotza_data ?heriotza_data WHERE {\n?item wdt:[property:sex or gender] wd:[entity:female].\n{ ?item wdt:[property:country] wd:[entity:Nigeria]. }\nUNION\n{\n?item wdt:[property:place of birth] ?pob.\n?pob (wdt:[property:located in the administrative territorial entity]*) wd:[entity:Nigeria].\n}\nOPTIONAL {\n?sitelink schema:about ?item;\nschema:inLanguage \"eu\".\n}\n?item wdt:[property:instance of] wd:[entity:human].\nFILTER(BOUND(?sitelink))\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"eu,es, en\". }\nOPTIONAL { ?item wdt:[property:occupation] ?jarduera. }\nOPTIONAL { ?item wdt:[property:date of birth] ?jaiotza_data. }\nOPTIONAL { ?item wdt:[property:date of death] ?heriotza_data. }\n}\nLIMIT 1000",
    "complexity": "complex"
  },
  {
    "id": "2305",
    "instruction": "What are the different writing systems and their corresponding years of origin?",
    "query": "SELECT distinct ?aksara ?aksaraLabel ?tgl ?tahun (sample(?ga) as ?gam) WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"id,en\". }\n?aksara wdt:P31/wdt:P279* wd:Q8192.\nMINUS { ?aksara wdt:P31/wdt:P279* wd:Q17451.} #bukan rupa huruf\nMINUS { ?aksara wdt:P31 wd:Q53764738.}\nMINUS { ?aksara wdt:P31 wd:Q16744570.}\nMINUS { ?aksara wdt:P31 wd:Q29575627.}\nMINUS { ?aksara wdt:P31/wdt:P279* wd:Q12681.}\nOPTIONAL { ?aksara wdt:P571 ?tgl. }\nOPTIONAL { ?aksara wdt:P18 ?ga. }\nBIND ( year(?tgl) AS ?th ).\nBIND ( xsd:integer(?th) - IF(?th<0,IF(STRENDS(STR(?th),\"9\"),1,0),0) AS ?th2). #kurangi satu tahun jika tahun SM karena tampilan tahun SM default bertambah 1\nBIND ( IF(?th2<0,CONCAT(STR(?th2 * -1),\" SM\"),?th2) AS ?tahun).\n}\nGROUP BY ?aksara ?aksaraLabel ?tgl ?tahun\n#defaultView:Timeline\n#view:Timeline{\"hide\": \"?tgl\"}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT distinct ?aksara ?aksaraLabel ?tgl ?tahun (sample(?ga) as ?gam) WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"id,en\". }\n?aksara wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:writing system].\nMINUS { ?aksara wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:typeface].} #bukan rupa huruf\nMINUS { ?aksara wdt:[property:instance of] wd:Q53764738.}\nMINUS { ?aksara wdt:[property:instance of] wd:[entity:tablet].}\nMINUS { ?aksara wdt:[property:instance of] wd:[entity:Latin-script alphabet].}\nMINUS { ?aksara wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:calligraphy].}\nOPTIONAL { ?aksara wdt:[property:inception] ?tgl. }\nOPTIONAL { ?aksara wdt:[property:image] ?ga. }\nBIND ( year(?tgl) AS ?th ).\nBIND ( xsd:integer(?th) - IF(?th<0,IF(STRENDS(STR(?th),\"9\"),1,0),0) AS ?th2). #kurangi satu tahun jika tahun SM karena tampilan tahun SM default bertambah 1\nBIND ( IF(?th2<0,CONCAT(STR(?th2 * -1),\" SM\"),?th2) AS ?tahun).\n}\nGROUP BY ?aksara ?aksaraLabel ?tgl ?tahun\n#defaultView:Timeline\n#view:Timeline{\"hide\": \"?tgl\"}",
    "complexity": "complex"
  },
  {
    "id": "2655",
    "instruction": "List the mountains in France with an elevation of at least 2,500 meters.",
    "query": "SELECT ?item ?itemLabel ?itemDescription ?instance ?instanceLabel ?altitude ?coord\nWHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\nwd:Q8502 ^(wdt:P279*) ?instance.\n?item wdt:P31 ?instance;\nwdt:P17 wd:Q142;\nwdt:P625 ?coord;\nwdt:P2044 ?altitude.\nFILTER(?altitude >= 2500)\n}\nORDER BY DESC(?altitude)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?itemDescription ?instance ?instanceLabel ?altitude ?coord\nWHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\nwd:[entity:mountain] ^(wdt:[property:subclass of]*) ?instance.\n?item wdt:[property:instance of] ?instance;\nwdt:[property:country] wd:[entity:France];\nwdt:[property:coordinate location] ?coord;\nwdt:[property:elevation above sea level] ?altitude.\nFILTER(?altitude >= 2500)\n}\nORDER BY DESC(?altitude)",
    "complexity": "complex"
  },
  {
    "id": "1632",
    "instruction": "What are the most common qualifiers used on depicts statements in Wikidata?",
    "query": "SELECT ?total ?count ?depicts_class ?depicts_classLabel ?prop ?propLabel ?samp\nWITH {\nSELECT ?item ?depicts_stmt WHERE {\n?item p:P180 ?depicts_stmt .\n} # LIMIT 100000\n} AS %stmts\nWITH {\nSELECT ?prop (COUNT(DISTINCT(?depicts_stmt)) AS ?total) WHERE {\nINCLUDE %stmts .\n?depicts_stmt ?qual [] .\n?prop wikibase:qualifier ?qual .\n} GROUP BY ?prop\n} AS %totals\nWITH {\nSELECT ?depicts_class ?prop (COUNT(DISTINCT(?depicts_stmt)) AS ?count) (SAMPLE(?item) AS ?samp) WHERE {\nINCLUDE %stmts .\n?depicts_stmt ps:P180 ?depicts_val .\n?depicts_val wdt:P31? ?depicts_class .\n?depicts_stmt ?qual [] .\n?prop wikibase:qualifier ?qual .\n} GROUP BY ?depicts_class ?prop\nORDER BY DESC(?count)\nLIMIT 5000\n} AS %data\nWITH {\nSELECT ?depicts_class ?prop (COUNT(DISTINCT(?depicts_class1)) AS ?rank) WHERE {\nINCLUDE %data .\n{\nSELECT (?depicts_class AS ?depicts_class1) ?prop (?count AS ?count1) WHERE {\nINCLUDE %data .\n}\n}\nFILTER (?count1 >= ?count) .\n} GROUP BY ?depicts_class ?prop\n} AS %ranks\nWHERE {\nINCLUDE %data .\nINCLUDE %ranks .\nINCLUDE %totals .\nFILTER (?rank < 11) .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY DESC(?total) ?prop DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?total ?count ?depicts_class ?depicts_classLabel ?prop ?propLabel ?samp\nWITH {\nSELECT ?item ?depicts_stmt WHERE {\n?item p:[property:depicts] ?depicts_stmt .\n} # LIMIT 100000\n} AS %stmts\nWITH {\nSELECT ?prop (COUNT(DISTINCT(?depicts_stmt)) AS ?total) WHERE {\nINCLUDE %stmts .\n?depicts_stmt ?qual [] .\n?prop wikibase:qualifier ?qual .\n} GROUP BY ?prop\n} AS %totals\nWITH {\nSELECT ?depicts_class ?prop (COUNT(DISTINCT(?depicts_stmt)) AS ?count) (SAMPLE(?item) AS ?samp) WHERE {\nINCLUDE %stmts .\n?depicts_stmt ps:[property:depicts] ?depicts_val .\n?depicts_val wdt:[property:instance of]? ?depicts_class .\n?depicts_stmt ?qual [] .\n?prop wikibase:qualifier ?qual .\n} GROUP BY ?depicts_class ?prop\nORDER BY DESC(?count)\nLIMIT 5000\n} AS %data\nWITH {\nSELECT ?depicts_class ?prop (COUNT(DISTINCT(?depicts_class1)) AS ?rank) WHERE {\nINCLUDE %data .\n{\nSELECT (?depicts_class AS ?depicts_class1) ?prop (?count AS ?count1) WHERE {\nINCLUDE %data .\n}\n}\nFILTER (?count1 >= ?count) .\n} GROUP BY ?depicts_class ?prop\n} AS %ranks\nWHERE {\nINCLUDE %data .\nINCLUDE %ranks .\nINCLUDE %totals .\nFILTER (?rank < 11) .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY DESC(?total) ?prop DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "587",
    "instruction": "What are the counts of variants by predictor type?",
    "query": "SELECT ?propertyLabel (count(?prognostic_type) as ?counts)\nWHERE\n{\nVALUES ?prognostic_type {wdt:P3354 wdt:P3355 wdt:P3356 wdt:P3357 wdt:P3358 wdt:P3359}\n?item wdt:P3329 ?civic_id ;\n?prognostic_type ?prognostic_value .\n?property wikibase:directClaim ?prognostic_type .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}\nGROUP BY ?propertyLabel ?prognostic_typeLabel\nORDER BY ?counts",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?propertyLabel (count(?prognostic_type) as ?counts)\nWHERE\n{\nVALUES ?prognostic_type {wdt:[property:positive therapeutic predictor for] wdt:[property:negative therapeutic predictor for] wdt:[property:positive diagnostic predictor for] wdt:[property:negative diagnostic predictor for] wdt:[property:positive prognostic predictor for] wdt:[property:negative prognostic predictor for]}\n?item wdt:[property:CIViC variant ID] ?civic_id ;\n?prognostic_type ?prognostic_value .\n?property wikibase:directClaim ?prognostic_type .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}\nGROUP BY ?propertyLabel ?prognostic_typeLabel\nORDER BY ?counts",
    "complexity": "complex"
  },
  {
    "id": "1048",
    "instruction": "What are the special days or celebrations happening today?",
    "query": "SELECT ?holiday ?holidayLabel WHERE {\n# first get the item for today's date by stitching together the English label (month name + day number) and finding items with that label\nVALUES (?monthNumber ?monthName) {\n(1 \"January\"@en)\n(2 \"February\"@en)\n(3 \"March\"@en)\n(4 \"April\"@en)\n(5 \"May\"@en)\n(6 \"June\"@en)\n(7 \"July\"@en)\n(8 \"August\"@en)\n(9 \"September\"@en)\n(10 \"October\"@en)\n(11 \"November\"@en)\n(12 \"December\"@en)\n}\nFILTER(?monthNumber = MONTH(NOW())).\nBIND(CONCAT(?monthName, \" \"@en, STRLANG(STR(DAY(NOW())),\"en\")) AS ?dateLabel).\n?date rdfs:label ?dateLabel.\n# then find holidays occurring on that day\n?holiday wdt:P837 ?date.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?holiday ?holidayLabel WHERE {\n# first get the item for today's date by stitching together the English label (month name + day number) and finding items with that label\nVALUES (?monthNumber ?monthName) {\n(1 \"January\"@en)\n(2 \"February\"@en)\n(3 \"March\"@en)\n(4 \"April\"@en)\n(5 \"May\"@en)\n(6 \"June\"@en)\n(7 \"July\"@en)\n(8 \"August\"@en)\n(9 \"September\"@en)\n(10 \"October\"@en)\n(11 \"November\"@en)\n(12 \"December\"@en)\n}\nFILTER(?monthNumber = MONTH(NOW())).\nBIND(CONCAT(?monthName, \" \"@en, STRLANG(STR(DAY(NOW())),\"en\")) AS ?dateLabel).\n?date rdfs:label ?dateLabel.\n# then find holidays occurring on that day\n?holiday wdt:[property:day in year for periodic occurrence] ?date.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "1978",
    "instruction": "List all organizations with open data portals in Wikidata.",
    "query": "SELECT ?org ?orgLabel ?portal ?portalLabel (SAMPLE(?coord) as ?coord) (SAMPLE(?img) as ?img) WHERE {\n# ?portal wdt:P31 wd:Q27031827.\n?org wdt:P8402 ?portal.\n?org wdt:P276?/wdt:P625 ?coord.\nOPTIONAL { ?org wdt:P41 ?flag }\nOPTIONAL { ?org wdt:P94 ?coat }\nOPTIONAL { ?org wdt:P154 ?logo }\nOPTIONAL { ?org wdt:P18 ?image }\nBIND( COALESCE(?flag, ?coat, ?logo, ?image) as ?img )\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nGROUP BY ?org ?orgLabel ?portal ?portalLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?org ?orgLabel ?portal ?portalLabel (SAMPLE(?coord) as ?coord) (SAMPLE(?img) as ?img) WHERE {\n# ?portal wdt:[property:instance of] wd:[entity:open data portal].\n?org wdt:[property:open data portal] ?portal.\n?org wdt:[property:location]?/wdt:[property:coordinate location] ?coord.\nOPTIONAL { ?org wdt:[property:flag image] ?flag }\nOPTIONAL { ?org wdt:[property:coat of arms image] ?coat }\nOPTIONAL { ?org wdt:[property:logo image] ?logo }\nOPTIONAL { ?org wdt:[property:image] ?image }\nBIND( COALESCE(?flag, ?coat, ?logo, ?image) as ?img )\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nGROUP BY ?org ?orgLabel ?portal ?portalLabel",
    "complexity": "complex"
  },
  {
    "id": "1310",
    "instruction": "List all tide mills in France along with their locations.",
    "query": "SELECT ?item ?itemLabel ?placeLabel ?departmentLabel ?coords ?image WHERE {\n?item wdt:P31/wdt:P279* wd:Q493694 ;\nwdt:P17 wd:Q142 ;\nwdt:P131 ?place .\n?place wdt:P131* ?department .\n?department wdt:P31 wd:Q6465 .\n?item wdt:P625 ?coords .\nOPTIONAL { ?item wdt:P18 ?image . }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\" . }\n} ORDER BY ?departmentLabel ?placeLabel ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?placeLabel ?departmentLabel ?coords ?image WHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:tide mill] ;\nwdt:[property:country] wd:[entity:France] ;\nwdt:[property:located in the administrative territorial entity] ?place .\n?place wdt:[property:located in the administrative territorial entity]* ?department .\n?department wdt:[property:instance of] wd:[entity:department of France] .\n?item wdt:[property:coordinate location] ?coords .\nOPTIONAL { ?item wdt:[property:image] ?image . }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\" . }\n} ORDER BY ?departmentLabel ?placeLabel ?itemLabel",
    "complexity": "complex"
  },
  {
    "id": "513",
    "instruction": "List languages with the most usage examples in a lexical database.",
    "query": "SELECT ?languageLabel (COUNT(?example) AS ?count ) WHERE {\n?l a ontolex:LexicalEntry; dct:language ?language.\n?l p:P5831 ?statement.\n?statement ps:P5831 ?example;\npq:P6072 [];\npq:P5830 [].\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?languageLabel\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX dct: <http://purl.org/dc/terms/>\nPREFIX ontolex: <http://www.w3.org/ns/lemon/ontolex#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?languageLabel (COUNT(?example) AS ?count ) WHERE {\n?l a ontolex:LexicalEntry; dct:language ?language.\n?l p:[property:usage example] ?statement.\n?statement ps:[property:usage example] ?example;\npq:[property:subject sense] [];\npq:[property:subject form] [].\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?languageLabel\nORDER BY DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "1695",
    "instruction": "List the years when works were published that are used as examples for Swedish words.",
    "query": "SELECT DISTINCT ?year (COUNT(?stated_in) AS ?count ) WHERE {\n?l a ontolex:LexicalEntry;\ndct:language ?language.\n?language wdt:P218 'sv'.\n?l wdt:P5831 ?example.\n?l p:P5831 ?statement.\n?statement prov:wasDerivedFrom ?refnode.\n?refnode pr:P248 ?stated_in.\n?stated_in wdt:P577 ?date.\nBIND(str(YEAR(?date)) AS ?year)\n}\nGROUP BY ?year\nORDER BY ?year",
    "annotated": "PREFIX dct: <http://purl.org/dc/terms/>\nPREFIX ontolex: <http://www.w3.org/ns/lemon/ontolex#>\nPREFIX prov: <http://www.w3.org/ns/prov#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pr: <http://www.wikidata.org/prop/reference/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT DISTINCT ?year (COUNT(?stated_in) AS ?count ) WHERE {\n?l a ontolex:LexicalEntry;\ndct:language ?language.\n?language wdt:[property:ISO 639-1 code] 'sv'.\n?l wdt:[property:usage example] ?example.\n?l p:[property:usage example] ?statement.\n?statement prov:wasDerivedFrom ?refnode.\n?refnode pr:[property:stated in] ?stated_in.\n?stated_in wdt:[property:publication date] ?date.\nBIND(str(YEAR(?date)) AS ?year)\n}\nGROUP BY ?year\nORDER BY ?year",
    "complexity": "complex"
  },
  {
    "id": "2510",
    "instruction": "List all languages with their corresponding number of non-English labels for Khalili Collections.",
    "query": "SELECT ?lang ?count WITH {\nSELECT ?work ?label WHERE {\n?work wdt:P195?/wdt:P361? wd:Q63160499. # Khalili Collections, or individual collections, or objects within collections\n?work (rdfs:label|skos:altLabel) ?label\nFILTER(lang(?label) != \"en\") } } AS %core\nWHERE { {\nSELECT ?lang (COUNT(?label) AS ?count) WHERE {\nINCLUDE %core.\nBIND(lang(?label) AS ?langcode).\nOPTIONAL { ?language wdt:P218 ?langcode; rdfs:label ?langname FILTER(lang(?langname) = \"en\")}\nBIND(IF (BOUND(?langname), ?langname, ?langcode) AS ?lang)\n} GROUP BY ?lang\n} UNION {\nSELECT (\"TOTAL\" AS ?lang) (COUNT(?label) AS ?count) WHERE {\nINCLUDE %core.\n} }\n} order BY DESC(?count) ?lang",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX skos: <http://www.w3.org/2004/02/skos/core#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?lang ?count WITH {\nSELECT ?work ?label WHERE {\n?work wdt:[property:collection]?/wdt:[property:part of]? wd:[entity:Khalili Collections]. # Khalili Collections, or individual collections, or objects within collections\n?work (rdfs:label|skos:altLabel) ?label\nFILTER(lang(?label) != \"en\") } } AS %core\nWHERE { {\nSELECT ?lang (COUNT(?label) AS ?count) WHERE {\nINCLUDE %core.\nBIND(lang(?label) AS ?langcode).\nOPTIONAL { ?language wdt:[property:ISO 639-1 code] ?langcode; rdfs:label ?langname FILTER(lang(?langname) = \"en\")}\nBIND(IF (BOUND(?langname), ?langname, ?langcode) AS ?lang)\n} GROUP BY ?lang\n} UNION {\nSELECT (\"TOTAL\" AS ?lang) (COUNT(?label) AS ?count) WHERE {\nINCLUDE %core.\n} }\n} order BY DESC(?count) ?lang",
    "complexity": "complex"
  },
  {
    "id": "1294",
    "instruction": "What are the most popular music genres in each country?",
    "query": "SELECT ?countryLabel (GROUP_CONCAT(?genreLabel; SEPARATOR=\", \") AS ?genres) WHERE {\n# for every country, find the maximum number of performers for some genre\n{ SELECT ?country (MAX(?genrePerformers) AS ?maxPerformers) WHERE {\n# for every country and genre, find the maximum number of performers\nSELECT ?country (MAX(COUNT(DISTINCT ?performer)) AS ?genrePerformers) WHERE {\n?genre wdt:P31/wdt:P279* wd:Q188451 ; # is-a musical genre\n^wdt:P136 ?performer ; # genre of performer\n{{ ?performer wdt:P31/wdt:P279* wd:Q215380 } UNION # performer is-a band\n{ ?performer ((wdt:P31/wdt:P279*)|wdt:P106) wd:Q639669 }} # ... or a musician\n?performer (wdt:P27|wdt:P495)/wdt:P131* ?country . # performer originating in/citizen of country\n?country wdt:P31 wd:Q3624078 . # country is a sovereign state\n} GROUP BY ?country ?genre\n} GROUP BY ?country }\n# for every country and genre, find the number of performers\n{ SELECT ?country ?genre ?genreLabel\n(COUNT(DISTINCT ?performer) AS ?performers) WHERE {\n?genre wdt:P31/wdt:P279* wd:Q188451 ; # is-a musical genre\n^wdt:P136 ?performer ; # genre of performer\nrdfs:label ?genreLabel # also fetch the label\nFILTER(LANG(?genreLabel) = \"en\")\n{{ ?performer wdt:P31/wdt:P279* wd:Q215380 } UNION # performer is-a band\n{ ?performer ((wdt:P31/wdt:P279*)|wdt:P106) wd:Q639669 }} # ... or a musician\n?performer (wdt:P27|wdt:P495) ?country . # performer originating in/citizen of country\n} GROUP BY ?country ?genre ?genreLabel\n}\nFILTER(?performers = ?maxPerformers) # keep only those combinations of country and genre\n# where the number of performers is maximal\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} GROUP BY ?countryLabel ORDER BY ?countryLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?countryLabel (GROUP_CONCAT(?genreLabel; SEPARATOR=\", \") AS ?genres) WHERE {\n# for every country, find the maximum number of performers for some genre\n{ SELECT ?country (MAX(?genrePerformers) AS ?maxPerformers) WHERE {\n# for every country and genre, find the maximum number of performers\nSELECT ?country (MAX(COUNT(DISTINCT ?performer)) AS ?genrePerformers) WHERE {\n?genre wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:music genre] ; # is-a musical genre\n^wdt:[property:genre] ?performer ; # genre of performer\n{{ ?performer wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:musical group] } UNION # performer is-a band\n{ ?performer ((wdt:[property:instance of]/wdt:[property:subclass of]*)|wdt:[property:occupation]) wd:[entity:musician] }} # ... or a musician\n?performer (wdt:[property:country of citizenship]|wdt:[property:country of origin])/wdt:[property:located in the administrative territorial entity]* ?country . # performer originating in/citizen of country\n?country wdt:[property:instance of] wd:[entity:sovereign state] . # country is a sovereign state\n} GROUP BY ?country ?genre\n} GROUP BY ?country }\n# for every country and genre, find the number of performers\n{ SELECT ?country ?genre ?genreLabel\n(COUNT(DISTINCT ?performer) AS ?performers) WHERE {\n?genre wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:music genre] ; # is-a musical genre\n^wdt:[property:genre] ?performer ; # genre of performer\nrdfs:label ?genreLabel # also fetch the label\nFILTER(LANG(?genreLabel) = \"en\")\n{{ ?performer wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:musical group] } UNION # performer is-a band\n{ ?performer ((wdt:[property:instance of]/wdt:[property:subclass of]*)|wdt:[property:occupation]) wd:[entity:musician] }} # ... or a musician\n?performer (wdt:[property:country of citizenship]|wdt:[property:country of origin]) ?country . # performer originating in/citizen of country\n} GROUP BY ?country ?genre ?genreLabel\n}\nFILTER(?performers = ?maxPerformers) # keep only those combinations of country and genre\n# where the number of performers is maximal\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} GROUP BY ?countryLabel ORDER BY ?countryLabel",
    "complexity": "complex"
  },
  {
    "id": "2669",
    "instruction": "What are the most common lexical categories used across languages in Wikidata?",
    "query": "SELECT ?lexicalCategory ?lexicalCategoryLabel ?count ?sample WITH {\nSELECT ?lexicalCategory (COUNT(DISTINCT ?language) AS ?count) (SAMPLE(?lexeme) AS ?sample) {\n?lexeme wikibase:lexicalCategory ?lexicalCategory ; dct:language ?language .\n}\nGROUP BY ?lexicalCategory\n} AS %i WHERE {\nINCLUDE %i\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX dct: <http://purl.org/dc/terms/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?lexicalCategory ?lexicalCategoryLabel ?count ?sample WITH {\nSELECT ?lexicalCategory (COUNT(DISTINCT ?language) AS ?count) (SAMPLE(?lexeme) AS ?sample) {\n?lexeme wikibase:lexicalCategory ?lexicalCategory ; dct:language ?language .\n}\nGROUP BY ?lexicalCategory\n} AS %i WHERE {\nINCLUDE %i\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}\nORDER BY DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "1006",
    "instruction": "What are the most common variations of the name Antoine?",
    "query": "SELECT ?name ?nameLabel ?count WHERE {\nhint:Query hint:optimizer \"None\" .\n{\nSELECT ?name (COUNT(DISTINCT ?a) AS ?count) WHERE {\n{\nSELECT DISTINCT ?name WHERE {\n{?name wdt:P460* wd:Q15235674 } UNION { wd:Q15235674 wdt:P460* ?name} .\n?name wdt:P31 wd:Q12308941 .\n} LIMIT 100\n} .\n?a wdt:P735 ?name .\n?a wdt:P31 wd:Q5 .\n} GROUP BY ?name\n} .\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n}\n# HAVING (?count > 1)\nORDER BY DESC(?count) ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX hint: <http://www.bigdata.com/queryHints#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?name ?nameLabel ?count WHERE {\nhint:Query hint:optimizer \"None\" .\n{\nSELECT ?name (COUNT(DISTINCT ?a) AS ?count) WHERE {\n{\nSELECT DISTINCT ?name WHERE {\n{?name wdt:[property:said to be the same as]* wd:[entity:Antoine] } UNION { wd:[entity:Antoine] wdt:[property:said to be the same as]* ?name} .\n?name wdt:[property:instance of] wd:[entity:male given name] .\n} LIMIT 100\n} .\n?a wdt:[property:given name] ?name .\n?a wdt:[property:instance of] wd:[entity:human] .\n} GROUP BY ?name\n} .\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n}\n# HAVING (?count > 1)\nORDER BY DESC(?count) ?itemLabel",
    "complexity": "complex"
  }
]