[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "820",
    "instruction": "Show me a map of U-Bahn stations in Berlin that are on the U1 line.",
    "query": "SELECT ?stationLabel ?coord\nWHERE {\n?station wdt:P81 wd:Q99691 .\n?station wdt:P625 ?coord\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"de\" }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?stationLabel ?coord\nWHERE {\n?station wdt:[property:connecting line] wd:[entity:U1] .\n?station wdt:[property:coordinate location] ?coord\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"de\" }\n}",
    "complexity": "medium"
  },
  {
    "id": "1940",
    "instruction": "List all locations where Art+Feminism editathons took place in 2020.",
    "query": "SELECT ?location ?locationLabel ?coord ?page ?point_in_time ?number_of_participants WHERE {\nwd:Q95116664 p:P276 ?statement.\n?statement ps:P276 ?location.\n?location wdt:P625 ?coord.\nOPTIONAL { ?statement pq:P856 ?page. }\nOPTIONAL { ?statement pq:P585 ?point_in_time. }\nOPTIONAL { ?statement pq:P1132 ?number_of_participants. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?location ?locationLabel ?coord ?page ?point_in_time ?number_of_participants WHERE {\nwd:[entity:Art+Feminism's 2020 campaign] p:[property:location] ?statement.\n?statement ps:[property:location] ?location.\n?location wdt:[property:coordinate location] ?coord.\nOPTIONAL { ?statement pq:[property:official website] ?page. }\nOPTIONAL { ?statement pq:[property:point in time] ?point_in_time. }\nOPTIONAL { ?statement pq:[property:number of participants] ?number_of_participants. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "163",
    "instruction": "List all French cities with names ending in 'ange'.",
    "query": "SELECT ?city ?name WHERE {\n?city wdt:P17 wd:Q142;\nwdt:P625 [].\n?city rdfs:label ?name FILTER (lang(?name)=\"fr\") FILTER ( REGEX(?name, \"ange$\", \"\") )\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?city ?name WHERE {\n?city wdt:[property:country] wd:[entity:France];\nwdt:[property:coordinate location] [].\n?city rdfs:label ?name FILTER (lang(?name)=\"fr\") FILTER ( REGEX(?name, \"ange$\", \"\") )\n}",
    "complexity": "medium"
  },
  {
    "id": "777",
    "instruction": "What are the names of people or things born on October 29?",
    "query": "select distinct ?item ?itemLabel ?instanceOfLabel ?DateofBirth ?Inception\nwhere {\n{ ?item wdt:P569 ?DateofBirth. #P569 date of birth\nFILTER (month(?DateofBirth) = 10 && day(?DateofBirth) = 29)\n}UNION\n{ ?item wdt:P571 ?Inception. #P571 inception/date of creation\nFILTER (month(?Inception) = 10 && day(?Inception) = 29)\n}\n?item wdt:P31 ?instanceOf. #P31 instance of\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en,ar,be,bg,bn,ca,cs,da,de,el,es,et,fa,fi,fr,he,hi,hu,hy,id,it,ja,jv,ko,nb,nl,eo,pa,pl,pt,ro,ru,sh,sk,sr,sv,sw,te,th,tr,uk,yue,vec,vi,zh\"\n}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nselect distinct ?item ?itemLabel ?instanceOfLabel ?DateofBirth ?Inception\nwhere {\n{ ?item wdt:[property:date of birth] ?DateofBirth. #[property:date of birth] date of birth\nFILTER (month(?DateofBirth) = 10 && day(?DateofBirth) = 29)\n}UNION\n{ ?item wdt:[property:inception] ?Inception. #[property:inception] inception/date of creation\nFILTER (month(?Inception) = 10 && day(?Inception) = 29)\n}\n?item wdt:[property:instance of] ?instanceOf. #[property:instance of] instance of\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en,ar,be,bg,bn,ca,cs,da,de,el,es,et,fa,fi,fr,he,hi,hu,hy,id,it,ja,jv,ko,nb,nl,eo,pa,pl,pt,ro,ru,sh,sk,sr,sv,sw,te,th,tr,uk,yue,vec,vi,zh\"\n}\n}",
    "complexity": "medium"
  },
  {
    "id": "1593",
    "instruction": "List literary awards with fewer than three winners.",
    "query": "SELECT DISTINCT ?award ?awardLabel (COUNT(?person) AS ?recipients) WHERE {\n?award wdt:P31 wd:Q378427.\nOPTIONAL { ?person wdt:P166 ?award. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?award ?awardLabel\nHAVING (?recipients < 3)\nORDER BY ?recipients",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?award ?awardLabel (COUNT(?person) AS ?recipients) WHERE {\n?award wdt:[property:instance of] wd:[entity:literary award].\nOPTIONAL { ?person wdt:[property:award received] ?award. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?award ?awardLabel\nHAVING (?recipients < 3)\nORDER BY ?recipients",
    "complexity": "medium"
  },
  {
    "id": "559",
    "instruction": "List all cities located on the border of a specific country.",
    "query": "SELECT ?border_city ?border_cityLabel ?countryLabel ?coords\nWHERE {\n?border_city wdt:P31 wd:Q902814.\nOPTIONAL { ?border_city wdt:P17 ?country. }\nOPTIONAL { ?border_city wdt:P625 ?coords. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\".\n?border_city rdfs:label ?border_cityLabel.\n?country rdfs:label ?countryLabel.}\n}\nGROUP BY ?border_city ?border_cityLabel ?countryLabel ?coords\nORDER BY ?countryLabel ?border_cityLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?border_city ?border_cityLabel ?countryLabel ?coords\nWHERE {\n?border_city wdt:[property:instance of] wd:[entity:border city].\nOPTIONAL { ?border_city wdt:[property:country] ?country. }\nOPTIONAL { ?border_city wdt:[property:coordinate location] ?coords. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\".\n?border_city rdfs:label ?border_cityLabel.\n?country rdfs:label ?countryLabel.}\n}\nGROUP BY ?border_city ?border_cityLabel ?countryLabel ?coords\nORDER BY ?countryLabel ?border_cityLabel",
    "complexity": "medium"
  },
  {
    "id": "2768",
    "instruction": "List all Wikimedians with their Mastodon account information.",
    "query": "SELECT ?item ?itemLabel ?mastodon ?wikimedia WHERE {\n?item wdt:P4033 ?mastodon;\nwdt:P4174 ?wikimedia.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?mastodon ?wikimedia WHERE {\n?item wdt:[property:Mastodon address] ?mastodon;\nwdt:[property:Wikimedia username] ?wikimedia.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "490",
    "instruction": "List all humans whose birthplace is New York City.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?itemDescription ?sitelinks\nWHERE {\n?item wdt:P31 wd:Q5; # Any instance of a human\nwdt:P19/wdt:P131* wd:Q60; # Who was born in any value (eg. a hospital)\nwikibase:sitelinks ?sitelinks.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}\nORDER BY DESC(?sitelinks)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?itemDescription ?sitelinks\nWHERE {\n?item wdt:[property:instance of] wd:[entity:human]; # Any instance of a human\nwdt:[property:place of birth]/wdt:[property:located in the administrative territorial entity]* wd:[entity:New York City]; # Who was born in any value (eg. a hospital)\nwikibase:sitelinks ?sitelinks.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}\nORDER BY DESC(?sitelinks)",
    "complexity": "medium"
  },
  {
    "id": "1119",
    "instruction": "What are the megalithic sites in Spain?",
    "query": "SELECT DISTINCT ?item ?itemLabel ?communityLabel ?image ?coords WHERE {\n?item wdt:P31/wdt:P279* wd:Q164240 ;\nwdt:P17 wd:Q29 ;\nwdt:P131+ ?community .\n?community wdt:P31 wd:Q10742 .\nOPTIONAL { ?item wdt:P18 ?image . }\nOPTIONAL { ?item wdt:P625 ?coords . }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} ORDER BY ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?communityLabel ?image ?coords WHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:megalith] ;\nwdt:[property:country] wd:[entity:Spain] ;\nwdt:[property:located in the administrative territorial entity]+ ?community .\n?community wdt:[property:instance of] wd:[entity:autonomous community of Spain] .\nOPTIONAL { ?item wdt:[property:image] ?image . }\nOPTIONAL { ?item wdt:[property:coordinate location] ?coords . }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} ORDER BY ?itemLabel",
    "complexity": "medium"
  },
  {
    "id": "96",
    "instruction": "List all doctoral theses with an author, but exclude those where the author has another thesis.",
    "query": "SELECT ?thesis ?thesisDescription ?author ?authorLabel WHERE {\n?thesis wdt:P31 wd:Q187685;\nwdt:P50 ?author.\nMINUS { ?author wdt:P1026 [] }\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\"\n}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?thesis ?thesisDescription ?author ?authorLabel WHERE {\n?thesis wdt:[property:instance of] wd:[entity:doctoral thesis];\nwdt:[property:author] ?author.\nMINUS { ?author wdt:[property:academic thesis] [] }\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\"\n}\n}",
    "complexity": "medium"
  },
  {
    "id": "2799",
    "instruction": "Find organizations on the fediverse that are classified as nonprofits.",
    "query": "SELECT DISTINCT ?org ?orgLabel ?orgDescription ?mastodonName ?pic\nWHERE {\n?org wdt:P4033 ?mastodonName .\n?org wdt:P31 ?type .\n?type wdt:P279* wd:Q163740 .\nOPTIONAL { ?org wdt:P18 ?pic . }\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\"\n}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?org ?orgLabel ?orgDescription ?mastodonName ?pic\nWHERE {\n?org wdt:[property:Mastodon address] ?mastodonName .\n?org wdt:[property:instance of] ?type .\n?type wdt:[property:subclass of]* wd:[entity:nonprofit organization] .\nOPTIONAL { ?org wdt:[property:image] ?pic . }\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\"\n}\n}",
    "complexity": "medium"
  },
  {
    "id": "1989",
    "instruction": "List all properties with their corresponding number of constraints.",
    "query": "SELECT ?property ?propertyLabel (COUNT(?constraint) AS ?count) WHERE {\n?property a wikibase:Property.\nOPTIONAL { ?property p:P2302 ?constraint. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?property ?propertyLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?property ?propertyLabel (COUNT(?constraint) AS ?count) WHERE {\n?property a wikibase:Property.\nOPTIONAL { ?property p:[property:property constraint] ?constraint. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?property ?propertyLabel",
    "complexity": "medium"
  },
  {
    "id": "421",
    "instruction": "List all biologists who have Twitter accounts.",
    "query": "SELECT DISTINCT ?person ?personLabel ?twitterName\nWHERE {\n?person wdt:P2002 ?twitterName ;\nwdt:P106 ?occupation .\n?occupation wdt:P279* wd:Q864503 . # all subclasses of biologists\nFILTER NOT EXISTS { ?person wdt:P496 ?orcid }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?person ?personLabel ?twitterName\nWHERE {\n?person wdt:[property:Twitter (X) username] ?twitterName ;\nwdt:[property:occupation] ?occupation .\n?occupation wdt:[property:subclass of]* wd:[entity:biologist] . # all subclasses of biologists\nFILTER NOT EXISTS { ?person wdt:[property:ORCID iD] ?orcid }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "1818",
    "instruction": "What are the names of EDM artists who released albums before 1980?",
    "query": "SELECT ?artistName ?albumTitle ?releaseDate\nWHERE {\n?artist wdt:P136 wd:Q851213 ; # artist has genre of EDM\nrdfs:label ?artistName .\nFILTER ( lang(?artistName) = \"en\" )\n?album wdt:P31 wd:Q482994 .\n?album wdt:P175 ?artist ; # album has performer\nrdfs:label ?albumTitle ;\np:P577 ?releaseDateThing .# release date as (claim about the date?)\n?releaseDateThing ps:P577 ?releaseDate . # release date as ISO 8601\nFILTER (?releaseDate < \"1980-01-01T00:00:00Z\"^^xsd:dateTime)\nFILTER ( lang(?albumTitle) = \"en\" )\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?artistName ?albumTitle ?releaseDate\nWHERE {\n?artist wdt:[property:genre] wd:[entity:electronic dance music] ; # artist has genre of EDM\nrdfs:label ?artistName .\nFILTER ( lang(?artistName) = \"en\" )\n?album wdt:[property:instance of] wd:[entity:album] .\n?album wdt:[property:performer] ?artist ; # album has performer\nrdfs:label ?albumTitle ;\np:[property:publication date] ?releaseDateThing .# release date as (claim about the date?)\n?releaseDateThing ps:[property:publication date] ?releaseDate . # release date as ISO 8601\nFILTER (?releaseDate < \"1980-01-01T00:00:00Z\"^^xsd:dateTime)\nFILTER ( lang(?albumTitle) = \"en\" )\n}",
    "complexity": "medium"
  },
  {
    "id": "2404",
    "instruction": "List all French departments along with their geographical shapes.",
    "query": "SELECT ?itemLabel ?shape (?itemLabel AS ?layer) WHERE {\n?item wdt:P31 wd:Q6465;\nwdt:P3896 ?shape.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?itemLabel ?shape (?itemLabel AS ?layer) WHERE {\n?item wdt:[property:instance of] wd:[entity:department of France];\nwdt:[property:geoshape] ?shape.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "2612",
    "instruction": "Find French public administrations with open data portals and SIREN numbers.",
    "query": "SELECT ?item ?itemLabel ?annuaire_url ?siren\n?portal ?portalLabel ?url WHERE {\n?item wdt:P6671 ?annuaire_id;\nwdt:P8402 ?portal;\nwdt:P1616 ?siren;\nrdfs:label ?itemLabel.\nFILTER((LANG(?itemLabel)) = \"[AUTO_LANGUAGE]\")\n?portal rdfs:label ?portalLabel.\nFILTER((LANG(?portalLabel)) = \"[AUTO_LANGUAGE]\")\n?portal wdt:P856 ?url.\nBIND(IRI(CONCAT('https://lannuaire.service-public.fr/',?annuaire_id)) as ?annuaire_url)\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?item ?itemLabel ?annuaire_url ?siren\n?portal ?portalLabel ?url WHERE {\n?item wdt:[property:French public service directory ID] ?annuaire_id;\nwdt:[property:open data portal] ?portal;\nwdt:[property:SIREN number] ?siren;\nrdfs:label ?itemLabel.\nFILTER((LANG(?itemLabel)) = \"[AUTO_LANGUAGE]\")\n?portal rdfs:label ?portalLabel.\nFILTER((LANG(?portalLabel)) = \"[AUTO_LANGUAGE]\")\n?portal wdt:[property:official website] ?url.\nBIND(IRI(CONCAT('https://lannuaire.service-public.fr/',?annuaire_id)) as ?annuaire_url)\n}",
    "complexity": "medium"
  },
  {
    "id": "1957",
    "instruction": "List all military bases in the United States named after Union soldiers.",
    "query": "SELECT DISTINCT ?base ?baseLabel ?namesake ?namesakeLabel WHERE {\n?base wdt:P31 wd:Q245016.\n?base wdt:P17 wd:Q30.\n?base wdt:P138 ?namesake.\n?namesake wdt:P241 wd:Q1752901.\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" .\n}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?base ?baseLabel ?namesake ?namesakeLabel WHERE {\n?base wdt:[property:instance of] wd:[entity:military base].\n?base wdt:[property:country] wd:[entity:United States of America].\n?base wdt:[property:named after] ?namesake.\n?namesake wdt:[property:military branch] wd:[entity:Union Army].\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" .\n}\n}",
    "complexity": "medium"
  },
  {
    "id": "452",
    "instruction": "How many people are marked as spouses of Madonna?",
    "query": "SELECT (COUNT (DISTINCT ?spouse) AS ?count) WHERE {\n?spouse wdt:P26 wd:Q1744 .\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT (COUNT (DISTINCT ?spouse) AS ?count) WHERE {\n?spouse wdt:[property:spouse] wd:[entity:Madonna] .\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n}",
    "complexity": "medium"
  },
  {
    "id": "66",
    "instruction": "List all UNESCO Biosphere Reserves with a website but no geographical coordinates.",
    "query": "SELECT ?wikidata_item ?biosphere_reserve_name ?biosphereURL\nWHERE {\n?wikidata_item wdt:P2520 ?biosphereURL . # get a list of all biospheres\nFILTER NOT EXISTS { ?wikidata_item wdt:P625 ?location.} # no location\n?wikidata_item rdfs:label ?biosphere_reserve_name filter (lang(?biosphere_reserve_name) = \"en\").\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?wikidata_item ?biosphere_reserve_name ?biosphereURL\nWHERE {\n?wikidata_item wdt:[property:UNESCO Biosphere Reserve URL] ?biosphereURL . # get a list of all biospheres\nFILTER NOT EXISTS { ?wikidata_item wdt:[property:coordinate location] ?location.} # no location\n?wikidata_item rdfs:label ?biosphere_reserve_name filter (lang(?biosphere_reserve_name) = \"en\").\n}",
    "complexity": "medium"
  },
  {
    "id": "959",
    "instruction": "List all U-bahn lines in Berlin with their corresponding colors.",
    "query": "SELECT ?stationLabel ?coord ?layer\nWHERE {\n?station wdt:P81/wdt:P361 wd:Q68646 .\n?station wdt:P625 ?coord.\n?station wdt:P81 ?line.\n?line rdfs:label ?layer. filter(lang(?layer) = 'de')\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"de\" }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?stationLabel ?coord ?layer\nWHERE {\n?station wdt:[property:connecting line]/wdt:[property:part of] wd:[entity:Berlin U-Bahn] .\n?station wdt:[property:coordinate location] ?coord.\n?station wdt:[property:connecting line] ?line.\n?line rdfs:label ?layer. filter(lang(?layer) = 'de')\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"de\" }\n}",
    "complexity": "medium"
  },
  {
    "id": "450",
    "instruction": "What properties are relevant to a specific class and its super-classes?",
    "query": "SELECT ?class ?classname ?property ?propertyname WHERE {\n?tree0 (wdt:P279)* ?class .\nBIND (wd:Q875538 AS ?tree0)\n?class wdt:P1963 ?property .\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n?class rdfs:label ?classname .\n?property rdfs:label ?propertyname .\n}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?class ?classname ?property ?propertyname WHERE {\n?tree0 (wdt:[property:subclass of])* ?class .\nBIND (wd:[entity:public university] AS ?tree0)\n?class wdt:[property:properties for this type] ?property .\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n?class rdfs:label ?classname .\n?property rdfs:label ?propertyname .\n}\n}",
    "complexity": "medium"
  },
  {
    "id": "2057",
    "instruction": "List the birthplaces of football players who have played for Olympique de Marseille.",
    "query": "SELECT ?item ?itemLabel ?nomLabel ?naissanceLabel ?coord ?debut ?fin ?matches WHERE {\n?item wdt:P31 wd:Q5;\nwdt:P106 wd:Q937857.\nOPTIONAL { ?item wdt:P734 ?nom. }\n?item wdt:P19 ?naissance.\n?naissance wdt:P625 ?coord .\n?item p:P54 ?om.\n?om ps:P54 wd:Q132885.\nOPTIONAL { ?om pq:P580 ?debut. }\nOPTIONAL { ?om pq:P582 ?fin. }\nOPTIONAL { ?om pq:P1350 ?matches. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],fr, en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?nomLabel ?naissanceLabel ?coord ?debut ?fin ?matches WHERE {\n?item wdt:[property:instance of] wd:[entity:human];\nwdt:[property:occupation] wd:[entity:association football player].\nOPTIONAL { ?item wdt:[property:family name] ?nom. }\n?item wdt:[property:place of birth] ?naissance.\n?naissance wdt:[property:coordinate location] ?coord .\n?item p:[property:member of sports team] ?om.\n?om ps:[property:member of sports team] wd:[entity:Olympique de Marseille].\nOPTIONAL { ?om pq:[property:start time] ?debut. }\nOPTIONAL { ?om pq:[property:end time] ?fin. }\nOPTIONAL { ?om pq:[property:number of matches played/races/starts] ?matches. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],fr, en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "2035",
    "instruction": "List the most popular Soviet cartoons globally.",
    "query": "SELECT ?item ?itemLabel ?count ?image WHERE {\n?item wikibase:sitelinks ?count.\n?item wdt:P31/wdt:P279* wd:Q202866;\nwdt:P495 wd:Q15180.\n# FILTER (SUBSTR(str(?sitelink), 11, 15) = \".wikipedia.org/\") .\nOPTIONAL {?item wdt:P18 ?image }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"ru\",\"en\" }\n}\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?count ?image WHERE {\n?item wikibase:sitelinks ?count.\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:animated film];\nwdt:[property:country of origin] wd:[entity:Soviet Union].\n# FILTER (SUBSTR(str(?sitelink), 11, 15) = \".wikipedia.org/\") .\nOPTIONAL {?item wdt:[property:image] ?image }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"ru\",\"en\" }\n}\nORDER BY DESC(?count)",
    "complexity": "medium"
  },
  {
    "id": "1498",
    "instruction": "List all moth species native to New Zealand that have images available.",
    "query": "SELECT ?species ?speciesLabel ?image WHERE {\n?species wdt:P31 wd:Q16521; # taxon\nwdt:P171* wd:Q28319; # in the Lepidoptera order\n# wdt:P105/wdt:P361* wd:Q7432; # species or subdivision thereof\nwdt:P183/wdt:P17 wd:Q664; # endemic to New Zealand\nwdt:P18 ?image. # with image\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?species ?speciesLabel ?image WHERE {\n?species wdt:[property:instance of] wd:[entity:taxon]; # taxon\nwdt:[property:country]1* wd:[entity:Lepidoptera]; # in the Lepidoptera order\n# wdt:[property:taxon rank]/wdt:[property:part of]* wd:[entity:species]; # species or subdivision thereof\nwdt:[property:image]3/wdt:[property:country] wd:[entity:New Zealand]; # endemic to New Zealand\nwdt:[property:image] ?image. # with image\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "950",
    "instruction": "List cities that the Trans-Mongolian and Trans-Siberian Railway connect.",
    "query": "SELECT ?city ?cityLabel ?coordinates WHERE {\nVALUES ?highway { wd:Q559037 wd:Q58767 }\n?highway wdt:P2789 ?city .\n?city wdt:P625 ?coordinates .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?city ?cityLabel ?coordinates WHERE {\nVALUES ?highway { wd:[entity:Trans-Mongolian Railway] wd:[entity:Trans-Siberian railway] }\n?highway wdt:[property:connects with] ?city .\n?city wdt:[property:coordinate location] ?coordinates .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "1953",
    "instruction": "List all the alternative names of countries.",
    "query": "SELECT distinct ?country ?countryLabel ?aa WHERE {\n?country p:P31 [ps:P31 wd:Q3624078 ] . # sovereign state\n?country skos:altLabel ?alias .\nbind(str(?alias) as ?aa)\n# filter(lang(?alias)=\"en\")\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\"\n}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX skos: <http://www.w3.org/2004/02/skos/core#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT distinct ?country ?countryLabel ?aa WHERE {\n?country p:[property:instance of] [ps:[property:instance of] wd:[entity:sovereign state] ] . # sovereign state\n?country skos:altLabel ?alias .\nbind(str(?alias) as ?aa)\n# filter(lang(?alias)=\"en\")\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\"\n}\n}",
    "complexity": "medium"
  },
  {
    "id": "286",
    "instruction": "List all items with an inventory number but no collection.",
    "query": "SELECT (COUNT(?obj) AS ?count) WHERE {\n?obj wdt:P217 []\nMINUS {?obj wdt:P195 []}\n}",
    "annotated": "PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT (COUNT(?obj) AS ?count) WHERE {\n?obj wdt:[property:inventory number] []\nMINUS {?obj wdt:[property:collection] []}\n}",
    "complexity": "medium"
  },
  {
    "id": "1620",
    "instruction": "List the types of places where ancient Greek pottery is typically stored.",
    "query": "SELECT ?type ?typeLabel (COUNT(?q) AS ?c) WHERE {\n?q wdt:P31/wdt:P279* wd:Q738680 ; wdt:P276/wdt:P31 ?type .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\". }\n}\nGROUP BY ?type ?typeLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?type ?typeLabel (COUNT(?q) AS ?c) WHERE {\n?q wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:pottery of ancient Greece] ; wdt:[property:location]/wdt:[property:instance of] ?type .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\". }\n}\nGROUP BY ?type ?typeLabel",
    "complexity": "medium"
  },
  {
    "id": "619",
    "instruction": "How many scientists are there by gender?",
    "query": "SELECT ?gender (count(DISTINCT ?human) as ?number)\nWHERE\n{\n?human wdt:P31 wd:Q5\n; wdt:P21 ?gender\n; wdt:P106/wdt:P279* wd:Q901 .\n}\nGROUP BY ?gender\nLIMIT 10",
    "annotated": "PREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?gender (count(DISTINCT ?human) as ?number)\nWHERE\n{\n?human wdt:[property:instance of] wd:[entity:human]\n; wdt:[property:sex or gender] ?gender\n; wdt:[property:occupation]/wdt:[property:subclass of]* wd:[entity:scientist] .\n}\nGROUP BY ?gender\nLIMIT 10",
    "complexity": "medium"
  },
  {
    "id": "1686",
    "instruction": "What are the peniches located in Lyon?",
    "query": "SELECT ?item ?itemLabel ?image WHERE {\n?item wdt:P31/wdt:P279* wd:Q7578326 ; wdt:P131+ wd:Q456 .\nOPTIONAL { ?item wdt:P18 ?image }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],fr\" . }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?image WHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:p\u00e9niche] ; wdt:[property:located in the administrative territorial entity]+ wd:[entity:Lyon] .\nOPTIONAL { ?item wdt:[property:image] ?image }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],fr\" . }\n}",
    "complexity": "medium"
  }
]