[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "1877",
    "instruction": "Show me a TreeMap of the 12 times table.",
    "query": "SELECT ?iaLabel ?a ?ab ?abLabel WITH {\nSELECT ?a ?ia WHERE {\n?ia wdt:P31 wd:Q21199 . # natural number\n?ia wdt:P1181 ?a . # its numeric value\nFILTER (?ia != wd:Q713113 ) # we don't want 0.9999\nFILTER (?a >= 1 && ?a <= 12 ) # between 1 and 12\n} } AS %A\nWITH { SELECT ?b ?ib WHERE {\nINCLUDE %A\nBIND (?a AS ?b)\nBIND (?ia AS ?ib)\n}} AS %B\nWHERE {\nINCLUDE %A\nINCLUDE %B\nBIND (?a * ?b AS ?ab )\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?iaLabel ?a ?ab ?abLabel WITH {\nSELECT ?a ?ia WHERE {\n?ia wdt:[property:instance of] wd:[entity:natural number] . # natural number\n?ia wdt:[property:numeric value] ?a . # its numeric value\nFILTER (?ia != wd:[entity:0.999...] ) # we don't want 0.9999\nFILTER (?a >= 1 && ?a <= 12 ) # between 1 and 12\n} } AS %A\nWITH { SELECT ?b ?ib WHERE {\nINCLUDE %A\nBIND (?a AS ?b)\nBIND (?ia AS ?ib)\n}} AS %B\nWHERE {\nINCLUDE %A\nINCLUDE %B\nBIND (?a * ?b AS ?ab )\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "1623",
    "instruction": "List Wikipedia articles with titles containing a transgender person's former name.",
    "query": "SELECT ?item ?itemLabel ?article ?title WHERE {\n?item wdt:P31 wd:Q5;\n# transgender or non-binary\nwdt:P21/wdt:P279* wd:Q17884;\n# deadnames are any names with an end time qualifier\np:P735 [\nps:P735/wdt:P1705 ?deadname;\npq:P582 ?deadnameEndTime\n].\n# find articles (any project, not just Wikipedias) containing the deadname\n?article schema:about ?item;\nschema:name ?title.\nFILTER(CONTAINS(?title, ?deadname))\n# remove articles that actually use the new name, but it's a variant of the deadname (e. g. Andrej - Andreja) so they contain the deadname as well\nFILTER NOT EXISTS {\n?item p:P735 ?nameStatement.\nMINUS { ?nameStatement pq:P582 ?nameEndTime. }\n?nameStatement ps:P735/wdt:P1705 ?name.\nFILTER(CONTAINS(?name, ?deadname) && CONTAINS(?title, ?name))\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY ?itemLabel ?article",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?article ?title WHERE {\n?item wdt:[property:instance of] wd:[entity:human];\n# transgender or non-binary\nwdt:[property:sex or gender]/wdt:[property:subclass of]* wd:[entity:LGBT];\n# deadnames are any names with an end time qualifier\np:[property:given name] [\nps:[property:given name]/wdt:[property:native label] ?deadname;\npq:[property:end time] ?deadnameEndTime\n].\n# find articles (any project, not just Wikipedias) containing the deadname\n?article schema:about ?item;\nschema:name ?title.\nFILTER(CONTAINS(?title, ?deadname))\n# remove articles that actually use the new name, but it's a variant of the deadname (e. g. Andrej - Andreja) so they contain the deadname as well\nFILTER NOT EXISTS {\n?item p:[property:given name] ?nameStatement.\nMINUS { ?nameStatement pq:[property:end time] ?nameEndTime. }\n?nameStatement ps:[property:given name]/wdt:[property:native label] ?name.\nFILTER(CONTAINS(?name, ?deadname) && CONTAINS(?title, ?name))\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY ?itemLabel ?article",
    "complexity": "complex"
  },
  {
    "id": "2019",
    "instruction": "List all German municipalities with names ending in -in, -ing, or -heim.",
    "query": "select * where {\n{\nselect ?item ?label ?coord (IF(strends(?label,\"ingen\"),\"-ingen\",\nIF(strends(?label,\"ing\"),\"-ing\",\nIF(strends(?label,\"heim\"),\"-heim\",\nIF(strends(?label,\"ein\"),\"\",\nIF(strends(?label,\"ain\"),\"\",\nIF(strends(?label,\"in\"),\"-in\",\"\")))))) AS ?layer) where {\n?item wdt:P31 wd:Q262166 .\n?item wdt:P625 ?coord.\n?item rdfs:label ?label filter(lang(?label)=\"fr\").\n}\n}\nfilter(?layer != \"\")\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nselect * where {\n{\nselect ?item ?label ?coord (IF(strends(?label,\"ingen\"),\"-ingen\",\nIF(strends(?label,\"ing\"),\"-ing\",\nIF(strends(?label,\"heim\"),\"-heim\",\nIF(strends(?label,\"ein\"),\"\",\nIF(strends(?label,\"ain\"),\"\",\nIF(strends(?label,\"in\"),\"-in\",\"\")))))) AS ?layer) where {\n?item wdt:[property:instance of] wd:[entity:municipality in Germany] .\n?item wdt:[property:coordinate location] ?coord.\n?item rdfs:label ?label filter(lang(?label)=\"fr\").\n}\n}\nfilter(?layer != \"\")\n}",
    "complexity": "complex"
  },
  {
    "id": "279",
    "instruction": "List all time periods with their corresponding collection sizes.",
    "query": "SELECT ?period ?periodLabel ?periodDescription (COUNT(?q) AS ?mcount)\nWHERE {\n?q wdt:P2348 ?period.\n?q p:P195 ?s. ?s ps:P195 ?collection . MINUS {?s pq:P582 []}.\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\".\n}\nOPTIONAL{?enwp schema:about ?collection; schema:isPartOf <https://en.wikipedia.org/> }\n}\nGROUP BY ?period ?periodLabel ?periodDescription\nORDER BY DESC(?mcount)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?period ?periodLabel ?periodDescription (COUNT(?q) AS ?mcount)\nWHERE {\n?q wdt:[property:time period] ?period.\n?q p:[property:collection] ?s. ?s ps:[property:collection] ?collection . MINUS {?s pq:[property:end time] []}.\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\".\n}\nOPTIONAL{?enwp schema:about ?collection; schema:isPartOf <https://en.wikipedia.org/> }\n}\nGROUP BY ?period ?periodLabel ?periodDescription\nORDER BY DESC(?mcount)",
    "complexity": "complex"
  },
  {
    "id": "1245",
    "instruction": "List the most cited works written by Swedish authors.",
    "query": "SELECT ?count ?work ?workLabel ?author ?authorLabel\nWITH {\nSELECT ?work ?author (COUNT(?citing_work) AS ?count) WHERE {\n?work p:P50 ?author_statement .\n?author_statement ps:P50 ?author .\n?author_statement pq:P1545 \"1\" .\n?author (wdt:P1416 | wdt:P108 ) / wdt:P17 wd:Q34 .\n?citing_work wdt:P2860 ?work .\n}\nGROUP BY ?work ?author\n} AS %results\nWHERE {\nINCLUDE %results\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?count ?work ?workLabel ?author ?authorLabel\nWITH {\nSELECT ?work ?author (COUNT(?citing_work) AS ?count) WHERE {\n?work p:[property:author] ?author_statement .\n?author_statement ps:[property:author] ?author .\n?author_statement pq:[property:series ordinal] \"1\" .\n?author (wdt:[property:affiliation] | wdt:[property:employer] ) / wdt:[property:country] wd:[entity:Sweden] .\n?citing_work wdt:[property:cites work] ?work .\n}\nGROUP BY ?work ?author\n} AS %results\nWHERE {\nINCLUDE %results\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "1575",
    "instruction": "What is the ratio of forms to lexemes for each language?",
    "query": "SELECT\n(SAMPLE(?number_of_forms) / SAMPLE(?number_of_lexemes) AS ?form_to_lexeme_ratio)\n(SAMPLE(?number_of_lexemes) AS ?number_of_lexemes)\n(SAMPLE(?number_of_forms) AS ?number_of_forms)\n?language ?languageLabel\nWHERE {\n{\nSELECT ?language (COUNT(*) AS ?number_of_lexemes) WHERE {\n[] dct:language ?language .\n}\nGROUP BY ?language\n}\nUNION\n{\nSELECT ?language (COUNT(*) AS ?number_of_forms) WHERE {\n[] ^ontolex:lexicalForm / dct:language ?language .\n}\nGROUP BY ?language\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?language ?languageLabel\nHAVING (?number_of_forms > 1)\nORDER BY DESC(?form_to_lexeme_ratio)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX dct: <http://purl.org/dc/terms/>\nPREFIX ontolex: <http://www.w3.org/ns/lemon/ontolex#>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT\n(SAMPLE(?number_of_forms) / SAMPLE(?number_of_lexemes) AS ?form_to_lexeme_ratio)\n(SAMPLE(?number_of_lexemes) AS ?number_of_lexemes)\n(SAMPLE(?number_of_forms) AS ?number_of_forms)\n?language ?languageLabel\nWHERE {\n{\nSELECT ?language (COUNT(*) AS ?number_of_lexemes) WHERE {\n[] dct:language ?language .\n}\nGROUP BY ?language\n}\nUNION\n{\nSELECT ?language (COUNT(*) AS ?number_of_forms) WHERE {\n[] ^ontolex:lexicalForm / dct:language ?language .\n}\nGROUP BY ?language\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?language ?languageLabel\nHAVING (?number_of_forms > 1)\nORDER BY DESC(?form_to_lexeme_ratio)",
    "complexity": "complex"
  },
  {
    "id": "222",
    "instruction": "Show me a random selection of images from the Aberdeen Archives, Gallery and Museums collection.",
    "query": "SELECT ?item ?itemLabel (SAMPLE(?img) AS ?image) WHERE {\n?item wdt:P195 wd:Q109893034 .\n?item wdt:P18 ?img\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\nBIND(SHA512(CONCAT(STR(RAND()), STR(NOW()), STR(?item))) AS ?random)\n} GROUP BY ?item ?itemLabel\nORDER BY ?random\nLIMIT 20",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel (SAMPLE(?img) AS ?image) WHERE {\n?item wdt:[property:collection] wd:[entity:Aberdeen Archives, Gallery and Museums] .\n?item wdt:[property:image] ?img\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\nBIND(SHA512(CONCAT(STR(RAND()), STR(NOW()), STR(?item))) AS ?random)\n} GROUP BY ?item ?itemLabel\nORDER BY ?random\nLIMIT 20",
    "complexity": "complex"
  },
  {
    "id": "151",
    "instruction": "List the longest chains of doctoral advisors in terms of years.",
    "query": "SELECT DISTINCT ?p1 ?p1Label ?p1birth ?p2 ?p2Label ?p2birth ?diff WHERE {\n?p2 wdt:P184/wdt:P184/wdt:P184/wdt:P184/wdt:P184/wdt:P184/wdt:P184/wdt:P184/wdt:P184+ ?p1;\nwdt:P569 ?p2birth.\n?p1 wdt:P569 ?p1birth.\nBIND(YEAR(?p2birth) - YEAR(?p1birth) AS ?diff)\nFILTER ( ?diff > 700)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} ORDER BY DESC(?diff)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?p1 ?p1Label ?p1birth ?p2 ?p2Label ?p2birth ?diff WHERE {\n?p2 wdt:[property:doctoral advisor]/wdt:[property:doctoral advisor]/wdt:[property:doctoral advisor]/wdt:[property:doctoral advisor]/wdt:[property:doctoral advisor]/wdt:[property:doctoral advisor]/wdt:[property:doctoral advisor]/wdt:[property:doctoral advisor]/wdt:[property:doctoral advisor]+ ?p1;\nwdt:[property:date of birth] ?p2birth.\n?p1 wdt:[property:date of birth] ?p1birth.\nBIND(YEAR(?p2birth) - YEAR(?p1birth) AS ?diff)\nFILTER ( ?diff > 700)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} ORDER BY DESC(?diff)",
    "complexity": "complex"
  },
  {
    "id": "2237",
    "instruction": "What percentage of men and women in Donostialdea are Basque?",
    "query": "SELECT ?_jaiolekuaLabel (COUNT(?_genre) AS ?count) (SAMPLE(?_genreLabel) AS ?label) WHERE {\n?item wdt:P31 wd:Q5;\nwdt:P1412 wd:Q8752;\nwdt:P19 ?_jaiolekua;\nwdt:P21 ?_genre.\n?_jaiolekua wdt:P131* wd:Q2602877.\n?_genre rdfs:label ?_genreLabel.\n?_jaiolekua rdfs:label ?_jaiolekuaLabel.\nFILTER((LANG(?_genreLabel)) = \"eu\")\nFILTER((LANG(?_jaiolekuaLabel)) = \"eu\")\n}\nGROUP BY ?_genreLabel ?_jaiolekuaLabel",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?_jaiolekuaLabel (COUNT(?_genre) AS ?count) (SAMPLE(?_genreLabel) AS ?label) WHERE {\n?item wdt:[property:instance of] wd:[entity:human];\nwdt:[property:languages spoken, written or signed] wd:[entity:Basque];\nwdt:[property:place of birth] ?_jaiolekua;\nwdt:[property:sex or gender] ?_genre.\n?_jaiolekua wdt:[property:located in the administrative territorial entity]* wd:[entity:Donostialdea].\n?_genre rdfs:label ?_genreLabel.\n?_jaiolekua rdfs:label ?_jaiolekuaLabel.\nFILTER((LANG(?_genreLabel)) = \"eu\")\nFILTER((LANG(?_jaiolekuaLabel)) = \"eu\")\n}\nGROUP BY ?_genreLabel ?_jaiolekuaLabel",
    "complexity": "complex"
  },
  {
    "id": "270",
    "instruction": "Find images of a British family sheltering a Christian missionary from the persecution of the Druids.",
    "query": "SELECT ?image ?extlink WHERE {\nwd:Q4656096 wdt:P18 ?image.\nBIND(STRAFTER(STR(?image), \"FilePath/\") AS ?encoded_name)\nBIND(wikibase:decodeUri(?encoded_name) AS ?name)\nOPTIONAL { SERVICE wikibase:mwapi { # External links from each image\nbd:serviceParam wikibase:api \"Generator\";\nwikibase:endpoint \"commons.wikimedia.org\";\nmwapi:generator \"allimages\";\nmwapi:gaifrom ?name;\nmwapi:gaito ?name;\nmwapi:prop \"extlinks\";\nmwapi:ellimit \"500\".\n?extlink wikibase:apiOutput \"extlinks/el/text()\".\n} }\n} ORDER BY ?name",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?image ?extlink WHERE {\nwd:[entity:A Converted British Family Sheltering a Christian Missionary from the Persecution of the Druids] wdt:[property:image] ?image.\nBIND(STRAFTER(STR(?image), \"FilePath/\") AS ?encoded_name)\nBIND(wikibase:decodeUri(?encoded_name) AS ?name)\nOPTIONAL { SERVICE wikibase:mwapi { # External links from each image\nbd:serviceParam wikibase:api \"Generator\";\nwikibase:endpoint \"commons.wikimedia.org\";\nmwapi:generator \"allimages\";\nmwapi:gaifrom ?name;\nmwapi:gaito ?name;\nmwapi:prop \"extlinks\";\nmwapi:ellimit \"500\".\n?extlink wikibase:apiOutput \"extlinks/el/text()\".\n} }\n} ORDER BY ?name",
    "complexity": "complex"
  },
  {
    "id": "2453",
    "instruction": "List all texts on French Wikisource written by authors born in Puy-de-D\u00f4me.",
    "query": "SELECT DISTINCT ?personLabel ?bookLabel ?page WHERE {\n?book wdt:P50 ?person.\n?person wdt:P19 ?place.\n?place wdt:P131+ wd:Q12694.\n?page schema:about ?book .\n?page schema:isPartOf <https://fr.wikisource.org/> .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\". }\n}\nORDER BY ?personLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?personLabel ?bookLabel ?page WHERE {\n?book wdt:[property:author] ?person.\n?person wdt:[property:place of birth] ?place.\n?place wdt:[property:located in the administrative territorial entity]+ wd:[entity:Puy-de-D\u00f4me].\n?page schema:about ?book .\n?page schema:isPartOf <https://fr.wikisource.org/> .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\". }\n}\nORDER BY ?personLabel",
    "complexity": "complex"
  },
  {
    "id": "219",
    "instruction": "List artists with a Benezit or Grove Art online link but no English Wikipedia article.",
    "query": "SELECT DISTINCT ?artist ?artistLabel ?countryLabel ?links ?benezit_id ?grove_id WHERE {\n{ ?artist wdt:P2843 ?benezit_id } UNION { ?artist wdt:P8406 ?grove_id }\n?artist wikibase:sitelinks ?links FILTER (?links > 0).\n?artist wdt:P31 wd:Q5.\n?artist wdt:P27 ?country.\nFILTER NOT EXISTS{?enwp schema:about ?artist; schema:inLanguage \"en\"}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY DESC(?links)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?artist ?artistLabel ?countryLabel ?links ?benezit_id ?grove_id WHERE {\n{ ?artist wdt:[property:Benezit ID] ?benezit_id } UNION { ?artist wdt:[property:Grove Art Online ID] ?grove_id }\n?artist wikibase:sitelinks ?links FILTER (?links > 0).\n?artist wdt:[property:instance of] wd:[entity:human].\n?artist wdt:[property:country of citizenship] ?country.\nFILTER NOT EXISTS{?enwp schema:about ?artist; schema:inLanguage \"en\"}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY DESC(?links)",
    "complexity": "complex"
  },
  {
    "id": "1207",
    "instruction": "List all disease names with their translations in South African languages.",
    "query": "SELECT DISTINCT ?disease ?diseaseLabel ?doid (GROUP_CONCAT(?language) as ?saTranslations ) (COUNT(?language) as ?counts) WHERE {\n# VALUES ?disease {wd:Q79793} #change this for another disease\nVALUES ?country {wd:Q258} #change this to get the offical language of another country\n# Get the official language of South Africa\n?country wdt:P37 ?wdLanguage .\n?wdLanguage wdt:P424 ?languageCode;\nrdfs:label ?language .\nFILTER (LANG(?language)=?languageCode)\nFILTER EXISTS {?wdLanguage wdt:P31?/wdt:P279+ wd:Q17376908}\n# get the item that has a Disease Ontology ID\n?disease wdt:P699 ?doid;\nrdfs:label ?English .\nFILTER (LANG(?English)=\"en\")\n# To extract non existing translation you need to make the language optional\n?disease rdfs:label ?label .\nBIND(LANG(?label) as ?languageCode)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nGROUP BY ?disease ?diseaseLabel ?doid ?saTranslations\nORDER BY DESC(?counts)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?disease ?diseaseLabel ?doid (GROUP_CONCAT(?language) as ?saTranslations ) (COUNT(?language) as ?counts) WHERE {\n# VALUES ?disease {wd:[entity:measles]} #change this for another disease\nVALUES ?country {wd:[entity:South Africa]} #change this to get the offical language of another country\n# Get the official language of South Africa\n?country wdt:[property:official language] ?wdLanguage .\n?wdLanguage wdt:[property:Wikimedia language code] ?languageCode;\nrdfs:label ?language .\nFILTER (LANG(?language)=?languageCode)\nFILTER EXISTS {?wdLanguage wdt:[property:instance of]?/wdt:[property:subclass of]+ wd:[entity:languoid]}\n# get the item that has a Disease Ontology ID\n?disease wdt:[property:Disease Ontology ID] ?doid;\nrdfs:label ?English .\nFILTER (LANG(?English)=\"en\")\n# To extract non existing translation you need to make the language optional\n?disease rdfs:label ?label .\nBIND(LANG(?label) as ?languageCode)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nGROUP BY ?disease ?diseaseLabel ?doid ?saTranslations\nORDER BY DESC(?counts)",
    "complexity": "complex"
  },
  {
    "id": "2346",
    "instruction": "List the causes of death from 2019 to 2021.",
    "query": "SELECT ?p ?ct (COUNT(?i) as ?jumlah) WHERE {\nOPTIONAL { SERVICE wikibase:label { bd:serviceParam wikibase:language \"id\".\n?p rdfs:label ?namap.} }\n?i wdt:P31 wd:Q5;\nwdt:P570 ?dod.\nFILTER(YEAR(?dod)>2018)\n?i wdt:P509 ?p.\nBIND(YEAR(?dod) as ?t)\nBIND(CONCAT(?namap, \" \", STR(?t)) as ?ct)\n}\nGROUP BY ?p ?ct\n#defaultView:BubbleChart",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?p ?ct (COUNT(?i) as ?jumlah) WHERE {\nOPTIONAL { SERVICE wikibase:label { bd:serviceParam wikibase:language \"id\".\n?p rdfs:label ?namap.} }\n?i wdt:[property:instance of] wd:[entity:human];\nwdt:[property:date of death] ?dod.\nFILTER(YEAR(?dod)>2018)\n?i wdt:[property:cause of death] ?p.\nBIND(YEAR(?dod) as ?t)\nBIND(CONCAT(?namap, \" \", STR(?t)) as ?ct)\n}\nGROUP BY ?p ?ct\n#defaultView:BubbleChart",
    "complexity": "complex"
  },
  {
    "id": "1896",
    "instruction": "List all cricketers who have played in the Sheffield Shield and count the number of states they've represented.",
    "query": "SELECT ?PID ?PIDLabel (COUNT(?BBLT) AS ?Count) WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?PID wdt:P106 wd:Q12299841;\nwdt:P54 ?BBLT.\n?BBLT wdt:P118 wd:Q2470981.\n}\nGROUP BY ?PID ?PIDLabel\nORDER BY DESC (?Count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?PID ?PIDLabel (COUNT(?BBLT) AS ?Count) WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?PID wdt:[property:occupation] wd:[entity:cricketer];\nwdt:[property:member of sports team] ?BBLT.\n?BBLT wdt:[property:league] wd:[entity:Sheffield Shield].\n}\nGROUP BY ?PID ?PIDLabel\nORDER BY DESC (?Count)",
    "complexity": "complex"
  },
  {
    "id": "250",
    "instruction": "What items in the Ashmolean Museum are associated with Wang Geyi?",
    "query": "SELECT ?prop ?item ?itemLabel ?inventory (GROUP_CONCAT(?typeLabel; separator=\", \") AS ?types) ?from (YEAR(?latest) AS ?to) ?precision WHERE {\n?item p:P195 [ps:P195 wd:Q636400; pq:P217 ?inventory].\n?item ?prop wd:Q48129717; wdt:P31 ?type.\nOPTIONAL {?item p:P571 [pq:P1319 ?earliest; pq:P1326 ?latest] }\nOPTIONAL {?item p:P571/psv:P571 [ wikibase:timePrecision ?precision; wikibase:timeValue ?year ] }\nBIND(IF (BOUND(?earliest), YEAR(?earliest), YEAR(?year)) AS ?from)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" .\n?item rdfs:label ?itemLabel. ?type rdfs:label ?typeLabel }\n} GROUP BY ?prop ?item ?itemLabel ?inventory ?from ?latest ?precision\nORDER BY DESC(?prop) ?from ?to",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?prop ?item ?itemLabel ?inventory (GROUP_CONCAT(?typeLabel; separator=\", \") AS ?types) ?from (YEAR(?latest) AS ?to) ?precision WHERE {\n?item p:[property:collection] [ps:[property:collection] wd:[entity:Ashmolean Museum]; pq:[property:inventory number] ?inventory].\n?item ?prop wd:[entity:Wang Geyi]; wdt:[property:instance of] ?type.\nOPTIONAL {?item p:[property:inception] [pq:[property:earliest date] ?earliest; pq:[property:latest date] ?latest] }\nOPTIONAL {?item p:[property:inception]/psv:[property:inception] [ wikibase:timePrecision ?precision; wikibase:timeValue ?year ] }\nBIND(IF (BOUND(?earliest), YEAR(?earliest), YEAR(?year)) AS ?from)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" .\n?item rdfs:label ?itemLabel. ?type rdfs:label ?typeLabel }\n} GROUP BY ?prop ?item ?itemLabel ?inventory ?from ?latest ?precision\nORDER BY DESC(?prop) ?from ?to",
    "complexity": "complex"
  },
  {
    "id": "1813",
    "instruction": "List the countries with the most co-authors of a specific researcher identified by their ORCID.",
    "query": "SELECT ?coauthor_countryLabel (COUNT(?author1) AS ?numberOfCoAuthors)\nWITH {\nSELECT (COUNT(?work) AS ?count) ?author1 ?author2 WHERE {\n# Find co-authors\n?searched_author wdt:P496 \"0000-0002-6778-0887\".\n?work wdt:P50 ?searched_author, ?author1, ?author2 .\n}\nGROUP BY ?author1 ?author2\nORDER BY DESC(?count)\n# Limit the size of the graph, to avoid overburdening the browser\nLIMIT 1000\n} AS %authors\nWITH {\nSELECT ?author1 ?author2 ?coauthor_country WHERE {\nINCLUDE %authors\n# Exclude self-links\nFILTER (?author1 != ?author2)\n?author1 wdt:P27 ?coauthor_country.\n}\n} AS %result\nWHERE {\nINCLUDE %result\n# Label the results\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,fr,de,ru,es,zh,jp\". }\n}GROUP BY ?coauthor_countryLabel\nORDER BY DESC(?numberOfCoAuthors)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?coauthor_countryLabel (COUNT(?author1) AS ?numberOfCoAuthors)\nWITH {\nSELECT (COUNT(?work) AS ?count) ?author1 ?author2 WHERE {\n# Find co-authors\n?searched_author wdt:[property:ORCID iD] \"0000-0002-6778-0887\".\n?work wdt:[property:author] ?searched_author, ?author1, ?author2 .\n}\nGROUP BY ?author1 ?author2\nORDER BY DESC(?count)\n# Limit the size of the graph, to avoid overburdening the browser\nLIMIT 1000\n} AS %authors\nWITH {\nSELECT ?author1 ?author2 ?coauthor_country WHERE {\nINCLUDE %authors\n# Exclude self-links\nFILTER (?author1 != ?author2)\n?author1 wdt:[property:country of citizenship] ?coauthor_country.\n}\n} AS %result\nWHERE {\nINCLUDE %result\n# Label the results\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,fr,de,ru,es,zh,jp\". }\n}GROUP BY ?coauthor_countryLabel\nORDER BY DESC(?numberOfCoAuthors)",
    "complexity": "complex"
  },
  {
    "id": "1374",
    "instruction": "List the capital cities that are more than 19,000 km away from each other.",
    "query": "SELECT DISTINCT ?country1Label ?country2Label ?capital1Label ?capital2Label ?distance WHERE {\n?country1 wdt:P31 wd:Q6256 ;\nwdt:P36 ?capital1 .\n?country2 wdt:P31 wd:Q6256 ;\nwdt:P36 ?capital2 .\n?capital1 wdt:P625 ?coords1 .\n?capital2 wdt:P625 ?coords2 .\nBIND(ROUND(geof:distance(?coords1, ?coords2)) AS ?distance) .\nFILTER (?distance>19000)\nFILTER(xsd:string(?capital1) < xsd:string(?capital2))\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n}\nORDER BY DESC(?distance)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?country1Label ?country2Label ?capital1Label ?capital2Label ?distance WHERE {\n?country1 wdt:[property:instance of] wd:[entity:country] ;\nwdt:[property:capital] ?capital1 .\n?country2 wdt:[property:instance of] wd:[entity:country] ;\nwdt:[property:capital] ?capital2 .\n?capital1 wdt:[property:coordinate location] ?coords1 .\n?capital2 wdt:[property:coordinate location] ?coords2 .\nBIND(ROUND(geof:distance(?coords1, ?coords2)) AS ?distance) .\nFILTER (?distance>19000)\nFILTER(xsd:string(?capital1) < xsd:string(?capital2))\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n}\nORDER BY DESC(?distance)",
    "complexity": "complex"
  },
  {
    "id": "1835",
    "instruction": "List the countries of origin for winners of the European Film Award for Best European Film.",
    "query": "SELECT ?countryLabel (STR(YEAR(?date)) AS ?year) ?title WHERE {\n#getting award winners for each year\n?item p:P166 ?st1; wdt:P31 wd:Q11424. ?st1 ps:P166 wd:Q777921; pq:P585 ?date.\n#making sure the statement is sourced with a page from the domain \"www.europeanfilmacademy.org\"\n?st1 prov:wasDerivedFrom ?ref1.\n?ref1 pr:P854 ?url1. FILTER(CONTAINS(STR(?url1), \"www.europeanfilmacademy.org\"))\n#getting country of origin\n?item p:P495 ?st2.\n#making sure the country of origin is sourced with a page from the domain \"www.europeanfilmawards.eu\"\n?st2 ps:P495 ?country; prov:wasDerivedFrom ?ref2.\n?ref2 pr:P854 ?url2. FILTER(CONTAINS(STR(?url2), \"www.europeanfilmawards.eu\"))\n#getting the titles\n?item wdt:P1476 ?orig_title; rdfs:label ?label. FILTER(LANG(?label)=\"en\")\nBIND(IF(LANG(?orig_title) IN (\"en\", \"en-gb\", \"en-us\") || STR(?orig_title)=STR(?label), ?orig_title, CONCAT(?orig_title, \" (\", ?label, \")\")) AS ?title)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nORDER BY ?year ?countryLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX prov: <http://www.w3.org/ns/prov#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX pr: <http://www.wikidata.org/prop/reference/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?countryLabel (STR(YEAR(?date)) AS ?year) ?title WHERE {\n#getting award winners for each year\n?item p:[property:award received] ?st1; wdt:[property:instance of] wd:[entity:film]. ?st1 ps:[property:award received] wd:[entity:European Film Award for Best Film]; pq:[property:point in time] ?date.\n#making sure the statement is sourced with a page from the domain \"www.europeanfilmacademy.org\"\n?st1 prov:wasDerivedFrom ?ref1.\n?ref1 pr:[property:reference URL] ?url1. FILTER(CONTAINS(STR(?url1), \"www.europeanfilmacademy.org\"))\n#getting country of origin\n?item p:[property:country of origin] ?st2.\n#making sure the country of origin is sourced with a page from the domain \"www.europeanfilmawards.eu\"\n?st2 ps:[property:country of origin] ?country; prov:wasDerivedFrom ?ref2.\n?ref2 pr:[property:reference URL] ?url2. FILTER(CONTAINS(STR(?url2), \"www.europeanfilmawards.eu\"))\n#getting the titles\n?item wdt:[property:title] ?orig_title; rdfs:label ?label. FILTER(LANG(?label)=\"en\")\nBIND(IF(LANG(?orig_title) IN (\"en\", \"en-gb\", \"en-us\") || STR(?orig_title)=STR(?label), ?orig_title, CONCAT(?orig_title, \" (\", ?label, \")\")) AS ?title)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nORDER BY ?year ?countryLabel",
    "complexity": "complex"
  }
]