[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "67",
    "instruction": "List all lutenists in chronological order of their birth year.",
    "query": "SELECT ?player ?playerLabel ?article ?birthyear ?placeLabel\nWHERE {\n?player wdt:P1303 wd:Q180733.\nOPTIONAL {?player wdt:P569 ?born}.\nOPTIONAL {?player wdt:P19 ?place}.\nBIND(YEAR(?born) as ?birthyear).\nOPTIONAL{ ?article schema:about ?player. ?article schema:isPartOf <https://en.wikipedia.org/>. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}\nORDER BY ASC(?birthyear)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?player ?playerLabel ?article ?birthyear ?placeLabel\nWHERE {\n?player wdt:[property:instrument] wd:[entity:lute].\nOPTIONAL {?player wdt:[property:date of birth] ?born}.\nOPTIONAL {?player wdt:[property:place of birth] ?place}.\nBIND(YEAR(?born) as ?birthyear).\nOPTIONAL{ ?article schema:about ?player. ?article schema:isPartOf <https://en.wikipedia.org/>. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}\nORDER BY ASC(?birthyear)",
    "complexity": "medium"
  },
  {
    "id": "431",
    "instruction": "What are the values for property P921 of item Q11?",
    "query": "SELECT ?item ?itemLabel ?value ?valueLabel\nWHERE\n{\nVALUES ?item {wd:Q116738730}\n?item p:P921/ps:P921 ?value.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?value ?valueLabel\nWHERE\n{\nVALUES ?item {wd:[entity:Neue Cyclocephalen (Col. Dyn.)]}\n?item p:[property:main subject]/ps:[property:main subject] ?value.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "856",
    "instruction": "What are the most common eye colors?",
    "query": "SELECT ?eyeColorLabel (COUNT(?person) AS ?count)\nWHERE\n{\n?person wdt:P1340 ?eyeColor.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nGROUP BY ?eyeColorLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?eyeColorLabel (COUNT(?person) AS ?count)\nWHERE\n{\n?person wdt:[property:eye color] ?eyeColor.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nGROUP BY ?eyeColorLabel",
    "complexity": "medium"
  },
  {
    "id": "2829",
    "instruction": "List all WorldPride events from 2000 to 2023.",
    "query": "SELECT ?WorldPride ?label ?time ?image WHERE {\n?WorldPride wdt:P31 wd:Q4127414;\nrdfs:label ?label.\n{ ?WorldPride wdt:P585 ?time. }\nUNION\n{ ?WorldPride wdt:P580 ?time. }\nOPTIONAL { ?WorldPride wdt:P18 ?image. }\nFILTER((LANG(?label)) = \"en\")\n}\nLIMIT 20",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?WorldPride ?label ?time ?image WHERE {\n?WorldPride wdt:[property:instance of] wd:[entity:WorldPride];\nrdfs:label ?label.\n{ ?WorldPride wdt:[property:point in time] ?time. }\nUNION\n{ ?WorldPride wdt:[property:start time] ?time. }\nOPTIONAL { ?WorldPride wdt:[property:image] ?image. }\nFILTER((LANG(?label)) = \"en\")\n}\nLIMIT 20",
    "complexity": "medium"
  },
  {
    "id": "2678",
    "instruction": "Show me a list of droughts.",
    "query": "SELECT ?item ?itemLabel ?itemDescription ?instance ?instanceLabel ?date WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\nwd:Q43059 ^(wdt:P279*) ?instance.\n?item wdt:P31 ?instance.\nOPTIONAL { ?instance wdt:P585 ?date. }\n}\nORDER BY DESC(?date)\nLIMIT 1000",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?itemDescription ?instance ?instanceLabel ?date WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\nwd:[entity:drought] ^(wdt:[property:subclass of]*) ?instance.\n?item wdt:[property:instance of] ?instance.\nOPTIONAL { ?instance wdt:[property:point in time] ?date. }\n}\nORDER BY DESC(?date)\nLIMIT 1000",
    "complexity": "medium"
  },
  {
    "id": "1705",
    "instruction": "List the years when Swedish book editions were published.",
    "query": "SELECT DISTINCT ?year (COUNT(?published) AS ?count) WHERE {\n?item wdt:P31 wd:Q3331189;\nwdt:P407 wd:Q9027;\nwdt:P577 ?published.\nFILTER(!(ISBLANK(?published)))\nBIND(STR(YEAR(?published)) AS ?year)\n}\nGROUP BY ?year\nORDER BY (?year)",
    "annotated": "PREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT DISTINCT ?year (COUNT(?published) AS ?count) WHERE {\n?item wdt:[property:instance of] wd:[entity:version, edition or translation];\nwdt:[property:language of work or name] wd:[entity:Swedish];\nwdt:[property:publication date] ?published.\nFILTER(!(ISBLANK(?published)))\nBIND(STR(YEAR(?published)) AS ?year)\n}\nGROUP BY ?year\nORDER BY (?year)",
    "complexity": "medium"
  },
  {
    "id": "1439",
    "instruction": "List the works cited by Egon Willighagen that have authors who are Nobel Prize winners.",
    "query": "SELECT DISTINCT ?cited ?citedLabel ?citedAuthor ?citedAuthorLabel ?award ?awardLabel WHERE {\n?work wdt:P50 wd:Q20895241 ; # replace by the item of another author\nwdt:P2860 ?cited .\n?cited wdt:P50 ?citedAuthor .\n?citedAuthor wdt:P166 ?award .\n?award wdt:P31 wd:Q7191\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?cited ?citedLabel ?citedAuthor ?citedAuthorLabel ?award ?awardLabel WHERE {\n?work wdt:[property:author] wd:[entity:Egon Willighagen] ; # replace by the item of another author\nwdt:[property:cites work] ?cited .\n?cited wdt:[property:author] ?citedAuthor .\n?citedAuthor wdt:[property:award received] ?award .\n?award wdt:[property:instance of] wd:[entity:Nobel Prize]\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "2007",
    "instruction": "List the hometowns of all Buffalo Sabres players.",
    "query": "select ?item ?itemLabel ?coord where {\n?item wdt:P54 wd:Q131206 .\n?item wdt:P19/wdt:P625 ?coord .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"cs,en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nselect ?item ?itemLabel ?coord where {\n?item wdt:[property:member of sports team] wd:[entity:Buffalo Sabres] .\n?item wdt:[property:place of birth]/wdt:[property:coordinate location] ?coord .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"cs,en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "1523",
    "instruction": "Find authors born in a specific location.",
    "query": "SELECT ?person ?personLabel ?placeLabel ?coord ?page WHERE {\n?person wdt:P19 ?place .\n?place wdt:P625 ?coord .\n?page schema:about ?person .\n?page schema:isPartOf <https://fr.wikisource.org/> .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?person ?personLabel ?placeLabel ?coord ?page WHERE {\n?person wdt:[property:place of birth] ?place .\n?place wdt:[property:coordinate location] ?coord .\n?page schema:about ?person .\n?page schema:isPartOf <https://fr.wikisource.org/> .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "101",
    "instruction": "List all things related to phonology.",
    "query": "SELECT DISTINCT ?thing ?name WHERE {\nVALUES ?prop {wdt:P279 wdt:P31}\n?thing ?prop wd:Q40998;\nrdfs:label ?name FILTER (lang(?name)=\"en\") FILTER STRENDS(?name, \" phonology\")\n} ORDER BY ?name",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT DISTINCT ?thing ?name WHERE {\nVALUES ?prop {wdt:[property:subclass of] wdt:[property:instance of]}\n?thing ?prop wd:[entity:phonology];\nrdfs:label ?name FILTER (lang(?name)=\"en\") FILTER STRENDS(?name, \" phonology\")\n} ORDER BY ?name",
    "complexity": "medium"
  },
  {
    "id": "2318",
    "instruction": "Find public bookcases with their coordinates and images.",
    "query": "SELECT ?public_bookcaseLabel ?coordinate_location ?image WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?public_bookcase wdt:P31 wd:Q294297.\nOPTIONAL { ?public_bookcase wdt:P625 ?coordinate_location. }\nOPTIONAL { ?public_bookcase wdt:P18 ?image. }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?public_bookcaseLabel ?coordinate_location ?image WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?public_bookcase wdt:[property:instance of] wd:[entity:public bookcase].\nOPTIONAL { ?public_bookcase wdt:[property:coordinate location] ?coordinate_location. }\nOPTIONAL { ?public_bookcase wdt:[property:image] ?image. }\n}",
    "complexity": "medium"
  },
  {
    "id": "544",
    "instruction": "List all Wikimedia projects with their featured articles.",
    "query": "SELECT ?lang ?name ?itemLabel ?sitelink ?linkcount ?item WHERE {\n?item wikibase:sitelinks ?linkcount.\n?sitelink schema:name ?name;\nschema:inLanguage ?lang;\nschema:about ?item;\n# Sitelink is badged as a Featured Article\nwikibase:badge wd:Q17437796.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?lang ?name ?itemLabel ?sitelink ?linkcount ?item WHERE {\n?item wikibase:sitelinks ?linkcount.\n?sitelink schema:name ?name;\nschema:inLanguage ?lang;\nschema:about ?item;\n# Sitelink is badged as a Featured Article\nwikibase:badge wd:[entity:featured article badge].\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "1999",
    "instruction": "List streets in Aberdeen City named after military leaders from World War 2.",
    "query": "SELECT ?item ?itemLabel ?itemDescription ?subjectLabel ?coords ?image WHERE {\n?item wdt:P31 wd:Q79007 .\n?item wdt:P131 wd:Q62274582 .\n?item wdt:P138 ?subject .\n?subject wdt:P106 wd:Q189290 .\n?subject wdt:P18 ?image .\n?item wdt:P625 ?coords .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?itemDescription ?subjectLabel ?coords ?image WHERE {\n?item wdt:[property:instance of] wd:[entity:street] .\n?item wdt:[property:located in the administrative territorial entity] wd:[entity:Aberdeen City] .\n?item wdt:[property:named after] ?subject .\n?subject wdt:[property:occupation] wd:[entity:military officer] .\n?subject wdt:[property:image] ?image .\n?item wdt:[property:coordinate location] ?coords .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "119",
    "instruction": "Find the list of UK Parliament constituencies on Wikipedia.",
    "query": "SELECT ?con ?conLabel ?loc ?enwp\nWHERE { ?con wdt:P31 wd:Q27971968;\nwdt:P625 ?loc.\nFILTER NOT EXISTS {?con wdt:P576 ?end} # Not abolished\nOPTIONAL{ ?enwp schema:about ?con. ?enwp schema:isPartOf <https://en.wikipedia.org/>}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\"}\n} ORDER BY ?conLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?con ?conLabel ?loc ?enwp\nWHERE { ?con wdt:[property:instance of] wd:[entity:constituency of the House of Commons];\nwdt:[property:coordinate location] ?loc.\nFILTER NOT EXISTS {?con wdt:[property:dissolved, abolished or demolished date] ?end} # Not abolished\nOPTIONAL{ ?enwp schema:about ?con. ?enwp schema:isPartOf <https://en.wikipedia.org/>}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\"}\n} ORDER BY ?conLabel",
    "complexity": "medium"
  },
  {
    "id": "1300",
    "instruction": "List Indian mathematicians along with their birth dates and images.",
    "query": "SELECT DISTINCT ?author ?authorLabel ?image ?date WHERE {\n?author wdt:P106 wd:Q170790 ;\nwdt:P19/wdt:P17 wd:Q668 .\n?author wdt:P569 ?date .\nOPTIONAL {?author wdt:P18 ?image .}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en, it, de, es, fr\" }\n} ORDER BY ?authorLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?author ?authorLabel ?image ?date WHERE {\n?author wdt:[property:occupation] wd:[entity:mathematician] ;\nwdt:[property:place of birth]/wdt:[property:country] wd:[entity:India] .\n?author wdt:[property:date of birth] ?date .\nOPTIONAL {?author wdt:[property:image] ?image .}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en, it, de, es, fr\" }\n} ORDER BY ?authorLabel",
    "complexity": "medium"
  },
  {
    "id": "58",
    "instruction": "Show me a map of museums in the UK with their corresponding websites.",
    "query": "SELECT DISTINCT ?web ?museum ?museumLabel (SAMPLE(?coord) AS ?coord) (SAMPLE(?image) AS ?image)\nWHERE {\n?museum wdt:P31/wdt:P279* wd:Q33506;\nwdt:P17 wd:Q145;\nwdt:P625 ?coord.\nOPTIONAL {?museum wdt:P856 ?web}\nOPTIONAL {?museum wdt:P18 ?image}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} GROUP BY ?web ?museum ?museumLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?web ?museum ?museumLabel (SAMPLE(?coord) AS ?coord) (SAMPLE(?image) AS ?image)\nWHERE {\n?museum wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:museum];\nwdt:[property:country] wd:[entity:United Kingdom];\nwdt:[property:coordinate location] ?coord.\nOPTIONAL {?museum wdt:[property:official website] ?web}\nOPTIONAL {?museum wdt:[property:image] ?image}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} GROUP BY ?web ?museum ?museumLabel",
    "complexity": "medium"
  },
  {
    "id": "2013",
    "instruction": "Find books written by Virginia Woolf and list their settings.",
    "query": "SELECT ?book ?bookLabel ?pubdate ?pubdateLabel ?location ?locationLabel ?coordinates\nWHERE { ?book wdt:P31 wd:Q47461344.\n?book wdt:P50 wd:Q40909.\n?book wdt:P577 ?pubdate.\nOPTIONAL {?book wdt:P840 ?location.\n?location wdt:P625 ?coordinates}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?book ?bookLabel ?pubdate ?pubdateLabel ?location ?locationLabel ?coordinates\nWHERE { ?book wdt:[property:instance of] wd:[entity:written work].\n?book wdt:[property:author] wd:[entity:Virginia Woolf].\n?book wdt:[property:publication date] ?pubdate.\nOPTIONAL {?book wdt:[property:narrative location] ?location.\n?location wdt:[property:coordinate location] ?coordinates}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "2417",
    "instruction": "Find the places where people born in Puy-de-D\u00f4me died.",
    "query": "SELECT ?person ?personLabel ?locLabel ?coord WHERE {\n?person wdt:P19/wdt:P131* wd:Q12694 ;\nwdt:P20 ?loc .\n?loc wdt:P625 ?coord .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?person ?personLabel ?locLabel ?coord WHERE {\n?person wdt:[property:place of birth]/wdt:[property:located in the administrative territorial entity]* wd:[entity:Puy-de-D\u00f4me] ;\nwdt:[property:place of death] ?loc .\n?loc wdt:[property:coordinate location] ?coord .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "625",
    "instruction": "How many scientific statements are supported by a reference with a DOI?",
    "query": "SELECT (COUNT (?statement) as ?statements)\nWHERE\n{\n?entry ?p ?statement .\n?statement prov:wasDerivedFrom/\n<http://www.wikidata.org/prop/reference/P248>/\nwdt:P356 ?doi .\n}",
    "annotated": "PREFIX prov: <http://www.w3.org/ns/prov#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT (COUNT (?statement) as ?statements)\nWHERE\n{\n?entry ?p ?statement .\n?statement prov:wasDerivedFrom/\n<http://www.wikidata.org/prop/reference/P248>/\nwdt:[property:DOI] ?doi .\n}",
    "complexity": "medium"
  },
  {
    "id": "987",
    "instruction": "List all rivers that do not have a specified mouth.",
    "query": "SELECT DISTINCT ?item ?itemLabel WHERE {\n?item wdt:P31/wdt:P279* wd:Q4022 .\nFILTER NOT EXISTS { ?item wdt:P403 ?mouth }\n#SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} ORDER BY ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel WHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:river] .\nFILTER NOT EXISTS { ?item wdt:[property:mouth of the watercourse] ?mouth }\n#SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} ORDER BY ?itemLabel",
    "complexity": "medium"
  },
  {
    "id": "1780",
    "instruction": "List all German plural nouns that end with 'n' but not 'en'.",
    "query": "SELECT DISTINCT ?l ?lemma ?word WHERE {\n?l a ontolex:LexicalEntry ; dct:language wd:Q188 ; wikibase:lemma ?lemma ; ontolex:lexicalForm ?form .\n?form ontolex:representation ?word ; wikibase:grammaticalFeature wd:Q146786 .\nFILTER regex (?word, \"[^e]n$\").\n}",
    "annotated": "PREFIX dct: <http://purl.org/dc/terms/>\nPREFIX ontolex: <http://www.w3.org/ns/lemon/ontolex#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?l ?lemma ?word WHERE {\n?l a ontolex:LexicalEntry ; dct:language wd:[entity:German] ; wikibase:lemma ?lemma ; ontolex:lexicalForm ?form .\n?form ontolex:representation ?word ; wikibase:grammaticalFeature wd:[entity:plural] .\nFILTER regex (?word, \"[^e]n$\").\n}",
    "complexity": "medium"
  },
  {
    "id": "1089",
    "instruction": "List the key people involved in the Soviet space program along with their launch dates.",
    "query": "SELECT DISTINCT ?author ?authorLabel ?image ?date WHERE {\n?author wdt:P137 wd:Q849730 ;\nwdt:P619 ?date .\nOPTIONAL {?author wdt:P18 ?image .}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"de, en, fr\" }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?author ?authorLabel ?image ?date WHERE {\n?author wdt:[property:operator] wd:[entity:Soviet space program] ;\nwdt:[property:UTC date of spacecraft launch] ?date .\nOPTIONAL {?author wdt:[property:image] ?image .}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"de, en, fr\" }\n}",
    "complexity": "medium"
  },
  {
    "id": "521",
    "instruction": "List all properties that have a subproperty.",
    "query": "SELECT ?property2 ?property2Label ?property1 ?property1Label WHERE {\n?property1 rdf:type wikibase:Property. #not replaceable with wikibase:Item, wikibase:Statement, wikibase:Reference at WDQS\n#https://www.mediawiki.org/wiki/Wikibase/Indexing/RDF_Dump_Format#WDQS_data_differences\n?property1 wdt:P1647 ?property2.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?property2 ?property2Label ?property1 ?property1Label WHERE {\n?property1 rdf:type wikibase:Property. #not replaceable with wikibase:Item, wikibase:Statement, wikibase:Reference at WDQS\n#https://www.mediawiki.org/wiki/Wikibase/Indexing/RDF_Dump_Format#WDQS_data_differences\n?property1 wdt:[property:subproperty of] ?property2.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "776",
    "instruction": "List all paintings without specified dimensions.",
    "query": "SELECT ?item WHERE {\n?item wdt:P31 wd:Q3305213 .\nOPTIONAL { ?item wdt:P2049 ?dummy0 }\nFILTER(!bound(?dummy0))\nOPTIONAL { ?item wdt:P2048 ?dummy1 }\nFILTER(!bound(?dummy1))\n}",
    "annotated": "PREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?item WHERE {\n?item wdt:[property:instance of] wd:[entity:painting] .\nOPTIONAL { ?item wdt:[property:width] ?dummy0 }\nFILTER(!bound(?dummy0))\nOPTIONAL { ?item wdt:[property:height] ?dummy1 }\nFILTER(!bound(?dummy1))\n}",
    "complexity": "medium"
  },
  {
    "id": "1753",
    "instruction": "Find the side of the road where cars drive in different countries.",
    "query": "SELECT ?pLabel ?sideLabel ?shape ?rgb WHERE {\nOPTIONAL { ?p wdt:P1622 ?side } # driving side\nOPTIONAL { ?p wdt:P3896 ?shape } # geoshape\nBIND ( COALESCE(\nIF(?side = wd:Q14565199, \"0066B4\", 1/0), # blue\nIF(?side = wd:Q13196750, \"F5831A\", 1/0), # orange\n\"000000\"\n) AS ?rgb )\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?pLabel ?sideLabel ?shape ?rgb WHERE {\nOPTIONAL { ?p wdt:[property:driving side] ?side } # driving side\nOPTIONAL { ?p wdt:[property:geoshape] ?shape } # geoshape\nBIND ( COALESCE(\nIF(?side = wd:[entity:right], \"0066B4\", 1/0), # blue\nIF(?side = wd:[entity:left], \"F5831A\", 1/0), # orange\n\"000000\"\n) AS ?rgb )\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "640",
    "instruction": "List poets who lived during the An Lushan Rebellion.",
    "query": "SELECT ?poet ?poetLabel WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],zh-hant,zh\". }\nwd:Q253774 wdt:P580 ?battleStartTime.\nwd:Q253774 wdt:P582 ?battleEndTime.\n?poet wdt:P106 wd:Q49757.\n?poet wdt:P497 ?cbdbId.\n?poet wdt:P569 ?birthDate.\nFILTER(?birthDate < ?battleStartTime).\n?poet wdt:P570 ?deathDate.\nFILTER(?deathDate > ?battleEndTime).\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?poet ?poetLabel WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],zh-hant,zh\". }\nwd:[entity:An Lushan Rebellion] wdt:[property:start time] ?battleStartTime.\nwd:[entity:An Lushan Rebellion] wdt:[property:end time] ?battleEndTime.\n?poet wdt:[property:occupation] wd:[entity:poet].\n?poet wdt:[property:CBDB ID] ?cbdbId.\n?poet wdt:[property:date of birth] ?birthDate.\nFILTER(?birthDate < ?battleStartTime).\n?poet wdt:[property:date of death] ?deathDate.\nFILTER(?deathDate > ?battleEndTime).\n}",
    "complexity": "medium"
  },
  {
    "id": "1101",
    "instruction": "List all the places mentioned in scientific articles.",
    "query": "SELECT ?topic ?geoloc ?paper WHERE {\n?paper wdt:P921 ?topic;\nwdt:P31 wd:Q13442814 .\n?topic wdt:P625 ?geoloc.\n} GROUP BY ?topic ?geoloc ?paper",
    "annotated": "PREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?topic ?geoloc ?paper WHERE {\n?paper wdt:[property:main subject] ?topic;\nwdt:[property:instance of] wd:[entity:scholarly article] .\n?topic wdt:[property:coordinate location] ?geoloc.\n} GROUP BY ?topic ?geoloc ?paper",
    "complexity": "medium"
  },
  {
    "id": "2756",
    "instruction": "List all national flags that have white and yellow colors.",
    "query": "SELECT ?Nationalflagge ?NationalflaggeLabel ?Bild WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],de\". }\n?Nationalflagge wdt:P31 wd:Q186516.\n?Nationalflagge wdt:P18 ?Bild.\n?Nationalflagge wdt:P462 ?Farbe1.\n?Nationalflagge wdt:P462 ?Farbe2.\n# ?Farbe2 wdt:P279 wd:Q3257809.\n# FILTER (?Farbe1 in (wd:Q3257809)). #Purpur\nFILTER (?Farbe1 in (wd:Q23444)). #Weiss\nFILTER (?Farbe2 in (wd:Q943)). #Gelb\n}\nLIMIT 100",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?Nationalflagge ?NationalflaggeLabel ?Bild WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],de\". }\n?Nationalflagge wdt:[property:instance of] wd:[entity:national flag].\n?Nationalflagge wdt:[property:image] ?Bild.\n?Nationalflagge wdt:[property:color] ?Farbe1.\n?Nationalflagge wdt:[property:color] ?Farbe2.\n# ?Farbe2 wdt:[property:subclass of] wd:[entity:purple].\n# FILTER (?Farbe1 in (wd:[entity:purple])). #Purpur\nFILTER (?Farbe1 in (wd:[entity:white])). #Weiss\nFILTER (?Farbe2 in (wd:[entity:yellow])). #Gelb\n}\nLIMIT 100",
    "complexity": "medium"
  },
  {
    "id": "2726",
    "instruction": "List all bishops from the 17th century who were Anglican priests.",
    "query": "SELECT distinct ?bish ?bishLabel ?dioceseLabel (year(?death) as ?deathYear) ?image\nWHERE {\n?bish wdt:P106 wd:Q42603.\n?bish wdt:P570 ?death.\n?bish wdt:P708 ?diocese.\nOPTIONAL { ?bish wdt:P18 ?image.}\n?diocese wdt:P31 wd:Q18917976 .\nFILTER (?death <= \"1700-01-01T00:00:00Z\"^^xsd:dateTime)\nFILTER (?death >= \"1638-01-01T00:00:00Z\"^^xsd:dateTime)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nGROUP BY ?bish ?bishLabel ?dioceseLabel ?death ?image",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT distinct ?bish ?bishLabel ?dioceseLabel (year(?death) as ?deathYear) ?image\nWHERE {\n?bish wdt:[property:occupation] wd:[entity:priest].\n?bish wdt:[property:date of death] ?death.\n?bish wdt:[property:diocese] ?diocese.\nOPTIONAL { ?bish wdt:[property:image] ?image.}\n?diocese wdt:[property:instance of] wd:[entity:Anglican diocese] .\nFILTER (?death <= \"1700-01-01T00:00:00Z\"^^xsd:dateTime)\nFILTER (?death >= \"1638-01-01T00:00:00Z\"^^xsd:dateTime)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nGROUP BY ?bish ?bishLabel ?dioceseLabel ?death ?image",
    "complexity": "medium"
  },
  {
    "id": "204",
    "instruction": "List all the taxa depicted by Ferdinand Bauer in his artworks.",
    "query": "SELECT DISTINCT ?taxon WHERE {\n?item wdt:P170 wd:Q79012; wdt:P180/wdt:P171* ?taxon.\n?taxon wdt:P31 wd:Q16521\n}",
    "annotated": "PREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT DISTINCT ?taxon WHERE {\n?item wdt:[property:creator] wd:[entity:Ferdinand Bauer]; wdt:[property:depicts]/wdt:[property:parent taxon]* ?taxon.\n?taxon wdt:[property:instance of] wd:[entity:taxon]\n}",
    "complexity": "medium"
  },
  {
    "id": "1384",
    "instruction": "List all plant species with their corresponding emojis.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?itemDescription ?Unicode_character WHERE {\n?item (wdt:P31?/wdt:P279*) wd:Q756.\n?item wdt:P105 wd:Q7432.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n{ ?item wdt:P487 ?Unicode_character. }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?itemDescription ?Unicode_character WHERE {\n?item (wdt:[property:instance of]?/wdt:[property:subclass of]*) wd:[entity:plant].\n?item wdt:[property:taxon rank] wd:[entity:species].\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n{ ?item wdt:[property:Unicode character] ?Unicode_character. }\n}",
    "complexity": "medium"
  }
]