[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "1270",
    "instruction": "List the names of people who received an award on their death day.",
    "query": "SELECT ?person ?personLabel ?dayOfDeath ?awardLabel WHERE {\n?person p:P570/psv:P570 ?dod ;\np:P166 ?aw .\n?aw pqv:P585 ?doa ;\nps:P166 ?award .\n?dod wikibase:timeValue ?dayOfDeath ;\nwikibase:timePrecision ?prec .\n?doa wikibase:timeValue ?dayOfDeath ;\nwikibase:timePrecision ?precA .\nFILTER (?prec >= 11 && ?precA >= 11)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pqv: <http://www.wikidata.org/prop/qualifier/value/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?person ?personLabel ?dayOfDeath ?awardLabel WHERE {\n?person p:[property:date of death]/psv:[property:date of death] ?dod ;\np:[property:award received] ?aw .\n?aw pqv:[property:point in time] ?doa ;\nps:[property:award received] ?award .\n?dod wikibase:timeValue ?dayOfDeath ;\nwikibase:timePrecision ?prec .\n?doa wikibase:timeValue ?dayOfDeath ;\nwikibase:timePrecision ?precA .\nFILTER (?prec >= 11 && ?precA >= 11)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "280",
    "instruction": "What are the different periods in Japanese history?",
    "query": "SELECT ?era ?eraLabel (YEAR(?start_time) AS ?start) (YEAR(?end_time) AS ?end) ?namedLabel ?namedDescription WHERE {\n?era wdt:P31 wd:Q11514315; wdt:P361 wd:Q130436; # eras of the history of Japan\nwdt:P580 ?start_time.\nMINUS {?era wdt:P2348 []}\nOPTIONAL { ?era wdt:P582 ?end_time }\nOPTIONAL { ?era wdt:P138 ?named }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} ORDER BY ?start DESC(?end)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?era ?eraLabel (YEAR(?start_time) AS ?start) (YEAR(?end_time) AS ?end) ?namedLabel ?namedDescription WHERE {\n?era wdt:[property:instance of] wd:[entity:historical period]; wdt:[property:part of] wd:[entity:history of Japan]; # eras of the history of Japan\nwdt:[property:start time] ?start_time.\nMINUS {?era wdt:[property:time period] []}\nOPTIONAL { ?era wdt:[property:end time] ?end_time }\nOPTIONAL { ?era wdt:[property:named after] ?named }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} ORDER BY ?start DESC(?end)",
    "complexity": "complex"
  },
  {
    "id": "1962",
    "instruction": "How many items are there in each ethnic group?",
    "query": "SELECT ?value ?valueLabel ?cnt\n{\n{\nSELECT ?value (COUNT(?value) AS ?cnt)\n{\n?item wdt:P172 ?value\n}\nGROUP BY ?value\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?cnt)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?value ?valueLabel ?cnt\n{\n{\nSELECT ?value (COUNT(?value) AS ?cnt)\n{\n?item wdt:[property:ethnic group] ?value\n}\nGROUP BY ?value\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?cnt)",
    "complexity": "complex"
  },
  {
    "id": "1464",
    "instruction": "List the educational institutions attended by UK Members of Parliament.",
    "query": "SELECT ?institution ?institutionLabel ?count (100*?count/?total AS ?percent) WITH {\nSELECT ?institution (COUNT(DISTINCT ?mp) AS ?count) WHERE {\n?mp wdt:P31 wd:Q5;\np:P39/ps:P39/wdt:P279* wd:Q16707842;\np:P69/ps:P69 ?institution.\n}\nGROUP BY ?institution ?institutionLabel\n} AS %institutions WITH {\nSELECT (COUNT(DISTINCT ?mp) AS ?total) WHERE {\n?mp wdt:P31 wd:Q5;\np:P39/ps:P39/wdt:P279* wd:Q16707842.\n}\n} AS %MPs WHERE {\nINCLUDE %institutions.\nINCLUDE %MPs.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?institution ?institutionLabel ?count (100*?count/?total AS ?percent) WITH {\nSELECT ?institution (COUNT(DISTINCT ?mp) AS ?count) WHERE {\n?mp wdt:[property:instance of] wd:[entity:human];\np:[property:position held]/ps:[property:position held]/wdt:[property:subclass of]* wd:[entity:Member of Parliament];\np:[property:educated at]/ps:[property:educated at] ?institution.\n}\nGROUP BY ?institution ?institutionLabel\n} AS %institutions WITH {\nSELECT (COUNT(DISTINCT ?mp) AS ?total) WHERE {\n?mp wdt:[property:instance of] wd:[entity:human];\np:[property:position held]/ps:[property:position held]/wdt:[property:subclass of]* wd:[entity:Member of Parliament].\n}\n} AS %MPs WHERE {\nINCLUDE %institutions.\nINCLUDE %MPs.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "2399",
    "instruction": "List all railway stations in Denmark along with their opening and closing dates.",
    "query": "SELECT ?station ?stationLabel ?coordinate_location ?start ?end WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"da,en\". }\n?station (wdt:P31/(wdt:P279*)) wd:Q55488;\nwdt:P17 wd:Q35;\nwdt:P625 ?coordinate_location.\nFILTER((BOUND(?start)) || (BOUND(?end)))\nOPTIONAL { ?station wdt:P1619 ?date_of_official_opening. }\nOPTIONAL { ?station wdt:P571 ?inception. }\nOPTIONAL { ?station wdt:P3999 ?closure. }\nOPTIONAL { ?station wdt:P582 ?endtime. }\nBIND(IF(BOUND(?date_of_official_opening), ?date_of_official_opening, ?inception) AS ?start)\nBIND(IF(BOUND(?closure), ?closure, ?endtime) AS ?end)\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?station ?stationLabel ?coordinate_location ?start ?end WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"da,en\". }\n?station (wdt:[property:instance of]/(wdt:[property:subclass of]*)) wd:[entity:railway station];\nwdt:[property:country] wd:[entity:Denmark];\nwdt:[property:coordinate location] ?coordinate_location.\nFILTER((BOUND(?start)) || (BOUND(?end)))\nOPTIONAL { ?station wdt:[property:date of official opening] ?date_of_official_opening. }\nOPTIONAL { ?station wdt:[property:inception] ?inception. }\nOPTIONAL { ?station wdt:[property:date of official closure] ?closure. }\nOPTIONAL { ?station wdt:[property:end time] ?endtime. }\nBIND(IF(BOUND(?date_of_official_opening), ?date_of_official_opening, ?inception) AS ?start)\nBIND(IF(BOUND(?closure), ?closure, ?endtime) AS ?end)\n}",
    "complexity": "complex"
  },
  {
    "id": "72",
    "instruction": "List art venues in the UK excluding pubs.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?url ?coord WHERE {\nVALUES ?type {wd:Q15090615 wd:Q7062022} # Arts venues + not-for-profit arts organisations\n?item (wdt:P31/wdt:P279*) ?type.\n?item wdt:P17 wd:Q145. # in the UK\nMINUS {?item wdt:P31 wd:Q212198} # Exclude pubs\nOPTIONAL{?item wdt:P625 ?itemcoord}\nOPTIONAL {?item wdt:P131/wdt:P625 ?wherecoord}\nOPTIONAL {?item wdt:P856 ?url}\nBIND(IF(BOUND(?itemcoord), ?itemcoord, ?wherecoord) AS ?coord)\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\".\n}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?url ?coord WHERE {\nVALUES ?type {wd:[entity:arts venue] wd:[entity:not-for-profit arts organization]} # Arts venues + not-for-profit arts organisations\n?item (wdt:[property:instance of]/wdt:[property:subclass of]*) ?type.\n?item wdt:[property:country] wd:[entity:United Kingdom]. # in the UK\nMINUS {?item wdt:[property:instance of] wd:[entity:pub]} # Exclude pubs\nOPTIONAL{?item wdt:[property:coordinate location] ?itemcoord}\nOPTIONAL {?item wdt:[property:located in the administrative territorial entity]/wdt:[property:coordinate location] ?wherecoord}\nOPTIONAL {?item wdt:[property:official website] ?url}\nBIND(IF(BOUND(?itemcoord), ?itemcoord, ?wherecoord) AS ?coord)\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\".\n}\n}",
    "complexity": "complex"
  },
  {
    "id": "2253",
    "instruction": "List music releases with incomplete track lists.",
    "query": "select ?release ?title ?listedTracks (sum(?trackAmount) as ?totalTracks) (?totalTracks - ?listedTracks as ?diff) where {\n{\nselect ?release (count(distinct ?track) as ?listedTracks) where {\n{\nselect distinct ?release where {\n?release wdt:P31/wdt:P279* wd:Q2031291.\nfilter exists {\n?release wdt:P2635 [].\n}\n}\n}\n?release wdt:P658 ?track.\n}\ngroup by ?release\n}\n?release p:P2635/ps:P2635 ?trackAmount.\nservice wikibase:label {\nbd:serviceParam wikibase:language \"[AUTO_LANGUAGE]\".\n?release rdfs:label ?title.\n}\n}\ngroup by ?release ?title ?listedTracks\nhaving(?listedTracks != ?totalTracks)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nselect ?release ?title ?listedTracks (sum(?trackAmount) as ?totalTracks) (?totalTracks - ?listedTracks as ?diff) where {\n{\nselect ?release (count(distinct ?track) as ?listedTracks) where {\n{\nselect distinct ?release where {\n?release wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:musical release].\nfilter exists {\n?release wdt:[property:number of parts of this work] [].\n}\n}\n}\n?release wdt:[property:tracklist] ?track.\n}\ngroup by ?release\n}\n?release p:[property:number of parts of this work]/ps:[property:number of parts of this work] ?trackAmount.\nservice wikibase:label {\nbd:serviceParam wikibase:language \"[AUTO_LANGUAGE]\".\n?release rdfs:label ?title.\n}\n}\ngroup by ?release ?title ?listedTracks\nhaving(?listedTracks != ?totalTracks)",
    "complexity": "complex"
  },
  {
    "id": "2022",
    "instruction": "List artists who have recorded songs in multiple languages.",
    "query": "SELECT ?artistLabel ?languages\nWITH {\nSELECT ?song WHERE {\n?song wdt:P31/wdt:P279* wd:Q7366.\n}\n} AS %songs\nWITH {\nSELECT ?artist (COUNT(DISTINCT ?language) AS ?languages)\nWHERE {\nINCLUDE %songs .\n?song wdt:P175 ?artist; wdt:P407 ?language .\n}\nGROUP BY ?artist\nHAVING(?languages > 2)\n} AS %artists\nWHERE {\nINCLUDE %artists\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nORDER BY DESC(?languages)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?artistLabel ?languages\nWITH {\nSELECT ?song WHERE {\n?song wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:song].\n}\n} AS %songs\nWITH {\nSELECT ?artist (COUNT(DISTINCT ?language) AS ?languages)\nWHERE {\nINCLUDE %songs .\n?song wdt:[property:performer] ?artist; wdt:[property:language of work or name] ?language .\n}\nGROUP BY ?artist\nHAVING(?languages > 2)\n} AS %artists\nWHERE {\nINCLUDE %artists\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nORDER BY DESC(?languages)",
    "complexity": "complex"
  },
  {
    "id": "2632",
    "instruction": "List all biennales that don't occur every 2 years.",
    "query": "SELECT ?biennale ?biennaleLabel WHERE {\nSERVICE wikibase:mwapi {\nbd:serviceParam wikibase:endpoint \"www.wikidata.org\";\nwikibase:api \"Search\";\nmwapi:srsearch \"inlabel:biennale@en\";\nmwapi:srlimit \"max\".\n?biennale wikibase:apiOutputItem mwapi:title.\n}\n?biennale p:P2257/psv:P2257 ?interval.\n?interval wikibase:quantityAmount ?intervalAmount;\nwikibase:quantityUnit ?intervalUnit.\nFILTER(!(?intervalAmount = 2 && ?intervalUnit IN (wd:Q577, wd:Q1092296)))\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?biennale ?biennaleLabel WHERE {\nSERVICE wikibase:mwapi {\nbd:serviceParam wikibase:endpoint \"www.wikidata.org\";\nwikibase:api \"Search\";\nmwapi:srsearch \"inlabel:biennale@en\";\nmwapi:srlimit \"max\".\n?biennale wikibase:apiOutputItem mwapi:title.\n}\n?biennale p:[property:event interval]/psv:[property:event interval] ?interval.\n?interval wikibase:quantityAmount ?intervalAmount;\nwikibase:quantityUnit ?intervalUnit.\nFILTER(!(?intervalAmount = 2 && ?intervalUnit IN (wd:[entity:year], wd:[entity:annum])))\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "1639",
    "instruction": "List the UK political parties that have appointed a new leader after a general election since 1945.",
    "query": "select distinct ?item ?itemLabel ?leadership_start_time (MAX(?elec_date) AS ?elec_date) (MIN(?days) AS ?days)\nwith {\nselect ?elec ?elec_date WHERE {\n?elec wdt:P31 wd:Q15283424 .\n?elec wdt:P585 ?elec_date .\n}\n} AS %elections\nwhere {\nhint:Query hint:optimizer \"None\".\n?role wdt:P279? wd:Q1553195 .\n?pos_stmt ps:P39 ?role .\n?pos_stmt pq:P580 ?leadership_start_time .\nFILTER (year(?leadership_start_time) > 1945) .\nMINUS {?role p:P279/pq:P642/wdt:P31 wd:Q848197} .\n?item p:P39 ?pos_stmt .\n?item wdt:P39/wdt:P279 wd:Q16707842 .\nINCLUDE %elections .\nFILTER (?elec_date < ?leadership_start_time).\nBIND ((?leadership_start_time - ?elec_date) AS ?days)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". } .\n} GROUP BY ?item ?itemLabel ?leadership_start_time\nORDER BY DESC(?days)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX hint: <http://www.bigdata.com/queryHints#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nselect distinct ?item ?itemLabel ?leadership_start_time (MAX(?elec_date) AS ?elec_date) (MIN(?days) AS ?days)\nwith {\nselect ?elec ?elec_date WHERE {\n?elec wdt:[property:instance of] wd:[entity:United Kingdom general election] .\n?elec wdt:[property:point in time] ?elec_date .\n}\n} AS %elections\nwhere {\nhint:Query hint:optimizer \"None\".\n?role wdt:[property:subclass of]? wd:[entity:party leader] .\n?pos_stmt ps:[property:position held] ?role .\n?pos_stmt pq:[property:start time] ?leadership_start_time .\nFILTER (year(?leadership_start_time) > 1945) .\nMINUS {?role p:[property:subclass of]/pq:[property:of]/wdt:[property:instance of] wd:[entity:parliamentary group]} .\n?item p:[property:position held] ?pos_stmt .\n?item wdt:[property:position held]/wdt:[property:subclass of] wd:[entity:Member of Parliament] .\nINCLUDE %elections .\nFILTER (?elec_date < ?leadership_start_time).\nBIND ((?leadership_start_time - ?elec_date) AS ?days)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". } .\n} GROUP BY ?item ?itemLabel ?leadership_start_time\nORDER BY DESC(?days)",
    "complexity": "complex"
  },
  {
    "id": "2158",
    "instruction": "Show me a map of gram panchayats in Kerala with literacy rates for 2001.",
    "query": "SELECT ?d ?dLabel ?shape ?litrate ?rgb WHERE {\n?d wdt:P31 wd:Q2732840; p:P6897 ?litratestmt ; wdt:P3896 ?shape.\n?litratestmt ps:P6897 ?litrate ; pq:P585 \"+2001-01-01T00:00:00Z\"^^xsd:dateTime.\nBIND(IF(?litrate < 80, \"00008b\", IF(?litrate < 85, \"006400\", IF(?litrate < 90, \"008000\", IF(?litrate < 95, \"32cd32\", \"7fff00\")))) AS ?rgb)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,ml\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?d ?dLabel ?shape ?litrate ?rgb WHERE {\n?d wdt:[property:instance of] wd:[entity:Gram panchayat]; p:[property:literacy rate] ?litratestmt ; wdt:[property:geoshape] ?shape.\n?litratestmt ps:[property:literacy rate] ?litrate ; pq:[property:point in time] \"+2001-01-01T00:00:00Z\"^^xsd:dateTime.\nBIND(IF(?litrate < 80, \"00008b\", IF(?litrate < 85, \"006400\", IF(?litrate < 90, \"008000\", IF(?litrate < 95, \"32cd32\", \"7fff00\")))) AS ?rgb)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,ml\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "1496",
    "instruction": "What percentage of popes died in Rome?",
    "query": "SELECT (100*SUM(?diedInRome)/COUNT(?pope) AS ?percentDiedInRome) WHERE {\n?pope wdt:P31 wd:Q5;\nwdt:P39 wd:Q19546.\nOPTIONAL {\n?pope wdt:P20/(wdt:P276|wdt:P131|wdt:P501)* wd:Q18288160.\nBIND(1 AS ?diedInRome)\n}\n}",
    "annotated": "PREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT (100*SUM(?diedInRome)/COUNT(?pope) AS ?percentDiedInRome) WHERE {\n?pope wdt:[property:instance of] wd:[entity:human];\nwdt:[property:position held] wd:[entity:pope].\nOPTIONAL {\n?pope wdt:[property:place of death]/(wdt:[property:location]|wdt:[property:located in the administrative territorial entity]|wdt:[property:enclave within])* wd:[entity:Metropolitan City of Rome].\nBIND(1 AS ?diedInRome)\n}\n}",
    "complexity": "complex"
  },
  {
    "id": "614",
    "instruction": "What are the boiling points of different alkanes?",
    "query": "SELECT DISTINCT ?comp ?compLabel ?formula ?bp ?bpUnit ?bpUnitLabel WHERE {\n?comp wdt:P31/wdt:P279* wd:Q41581 ;\nwdt:P274 ?formula ;\np:P2102 [\nps:P2102 ?bp ;\npsv:P2102/wikibase:quantityUnit ?bpUnit\n] .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY DESC(?bpUnit) ASC(?bp)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?comp ?compLabel ?formula ?bp ?bpUnit ?bpUnitLabel WHERE {\n?comp wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:alkane] ;\nwdt:[property:chemical formula] ?formula ;\np:[property:boiling point] [\nps:[property:boiling point] ?bp ;\npsv:[property:boiling point]/wikibase:quantityUnit ?bpUnit\n] .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY DESC(?bpUnit) ASC(?bp)",
    "complexity": "complex"
  },
  {
    "id": "2230",
    "instruction": "What cities in the Czech Republic have the highest number of deaths that are not the birthplace?",
    "query": "SELECT ?misto_narozeni ?misto_umrti ?line WITH {\nSELECT ?item ?misto_narozeni ?misto_umrti where {\n?item wdt:P19/wdt:P17 wd:Q213 .\n?item wdt:P20/wdt:P17 wd:Q213 .\n?item wdt:P19* ?misto_narozeni . ?misto_narozeni wdt:P31 wd:Q5153359 .?misto_narozeni wdt:P1082 ?obyvatele filter(?obyvatele > 2500 ) .\n?item wdt:P20* ?misto_umrti . ?misto_umrti wdt:P31 wd:Q5153359 filter(?misto_narozeni != ?misto_umrti).\n}\n} AS %data WITH {\nSELECT ?misto_narozeni ?misto_umrti (COUNT(?item) AS ?pocet) {\nINCLUDE %data .\n} GROUP BY ?misto_narozeni ?misto_umrti\n} AS %counts WITH {\nSELECT ?misto_narozeni (MAX(?pocet) AS ?nej) {\nINCLUDE %counts .\n} GROUP BY ?misto_narozeni\n} AS %best WHERE {\nINCLUDE %counts .\nINCLUDE %best .\n?misto_narozeni p:P625 [ ps:P625 []; psv:P625 [ wikibase:geoLongitude ?coord1lon; wikibase:geoLatitude ?coord1lat; ] ].\n?misto_umrti p:P625 [ ps:P625 []; psv:P625 [ wikibase:geoLongitude ?coord2lon; wikibase:geoLatitude ?coord2lat; ] ].\nBIND(CONCAT('LINESTRING (', STR(?coord1lon), ' ', STR(?coord1lat), ',', STR(?coord2lon), ' ', STR(?coord2lat), ')') AS ?str) .\nBIND(STRDT(?str, geo:wktLiteral) AS ?line)\nFILTER( ?nej = ?pocet ) .\n} order by asc(?misto_narozeni)",
    "annotated": "PREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?misto_narozeni ?misto_umrti ?line WITH {\nSELECT ?item ?misto_narozeni ?misto_umrti where {\n?item wdt:[property:place of birth]/wdt:[property:country] wd:[entity:Czech Republic] .\n?item wdt:[property:place of death]/wdt:[property:country] wd:[entity:Czech Republic] .\n?item wdt:[property:place of birth]* ?misto_narozeni . ?misto_narozeni wdt:[property:instance of] wd:[entity:municipality of the Czech Republic] .?misto_narozeni wdt:[property:population] ?obyvatele filter(?obyvatele > 2500 ) .\n?item wdt:[property:place of death]* ?misto_umrti . ?misto_umrti wdt:[property:instance of] wd:[entity:municipality of the Czech Republic] filter(?misto_narozeni != ?misto_umrti).\n}\n} AS %data WITH {\nSELECT ?misto_narozeni ?misto_umrti (COUNT(?item) AS ?pocet) {\nINCLUDE %data .\n} GROUP BY ?misto_narozeni ?misto_umrti\n} AS %counts WITH {\nSELECT ?misto_narozeni (MAX(?pocet) AS ?nej) {\nINCLUDE %counts .\n} GROUP BY ?misto_narozeni\n} AS %best WHERE {\nINCLUDE %counts .\nINCLUDE %best .\n?misto_narozeni p:[property:coordinate location] [ ps:[property:coordinate location] []; psv:[property:coordinate location] [ wikibase:geoLongitude ?coord1lon; wikibase:geoLatitude ?coord1lat; ] ].\n?misto_umrti p:[property:coordinate location] [ ps:[property:coordinate location] []; psv:[property:coordinate location] [ wikibase:geoLongitude ?coord2lon; wikibase:geoLatitude ?coord2lat; ] ].\nBIND(CONCAT('LINESTRING (', STR(?coord1lon), ' ', STR(?coord1lat), ',', STR(?coord2lon), ' ', STR(?coord2lat), ')') AS ?str) .\nBIND(STRDT(?str, geo:wktLiteral) AS ?line)\nFILTER( ?nej = ?pocet ) .\n} order by asc(?misto_narozeni)",
    "complexity": "complex"
  },
  {
    "id": "2357",
    "instruction": "List the multiplication table for numbers from 1 to 12.",
    "query": "SELECT ?a $TIMES ?b $EQUALS ?ab WITH {\n# equivalent to VALUES ?a { 1 2 3 4 5 6 7 8 9 10 11 12 }\nSELECT ?a WHERE {\n# we could use numeric literals 0, 1, 12 but why do that when we can get the values from Wikidata items!\nwd:Q199 wdt:P1181 ?one . # 1\nwd:Q36977 wdt:P1181 ?twelve . # 12\nBIND (?one AS ?start )\nBIND (?twelve AS ?end )\nBIND ( (?end - ?start ) + ?one AS ?x )\n[] p:P31 [\nps:P31 wd:Q21199 ;\npq:P155 ?prev\n] .\n?prev wdt:P1181 ?a .\nFILTER (?a >= ?start && ?a <= ?x)\n} ORDER BY ?a\n} AS %a\n# equivalent to VALUES ?b { 1 2 3 4 5 6 7 8 9 10 11 12 }\nWITH { SELECT ?b WHERE {\nINCLUDE %a\nBIND (?a AS ?b)\n}} AS %b\n# this is where the multiplication happens, pairing every digit in a with every digit in b\nWHERE {\nINCLUDE %a\nINCLUDE %b\nBIND (?a * ?b AS ?ab )\nBIND (\"TIMES\" AS $TIMES)\nBIND (\"EQUALS\" AS $EQUALS)\n}\nORDER BY ASC (?b) ASC (?a)",
    "annotated": "PREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?a $TIMES ?b $EQUALS ?ab WITH {\n# equivalent to VALUES ?a { 1 2 3 4 5 6 7 8 9 10 11 12 }\nSELECT ?a WHERE {\n# we could use numeric literals 0, 1, 12 but why do that when we can get the values from Wikidata items!\nwd:[entity:1] wdt:[property:numeric value] ?one . # 1\nwd:[entity:12] wdt:[property:numeric value] ?twelve . # 12\nBIND (?one AS ?start )\nBIND (?twelve AS ?end )\nBIND ( (?end - ?start ) + ?one AS ?x )\n[] p:[property:instance of] [\nps:[property:instance of] wd:[entity:natural number] ;\npq:[property:follows] ?prev\n] .\n?prev wdt:[property:numeric value] ?a .\nFILTER (?a >= ?start && ?a <= ?x)\n} ORDER BY ?a\n} AS %a\n# equivalent to VALUES ?b { 1 2 3 4 5 6 7 8 9 10 11 12 }\nWITH { SELECT ?b WHERE {\nINCLUDE %a\nBIND (?a AS ?b)\n}} AS %b\n# this is where the multiplication happens, pairing every digit in a with every digit in b\nWHERE {\nINCLUDE %a\nINCLUDE %b\nBIND (?a * ?b AS ?ab )\nBIND (\"TIMES\" AS $TIMES)\nBIND (\"EQUALS\" AS $EQUALS)\n}\nORDER BY ASC (?b) ASC (?a)",
    "complexity": "complex"
  },
  {
    "id": "1454",
    "instruction": "List the number of women and Johns in each UK parliament since 1992.",
    "query": "SELECT ?date ?count ?label WITH {\n# all MPs with their associated parliament\nSELECT DISTINCT ?mp ?parliament WHERE {\n?mp wdt:P31 wd:Q5.\n{\n# new data model: position held - Member of the nth Parliament of the United Kingdom\n?mp p:P39/ps:P39 ?position.\n?position wdt:P279 wd:Q16707842;\np:P279/pq:P2937|wdt:P2937 ?parliament.\n} UNION {\n# old data model: member of - nth Parliament of the United Kingdom\n?mp p:P463/ps:P463 ?parliament.\n?parliament wdt:P31 wd:Q21094819.\n}\n}\n} AS %MPsWithParliament WITH {\n# count of Johns in each parliament\nSELECT ?parliament (COUNT(DISTINCT ?mp) AS ?johns) WHERE {\nINCLUDE %MPsWithParliament.\n?mp wdt:P735 wd:Q4925477.\n}\nGROUP BY ?parliament\n} AS %johns WITH {\n# count of women in each parliament\nSELECT ?parliament (COUNT(DISTINCT ?mp) AS ?women) WHERE {\nINCLUDE %MPsWithParliament.\n?mp wdt:P21/wdt:P279* wd:Q6581072. # (P279*: include transgender females - non yet, but will probably happen in the future)\n}\nGROUP BY ?parliament\n} AS %women WHERE {\n# get ?johns and ?women\nINCLUDE %johns.\nINCLUDE %women.\n# fan out single result\n# ?parliament ?johns ?women\n# into two results\n# ?parliament \"Johns\" ?johns\n# ?parliament \"women\" ?women\n# so the line chart works\nVALUES ?label { \"Johns\"@en \"women\"@en }\nBIND(IF(?label = \"Johns\"@en, ?johns, ?women) AS ?count)\n# get parliament date for the chart\n?parliament wdt:P571|wdt:P580 ?date.\n# add labels\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY ?date",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?date ?count ?label WITH {\n# all MPs with their associated parliament\nSELECT DISTINCT ?mp ?parliament WHERE {\n?mp wdt:[property:instance of] wd:[entity:human].\n{\n# new data model: position held - Member of the nth Parliament of the United Kingdom\n?mp p:[property:position held]/ps:[property:position held] ?position.\n?position wdt:[property:subclass of] wd:[entity:Member of Parliament];\np:[property:subclass of]/pq:[property:parliamentary term]|wdt:[property:parliamentary term] ?parliament.\n} UNION {\n# old data model: member of - nth Parliament of the United Kingdom\n?mp p:[property:member of]/ps:[property:member of] ?parliament.\n?parliament wdt:[property:instance of] wd:[entity:parliamentary term in the United Kingdom].\n}\n}\n} AS %MPsWithParliament WITH {\n# count of Johns in each parliament\nSELECT ?parliament (COUNT(DISTINCT ?mp) AS ?johns) WHERE {\nINCLUDE %MPsWithParliament.\n?mp wdt:[property:given name] wd:[entity:John].\n}\nGROUP BY ?parliament\n} AS %johns WITH {\n# count of women in each parliament\nSELECT ?parliament (COUNT(DISTINCT ?mp) AS ?women) WHERE {\nINCLUDE %MPsWithParliament.\n?mp wdt:[property:sex or gender]/wdt:[property:subclass of]* wd:[entity:female]. # ([property:subclass of]*: include transgender females - non yet, but will probably happen in the future)\n}\nGROUP BY ?parliament\n} AS %women WHERE {\n# get ?johns and ?women\nINCLUDE %johns.\nINCLUDE %women.\n# fan out single result\n# ?parliament ?johns ?women\n# into two results\n# ?parliament \"Johns\" ?johns\n# ?parliament \"women\" ?women\n# so the line chart works\nVALUES ?label { \"Johns\"@en \"women\"@en }\nBIND(IF(?label = \"Johns\"@en, ?johns, ?women) AS ?count)\n# get parliament date for the chart\n?parliament wdt:[property:inception]|wdt:[property:start time] ?date.\n# add labels\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY ?date",
    "complexity": "complex"
  }
]