[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "1822",
    "instruction": "Show me a chart of COVID-19 cases and deaths reported by the World Health Organisation.",
    "query": "SELECT ?date ?count ?measureLabel\nWHERE {\nBIND(wd:Q81068910 AS ?outbreak).\n{\nBIND(wd:Q166231 AS ?measure).\n?outbreak p:P1603 ?cases.\n?cases prov:wasDerivedFrom/pr:P248/wdt:P50 wd:Q7817.\n?cases pqv:P585/wikibase:timeValue ?date.\n?cases psv:P1603/wikibase:quantityAmount ?count.\n?cases psv:P1603/wikibase:quantityAmount ?infection_count.\n} UNION {\nBIND(wd:Q4 AS ?measure).\n?outbreak p:P1120 ?deaths.\n?deaths prov:wasDerivedFrom/pr:P248/wdt:P50 wd:Q7817.\n?deaths pqv:P585/wikibase:timeValue ?date.\n?deaths psv:P1120/wikibase:quantityAmount ?count.\n?deaths psv:P1120/wikibase:quantityAmount ?death_count.\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY ASC(?date) DESC(?measure)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX prov: <http://www.w3.org/ns/prov#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pqv: <http://www.wikidata.org/prop/qualifier/value/>\nPREFIX pr: <http://www.wikidata.org/prop/reference/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?date ?count ?measureLabel\nWHERE {\nBIND(wd:[entity:COVID-19 pandemic] AS ?outbreak).\n{\nBIND(wd:[entity:infection] AS ?measure).\n?outbreak p:[property:number of cases] ?cases.\n?cases prov:wasDerivedFrom/pr:[property:stated in]/wdt:[property:author] wd:[entity:World Health Organization].\n?cases pqv:[property:point in time]/wikibase:timeValue ?date.\n?cases psv:[property:number of cases]/wikibase:quantityAmount ?count.\n?cases psv:[property:number of cases]/wikibase:quantityAmount ?infection_count.\n} UNION {\nBIND(wd:[entity:death] AS ?measure).\n?outbreak p:[property:number of deaths] ?deaths.\n?deaths prov:wasDerivedFrom/pr:[property:stated in]/wdt:[property:author] wd:[entity:World Health Organization].\n?deaths pqv:[property:point in time]/wikibase:timeValue ?date.\n?deaths psv:[property:number of deaths]/wikibase:quantityAmount ?count.\n?deaths psv:[property:number of deaths]/wikibase:quantityAmount ?death_count.\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY ASC(?date) DESC(?measure)",
    "complexity": "complex"
  },
  {
    "id": "1199",
    "instruction": "List all statements that are disputed by the person or entity making them.",
    "query": "SELECT ?subject ?subjectLabel ?propertyLabel ?objectLabel WHERE {\n?property a wikibase:Property;\nwikibase:claim ?p;\nwikibase:statementProperty ?ps.\n?subject ?p ?statement.\n?statement ?ps ?object;\npq:P1310 ?subject.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?subject ?subjectLabel ?propertyLabel ?objectLabel WHERE {\n?property a wikibase:Property;\nwikibase:claim ?p;\nwikibase:statementProperty ?ps.\n?subject ?p ?statement.\n?statement ?ps ?object;\npq:[property:statement disputed by] ?subject.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "297",
    "instruction": "What materials are astrolabes typically made of?",
    "query": "SELECT ?materialLabel ?materialDescription (COUNT(?item) AS ?count) WHERE {\n?item wdt:P31/wdt:P361? wd:Q164992.\n?item wdt:P186 ?material\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} GROUP BY ?materialLabel ?materialDescription\nORDER BY DESC(?count) UCASE(?materialLabel)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?materialLabel ?materialDescription (COUNT(?item) AS ?count) WHERE {\n?item wdt:[property:instance of]/wdt:[property:part of]? wd:[entity:astrolabe].\n?item wdt:[property:made from material] ?material\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} GROUP BY ?materialLabel ?materialDescription\nORDER BY DESC(?count) UCASE(?materialLabel)",
    "complexity": "complex"
  },
  {
    "id": "195",
    "instruction": "List artworks created by Ferdinand Bauer that are not part of a publication.",
    "query": "SELECT ?item ?itemLabel ?url WHERE {\n?item wdt:P170 wd:Q79012; wdt:P953 ?url\nMINUS {?item wdt:P1433 [] }\nMINUS {?item wdt:P361 [] }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER by ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?url WHERE {\n?item wdt:[property:creator] wd:[entity:Ferdinand Bauer]; wdt:[property:full work available at URL] ?url\nMINUS {?item wdt:[property:published in] [] }\nMINUS {?item wdt:[property:part of] [] }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER by ?itemLabel",
    "complexity": "complex"
  },
  {
    "id": "2410",
    "instruction": "What is the average number of visitors per year for each museum?",
    "query": "SELECT ?musee ?annee ?visiteurs ?museeLabel WHERE {\n{\nSELECT ?musee ?annee (AVG(?nb) AS ?visiteurs) WHERE {\n{\nSELECT ?musee (STR(YEAR(?date)) AS ?annee) ?nb WHERE {\nVALUES ?musee { wd:Q3330860 wd:Q1495869 wd:Q3329089 }\n?musee p:P1174 ?node.\n?node ps:P1174 ?nb ; pq:P585 ?date.\n}\n}\n}\nGROUP BY ?musee ?annee\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?musee ?annee ?visiteurs ?museeLabel WHERE {\n{\nSELECT ?musee ?annee (AVG(?nb) AS ?visiteurs) WHERE {\n{\nSELECT ?musee (STR(YEAR(?date)) AS ?annee) ?nb WHERE {\nVALUES ?musee { wd:[entity:Mus\u00e9um Henri-Lecoq] wd:[entity:Mus\u00e9e d'Art Roger-Quilliot] wd:[entity:Mus\u00e9e Bargoin] }\n?musee p:[property:visitors per year] ?node.\n?node ps:[property:visitors per year] ?nb ; pq:[property:point in time] ?date.\n}\n}\n}\nGROUP BY ?musee ?annee\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "2793",
    "instruction": "List all mountains in Iceland that do not have a Wikipedia page in Cebuano.",
    "query": "SELECT DISTINCT ?item ?itemLabel WHERE {\n?item wdt:P17 wd:Q189. hint:Prior hint:runFirst true.\n?item p:P31/ps:P31/wdt:P279* wd:Q8502.\nFILTER NOT EXISTS {?article schema:about ?item ;\nschema:isPartOf <https://ceb.wikipedia.org/> .}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE]\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX hint: <http://www.bigdata.com/queryHints#>\nPREFIX schema: <http://schema.org/>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel WHERE {\n?item wdt:[property:country] wd:[entity:Iceland]. hint:Prior hint:runFirst true.\n?item p:[property:instance of]/ps:[property:instance of]/wdt:[property:subclass of]* wd:[entity:mountain].\nFILTER NOT EXISTS {?article schema:about ?item ;\nschema:isPartOf <https://ceb.wikipedia.org/> .}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE]\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "307",
    "instruction": "List all collections in Wikidata that have IIIF links.",
    "query": "SELECT ?collectionLabel (COUNT(?thing) AS ?count) WHERE {\n?thing wdt:P6108 []; wdt:P195 ?collection\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} GROUP BY ?collectionLabel\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?collectionLabel (COUNT(?thing) AS ?count) WHERE {\n?thing wdt:[property:IIIF manifest URL] []; wdt:[property:collection] ?collection\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} GROUP BY ?collectionLabel\nORDER BY DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "2332",
    "instruction": "List Latin American female mathematicians who have articles in languages other than Spanish.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?numLinks ?desc WHERE {\n?item wdt:P31 wd:Q5;\nwdt:P21 wd:Q6581072 ;\nwdt:P106/wdt:P279* wd:Q170790 .\n?item wikibase:sitelinks ?numLinks.\n?item schema:description ?desc .\n?item wdt:P569 ?birth.\n?item wdt:P27 ?nacionalidad .\n?nacionalidad wdt:P17 ?country .\n?country (wdt:P361/(wdt:P361*)) wd:Q12585 .\nFILTER((LANG(?desc)) = \"en\")\nFILTER(?numLinks >= 1)\nMINUS {\n?art schema:about ?item.\n?art schema:isPartOf <https://es.wikipedia.org/>.\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?numLinks)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?numLinks ?desc WHERE {\n?item wdt:[property:instance of] wd:[entity:human];\nwdt:[property:sex or gender] wd:[entity:female] ;\nwdt:[property:occupation]/wdt:[property:subclass of]* wd:[entity:mathematician] .\n?item wikibase:sitelinks ?numLinks.\n?item schema:description ?desc .\n?item wdt:[property:date of birth] ?birth.\n?item wdt:[property:country of citizenship] ?nacionalidad .\n?nacionalidad wdt:[property:country] ?country .\n?country (wdt:[property:part of]/(wdt:[property:part of]*)) wd:[entity:Latin America] .\nFILTER((LANG(?desc)) = \"en\")\nFILTER(?numLinks >= 1)\nMINUS {\n?art schema:about ?item.\n?art schema:isPartOf <https://es.wikipedia.org/>.\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?numLinks)",
    "complexity": "complex"
  },
  {
    "id": "1387",
    "instruction": "List painters with many identifiers on Wikidata but few Wikipedia articles.",
    "query": "SELECT ?item ?name ?idcount ?sitelinks ?rato WHERE {\n?item wdt:P106 wd:Q1028181 .\n?item wdt:P31 wd:Q5 .\n{\n?item wikibase:identifiers ?idcount .\n?item wikibase:sitelinks ?sitelinks .\nFILTER ( ?sitelinks > 0 ) .\nBIND ( xsd:float(?idcount) / xsd:float(?sitelinks) as ?rato)\n} UNION {\n?item wikibase:identifiers ?idcount .\n?item wikibase:sitelinks ?sitelinks .\nFILTER ( ?sitelinks=0 ) .\nBIND ( xsd:float(?idcount) / xsd:float(1) as ?rato)\n}\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n?item rdfs:label ?name .\n}\n}\nORDER BY DESC(?rato )\nLIMIT 500",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?name ?idcount ?sitelinks ?rato WHERE {\n?item wdt:[property:occupation] wd:[entity:painter] .\n?item wdt:[property:instance of] wd:[entity:human] .\n{\n?item wikibase:identifiers ?idcount .\n?item wikibase:sitelinks ?sitelinks .\nFILTER ( ?sitelinks > 0 ) .\nBIND ( xsd:float(?idcount) / xsd:float(?sitelinks) as ?rato)\n} UNION {\n?item wikibase:identifiers ?idcount .\n?item wikibase:sitelinks ?sitelinks .\nFILTER ( ?sitelinks=0 ) .\nBIND ( xsd:float(?idcount) / xsd:float(1) as ?rato)\n}\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n?item rdfs:label ?name .\n}\n}\nORDER BY DESC(?rato )\nLIMIT 500",
    "complexity": "complex"
  },
  {
    "id": "1336",
    "instruction": "List all properties related to items with 'feminist art' as a value.",
    "query": "SELECT DISTINCT ?property ?propertyLabel ?item ?itemLabel WHERE {\n?item ?p wd:Q1246516 .\nFILTER NOT EXISTS { ?item a ?type . }\n?property ?ref ?p .\n?property a wikibase:Property .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} ORDER BY ?property ?item",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?property ?propertyLabel ?item ?itemLabel WHERE {\n?item ?p wd:[entity:feminist art] .\nFILTER NOT EXISTS { ?item a ?type . }\n?property ?ref ?p .\n?property a wikibase:Property .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} ORDER BY ?property ?item",
    "complexity": "complex"
  },
  {
    "id": "2522",
    "instruction": "What are the places in Hautes-Alpes with Wikipedia articles in at least 10 languages?",
    "query": "SELECT ?item ?itemLabel (count(distinct ?article) as ?count) ?coords ?image WITH\n{\nSELECT ?item WHERE {\n?item wdt:P131* wd:Q12709 .\nFILTER NOT EXISTS { ?item wdt:P31/wdt:P279* wd:Q1496967 }\nFILTER NOT EXISTS { ?item wdt:P31/wdt:P279* wd:Q2385804 }\nFILTER NOT EXISTS { ?item wdt:P31/wdt:P279* wd:Q271669 }\nFILTER NOT EXISTS { ?item wdt:P31/wdt:P279* wd:Q35145263 }\nFILTER NOT EXISTS { ?item wdt:P31/wdt:P279* wd:Q728937 }\nFILTER NOT EXISTS { ?item wdt:P31/wdt:P279* wd:Q12819564 }\nFILTER NOT EXISTS { ?item wdt:P31/wdt:P279* wd:Q1292279 }\n#FILTER NOT EXISTS { ?item wdt:P31/wdt:P279* wd:Q27096213 }\nFILTER NOT EXISTS { ?item wdt:P31/wdt:P279* wd:Q83620 }\n}\n} AS %i\nWHERE\n{\nINCLUDE %i .\n?item wdt:P625 ?coords .\nOPTIONAL { ?item wdt:P18 ?image }\n?article schema:about ?item\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?item ?itemLabel ?coords ?image\nHAVING (?count >= 10)\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel (count(distinct ?article) as ?count) ?coords ?image WITH\n{\nSELECT ?item WHERE {\n?item wdt:[property:located in the administrative territorial entity]* wd:[entity:Pyr\u00e9n\u00e9es-Orientales] .\nFILTER NOT EXISTS { ?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:Q1496967 }\nFILTER NOT EXISTS { ?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:educational institution] }\nFILTER NOT EXISTS { ?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:landform] }\nFILTER NOT EXISTS { ?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:natural geographic object] }\nFILTER NOT EXISTS { ?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:railway line] }\nFILTER NOT EXISTS { ?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:station] }\nFILTER NOT EXISTS { ?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:political border] }\n#FILTER NOT EXISTS { ?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:geographic entity] }\nFILTER NOT EXISTS { ?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:thoroughfare] }\n}\n} AS %i\nWHERE\n{\nINCLUDE %i .\n?item wdt:[property:coordinate location] ?coords .\nOPTIONAL { ?item wdt:[property:image] ?image }\n?article schema:about ?item\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?item ?itemLabel ?coords ?image\nHAVING (?count >= 10)\nORDER BY DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "1598",
    "instruction": "Show me a list of notable libraries with their images.",
    "query": "SELECT DISTINCT ?library ?libraryLabel (SAMPLE(?image) AS ?image) ?sitelinks WHERE {\n?library wdt:P31/wdt:P279* wd:Q7075 . # libraries or subtypes\nMINUS {?library wdt:P31/wdt:P279* wd:Q212805} # but not digital libraries\n?library wikibase:sitelinks ?sitelinks.\nOPTIONAL {?library wdt:P18 ?img}\nBIND (IF(BOUND(?img), ?img, <http://commons.wikimedia.org/wiki/Special:FilePath/No%20image%20available.svg>) AS ?image)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} GROUP BY ?library ?libraryLabel ?sitelinks\nORDER BY DESC(?sitelinks)\nLIMIT 1000",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?library ?libraryLabel (SAMPLE(?image) AS ?image) ?sitelinks WHERE {\n?library wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:library] . # libraries or subtypes\nMINUS {?library wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:digital library]} # but not digital libraries\n?library wikibase:sitelinks ?sitelinks.\nOPTIONAL {?library wdt:[property:image] ?img}\nBIND (IF(BOUND(?img), ?img, <http://commons.wikimedia.org/wiki/Special:FilePath/No%20image%20available.svg>) AS ?image)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} GROUP BY ?library ?libraryLabel ?sitelinks\nORDER BY DESC(?sitelinks)\nLIMIT 1000",
    "complexity": "complex"
  },
  {
    "id": "2512",
    "instruction": "Find nearby restaurants and cafes within a 1.5-mile radius.",
    "query": "SELECT ?place ?placeLabel ?location WHERE {\nSERVICE wikibase:around {\n?place wdt:P625 ?location.\nbd:serviceParam wikibase:center \"[AUTO_COORDINATES]\" ;\nwikibase:radius \"1.5\";\nwikibase:distance ?dist.\n}\n?place wdt:P31/wdt:P279* wd:Q88985865\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?place ?placeLabel ?location WHERE {\nSERVICE wikibase:around {\n?place wdt:[property:coordinate location] ?location.\nbd:serviceParam wikibase:center \"[AUTO_COORDINATES]\" ;\nwikibase:radius \"1.5\";\nwikibase:distance ?dist.\n}\n?place wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:eating or drinking establishment]\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "2703",
    "instruction": "List all rivers in France that are longer than 50 km, grouped by their watershed.",
    "query": "SELECT DISTINCT ?river ?riverLabel ?length ?shape ?layer WHERE {\n{\nSELECT DISTINCT ?river ?riverLabel ?basinNameLabel ?length WHERE {\n?river wdt:P17 wd:Q142 ;\nwdt:P2043 ?l .\nBIND (ROUND(?l) AS ?length)\nFILTER( ?length >= 50 )\nVALUES ?type { wd:Q573344 wd:Q355304 wd:Q4022 wd:Q3073652 }\n?river wdt:P31 ?type .\n?river wdt:P4614+ ?basin .\n?basin wdt:P138 ?basinName .\nFILTER NOT EXISTS { ?basinName wdt:P403/wdt:P31 wd:Q573344 }\nFILTER NOT EXISTS { ?basinName wdt:P403/wdt:P31 wd:Q4022 }\nFILTER NOT EXISTS { ?basinName wdt:P31 wd:Q165 }\nFILTER NOT EXISTS { ?basinName wdt:P31 wd:Q9430 }\nFILTER NOT EXISTS { ?basinName wdt:P31 wd:Q39594 }\nFILTER NOT EXISTS { ?basinName wdt:P31 wd:Q1973404 }\nFILTER NOT EXISTS { ?basin wdt:P31 wd:Q82794 }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\n}\nOPTIONAL { ?river wdt:P3896 ?shape }\nBIND(?basinNameLabel AS ?layer)\n}\nORDER BY REPLACE(REPLACE(LCASE(?basinNameLabel), \"e\", \"e\"), \"e\", \"e\") ?riverLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?river ?riverLabel ?length ?shape ?layer WHERE {\n{\nSELECT DISTINCT ?river ?riverLabel ?basinNameLabel ?length WHERE {\n?river wdt:[property:country] wd:[entity:France] ;\nwdt:[property:length] ?l .\nBIND (ROUND(?l) AS ?length)\nFILTER( ?length >= 50 )\nVALUES ?type { wd:[entity:main stream] wd:[entity:watercourse] wd:[entity:river] wd:[entity:coastal river] }\n?river wdt:[property:instance of] ?type .\n?river wdt:[property:drainage basin]+ ?basin .\n?basin wdt:[property:named after] ?basinName .\nFILTER NOT EXISTS { ?basinName wdt:[property:mouth of the watercourse]/wdt:[property:instance of] wd:[entity:main stream] }\nFILTER NOT EXISTS { ?basinName wdt:[property:mouth of the watercourse]/wdt:[property:instance of] wd:[entity:river] }\nFILTER NOT EXISTS { ?basinName wdt:[property:instance of] wd:[entity:sea] }\nFILTER NOT EXISTS { ?basinName wdt:[property:instance of] wd:[entity:ocean] }\nFILTER NOT EXISTS { ?basinName wdt:[property:instance of] wd:[entity:bay] }\nFILTER NOT EXISTS { ?basinName wdt:[property:instance of] wd:[entity:adjacent sea] }\nFILTER NOT EXISTS { ?basin wdt:[property:instance of] wd:[entity:geographic region] }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\n}\nOPTIONAL { ?river wdt:[property:geoshape] ?shape }\nBIND(?basinNameLabel AS ?layer)\n}\nORDER BY REPLACE(REPLACE(LCASE(?basinNameLabel), \"e\", \"e\"), \"e\", \"e\") ?riverLabel",
    "complexity": "complex"
  },
  {
    "id": "122",
    "instruction": "What other jobs have British MPs held apart from being a politician?",
    "query": "SELECT (COUNT(DISTINCT ?mp) as ?mps) ?job ?jobLabel\nWHERE {\n?mp wdt:P31 wd:Q5; wdt:P39/wdt:P279? wd:Q16707842;\nwdt:P106 ?job.\nFILTER (?job not in (wd:Q82955, wd:Q486839) )\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} GROUP BY ?job ?jobLabel\nORDER BY DESC(?mps)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT (COUNT(DISTINCT ?mp) as ?mps) ?job ?jobLabel\nWHERE {\n?mp wdt:[property:instance of] wd:[entity:human]; wdt:[property:position held]/wdt:[property:subclass of]? wd:[entity:Member of Parliament];\nwdt:[property:occupation] ?job.\nFILTER (?job not in (wd:[entity:politician], wd:[entity:member of parliament]) )\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} GROUP BY ?job ?jobLabel\nORDER BY DESC(?mps)",
    "complexity": "complex"
  },
  {
    "id": "615",
    "instruction": "List the chemicals with their solubility values and units.",
    "query": "SELECT DISTINCT ?chemical ?chemicalLabel ?value ?units ?unitsLabel ?solvent ?solventLabel ?temperature ?temperatureUnit ?temperatureUnitLabel ?source ?sourceLabel ?doi\nWITH {\nSELECT DISTINCT ?chemical ?value ?units ?source ?doi ?solvent ?temperature ?temperatureUnit WHERE {\n?chemical ?propp ?statement .\n?statement a wikibase:BestRank ;\n?proppsv [\nwikibase:quantityAmount ?value ;\nwikibase:quantityUnit ?units\n] .\nOPTIONAL {\n?statement prov:wasDerivedFrom/pr:P248 ?source .\nOPTIONAL { ?source wdt:P356 ?doi . }\n}\n?property wikibase:claim ?propp ;\nwikibase:statementValue ?proppsv ;\nwdt:P1629 wd:Q170731 ;\nwdt:P31 wd:Q21077852 .\nOPTIONAL {\n?statement pqv:P2076 ?temperatureNode .\n?temperatureNode wikibase:quantityAmount ?temperature ;\nwikibase:quantityUnit ?temperatureUnit .\n}\nOPTIONAL {\nwd:P2178 wikibase:qualifier ?qualifierS .\n?qualifierS a owl:ObjectProperty .\n?statement ?qualifierS ?solvent .\n}\n} GROUP BY ?chemical ?value ?units ?temperature ?temperatureUnit ?solvent ?source ?doi\n} AS %result\nWHERE {\nINCLUDE %result\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY ASC(?propEntityLabel)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX owl: <http://www.w3.org/2002/07/owl#>\nPREFIX prov: <http://www.w3.org/ns/prov#>\nPREFIX pqv: <http://www.wikidata.org/prop/qualifier/value/>\nPREFIX pr: <http://www.wikidata.org/prop/reference/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?chemical ?chemicalLabel ?value ?units ?unitsLabel ?solvent ?solventLabel ?temperature ?temperatureUnit ?temperatureUnitLabel ?source ?sourceLabel ?doi\nWITH {\nSELECT DISTINCT ?chemical ?value ?units ?source ?doi ?solvent ?temperature ?temperatureUnit WHERE {\n?chemical ?propp ?statement .\n?statement a wikibase:BestRank ;\n?proppsv [\nwikibase:quantityAmount ?value ;\nwikibase:quantityUnit ?units\n] .\nOPTIONAL {\n?statement prov:wasDerivedFrom/pr:[property:stated in] ?source .\nOPTIONAL { ?source wdt:[property:DOI] ?doi . }\n}\n?property wikibase:claim ?propp ;\nwikibase:statementValue ?proppsv ;\nwdt:[property:Wikidata item of this property] wd:[entity:solubility] ;\nwdt:[property:instance of] wd:[entity:Wikidata property for physical quantities] .\nOPTIONAL {\n?statement pqv:[property:temperature] ?temperatureNode .\n?temperatureNode wikibase:quantityAmount ?temperature ;\nwikibase:quantityUnit ?temperatureUnit .\n}\nOPTIONAL {\nwd:[property:solvent] wikibase:qualifier ?qualifierS .\n?qualifierS a owl:ObjectProperty .\n?statement ?qualifierS ?solvent .\n}\n} GROUP BY ?chemical ?value ?units ?temperature ?temperatureUnit ?solvent ?source ?doi\n} AS %result\nWHERE {\nINCLUDE %result\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY ASC(?propEntityLabel)",
    "complexity": "complex"
  },
  {
    "id": "253",
    "instruction": "What are the top 10 nearest places to Ashmolean Museum?",
    "query": "SELECT DISTINCT (SUBSTR(STR(?place),32) as ?link) ?placeLabel\nWHERE {\nwd:Q1191 wdt:P625 ?loc2. #Starting point\n{ SELECT DISTINCT ?place ?coords WHERE\n{?item wdt:P195 wd:Q636400;\nwdt:P973 ?url FILTER (STRSTARTS(STR(?url),\"http://jameelcentre\") ).\nVALUES ?property {wd:P180 wd:P1071}\n?property wikibase:directClaim ?prop.\n?item ?prop ?place.\n?place wdt:P625 ?coords\n} }\nBIND(geof:distance(?coords, ?loc2) AS ?distNum).\nSERVICE wikibase:label {bd:serviceParam wikibase:language \"en\".\n?place rdfs:label ?placeLabel}\n} ORDER BY ?distNum OFFSET 1 LIMIT 10",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT (SUBSTR(STR(?place),32) as ?link) ?placeLabel\nWHERE {\nwd:[entity:Maharashtra] wdt:[property:coordinate location] ?loc2. #Starting point\n{ SELECT DISTINCT ?place ?coords WHERE\n{?item wdt:[property:collection] wd:[entity:Ashmolean Museum];\nwdt:[property:described at URL] ?url FILTER (STRSTARTS(STR(?url),\"http://jameelcentre\") ).\nVALUES ?property {wd:[property:depicts] wd:[property:location of creation]}\n?property wikibase:directClaim ?prop.\n?item ?prop ?place.\n?place wdt:[property:coordinate location] ?coords\n} }\nBIND(geof:distance(?coords, ?loc2) AS ?distNum).\nSERVICE wikibase:label {bd:serviceParam wikibase:language \"en\".\n?place rdfs:label ?placeLabel}\n} ORDER BY ?distNum OFFSET 1 LIMIT 10",
    "complexity": "complex"
  },
  {
    "id": "1500",
    "instruction": "List all paintings in the Louvre Museum without images on Wikidata.",
    "query": "select DISTINCT ?urlatlas ?item ?itemLabel ?lieuLabel ?dateconsult\nwhere {\n?item wdt:P195/wdt:P361* wd:Q3044768.\n?item (wdt:P276|wdt:P361)/(wdt:P276*|wdt:P361*) wd:Q1075988.\nMINUS{?item wdt:P276 wd:Q1075988.}\nMINUS{?item wdt:P276 wd:Q40091273.}\nMINUS{?item wdt:P276 wd:Q19675. }\n?item wdt:P276 ?lieu.\nOPTIONAL{\n?item p:P276 ?declarationloc.\n?declarationloc prov:wasDerivedFrom ?ref.\n?ref pr:P854 ?URLref.\nFILTER regex(str(?URLref), \"cartelfr.louvre\")\n?ref pr:P813 ?dateconsult .\n}\nMINUS{?item wdt:P18 ?img.}\nOPTIONAL{\n?item wdt:P1212 ?IDatlas .\nwd:P1212 wdt:P1630 ?formatterurl .\nBIND(IRI(REPLACE(?IDatlas, '^(.+)$', ?formatterurl)) AS ?urlatlas)\n}\nSERVICE wikibase:label {bd:serviceParam wikibase:language \"fr\"}\n}ORDER BY ?LieuLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX prov: <http://www.w3.org/ns/prov#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pr: <http://www.wikidata.org/prop/reference/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nselect DISTINCT ?urlatlas ?item ?itemLabel ?lieuLabel ?dateconsult\nwhere {\n?item wdt:[property:collection]/wdt:[property:part of]* wd:[entity:Department of Paintings of the Louvre].\n?item (wdt:[property:location]|wdt:[property:part of])/(wdt:[property:location]*|wdt:[property:part of]*) wd:[entity:Louvre Palace].\nMINUS{?item wdt:[property:location] wd:[entity:Louvre Palace].}\nMINUS{?item wdt:[property:location] wd:[entity:in Painting's depot of the Mus\u00e9e du Louvre or in temporary movement].}\nMINUS{?item wdt:[property:location] wd:[entity:Louvre Museum]. }\n?item wdt:[property:location] ?lieu.\nOPTIONAL{\n?item p:[property:location] ?declarationloc.\n?declarationloc prov:wasDerivedFrom ?ref.\n?ref pr:[property:reference URL] ?URLref.\nFILTER regex(str(?URLref), \"cartelfr.louvre\")\n?ref pr:[property:retrieved] ?dateconsult .\n}\nMINUS{?item wdt:[property:image] ?img.}\nOPTIONAL{\n?item wdt:[property:Atlas ID] ?IDatlas .\nwd:[property:Atlas ID] wdt:[property:formatter URL] ?formatterurl .\nBIND(IRI(REPLACE(?IDatlas, '^(.+)$', ?formatterurl)) AS ?urlatlas)\n}\nSERVICE wikibase:label {bd:serviceParam wikibase:language \"fr\"}\n}ORDER BY ?LieuLabel",
    "complexity": "complex"
  }
]