[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "1757",
    "instruction": "List all the chateaux in the Loire Valley between Sully-sur-Loire and Chalonnes.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?communeLabel ?coords ?image WHERE {\nwd:Q2789507 wdt:P527 ?commune .\n?item wdt:P31/wdt:P279* wd:Q751876 ;\nwdt:P131 ?commune .\nOPTIONAL { ?item wdt:P625 ?coords }\nOPTIONAL { ?item wdt:P18 ?image }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY ?communeLabel ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?communeLabel ?coords ?image WHERE {\nwd:[entity:The Loire Valley between Sully-sur-Loire and Chalonnes] wdt:[property:has part(s)] ?commune .\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:ch\u00e2teau] ;\nwdt:[property:located in the administrative territorial entity] ?commune .\nOPTIONAL { ?item wdt:[property:coordinate location] ?coords }\nOPTIONAL { ?item wdt:[property:image] ?image }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY ?communeLabel ?itemLabel",
    "complexity": "medium"
  },
  {
    "id": "1449",
    "instruction": "List surnames with similar phonetics to Muller.",
    "query": "SELECT ?item ?itemLabel WHERE {\nBIND(wd:Q28800754 AS ?surname)\n?surname wdt:P3879 ?cologne.\n?surname wdt:P3880 ?caverphone.\n?surname wdt:P3878 ?soundex.\n?item wdt:P31 wd:Q101352.\n?item wdt:P3879 ?cologne.\n?item wdt:P3880 ?caverphone.\n?item wdt:P3878 ?soundex.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\nFILTER(?item != ?surname)\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel WHERE {\nBIND(wd:[entity:Muller] AS ?surname)\n?surname wdt:[property:Cologne phonetics] ?cologne.\n?surname wdt:[property:Caverphone] ?caverphone.\n?surname wdt:[property:Soundex] ?soundex.\n?item wdt:[property:instance of] wd:[entity:family name].\n?item wdt:[property:Cologne phonetics] ?cologne.\n?item wdt:[property:Caverphone] ?caverphone.\n?item wdt:[property:Soundex] ?soundex.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\nFILTER(?item != ?surname)\n}",
    "complexity": "medium"
  },
  {
    "id": "324",
    "instruction": "List the names of organizations with their member counts.",
    "query": "SELECT ?orgname (COUNT(?person) AS ?members)\nWHERE {\n?person wdt:P3429 [];\nwdt:P463 ?org.\n?org rdfs:label ?orgname filter (lang(?orgname) = \"en\")\n} GROUP BY ?orgname\nORDER BY DESC (?members)",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?orgname (COUNT(?person) AS ?members)\nWHERE {\n?person wdt:[property:Electronic Enlightenment ID] [];\nwdt:[property:member of] ?org.\n?org rdfs:label ?orgname filter (lang(?orgname) = \"en\")\n} GROUP BY ?orgname\nORDER BY DESC (?members)",
    "complexity": "medium"
  },
  {
    "id": "2725",
    "instruction": "List all capoeira practitioners with their birthdays!",
    "query": "SELECT ?person ?personLabel ?birthdate ?pic where {\n?person wdt:P106 wd:Q29840095 .\nOPTIONAL {?person wdt:P18 ?pic . }\n?person wdt:P569 ?birthdate\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],nl,en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?person ?personLabel ?birthdate ?pic where {\n?person wdt:[property:occupation] wd:[entity:capoeira practitioner] .\nOPTIONAL {?person wdt:[property:image] ?pic . }\n?person wdt:[property:date of birth] ?birthdate\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],nl,en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "2226",
    "instruction": "List all localities in Mexico that have 'San' in their name.",
    "query": "SELECT DISTINCT ?localidad ?localidadLabel WHERE {\n?localidad wdt:P31 wd:Q20202352 ;\nrdfs:label ?itemLabel;\nFILTER (lang(?itemLabel) = \"es\") .\nFILTER regex (?itemLabel, \"^San\") .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"es\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?localidad ?localidadLabel WHERE {\n?localidad wdt:[property:instance of] wd:[entity:locality of Mexico] ;\nrdfs:label ?itemLabel;\nFILTER (lang(?itemLabel) = \"es\") .\nFILTER regex (?itemLabel, \"^San\") .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"es\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "287",
    "instruction": "List all items with an inventory number that have a collection in a qualifier but lack a collection.",
    "query": "SELECT (COUNT(?obj) AS ?count) WHERE {\n?obj p:P217 ?s.\n?s pq:P195 ?collection\nMINUS {?obj wdt:P195 []}\n}",
    "annotated": "PREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT (COUNT(?obj) AS ?count) WHERE {\n?obj p:[property:inventory number] ?s.\n?s pq:[property:collection] ?collection\nMINUS {?obj wdt:[property:collection] []}\n}",
    "complexity": "medium"
  },
  {
    "id": "1615",
    "instruction": "List all women who are scientific illustrators.",
    "query": "SELECT ?human ?humanLabel WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?human wdt:P31 wd:Q5.\n?human wdt:P21 wd:Q6581072.\n?human wdt:P106 wd:Q19507792.\n}\nLIMIT 1000",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?human ?humanLabel WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?human wdt:[property:instance of] wd:[entity:human].\n?human wdt:[property:sex or gender] wd:[entity:female].\n?human wdt:[property:occupation] wd:[entity:scientific illustrator].\n}\nLIMIT 1000",
    "complexity": "medium"
  },
  {
    "id": "717",
    "instruction": "Find items with statements derived from a specific reference related to the EPA CompTox Dashboard.",
    "query": "SELECT DISTiNCT ?item ?itemLabel WHERE {\n?item ?p ?statement.\n?statement prov:wasDerivedFrom ?ref .\n?ref ?prop wd:Q28061352 .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX prov: <http://www.w3.org/ns/prov#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTiNCT ?item ?itemLabel WHERE {\n?item ?p ?statement.\n?statement prov:wasDerivedFrom ?ref .\n?ref ?prop wd:[entity:Mapping file of InChIStrings, InChIKeys and DTXSIDs for the EPA CompTox Dashboard] .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "1333",
    "instruction": "Find locations of churches in Pyrenees-Orientales, France.",
    "query": "SELECT DISTINCT ?item ?coor WHERE {\n?item wdt:P31/wdt:P279* wd:Q16970 ; wdt:P131 ?commune .\n?commune wdt:P131 wd:Q12709.\n?item wdt:P625 ?coor.\n}",
    "annotated": "PREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT DISTINCT ?item ?coor WHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:church building] ; wdt:[property:located in the administrative territorial entity] ?commune .\n?commune wdt:[property:located in the administrative territorial entity] wd:[entity:Pyr\u00e9n\u00e9es-Orientales].\n?item wdt:[property:coordinate location] ?coor.\n}",
    "complexity": "medium"
  },
  {
    "id": "44",
    "instruction": "What awards have University of Edinburgh employees won?",
    "query": "SELECT ?alum ?alumLabel ?award ?awardLabel\nWHERE {\n?alum wdt:P108 wd:Q160302;\nwdt:P166 ?award.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?alum ?alumLabel ?award ?awardLabel\nWHERE {\n?alum wdt:[property:employer] wd:[entity:University of Edinburgh];\nwdt:[property:award received] ?award.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}",
    "complexity": "medium"
  },
  {
    "id": "1274",
    "instruction": "What are the broader categories of knowledge organization systems?",
    "query": "SELECT ?broader ?broaderLabel ?item ?itemLabel\n{\n?item wdt:P279* wd:Q6423319;\nwdt:P279 ?broader;\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?broader ?broaderLabel ?item ?itemLabel\n{\n?item wdt:[property:subclass of]* wd:[entity:knowledge organization system];\nwdt:[property:subclass of] ?broader;\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}",
    "complexity": "medium"
  },
  {
    "id": "2050",
    "instruction": "List all the places shown in paintings.",
    "query": "SELECT ?item ?anotherItemLabel ?loc WHERE {\n?item wdt:P31 wd:Q3305213 .\n?item wdt:P180 ?anotherItem .\n?anotherItem wdt:P625 ?loc .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?anotherItemLabel ?loc WHERE {\n?item wdt:[property:instance of] wd:[entity:painting] .\n?item wdt:[property:depicts] ?anotherItem .\n?anotherItem wdt:[property:coordinate location] ?loc .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "1728",
    "instruction": "List all individuals who are YouTubers but do not have a YouTube channel.",
    "query": "SELECT ?youtuber ?youtuberLabel ?image WHERE {\n?youtuber wdt:P106 wd:Q17125263.\nMINUS { ?youtuber wdt:P2397 ?channel. }\nOPTIONAL { ?youtuber wdt:P18 ?image. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?youtuber ?youtuberLabel ?image WHERE {\n?youtuber wdt:[property:occupation] wd:[entity:YouTuber].\nMINUS { ?youtuber wdt:[property:YouTube channel ID] ?channel. }\nOPTIONAL { ?youtuber wdt:[property:image] ?image. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "1305",
    "instruction": "List all species named after Barack Obama.",
    "query": "SELECT ?taxon ?taxonLabel ?name WHERE {\n?taxon wdt:P31 wd:Q16521;\nwdt:P138 wd:Q76.\nOPTIONAL { ?taxon wdt:P225 ?name. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?taxon ?taxonLabel ?name WHERE {\n?taxon wdt:[property:instance of] wd:[entity:taxon];\nwdt:[property:named after] wd:[entity:Barack Obama].\nOPTIONAL { ?taxon wdt:[property:taxon name] ?name. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "2137",
    "instruction": "What are the written works of Joshua Angrist, a recent Nobel laureate?",
    "query": "SELECT ?item ?itemLabel ?itemDescription ?year WHERE {\n?item wdt:P50 wd:Q921499.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\nOPTIONAL { ?item wdt:P577 ?date. }\nBIND(YEAR(?date) AS ?year)\n}\nORDER BY (?year)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?itemDescription ?year WHERE {\n?item wdt:[property:author] wd:[entity:Joshua Angrist].\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\nOPTIONAL { ?item wdt:[property:publication date] ?date. }\nBIND(YEAR(?date) AS ?year)\n}\nORDER BY (?year)",
    "complexity": "medium"
  },
  {
    "id": "1039",
    "instruction": "List all Christmas movies along with their release dates.",
    "query": "SELECT ?film ?filmLabel ?date WHERE {\n?film wdt:P136 wd:Q28026639.\n?film wdt:P577 ?date .\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?film ?filmLabel ?date WHERE {\n?film wdt:[property:genre] wd:[entity:Christmas film].\n?film wdt:[property:publication date] ?date .\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n}",
    "complexity": "medium"
  },
  {
    "id": "857",
    "instruction": "Find artworks featuring the Eiffel Tower.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?instanceLabel ?creatorLabel (YEAR(?date) as ?year) ?image WHERE {\n?item wdt:P180 wd:Q243 .\n?item wdt:P31 ?instance .\nOPTIONAL { ?item wdt:P170 ?creator }\nOPTIONAL { ?item wdt:P571 ?date }\nOPTIONAL { ?item wdt:P18 ?image }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} ORDER BY ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?instanceLabel ?creatorLabel (YEAR(?date) as ?year) ?image WHERE {\n?item wdt:[property:image]0 wd:[entity:Eiffel Tower] .\n?item wdt:[property:instance of] ?instance .\nOPTIONAL { ?item wdt:[property:creator] ?creator }\nOPTIONAL { ?item wdt:[property:inception] ?date }\nOPTIONAL { ?item wdt:[property:image] ?image }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} ORDER BY ?itemLabel",
    "complexity": "medium"
  },
  {
    "id": "2231",
    "instruction": "What are the most common tonalities used in music?",
    "query": "SELECT ?tonalityLabel (COUNT(?tonalityLabel) as ?count)\nWHERE\n{\n?work wdt:P826 ?tonality.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}\nGROUP BY ?tonalityLabel\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?tonalityLabel (COUNT(?tonalityLabel) as ?count)\nWHERE\n{\n?work wdt:[property:tonality] ?tonality.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}\nGROUP BY ?tonalityLabel\nORDER BY DESC(?count)",
    "complexity": "medium"
  },
  {
    "id": "1366",
    "instruction": "List all French cities that start with the letter W.",
    "query": "SELECT ?item ?itemL ?coords WHERE {\n?item wdt:P31/wdt:P279* wd:Q484170 ;\nwdt:P625 ?coords ;\nrdfs:label ?itemL filter (lang(?itemL) = \"fr\") .\nFILTER (STRSTARTS(?itemL, \"W\"))\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?item ?itemL ?coords WHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:commune of France] ;\nwdt:[property:coordinate location] ?coords ;\nrdfs:label ?itemL filter (lang(?itemL) = \"fr\") .\nFILTER (STRSTARTS(?itemL, \"W\"))\n}",
    "complexity": "medium"
  },
  {
    "id": "1499",
    "instruction": "Find images of people honored with plaques in Jena, Germany.",
    "query": "SELECT ?subject ?subjectLabel ?image WHERE {\n?tafel wdt:P31 wd:Q721747; # instances of commemorative plaques\nwdt:P131 wd:Q3150 ; # located in the administrative territorial entity of the city of Jena\nwdt:P547 ?subject . # subject of the commemoration\n?subject wdt:P18 ?image . # image of the subject\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],de,en\". } # labels\n}\n#defaultView:ImageGrid",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?subject ?subjectLabel ?image WHERE {\n?tafel wdt:[property:instance of] wd:[entity:commemorative plaque]; # instances of commemorative plaques\nwdt:[property:located in the administrative territorial entity] wd:[entity:Jena] ; # located in the administrative territorial entity of the city of Jena\nwdt:[property:commemorates] ?subject . # subject of the commemoration\n?subject wdt:[property:image] ?image . # image of the subject\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],de,en\". } # labels\n}\n#defaultView:ImageGrid",
    "complexity": "medium"
  },
  {
    "id": "1094",
    "instruction": "List all news aggregator apps along with their operating systems and licenses.",
    "query": "SELECT DISTINCT ?app ?appLabel ?osLabel ?licLabel ?image WHERE {\n?app wdt:P31 wd:Q498267.\n?app wdt:P306 ?os.\n?app wdt:P275 ?lic.\nOPTIONAL {?app wdt:P154 ?image.}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?app ?appLabel ?osLabel ?licLabel ?image WHERE {\n?app wdt:[property:instance of] wd:[entity:news aggregator].\n?app wdt:[property:operating system] ?os.\n?app wdt:[property:copyright license] ?lic.\nOPTIONAL {?app wdt:[property:logo image] ?image.}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "1552",
    "instruction": "List the components of the Wall of Philip II Augustus in Paris.",
    "query": "SELECT ?item ?itemLabel ?coords ?image WHERE {\n?item wdt:P361 wd:Q3053741 .\nOPTIONAL { ?item wdt:P625 ?coords }\nOPTIONAL { ?item wdt:P18 ?image }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?coords ?image WHERE {\n?item wdt:[property:part of] wd:[entity:Wall of Philip II Augustus, Paris] .\nOPTIONAL { ?item wdt:[property:coordinate location] ?coords }\nOPTIONAL { ?item wdt:[property:image] ?image }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY ?itemLabel",
    "complexity": "medium"
  },
  {
    "id": "1658",
    "instruction": "List Nigerian women with Wikipedia articles and pictures.",
    "query": "SELECT ?nigerianwomen ?nigerianwomenLabel ?placeofbirthLabel ?datebirth ?locationLabel?image\nWHERE {\n?nigerianwomen wdt:P31 wd:Q5.\n?nigerianwomen wdt:P21 wd:Q6581072.\n?nigerianwomen wdt:P27 wd:Q1033.\nOPTIONAL {?nigerianwomen wdt:P19 ?placeofbirth}.\nOPTIONAL {?nigerianwomen wdt:P569 ?datebirth}.\nOPTIONAL {?nigerianwomen wdt:P18 ?image}.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?nigerianwomen ?nigerianwomenLabel ?placeofbirthLabel ?datebirth ?locationLabel?image\nWHERE {\n?nigerianwomen wdt:[property:instance of] wd:[entity:human].\n?nigerianwomen wdt:[property:sex or gender] wd:[entity:female].\n?nigerianwomen wdt:[property:country of citizenship] wd:[entity:Nigeria].\nOPTIONAL {?nigerianwomen wdt:[property:place of birth] ?placeofbirth}.\nOPTIONAL {?nigerianwomen wdt:[property:date of birth] ?datebirth}.\nOPTIONAL {?nigerianwomen wdt:[property:image] ?image}.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }}",
    "complexity": "medium"
  },
  {
    "id": "926",
    "instruction": "List all the places of worship in France.",
    "query": "SELECT ?item ?itemLabel ?placeLabel ?coords WHERE {\n?item wdt:P31/wdt:P279* wd:Q1370598 .\n?item wdt:P17 wd:Q142.\nOPTIONAL { ?item wdt:P131 ?place }\nOPTIONAL { ?item wdt:P625 ?coords }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\" . }\n}\nORDER BY ?placeLabel ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?placeLabel ?coords WHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:structure of worship] .\n?item wdt:[property:country] wd:[entity:France].\nOPTIONAL { ?item wdt:[property:located in the administrative territorial entity] ?place }\nOPTIONAL { ?item wdt:[property:coordinate location] ?coords }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\" . }\n}\nORDER BY ?placeLabel ?itemLabel",
    "complexity": "medium"
  },
  {
    "id": "656",
    "instruction": "What are the episodes of The Simpsons, grouped by season?",
    "query": "SELECT ?show ?showLabel ?seasonNumber ?episode ?episodeLabel\nWHERE {\nBIND(wd:Q886 as ?show) .\n?season wdt:P361 ?show;\nwdt:P527 ?episode;\np:P179 [pq:P1545 ?seasonNumber] .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}\nORDER BY xsd:integer(?seasonNumber)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?show ?showLabel ?seasonNumber ?episode ?episodeLabel\nWHERE {\nBIND(wd:[entity:The Simpsons] as ?show) .\n?season wdt:[property:part of] ?show;\nwdt:[property:has part(s)] ?episode;\np:[property:part of the series] [pq:[property:series ordinal] ?seasonNumber] .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}\nORDER BY xsd:integer(?seasonNumber)",
    "complexity": "medium"
  },
  {
    "id": "594",
    "instruction": "List the most cited works in WikiPathways along with their citation counts.",
    "query": "SELECT ?citation ?citationLabel (count(?pathway) as ?times_cited) WHERE {\n?pathway wdt:P2410 ?WikiPathwaysID ;\nwdt:P2860 ?citation .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nGROUP BY ?pathway ?citation ?citationLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?citation ?citationLabel (count(?pathway) as ?times_cited) WHERE {\n?pathway wdt:[property:WikiPathways ID] ?WikiPathwaysID ;\nwdt:[property:cites work] ?citation .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nGROUP BY ?pathway ?citation ?citationLabel",
    "complexity": "medium"
  },
  {
    "id": "509",
    "instruction": "Find English lexemes starting with 'pota'.",
    "query": "SELECT ?lexemeId ?lemma WHERE {\n?lexemeId dct:language wd:Q1860;\nwikibase:lemma ?lemma.\n# only those lemmas that begin with \"pota\", i.e. \"potato\"\nFILTER (regex(?lemma, '^pota.*'))\n}",
    "annotated": "PREFIX dct: <http://purl.org/dc/terms/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?lexemeId ?lemma WHERE {\n?lexemeId dct:language wd:[entity:English];\nwikibase:lemma ?lemma.\n# only those lemmas that begin with \"pota\", i.e. \"potato\"\nFILTER (regex(?lemma, '^pota.*'))\n}",
    "complexity": "medium"
  },
  {
    "id": "642",
    "instruction": "List the parents and grandparents of King Willem-Alexander of the Netherlands.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?dateofbirth WHERE {\nwd:Q154952 (wdt:P22|wdt:P25)* ?item .\nOPTIONAL { ?item wdt:P569 ?dateofbirth } .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} ORDER BY ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?dateofbirth WHERE {\nwd:[entity:Willem-Alexander of the Netherlands] (wdt:[property:father]|wdt:[property:mother])* ?item .\nOPTIONAL { ?item wdt:[property:date of birth] ?dateofbirth } .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} ORDER BY ?itemLabel",
    "complexity": "medium"
  },
  {
    "id": "2400",
    "instruction": "Find all archaeological sites related to Talaiotic culture on Menorca island.",
    "query": "SELECT ?item ?itemLabel ?coordenades ?imatge ?localitzat_a_l_entitat_territorial_administrativaLabel ?inst_ncia_de ?inst_ncia_deLabel WHERE {\n?item wdt:P31 wd:Q530894;\n(wdt:P131+) wd:Q52636.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],ca\". }\nOPTIONAL { ?item wdt:P625 ?coordenades. }\nOPTIONAL { ?item wdt:P18 ?imatge. }\nOPTIONAL { ?item wdt:P131 ?localitzat_a_l_entitat_territorial_administrativa. }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?coordenades ?imatge ?localitzat_a_l_entitat_territorial_administrativaLabel ?inst_ncia_de ?inst_ncia_deLabel WHERE {\n?item wdt:[property:instance of] wd:[entity:Talaiotic culture];\n(wdt:[property:located in the administrative territorial entity]+) wd:[entity:Menorca].\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],ca\". }\nOPTIONAL { ?item wdt:[property:coordinate location] ?coordenades. }\nOPTIONAL { ?item wdt:[property:image] ?imatge. }\nOPTIONAL { ?item wdt:[property:located in the administrative territorial entity] ?localitzat_a_l_entitat_territorial_administrativa. }\n}",
    "complexity": "medium"
  },
  {
    "id": "1403",
    "instruction": "What are the smallest countries with urban rail transit systems?",
    "query": "SELECT DISTINCT ?countryLabel WHERE {\n?item wdt:P31/wdt:P279* wd:Q3491904 ;\nwdt:P17 ?country .\n?country wdt:P2046 ?area .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n}\nORDER BY ?area\nLIMIT 10",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?countryLabel WHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:urban rail transit system] ;\nwdt:[property:country] ?country .\n?country wdt:[property:area] ?area .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n}\nORDER BY ?area\nLIMIT 10",
    "complexity": "medium"
  },
  {
    "id": "198",
    "instruction": "List all English common names of species depicted by Ferdinand Bauer.",
    "query": "SELECT DISTINCT ?item ?commonname ?taxonname WHERE {\n?art wdt:P170 wd:Q79012; wdt:P180 ?item.\n?item wdt:P225 ?taxonname; wdt:P1843 ?commonname FILTER (lang(?commonname) = \"en\")\n} ORDER BY UCASE(?commonname)",
    "annotated": "PREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT DISTINCT ?item ?commonname ?taxonname WHERE {\n?art wdt:[property:creator] wd:[entity:Ferdinand Bauer]; wdt:[property:depicts] ?item.\n?item wdt:[property:taxon name] ?taxonname; wdt:[property:taxon common name] ?commonname FILTER (lang(?commonname) = \"en\")\n} ORDER BY UCASE(?commonname)",
    "complexity": "medium"
  },
  {
    "id": "1492",
    "instruction": "List all individuals who are their grandfather.",
    "query": "SELECT ?aLabel ?bLabel WHERE {\n?a wdt:P22 ?b.\n?b wdt:P22 ?a.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?aLabel ?bLabel WHERE {\n?a wdt:[property:father] ?b.\n?b wdt:[property:father] ?a.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n}",
    "complexity": "medium"
  },
  {
    "id": "1425",
    "instruction": "List all married couples where both partners are Members of Parliament in the UK.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?person2 ?person2Label\nWHERE {\n?item wdt:P31 wd:Q5 ; wdt:P39 wd:Q16707842.\n?person2 wdt:P31 wd:Q5 ; wdt:P39 wd:Q16707842 ; wdt:P26 ?item .\nFILTER(STR(?person2) > STR(?item))\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?person2 ?person2Label\nWHERE {\n?item wdt:[property:instance of] wd:[entity:human] ; wdt:[property:position held] wd:[entity:Member of Parliament].\n?person2 wdt:[property:instance of] wd:[entity:human] ; wdt:[property:position held] wd:[entity:Member of Parliament] ; wdt:[property:spouse] ?item .\nFILTER(STR(?person2) > STR(?item))\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "complexity": "medium"
  }
]