[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "1029",
    "instruction": "List all Nobel Prize winners with Twitter accounts.",
    "query": "SELECT DISTINCT ?winner ?winnerLabel ?twitter WHERE {\n{ ?winner wdt:P166 wd:Q7191. }\nUNION\n{ ?winner wdt:P166 [ wdt:P279 wd:Q7191 ] }\n?winner wdt:P2002 ?twitter .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n} ORDER BY ASC(?winnerLabel)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?winner ?winnerLabel ?twitter WHERE {\n{ ?winner wdt:[property:award received] wd:[entity:Nobel Prize]. }\nUNION\n{ ?winner wdt:[property:award received] [ wdt:[property:subclass of] wd:[entity:Nobel Prize] ] }\n?winner wdt:[property:Twitter (X) username] ?twitter .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n} ORDER BY ASC(?winnerLabel)",
    "complexity": "complex"
  },
  {
    "id": "494",
    "instruction": "What are the recent events that have occurred in the last 31 days?",
    "query": "SELECT ?event ?eventLabel ?date\nWITH {\nSELECT DISTINCT ?event ?date\nWHERE {\n# find events\n?event wdt:P31/wdt:P279* wd:Q1190554.\n# with a point in time or start date\nOPTIONAL { ?event wdt:P585 ?date. }\nOPTIONAL { ?event wdt:P580 ?date. }\n# but at least one of those\nFILTER(BOUND(?date) && DATATYPE(?date) = xsd:dateTime).\n# not in the future, and not more than 31 days ago\nBIND(NOW() - ?date AS ?distance).\nFILTER(0 <= ?distance && ?distance < 31).\n}\nLIMIT 150\n} AS %i\nWHERE {\nINCLUDE %i\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" . }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?event ?eventLabel ?date\nWITH {\nSELECT DISTINCT ?event ?date\nWHERE {\n# find events\n?event wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:occurrence].\n# with a point in time or start date\nOPTIONAL { ?event wdt:[property:point in time] ?date. }\nOPTIONAL { ?event wdt:[property:start time] ?date. }\n# but at least one of those\nFILTER(BOUND(?date) && DATATYPE(?date) = xsd:dateTime).\n# not in the future, and not more than 31 days ago\nBIND(NOW() - ?date AS ?distance).\nFILTER(0 <= ?distance && ?distance < 31).\n}\nLIMIT 150\n} AS %i\nWHERE {\nINCLUDE %i\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" . }\n}",
    "complexity": "complex"
  },
  {
    "id": "2673",
    "instruction": "Find research papers by University of Leeds authors with CC-BY or CC-BY-SA licenses and full text available online.",
    "query": "SELECT DISTINCT ?paper ?paperLabel ?licenceLabel ?fulltext WHERE {\n?author wdt:P108 wd:Q503424. # Employee of University of Leeds\n?paper wdt:P31 wd:Q13442814; wdt:P50 ?author. # scholarly article by this author\nVALUES ?freelicence {wd:Q6905323 wd:Q6905942} # CC-BY or CC-BY-SA\n?paper wdt:P275 ?licence . ?licence wdt:P629? ?freelicence. # Article has this licence, or a specific edition such as CC-BY 3.0\n?paper wdt:P953 ?fulltext FILTER(CONTAINS(STR(?fulltext), \"whiterose.ac.uk\"))\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\"}\n} ORDER BY ?paper",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?paper ?paperLabel ?licenceLabel ?fulltext WHERE {\n?author wdt:[property:employer] wd:[entity:University of Leeds]. # Employee of University of Leeds\n?paper wdt:[property:instance of] wd:[entity:scholarly article]; wdt:[property:author] ?author. # scholarly article by this author\nVALUES ?freelicence {wd:[entity:Creative Commons Attribution] wd:[entity:Creative Commons Attribution-ShareAlike]} # CC-BY or CC-BY-SA\n?paper wdt:[property:copyright license] ?licence . ?licence wdt:[property:edition or translation of]? ?freelicence. # Article has this licence, or a specific edition such as CC-BY 3.0\n?paper wdt:[property:full work available at URL] ?fulltext FILTER(CONTAINS(STR(?fulltext), \"whiterose.ac.uk\"))\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\"}\n} ORDER BY ?paper",
    "complexity": "complex"
  },
  {
    "id": "1784",
    "instruction": "List the movie directors who have been active for more than 20,000 days.",
    "query": "SELECT ?director (MIN(?date) AS ?first) (MAX(?date) AS ?last) (MAX(?date)-MIN(?date) AS ?span) WHERE {\n?movie wdt:P57 ?director ; wdt:P577 ?date .\n}\nGROUP BY ?director\nHAVING (?span > 20000 )\nORDER BY DESC(?span)",
    "annotated": "PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?director (MIN(?date) AS ?first) (MAX(?date) AS ?last) (MAX(?date)-MIN(?date) AS ?span) WHERE {\n?movie wdt:[property:director] ?director ; wdt:[property:publication date] ?date .\n}\nGROUP BY ?director\nHAVING (?span > 20000 )\nORDER BY DESC(?span)",
    "complexity": "complex"
  },
  {
    "id": "2356",
    "instruction": "What are the concepts related to power?",
    "query": "SELECT DISTINCT ?item ?itemLabel ?pic ?linkTo ?linkToLabel # ?instance ?instanceLabel ?subClass ?subClassLabel\nWHERE\n{\nwd:Q18340964 ^wdt:P279* ?item .\n?item ^wdt:P279 ?linkTo .\n?linkTo wdt:P31 ?instance.\n?linkTo wdt:P279* ?subClass.\nOPTIONAL { ?item wdt:P18 ?pic }\nMINUS {?linkTo wdt:P17 | wdt:P1001 ?jurisdiction}\nMINUS {?item wdt:P17 | wdt:P1001 ?jurisdiction}\nSERVICE wikibase:label {bd:serviceParam wikibase:language \"en\" }\nFILTER (?instance NOT IN (wd:Q28640, wd:Q14204246, wd:Q28057030, wd:Q7810129, wd:Q11488158, wd:Q1900326, wd:Q4164871, wd:Q4671286, wd:Q241317,wd:Q1665984, wd:Q11862829, wd:Q11773926, wd:Q294414, wd:Q815823, wd:Q159535, wd:Q66439731, wd:Q2465832, wd:Q5157582,wd:Q1093434, wd:Q1789452, wd:Q6055843, wd:Q2424752, wd:Q104822033, wd:Q1220872, wd:Q336, wd:Q12737077, wd:Q1714118,wd:Q13406463 , wd:Q12812139, wd:Q49773))\nFILTER (?subClass NOT IN (wd:Q30185, wd:Q11902879, wd:Q59512604, wd:Q59240317, wd:Q99766277, wd:Q35749, wd:Q621261, wd:Q35749, wd:Q239463, wd:Q1153777, wd:Q7603708, wd:Q15284, wd:Q1632136, wd:Q206814, wd:Q206814, wd:Q5185982, wd:Q7930989, wd:Q50592854, wd:Q4671162 , wd:Q275969))\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?pic ?linkTo ?linkToLabel # ?instance ?instanceLabel ?subClass ?subClassLabel\nWHERE\n{\nwd:[entity:power] ^wdt:[property:subclass of]* ?item .\n?item ^wdt:[property:subclass of] ?linkTo .\n?linkTo wdt:[property:instance of] ?instance.\n?linkTo wdt:[property:subclass of]* ?subClass.\nOPTIONAL { ?item wdt:[property:image] ?pic }\nMINUS {?linkTo wdt:[property:country] | wdt:[property:applies to jurisdiction] ?jurisdiction}\nMINUS {?item wdt:[property:country] | wdt:[property:applies to jurisdiction] ?jurisdiction}\nSERVICE wikibase:label {bd:serviceParam wikibase:language \"en\" }\nFILTER (?instance NOT IN (wd:[entity:profession], wd:[entity:Wikimedia project page], wd:[entity:ERP software], wd:Q7810129, wd:[entity:corporate title], wd:[entity:network], wd:[entity:position], wd:[entity:academic major], wd:[entity:computing platform],wd:[entity:interdisciplinary science], wd:[entity:academic discipline], wd:[entity:ecclesiastical occupation], wd:[entity:public office], wd:[entity:business model], wd:[entity:conspiracy theory], wd:[entity:access restriction], wd:[entity:branch of science], wd:[entity:computer security model],wd:[entity:citizen science], wd:[entity:criterion], wd:[entity:Internet genre], wd:[entity:product], wd:[entity:podcast genre], wd:[entity:service], wd:[entity:science], wd:[entity:occupation], wd:[entity:online publication],wd:[entity:Wikimedia list article] , wd:[entity:technical term], wd:[entity:social movement]))\nFILTER (?subClass NOT IN (wd:[entity:mayor], wd:[entity:Lord Mayor], wd:[entity:chair of local government], wd:[entity:chair of the district council], wd:[entity:mayor of a place in Turkey], wd:[entity:parliament], wd:[entity:pain management], wd:[entity:parliament], wd:[entity:junta], wd:[entity:legislative assembly], wd:[entity:legislature of a constituent state], wd:[entity:municipality], wd:[entity:security control], wd:[entity:civil aviation], wd:[entity:civil aviation], wd:[entity:crisis plan], wd:[entity:city or town], wd:[entity:absence of pain sensation], wd:[entity:academic administration] , wd:[entity:crowdsourcing]))\n}",
    "complexity": "complex"
  },
  {
    "id": "2095",
    "instruction": "List all diet advocates with their birth dates and images.",
    "query": "SELECT DISTINCT ?wditem ?wditemLabel ?date ?image ?work ?workLabel ?coord ?description WHERE {\nSERVICE <http://dbpedia.org/sparql> {\n?item dct:subject dbc:Diet_food_advocates ;\n#?item dct:subject dbc:Sewing_machines;\n#?item dct:subject|dct:subject/skos:broader|dct:subject/skos:broader/skos:broader dbc:Ancient_Greek_philosophers ;\n#?item dct:subject|dct:subject/skos:broader dbc:Cryptography ;\nowl:sameAs ?wditem FILTER regex (?wditem, \"wikidata.org\") .\n#?item dct:subject|dct:subject/skos:broader|dct:subject/skos:broader/skos:broader dbc:Duelling_fatalities .\n}\nSERVICE <https://query.wikidata.org/sparql> {\n{?wditem wdt:P569 ?date FILTER (YEAR(?date) >= 500).}\n#{?wditem wdt:P570 ?date .}\nOPTIONAL {?wditem wdt:P18 ?image } .\n?wditem rdfs:label ?wditemLabel FILTER (LANG(?wditemLabel)=\"en\") .\n}\n}",
    "annotated": "PREFIX dct: <http://purl.org/dc/terms/>\nPREFIX owl: <http://www.w3.org/2002/07/owl#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX skos: <http://www.w3.org/2004/02/skos/core#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX dbc: <http://dbpedia.org/resource/Category:>\n\nSELECT DISTINCT ?wditem ?wditemLabel ?date ?image ?work ?workLabel ?coord ?description WHERE {\nSERVICE <http://dbpedia.org/sparql> {\n?item dct:subject dbc:Diet_food_advocates ;\n#?item dct:subject dbc:Sewing_machines;\n#?item dct:subject|dct:subject/skos:broader|dct:subject/skos:broader/skos:broader dbc:Ancient_Greek_philosophers ;\n#?item dct:subject|dct:subject/skos:broader dbc:Cryptography ;\nowl:sameAs ?wditem FILTER regex (?wditem, \"wikidata.org\") .\n#?item dct:subject|dct:subject/skos:broader|dct:subject/skos:broader/skos:broader dbc:Duelling_fatalities .\n}\nSERVICE <https://query.wikidata.org/sparql> {\n{?wditem wdt:[property:date of birth] ?date FILTER (YEAR(?date) >= 500).}\n#{?wditem wdt:[property:date of death] ?date .}\nOPTIONAL {?wditem wdt:[property:image] ?image } .\n?wditem rdfs:label ?wditemLabel FILTER (LANG(?wditemLabel)=\"en\") .\n}\n}",
    "complexity": "complex"
  },
  {
    "id": "1389",
    "instruction": "List all female writers on a map according to their birthplaces.",
    "query": "SELECT ?person ?personLabel ?dob ?precision ?coords ?Gender ?Occupation ?Place_of_Birth ?image\n(COUNT(distinct ?article) as ?count)\nWHERE {\n?person wdt:P106 wd:Q36180 .\n?person wdt:P31 wd:Q5 .\n?person wdt:P21 wd:Q6581072 .\n?person p:P569/psv:P569 ?dobNode .\n?dobNode wikibase:timeValue ?dob .\n?dobNode wikibase:timePrecision ?precision .\n?person wdt:P19 ?birthPlace .\n?birthPlace wdt:P625 ?coords .\nOPTIONAL { ?person wdt:P18 ?image }\nOPTIONAL { ?article schema:about ?person }\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language 'en' .\n?person rdfs:label ?personLabel .\n?birthPlace rdfs:label ?Place_of_Birth .\n?occupation rdfs:label ?Occupation .\n?gender rdfs:label ?Gender .\n}\n} GROUP BY ?person ?personLabel ?dob ?precision ?coords ?Gender ?Occupation ?Place_of_Birth ?image\nORDER BY DESC (?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?person ?personLabel ?dob ?precision ?coords ?Gender ?Occupation ?Place_of_Birth ?image\n(COUNT(distinct ?article) as ?count)\nWHERE {\n?person wdt:[property:occupation] wd:[entity:writer] .\n?person wdt:[property:instance of] wd:[entity:human] .\n?person wdt:[property:sex or gender] wd:[entity:female] .\n?person p:[property:date of birth]/psv:[property:date of birth] ?dobNode .\n?dobNode wikibase:timeValue ?dob .\n?dobNode wikibase:timePrecision ?precision .\n?person wdt:[property:place of birth] ?birthPlace .\n?birthPlace wdt:[property:coordinate location] ?coords .\nOPTIONAL { ?person wdt:[property:image] ?image }\nOPTIONAL { ?article schema:about ?person }\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language 'en' .\n?person rdfs:label ?personLabel .\n?birthPlace rdfs:label ?Place_of_Birth .\n?occupation rdfs:label ?Occupation .\n?gender rdfs:label ?Gender .\n}\n} GROUP BY ?person ?personLabel ?dob ?precision ?coords ?Gender ?Occupation ?Place_of_Birth ?image\nORDER BY DESC (?count)",
    "complexity": "complex"
  },
  {
    "id": "2296",
    "instruction": "What are the language codes used by Wikimedia?",
    "query": "SELECT DISTINCT ?lang ?tongue WHERE {\nhint:Query hint:optimizer \"None\".\n?tongueitem wdt:P424 ?lang .\n?tongueitem wdt:P279*/wdt:P31 wd:Q34770 .\nwd:Q52 rdfs:label ?pedia .\nFILTER(LANG(?pedia)=?lang)\nOPTIONAL{wd:Q2013 rdfs:label ?data .\nFILTER(LANG(?data)=?lang)}\nOPTIONAL{wd:Q35120 rdfs:label ?entity .\nFILTER(LANG(?entity)=?lang)}\nOPTIONAL{wd:Q34770 rdfs:label ?language .\nFILTER(LANG(?language)=?lang)}\nOPTIONAL{wd:Q565 rdfs:label ?commons .\nFILTER(LANG(?commons)=?lang)}\nOPTIONAL{wd:Q367 rdfs:label ?books .\nFILTER(LANG(?books)=?lang)}\nOPTIONAL{wd:Q964 rdfs:label ?news .\nFILTER(LANG(?news)=?lang)}\nOPTIONAL{wd:Q369 rdfs:label ?quote .\nFILTER(LANG(?quote)=?lang)}\nOPTIONAL{wd:Q263 rdfs:label ?source .\nFILTER(LANG(?source)=?lang)}\nOPTIONAL{wd:Q370 rdfs:label ?versity .\nFILTER(LANG(?versity)=?lang)}\nOPTIONAL{wd:Q373 rdfs:label ?voyage .\nFILTER(LANG(?voyage)=?lang)}\nOPTIONAL{wd:Q151 rdfs:label ?tionary .\nFILTER(LANG(?tionary)=?lang)}\nOPTIONAL{wd:Q13679 rdfs:label ?species .\nFILTER(LANG(?species)=?lang)}\n?tongueitem rdfs:label ?tongue .\nFILTER(LANG(?tongue)=?lang)\n}",
    "annotated": "PREFIX hint: <http://www.bigdata.com/queryHints#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT DISTINCT ?lang ?tongue WHERE {\nhint:Query hint:optimizer \"None\".\n?tongueitem wdt:[property:Wikimedia language code] ?lang .\n?tongueitem wdt:[property:subclass of]*/wdt:[property:instance of] wd:[entity:language] .\nwd:[entity:Wikipedia] rdfs:label ?pedia .\nFILTER(LANG(?pedia)=?lang)\nOPTIONAL{wd:[entity:Wikidata] rdfs:label ?data .\nFILTER(LANG(?data)=?lang)}\nOPTIONAL{wd:[entity:entity] rdfs:label ?entity .\nFILTER(LANG(?entity)=?lang)}\nOPTIONAL{wd:[entity:language] rdfs:label ?language .\nFILTER(LANG(?language)=?lang)}\nOPTIONAL{wd:[entity:Wikimedia Commons] rdfs:label ?commons .\nFILTER(LANG(?commons)=?lang)}\nOPTIONAL{wd:[entity:Wikibooks] rdfs:label ?books .\nFILTER(LANG(?books)=?lang)}\nOPTIONAL{wd:[entity:Wikinews] rdfs:label ?news .\nFILTER(LANG(?news)=?lang)}\nOPTIONAL{wd:[entity:Wikiquote] rdfs:label ?quote .\nFILTER(LANG(?quote)=?lang)}\nOPTIONAL{wd:[entity:Wikisource] rdfs:label ?source .\nFILTER(LANG(?source)=?lang)}\nOPTIONAL{wd:[entity:Wikiversity] rdfs:label ?versity .\nFILTER(LANG(?versity)=?lang)}\nOPTIONAL{wd:[entity:Wikivoyage] rdfs:label ?voyage .\nFILTER(LANG(?voyage)=?lang)}\nOPTIONAL{wd:[entity:Wiktionary] rdfs:label ?tionary .\nFILTER(LANG(?tionary)=?lang)}\nOPTIONAL{wd:[entity:Wikispecies] rdfs:label ?species .\nFILTER(LANG(?species)=?lang)}\n?tongueitem rdfs:label ?tongue .\nFILTER(LANG(?tongue)=?lang)\n}",
    "complexity": "complex"
  },
  {
    "id": "2464",
    "instruction": "What are the things depicted in art works of the Khalili Collections?",
    "query": "SELECT (?link as ?q) (?nameplusdesc AS ?qLabel) (SAMPLE(?image) AS ?img) WHERE {\n?work wdt:P195/wdt:P361 wd:Q63160499; wdt:P18 ?image ; wdt:P973 ?link; wdt:P180 ?depicted.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\".\n?depicted rdfs:label ?name . ?depicted schema:description ?desc }\nBIND(IF(BOUND(?desc), CONCAT(?name, \", \", ?desc), ?name) AS ?nameplusdesc)\n} GROUP BY ?link ?nameplusdesc\nORDER BY UCASE(?qLabel)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT (?link as ?q) (?nameplusdesc AS ?qLabel) (SAMPLE(?image) AS ?img) WHERE {\n?work wdt:[property:collection]/wdt:[property:part of] wd:[entity:Khalili Collections]; wdt:[property:image] ?image ; wdt:[property:described at URL] ?link; wdt:[property:image]0 ?depicted.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\".\n?depicted rdfs:label ?name . ?depicted schema:description ?desc }\nBIND(IF(BOUND(?desc), CONCAT(?name, \", \", ?desc), ?name) AS ?nameplusdesc)\n} GROUP BY ?link ?nameplusdesc\nORDER BY UCASE(?qLabel)",
    "complexity": "complex"
  },
  {
    "id": "1369",
    "instruction": "What are the ingredients of popular cocktails?",
    "query": "SELECT ?cocktail ?cocktailLabel (GROUP_CONCAT(?_ingredientLabel; separator=\", \") AS ?ingredients) (COUNT(DISTINCT(?_ingredientLabel)) AS ?n_ingredients) ?pic\nWHERE\n{\n?cocktail wdt:P31/wdt:P279* wd:Q134768 .\nOPTIONAL {\n?cocktail wdt:P18 ?pic\n}\n?cocktail wdt:P186 ?ingredient .\n?ingredient rdfs:label ?_ingredientLabel\nFILTER((LANG(?_ingredientLabel)) = \"en\")\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}\nGROUP BY ?cocktail ?cocktailLabel ?pic\nORDER BY DESC(?n_ingredients)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?cocktail ?cocktailLabel (GROUP_CONCAT(?_ingredientLabel; separator=\", \") AS ?ingredients) (COUNT(DISTINCT(?_ingredientLabel)) AS ?n_ingredients) ?pic\nWHERE\n{\n?cocktail wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:cocktail] .\nOPTIONAL {\n?cocktail wdt:[property:image] ?pic\n}\n?cocktail wdt:[property:image]6 ?ingredient .\n?ingredient rdfs:label ?_ingredientLabel\nFILTER((LANG(?_ingredientLabel)) = \"en\")\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}\nGROUP BY ?cocktail ?cocktailLabel ?pic\nORDER BY DESC(?n_ingredients)",
    "complexity": "complex"
  },
  {
    "id": "295",
    "instruction": "List all astrolabes with their inception dates.",
    "query": "SELECT ?item (?thingLabel as ?itemLabel) ?d ?collectionLabel ?inception WHERE {\n?thing wdt:P31 wd:Q164992; wdt:P195 ?collection; wdt:P217 ?d; wdt:P571 ?inception\nOPTIONAL {?thing wdt:P973 ?url}\nBIND (IF(BOUND(?url),?url, URI(CONCAT(\"https://tools.wmflabs.org/reasonator/?q=\", substr(str(?thing),32))) ) AS ?item)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". ?thing rdfs:label ?thingLabel. ?collection rdfs:label ?collectionLabel}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item (?thingLabel as ?itemLabel) ?d ?collectionLabel ?inception WHERE {\n?thing wdt:[property:instance of] wd:[entity:astrolabe]; wdt:[property:collection] ?collection; wdt:[property:inventory number] ?d; wdt:[property:inception] ?inception\nOPTIONAL {?thing wdt:[property:described at URL] ?url}\nBIND (IF(BOUND(?url),?url, URI(CONCAT(\"https://tools.wmflabs.org/reasonator/?q=\", substr(str(?thing),32))) ) AS ?item)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". ?thing rdfs:label ?thingLabel. ?collection rdfs:label ?collectionLabel}\n}",
    "complexity": "complex"
  },
  {
    "id": "269",
    "instruction": "Find Wikipedia articles about items in the Ashmolean Museum and list their corresponding external links.",
    "query": "SELECT ?itempage ?extlink ?url ?ash_id WHERE {\n{SELECT DISTINCT ?name ?item ?itempage WHERE {\n?item wdt:P195 wd:Q636400. # items in the Ashmolean\n?itempage schema:about ?item;\nschema:isPartOf <https://en.wikipedia.org/>; # ENWP articles about them\nschema:name ?name # Title of article\n}\n}\nOPTIONAL {SERVICE wikibase:mwapi { # External links from each article\nbd:serviceParam wikibase:api \"Generator\";\nwikibase:endpoint \"en.wikipedia.org\";\nmwapi:generator \"allpages\";\nmwapi:gapfrom ?name;\nmwapi:gapto ?name;\nmwapi:prop \"extlinks\";\nmwapi:ellimit 50 .\n?extlink wikibase:apiOutput \"extlinks/el/text()\".\n}\nFILTER CONTAINS(?extlink, \"ashmolean.org\")\n}\nOPTIONAL {?item wdt:P973 ?url FILTER CONTAINS(STR(?url), \"ashmolean.org\")\n}\nOPTIONAL {?item wdt:P6610 ?ash_id}\n} ORDER BY ?itempage",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?itempage ?extlink ?url ?ash_id WHERE {\n{SELECT DISTINCT ?name ?item ?itempage WHERE {\n?item wdt:[property:collection] wd:[entity:Ashmolean Museum]. # items in the Ashmolean\n?itempage schema:about ?item;\nschema:isPartOf <https://en.wikipedia.org/>; # ENWP articles about them\nschema:name ?name # Title of article\n}\n}\nOPTIONAL {SERVICE wikibase:mwapi { # External links from each article\nbd:serviceParam wikibase:api \"Generator\";\nwikibase:endpoint \"en.wikipedia.org\";\nmwapi:generator \"allpages\";\nmwapi:gapfrom ?name;\nmwapi:gapto ?name;\nmwapi:prop \"extlinks\";\nmwapi:ellimit 50 .\n?extlink wikibase:apiOutput \"extlinks/el/text()\".\n}\nFILTER CONTAINS(?extlink, \"ashmolean.org\")\n}\nOPTIONAL {?item wdt:[property:described at URL] ?url FILTER CONTAINS(STR(?url), \"ashmolean.org\")\n}\nOPTIONAL {?item wdt:[property:Ashmolean museum ID] ?ash_id}\n} ORDER BY ?itempage",
    "complexity": "complex"
  },
  {
    "id": "2680",
    "instruction": "Find the most recent date that has not been used as a birthday or death anniversary.",
    "query": "SELECT ?date\nWITH {\nSELECT ?date WHERE {\nwd:Q47150325 ^wdt:P31 [wdt:P585 ?date] .\nFILTER(xsd:date(?date) < xsd:date(NOW()))\n}\n} AS %results1\nWITH {\nSELECT ?date WHERE {\nINCLUDE %results1.\nMINUS{[] ps:P570 ?date .}\n}\n} AS %results2\nWHERE {\nINCLUDE %results2.\nMINUS{[] ps:P569 ?date .}\n} ORDER BY DESC(?date) LIMIT 1",
    "annotated": "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?date\nWITH {\nSELECT ?date WHERE {\nwd:[entity:calendar day of a given year] ^wdt:[property:instance of] [wdt:[property:point in time] ?date] .\nFILTER(xsd:date(?date) < xsd:date(NOW()))\n}\n} AS %results1\nWITH {\nSELECT ?date WHERE {\nINCLUDE %results1.\nMINUS{[] ps:[property:date of death] ?date .}\n}\n} AS %results2\nWHERE {\nINCLUDE %results2.\nMINUS{[] ps:[property:date of birth] ?date .}\n} ORDER BY DESC(?date) LIMIT 1",
    "complexity": "complex"
  },
  {
    "id": "2760",
    "instruction": "Find the locations where Wikidata's 10th birthday events are taking place.",
    "query": "SELECT ?location ?locationLabel ?coord ?date ?timeLabel ?page\nWHERE {\nwd:Q113121949 p:P276 ?statement.\n?statement ps:P276 ?location.\n?location wdt:P625 ?coord.\n?statement pq:P585 ?date.\nOPTIONAL {\n?statement pq:P4241 ?time.\n?statement pq:P856 ?page.\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?location ?locationLabel ?coord ?date ?timeLabel ?page\nWHERE {\nwd:[entity:Wikidata's 10th birthday] p:[property:location] ?statement.\n?statement ps:[property:location] ?location.\n?location wdt:[property:coordinate location] ?coord.\n?statement pq:[property:point in time] ?date.\nOPTIONAL {\n?statement pq:[property:refine date] ?time.\n?statement pq:[property:official website] ?page.\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "1769",
    "instruction": "List the parents and children who both held governor mandates in the USA.",
    "query": "SELECT ?parentLabel ?parentStateLabel ?childLabel ?childStateLabel ?childDOB WHERE {\n?parent wdt:P40 ?child.\n?child wdt:P569 ?childDOB.\n?parent wdt:P39 ?parentOffice.\n?parentOffice wdt:P279 wd:Q889821.\n?parentOffice wdt:P361 ?parentGovt.\n?parentGovt wdt:P1001 ?parentState.\n?parentState wdt:P31 wd:Q35657.\n?child wdt:P39 ?childOffice.\n?childOffice wdt:P279 wd:Q889821.\n?childOffice wdt:P361 ?childGovt.\n?childGovt wdt:P1001 ?childState.\n?childState wdt:P31 wd:Q35657.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE]\". }\n} ORDER BY ?childDOB",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?parentLabel ?parentStateLabel ?childLabel ?childStateLabel ?childDOB WHERE {\n?parent wdt:[property:child] ?child.\n?child wdt:[property:date of birth] ?childDOB.\n?parent wdt:[property:position held] ?parentOffice.\n?parentOffice wdt:[property:subclass of] wd:[entity:governor].\n?parentOffice wdt:[property:part of] ?parentGovt.\n?parentGovt wdt:[property:applies to jurisdiction] ?parentState.\n?parentState wdt:[property:instance of] wd:[entity:U.S. state].\n?child wdt:[property:position held] ?childOffice.\n?childOffice wdt:[property:subclass of] wd:[entity:governor].\n?childOffice wdt:[property:part of] ?childGovt.\n?childGovt wdt:[property:applies to jurisdiction] ?childState.\n?childState wdt:[property:instance of] wd:[entity:U.S. state].\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE]\". }\n} ORDER BY ?childDOB",
    "complexity": "complex"
  },
  {
    "id": "1933",
    "instruction": "Find the locations where infectious diseases were published in Die Gartenlaube during the 19th century.",
    "query": "SELECT ?Die_Gartenlaube ?Die_GartenlaubeLabel ?schlagwort1Label ?schlagwort2Label ?coords WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n{\nSELECT * WHERE {\n?Die_Gartenlaube wdt:P1433 wd:Q655617;\nwdt:P921 ?schlagwort1;\nwdt:P921 ?schlagwort2.\n}\n}\n{ SELECT * WHERE { ?schlagwort1 wdt:P31 wd:Q12136. } }\n{ SELECT * WHERE { ?schlagwort2 wdt:P625 ?coords. }}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?Die_Gartenlaube ?Die_GartenlaubeLabel ?schlagwort1Label ?schlagwort2Label ?coords WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n{\nSELECT * WHERE {\n?Die_Gartenlaube wdt:[property:published in] wd:[entity:Die Gartenlaube];\nwdt:[property:main subject] ?schlagwort1;\nwdt:[property:main subject] ?schlagwort2.\n}\n}\n{ SELECT * WHERE { ?schlagwort1 wdt:[property:instance of] wd:[entity:disease]. } }\n{ SELECT * WHERE { ?schlagwort2 wdt:[property:coordinate location] ?coords. }}\n}",
    "complexity": "complex"
  },
  {
    "id": "123",
    "instruction": "What jobs have US senators held besides being a politician?",
    "query": "SELECT (COUNT(?sen) AS ?sens) ?job ?jobLabel\nWHERE {\n?sen wdt:P39 wd:Q4416090;\nwdt:P106 ?job.\nFILTER (?job not in (wd:Q82955, wd:Q4416090) )\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} GROUP BY ?job ?jobLabel\nORDER BY DESC(?sen)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT (COUNT(?sen) AS ?sens) ?job ?jobLabel\nWHERE {\n?sen wdt:[property:position held] wd:[entity:United States senator];\nwdt:[property:occupation] ?job.\nFILTER (?job not in (wd:[entity:politician], wd:[entity:United States senator]) )\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} GROUP BY ?job ?jobLabel\nORDER BY DESC(?sen)",
    "complexity": "complex"
  }
]