[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "1326",
    "instruction": "What are the Grade I listed buildings in Bedfordshire?",
    "query": "SELECT DISTINCT ?item ?itemLabel ?class ?commonscat ?img ?layer (SAMPLE(?coord) AS ?coord) WHERE {\nhint:Query hint:optimizer \"None\" .\n?item wdt:P131+ wd:Q23143 ; wdt:P1435 wd:Q15700818 ; wdt:P31?/wdt:P279* wd:Q41176\nOPTIONAL {\n?item wdt:P373 ?commonscat\n}\nOPTIONAL {\n?item wdt:P279 [] .\nBIND('class' AS ?class) .\n}\nOPTIONAL {\n?item wdt:P625 ?coord\n}\nOPTIONAL {\n?item wdt:P18 ?img .\n}\nBIND(IF(bound(?img),'image','no image') AS ?layer) .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} GROUP BY ?item ?itemLabel ?class ?commonscat ?img ?layer\nORDER BY DESC(?class) ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX hint: <http://www.bigdata.com/queryHints#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?class ?commonscat ?img ?layer (SAMPLE(?coord) AS ?coord) WHERE {\nhint:Query hint:optimizer \"None\" .\n?item wdt:[property:located in the administrative territorial entity]+ wd:[entity:Bedfordshire] ; wdt:[property:heritage designation] wd:[entity:Grade I listed building] ; wdt:[property:instance of]?/wdt:[property:subclass of]* wd:[entity:building]\nOPTIONAL {\n?item wdt:[property:Commons category] ?commonscat\n}\nOPTIONAL {\n?item wdt:[property:subclass of] [] .\nBIND('class' AS ?class) .\n}\nOPTIONAL {\n?item wdt:[property:coordinate location] ?coord\n}\nOPTIONAL {\n?item wdt:[property:image] ?img .\n}\nBIND(IF(bound(?img),'image','no image') AS ?layer) .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} GROUP BY ?item ?itemLabel ?class ?commonscat ?img ?layer\nORDER BY DESC(?class) ?itemLabel",
    "complexity": "complex"
  },
  {
    "id": "1203",
    "instruction": "List people who were born farthest from where they studied.",
    "query": "SELECT ?person ?personLabel ?personDescription ?placeOfBirthLabel ?educatedAtLabel (MAX(?distance) AS ?distance) WITH {\nSELECT ?person ?placeOfBirth ?educatedAt ?distance WHERE {\n?person wdt:P31 wd:Q5;\nwdt:P569 ?dateOfBirth;\nwdt:P19 ?placeOfBirth;\nwdt:P69 ?educatedAt.\n?placeOfBirth wdt:P625 ?placeOfBirthCoordinates.\n?educatedAt wdt:P625 ?educatedAtCoordinates.\nBIND(geof:distance(?placeOfBirthCoordinates, ?educatedAtCoordinates) AS ?distance).\n}\nORDER BY DESC(?distance)\nLIMIT 50\n} AS %results WHERE {\nINCLUDE %results.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nGROUP BY ?person ?personLabel ?personDescription ?placeOfBirthLabel ?educatedAtLabel\nORDER BY DESC(?distance)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?person ?personLabel ?personDescription ?placeOfBirthLabel ?educatedAtLabel (MAX(?distance) AS ?distance) WITH {\nSELECT ?person ?placeOfBirth ?educatedAt ?distance WHERE {\n?person wdt:[property:instance of] wd:[entity:human];\nwdt:[property:date of birth] ?dateOfBirth;\nwdt:[property:place of birth] ?placeOfBirth;\nwdt:[property:educated at] ?educatedAt.\n?placeOfBirth wdt:[property:coordinate location] ?placeOfBirthCoordinates.\n?educatedAt wdt:[property:coordinate location] ?educatedAtCoordinates.\nBIND(geof:distance(?placeOfBirthCoordinates, ?educatedAtCoordinates) AS ?distance).\n}\nORDER BY DESC(?distance)\nLIMIT 50\n} AS %results WHERE {\nINCLUDE %results.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nGROUP BY ?person ?personLabel ?personDescription ?placeOfBirthLabel ?educatedAtLabel\nORDER BY DESC(?distance)",
    "complexity": "complex"
  },
  {
    "id": "118",
    "instruction": "List the educational institutions attended by UK Members of Parliament.",
    "query": "SELECT (COUNT(?mp) AS ?mps) ?education ?educationLabel ?educationDescription\nWHERE {\n?mp wdt:P39 wd:Q16707842;\nwdt:P69 ?education.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} GROUP BY ?education ?educationLabel ?educationDescription\nORDER BY DESC(?mps)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT (COUNT(?mp) AS ?mps) ?education ?educationLabel ?educationDescription\nWHERE {\n?mp wdt:[property:position held] wd:[entity:Member of Parliament];\nwdt:[property:educated at] ?education.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} GROUP BY ?education ?educationLabel ?educationDescription\nORDER BY DESC(?mps)",
    "complexity": "complex"
  },
  {
    "id": "1181",
    "instruction": "List all references that only have a quote and no other properties.",
    "query": "SELECT ?statement ?reference ?quote\nWITH {\nSELECT ?reference WHERE {\n?statement prov:wasDerivedFrom ?reference.\n?reference pr:P1683 ?quote;\n?pr [].\n}\nGROUP BY ?reference\nHAVING(COUNT(DISTINCT ?pr) = 1)\n} AS %references\nWHERE {\nINCLUDE %references.\n?statement prov:wasDerivedFrom ?reference.\n?reference pr:P1683 ?quote.\n}",
    "annotated": "PREFIX prov: <http://www.w3.org/ns/prov#>\nPREFIX pr: <http://www.wikidata.org/prop/reference/>\n\nSELECT ?statement ?reference ?quote\nWITH {\nSELECT ?reference WHERE {\n?statement prov:wasDerivedFrom ?reference.\n?reference pr:[property:quotation] ?quote;\n?pr [].\n}\nGROUP BY ?reference\nHAVING(COUNT(DISTINCT ?pr) = 1)\n} AS %references\nWHERE {\nINCLUDE %references.\n?statement prov:wasDerivedFrom ?reference.\n?reference pr:[property:quotation] ?quote.\n}",
    "complexity": "complex"
  },
  {
    "id": "2185",
    "instruction": "Show the number of deaths in the UK per month since 2005, separated by gender.",
    "query": "SELECT ?deathYYYY_MM (COUNT(?gender) AS ?count) ?genderLabel WHERE {\n?human wdt:P31 wd:Q5 .\n?human wdt:P27 wd:Q145 .\n?human wdt:P21 ?gender .\n?human p:P570 [\na wikibase:BestRank ;\npsv:P570 [\nwikibase:timeValue ?dateOfDeath ;\nwikibase:timePrecision ?precision\n]\n]\nFILTER (?precision >= 10 ) # month precision or better\nBIND(YEAR(?dateOfDeath) as ?year) .\nBIND(MONTH(?dateOfDeath) as ?month) .\nBIND ( IF(?month < 10, CONCAT(\"0\",STR(?month) ), STR(?month)) AS ?MM)\nBIND(CONCAT(STR(?year), \"-\", ?MM) as ?deathYYYY_MM).\nFILTER (?year >= 2005)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?deathYYYY_MM ?genderLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?deathYYYY_MM (COUNT(?gender) AS ?count) ?genderLabel WHERE {\n?human wdt:[property:instance of] wd:[entity:human] .\n?human wdt:[property:country of citizenship] wd:[entity:United Kingdom] .\n?human wdt:[property:sex or gender] ?gender .\n?human p:[property:date of death] [\na wikibase:BestRank ;\npsv:[property:date of death] [\nwikibase:timeValue ?dateOfDeath ;\nwikibase:timePrecision ?precision\n]\n]\nFILTER (?precision >= 10 ) # month precision or better\nBIND(YEAR(?dateOfDeath) as ?year) .\nBIND(MONTH(?dateOfDeath) as ?month) .\nBIND ( IF(?month < 10, CONCAT(\"0\",STR(?month) ), STR(?month)) AS ?MM)\nBIND(CONCAT(STR(?year), \"-\", ?MM) as ?deathYYYY_MM).\nFILTER (?year >= 2005)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?deathYYYY_MM ?genderLabel",
    "complexity": "complex"
  },
  {
    "id": "2422",
    "instruction": "Find French labels of Wikidata items that are the same as their male form but different from their female form.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?femaleform ?maleform ?lang WHERE {\nwd:Q12737077 (^(wdt:P279*)/^wdt:P31) ?item.\n?item wdt:P2521 ?femaleform;\nwdt:P3321 ?maleform;\nrdfs:label ?itemLabel.\nBIND(LANG(?itemLabel) AS ?lang)\nFILTER((LANG(?itemLabel)) = \"fr\")\nFILTER((LANG(?femaleform)) = ?lang)\nFILTER((LANG(?maleform)) = ?lang)\nFILTER(?itemLabel = ?maleform)\nFILTER(?itemLabel != ?femaleform)\n}\nORDER BY ?item\nLIMIT 100",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT DISTINCT ?item ?itemLabel ?femaleform ?maleform ?lang WHERE {\nwd:[entity:occupation] (^(wdt:[property:subclass of]*)/^wdt:[property:instance of]) ?item.\n?item wdt:[property:female form of label] ?femaleform;\nwdt:[property:male form of label] ?maleform;\nrdfs:label ?itemLabel.\nBIND(LANG(?itemLabel) AS ?lang)\nFILTER((LANG(?itemLabel)) = \"fr\")\nFILTER((LANG(?femaleform)) = ?lang)\nFILTER((LANG(?maleform)) = ?lang)\nFILTER(?itemLabel = ?maleform)\nFILTER(?itemLabel != ?femaleform)\n}\nORDER BY ?item\nLIMIT 100",
    "complexity": "complex"
  },
  {
    "id": "1776",
    "instruction": "How many English words start with each letter of the alphabet?",
    "query": "SELECT ?firstLetter (COUNT(?form) AS ?count ) WHERE {\n?lexeme a ontolex:LexicalEntry ; dct:language ?language ; ontolex:lexicalForm ?form .\n?form ontolex:representation ?word .\n?language wdt:P218 'en' .\nBIND ( SUBSTR(UCASE(STR(?word)), 1, 1) AS ?firstLetter )\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?firstLetter\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX dct: <http://purl.org/dc/terms/>\nPREFIX ontolex: <http://www.w3.org/ns/lemon/ontolex#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?firstLetter (COUNT(?form) AS ?count ) WHERE {\n?lexeme a ontolex:LexicalEntry ; dct:language ?language ; ontolex:lexicalForm ?form .\n?form ontolex:representation ?word .\n?language wdt:[property:ISO 639-1 code] 'en' .\nBIND ( SUBSTR(UCASE(STR(?word)), 1, 1) AS ?firstLetter )\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?firstLetter\nORDER BY DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "1025",
    "instruction": "List the flags of sovereign states along with their proportions.",
    "query": "SELECT ?item ?itemLabel ?countryLabel ?height ?width ?ratio ?image WHERE {\n?item wdt:P31 wd:Q186516 .\n?item wdt:P1001 ?country .\n?country wdt:P31 wd:Q3624078 .\nFILTER NOT EXISTS { ?country wdt:P576 ?x }\n?item wdt:P18 ?image .\n?item p:P2048 ?statement .\n?statement ps:P2048 ?height .\n{ ?statement pq:P2049 ?width . } UNION { FILTER NOT EXISTS { ?statement pq:P2049 ?y } . ?item wdt:P2049 ?width . }\nBIND (?width / ?height AS ?ratio)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} ORDER BY ?ratio ?countryLabel ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?countryLabel ?height ?width ?ratio ?image WHERE {\n?item wdt:[property:instance of] wd:[entity:national flag] .\n?item wdt:[property:applies to jurisdiction] ?country .\n?country wdt:[property:instance of] wd:[entity:sovereign state] .\nFILTER NOT EXISTS { ?country wdt:[property:dissolved, abolished or demolished date] ?x }\n?item wdt:[property:image] ?image .\n?item p:[property:height] ?statement .\n?statement ps:[property:height] ?height .\n{ ?statement pq:[property:width] ?width . } UNION { FILTER NOT EXISTS { ?statement pq:[property:width] ?y } . ?item wdt:[property:width] ?width . }\nBIND (?width / ?height AS ?ratio)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} ORDER BY ?ratio ?countryLabel ?itemLabel",
    "complexity": "complex"
  },
  {
    "id": "2258",
    "instruction": "What railway stations are connected to Topsham station?",
    "query": "SELECT ?station ?stationLabel ?cds ?line ?trackLabel ?track ?image {\n{SELECT * {\nSERVICE gas:service {\ngas:program gas:gasClass \"com.bigdata.rdf.graph.analytics.BFS\" ; gas:in wd:Q1990205 ; gas:linkType wdt:P197 ; gas:out ?station ; gas:out1 ?depth ; gas:out2 ?pred . }\nFILTER(?station != wd:Q1990205)\n?station wdt:P625 ?cds ;\nwdt:P17 wd:Q145 .\n?station p:P197 ?adjST .\n?adjST ps:P197 ?adj ;\npq:P81 ?track .\n?adj p:P625/psv:P625/wikibase:geoLatitude ?lat1 ; p:P625/psv:P625/wikibase:geoLongitude ?lon1 .\n?station p:P625/psv:P625/wikibase:geoLatitude ?lat2 ; p:P625/psv:P625/wikibase:geoLongitude ?lon2 .\nBIND(CONCAT('LINESTRING(', STR(?lon1), ' ', STR(?lat1), ',', STR(?lon2), ' ', STR(?lat2), ')') AS ?str) . BIND(STRDT(?str, geo:wktLiteral) AS ?line)}\n}\nOPTIONAL { ?station wdt:P18 ?image .}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\nPREFIX gas: <http://www.bigdata.com/rdf/gas#>\n\nSELECT ?station ?stationLabel ?cds ?line ?trackLabel ?track ?image {\n{SELECT * {\nSERVICE gas:service {\ngas:program gas:gasClass \"com.bigdata.rdf.graph.analytics.BFS\" ; gas:in wd:[entity:Topsham railway station] ; gas:linkType wdt:[property:adjacent station] ; gas:out ?station ; gas:out1 ?depth ; gas:out2 ?pred . }\nFILTER(?station != wd:[entity:Topsham railway station])\n?station wdt:[property:coordinate location] ?cds ;\nwdt:[property:country] wd:[entity:United Kingdom] .\n?station p:[property:adjacent station] ?adjST .\n?adjST ps:[property:adjacent station] ?adj ;\npq:[property:connecting line] ?track .\n?adj p:[property:coordinate location]/psv:[property:coordinate location]/wikibase:geoLatitude ?lat1 ; p:[property:coordinate location]/psv:[property:coordinate location]/wikibase:geoLongitude ?lon1 .\n?station p:[property:coordinate location]/psv:[property:coordinate location]/wikibase:geoLatitude ?lat2 ; p:[property:coordinate location]/psv:[property:coordinate location]/wikibase:geoLongitude ?lon2 .\nBIND(CONCAT('LINESTRING(', STR(?lon1), ' ', STR(?lat1), ',', STR(?lon2), ' ', STR(?lat2), ')') AS ?str) . BIND(STRDT(?str, geo:wktLiteral) AS ?line)}\n}\nOPTIONAL { ?station wdt:[property:image] ?image .}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "1220",
    "instruction": "List all newspapers in Oregon with their publication locations.",
    "query": "SELECT DISTINCT ?p ?pLabel ?usnpl ?coords WHERE {\n?c wdt:P279* wd:Q11032 .\n?p wdt:P31 ?c .\n{\n?p wdt:P17 wd:Q30 .\n} UNION {\n?p wdt:P495 wd:Q30 .\n}\nOPTIONAL {?p wdt:P5454 ?usnpl.} # usnpl (option)\n?p wdt:P291 ?place .\n?place wdt:P625 ?coords.\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?p ?pLabel ?usnpl ?coords WHERE {\n?c wdt:[property:subclass of]* wd:[entity:newspaper] .\n?p wdt:[property:instance of] ?c .\n{\n?p wdt:[property:country] wd:[entity:United States of America] .\n} UNION {\n?p wdt:[property:country of origin] wd:[entity:United States of America] .\n}\nOPTIONAL {?p wdt:[property:USNPL ID] ?usnpl.} # usnpl (option)\n?p wdt:[property:place of publication] ?place .\n?place wdt:[property:coordinate location] ?coords.\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n}",
    "complexity": "complex"
  },
  {
    "id": "2671",
    "instruction": "Show me a map of all driverless rapid transit railway lines around the world.",
    "query": "SELECT ?st ?stLabel ?sl ?coords ?line ?layer ?rgb WHERE {\n?search (wdt:P31/wdt:P279*) wd:Q5503;wdt:P527 ?lignes.\n?lignes wdt:P559 ?termini;(wdt:P31/wdt:P279*) wd:Q107343049.\n?st (wdt:P31/wdt:P279*) wd:Q928830;wdt:P16 ?search;wdt:P625 ?coords;(wdt:P81|wdt:P1192) ?sl;wdt:P197 ?pred;p:P197[ps:P197 ?pred;pq:P5051 ?towards;(pq:P81|pq:P1192) ?line_pq].\n?pred wdt:P625 ?coords_pred;(wdt:P81|wdt:P1192) ?sl_pred.\nFILTER(?sl_pred = ?lignes)FILTER(?sl = ?lignes)FILTER(?towards = ?termini)\n?st wdt:P5817 wd:Q55654238.\n?pred wdt:P5817 wd:Q55654238.\n?lignes wdt:P5817 wd:Q55654238.\n?pred p:P625[psv:P625[wikibase:geoLatitude ?lat1;wikibase:geoLongitude ?lon1]; rdf:type wikibase:BestRank].\n?st p:P625[psv:P625[wikibase:geoLatitude ?lat2;wikibase:geoLongitude ?lon2]; rdf:type wikibase:BestRank].\nBIND(STRDT(CONCAT(\"LINESTRING(\",STR(?lon1),\" \",STR(?lat1),\",\",STR(?lon2),\" \",STR(?lat2),\")\"),geo:wktLiteral)AS ?line)\nOPTIONAL{?sl wdt:P465 ?rgb.}\nSERVICE wikibase:label{bd:serviceParam wikibase:language \"en\". ?sl rdfs:label ?layer. ?st rdfs:label ?stLabel}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?st ?stLabel ?sl ?coords ?line ?layer ?rgb WHERE {\n?search (wdt:[property:instance of]/wdt:[property:subclass of]*) wd:[entity:rapid transit];wdt:[property:has part(s)] ?lignes.\n?lignes wdt:[property:terminus] ?termini;(wdt:[property:instance of]/wdt:[property:subclass of]*) wd:[entity:automated rapid transit railway line].\n?st (wdt:[property:instance of]/wdt:[property:subclass of]*) wd:[entity:metro station];wdt:[property:transport network] ?search;wdt:[property:coordinate location] ?coords;(wdt:[property:connecting line]|wdt:[property:connecting service]) ?sl;wdt:[property:adjacent station] ?pred;p:[property:adjacent station][ps:[property:adjacent station] ?pred;pq:[property:towards] ?towards;(pq:[property:connecting line]|pq:[property:connecting service]) ?line_pq].\n?pred wdt:[property:coordinate location] ?coords_pred;(wdt:[property:connecting line]|wdt:[property:connecting service]) ?sl_pred.\nFILTER(?sl_pred = ?lignes)FILTER(?sl = ?lignes)FILTER(?towards = ?termini)\n?st wdt:[property:state of use] wd:[entity:in use].\n?pred wdt:[property:state of use] wd:[entity:in use].\n?lignes wdt:[property:state of use] wd:[entity:in use].\n?pred p:[property:coordinate location][psv:[property:coordinate location][wikibase:geoLatitude ?lat1;wikibase:geoLongitude ?lon1]; rdf:type wikibase:BestRank].\n?st p:[property:coordinate location][psv:[property:coordinate location][wikibase:geoLatitude ?lat2;wikibase:geoLongitude ?lon2]; rdf:type wikibase:BestRank].\nBIND(STRDT(CONCAT(\"LINESTRING(\",STR(?lon1),\" \",STR(?lat1),\",\",STR(?lon2),\" \",STR(?lat2),\")\"),geo:wktLiteral)AS ?line)\nOPTIONAL{?sl wdt:[property:sRGB color hex triplet] ?rgb.}\nSERVICE wikibase:label{bd:serviceParam wikibase:language \"en\". ?sl rdfs:label ?layer. ?st rdfs:label ?stLabel}\n}",
    "complexity": "complex"
  },
  {
    "id": "1497",
    "instruction": "What are the first UNESCO World Heritage Sites registered for each country?",
    "query": "SELECT DISTINCT ?item ?itemLabel ?countryLabel (YEAR(?date) AS ?year) ?coords ?image WHERE {\n{\nSELECT (MIN(?date) AS ?date) ?country WHERE {\n?item p:P1435 ?statement ;\nwdt:P17 ?country .\n?statement ps:P1435 wd:Q9259 ;\npq:P580 ?date .\n}\nGROUP BY ?country\n}\n?item p:P1435 ?statement ;\nwdt:P17 ?country ;\nwdt:P625 ?coords .\nOPTIONAL { ?item wdt:P18 ?image }\n?statement ps:P1435 wd:Q9259 ;\npq:P580 ?date .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,fr\" . }\n} ORDER BY ?countryLabel ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?countryLabel (YEAR(?date) AS ?year) ?coords ?image WHERE {\n{\nSELECT (MIN(?date) AS ?date) ?country WHERE {\n?item p:[property:heritage designation] ?statement ;\nwdt:[property:country] ?country .\n?statement ps:[property:heritage designation] wd:[entity:World Heritage Site] ;\npq:[property:start time] ?date .\n}\nGROUP BY ?country\n}\n?item p:[property:heritage designation] ?statement ;\nwdt:[property:country] ?country ;\nwdt:[property:coordinate location] ?coords .\nOPTIONAL { ?item wdt:[property:image] ?image }\n?statement ps:[property:heritage designation] wd:[entity:World Heritage Site] ;\npq:[property:start time] ?date .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,fr\" . }\n} ORDER BY ?countryLabel ?itemLabel",
    "complexity": "complex"
  },
  {
    "id": "2547",
    "instruction": "What are the launch dates of popular social media services?",
    "query": "SELECT ?medsos ?medsosLabel ?vp571 ?diluncurkan (SAMPLE(?logo) AS ?logo2) ?ditutup ?situs WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"id,en\". }\n?medsos wdt:P31 wd:Q3220391.\nOPTIONAL { ?medsos wdt:P571 ?vp571.\nBIND(YEAR(?vp571) AS ?diluncurkan) }\nOPTIONAL { ?medsos wdt:P154 ?logo. }\nOPTIONAL { ?medsos wdt:P582 ?vp582.\nBIND(YEAR(?vp582) AS ?ditutup)}\nOPTIONAL { ?medsos wdt:P856 ?situs. }\n}\nGROUP BY ?medsos ?medsosLabel ?vp571 ?diluncurkan ?ditutup ?situs\n#defaultView:Timeline\n#view:Timeline{\"hide\": \"?vp571\"}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?medsos ?medsosLabel ?vp571 ?diluncurkan (SAMPLE(?logo) AS ?logo2) ?ditutup ?situs WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"id,en\". }\n?medsos wdt:[property:instance of] wd:[entity:social networking service].\nOPTIONAL { ?medsos wdt:[property:inception] ?vp571.\nBIND(YEAR(?vp571) AS ?diluncurkan) }\nOPTIONAL { ?medsos wdt:[property:logo image] ?logo. }\nOPTIONAL { ?medsos wdt:[property:end time] ?vp582.\nBIND(YEAR(?vp582) AS ?ditutup)}\nOPTIONAL { ?medsos wdt:[property:official website] ?situs. }\n}\nGROUP BY ?medsos ?medsosLabel ?vp571 ?diluncurkan ?ditutup ?situs\n#defaultView:Timeline\n#view:Timeline{\"hide\": \"?vp571\"}",
    "complexity": "complex"
  },
  {
    "id": "1019",
    "instruction": "List all non-deprecated statements with a reason for deprecation rank.",
    "query": "SELECT ?subject ?subjectLabel ?predicateLabel ?objectLabel ?reasonLabel (SUBSTR(STR(?rank), 27) AS ?rankLabel) WHERE {\n?subject ?p [\n?ps ?object;\npq:P2241 ?reason;\nwikibase:rank ?rank\n].\nFILTER(?rank != wikibase:DeprecatedRank).\n?predicate wikibase:claim ?p;\nwikibase:statementProperty ?ps.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nORDER BY ?rank",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?subject ?subjectLabel ?predicateLabel ?objectLabel ?reasonLabel (SUBSTR(STR(?rank), 27) AS ?rankLabel) WHERE {\n?subject ?p [\n?ps ?object;\npq:[property:reason for deprecated rank] ?reason;\nwikibase:rank ?rank\n].\nFILTER(?rank != wikibase:DeprecatedRank).\n?predicate wikibase:claim ?p;\nwikibase:statementProperty ?ps.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nORDER BY ?rank",
    "complexity": "complex"
  },
  {
    "id": "1947",
    "instruction": "List the Open Science Fellows along with their details.",
    "query": "SELECT\n?year ?fellow ?fellowLabel ?fellowDescription ?image ?orcid ?twitter ?github ?homepage ?wikimedia\nWHERE {\n?fellow p:P166 ?award_statement .\n?award_statement ps:P166 wd:Q42092479 .\nOPTIONAL {\n?award_statement pq:P580 ?time\nBIND(YEAR(?time) AS ?year)\n}\nOPTIONAL { ?fellow wdt:P18 ?image }\nOPTIONAL {\n?fellow wdt:P496 ?orcid_id\nBIND(URI(CONCAT(\"https://orcid.org/\",?orcid_id)) AS ?orcid)\n}\nOPTIONAL {\n?fellow wdt:P2037 ?github_name\nBIND(URI(CONCAT(\"https://github.com/\",?github_name)) AS ?github)\n}\nOPTIONAL {\n?fellow wdt:P2002 ?twitter_name\nBIND(URI(CONCAT(\"https://twitter.com/\",?twitter_name)) AS ?twitter)\n}\nOPTIONAL {\n?fellow wdt:P856 ?homepage\n}\nOPTIONAL {\n?fellow wdt:P4174 ?wikimedia_name\nBIND(URI(CONCAT(\"https://www.wikidata.org/w/index.php?title=Special%3ACentralAuth&target=\",?wikimedia_name)) AS ?wikimedia)\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,da,de,es,fr,jp,no,ru,sv,zh\" . }\n}\nORDER BY DESC(?year)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT\n?year ?fellow ?fellowLabel ?fellowDescription ?image ?orcid ?twitter ?github ?homepage ?wikimedia\nWHERE {\n?fellow p:[property:award received] ?award_statement .\n?award_statement ps:[property:award received] wd:[entity:Open Science Fellows Program] .\nOPTIONAL {\n?award_statement pq:[property:start time] ?time\nBIND(YEAR(?time) AS ?year)\n}\nOPTIONAL { ?fellow wdt:[property:image] ?image }\nOPTIONAL {\n?fellow wdt:[property:ORCID iD] ?orcid_id\nBIND(URI(CONCAT(\"https://orcid.org/\",?orcid_id)) AS ?orcid)\n}\nOPTIONAL {\n?fellow wdt:[property:GitHub username] ?github_name\nBIND(URI(CONCAT(\"https://github.com/\",?github_name)) AS ?github)\n}\nOPTIONAL {\n?fellow wdt:[property:Twitter (X) username] ?twitter_name\nBIND(URI(CONCAT(\"https://twitter.com/\",?twitter_name)) AS ?twitter)\n}\nOPTIONAL {\n?fellow wdt:[property:official website] ?homepage\n}\nOPTIONAL {\n?fellow wdt:[property:Wikimedia username] ?wikimedia_name\nBIND(URI(CONCAT(\"https://www.wikidata.org/w/index.php?title=Special%3ACentralAuth&target=\",?wikimedia_name)) AS ?wikimedia)\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,da,de,es,fr,jp,no,ru,sv,zh\" . }\n}\nORDER BY DESC(?year)",
    "complexity": "complex"
  },
  {
    "id": "978",
    "instruction": "List all statues in Paris that depict historical women.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?subjectLabel ?artistLabel (YEAR(?date) AS ?year) ?coords ?image WHERE {\n?item wdt:P136 wd:Q557141 .\n?item wdt:P131 ?arrdt .\n?arrdt wdt:P131 wd:Q90 .\n?item wdt:P180 ?subject .\n?subject wdt:P31 wd:Q5 .\n?subject wdt:P21 wd:Q6581072 .\nOPTIONAL { ?item wdt:P571 ?date }\nOPTIONAL { ?item wdt:P170 ?artist }\nOPTIONAL { ?item wdt:P625 ?coords }\nOPTIONAL { ?item wdt:P18 ?image }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} ORDER BY ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?subjectLabel ?artistLabel (YEAR(?date) AS ?year) ?coords ?image WHERE {\n?item wdt:[property:genre] wd:[entity:public art] .\n?item wdt:[property:located in the administrative territorial entity] ?arrdt .\n?arrdt wdt:[property:located in the administrative territorial entity] wd:[entity:Paris] .\n?item wdt:[property:image]0 ?subject .\n?subject wdt:[property:instance of] wd:[entity:human] .\n?subject wdt:[property:sex or gender] wd:[entity:female] .\nOPTIONAL { ?item wdt:[property:inception] ?date }\nOPTIONAL { ?item wdt:[property:creator] ?artist }\nOPTIONAL { ?item wdt:[property:coordinate location] ?coords }\nOPTIONAL { ?item wdt:[property:image] ?image }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} ORDER BY ?itemLabel",
    "complexity": "complex"
  },
  {
    "id": "1502",
    "instruction": "List all political parties grouped by their ideologies in a tree structure.",
    "query": "SELECT ?ideology ?ideologyLabel ?imageI ?political_ideology ?political_ideologyLabel ?political_party ?political_partyLabel ?image ?political_alignment ?political_alignmentLabel ?country ?countryLabel WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],de,en,es,fr,it\". }\n?political_party (wdt:P31/wdt:P279*) wd:Q7278.\n?political_party wdt:P1142 ?political_ideology.\n?political_ideology wdt:P279 ?ideology.\n?ideology wdt:P31 wd:Q14934048.\nOPTIONAL { ?political_party wdt:P1387 ?political_alignment. }\nOPTIONAL { ?political_party wdt:P18 ?image. }\nOPTIONAL { ?ideology wdt:P18 ?imageI. }\nOPTIONAL { ?political_party wdt:P17 ?country. }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?ideology ?ideologyLabel ?imageI ?political_ideology ?political_ideologyLabel ?political_party ?political_partyLabel ?image ?political_alignment ?political_alignmentLabel ?country ?countryLabel WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],de,en,es,fr,it\". }\n?political_party (wdt:[property:instance of]/wdt:[property:subclass of]*) wd:[entity:political party].\n?political_party wdt:[property:political ideology] ?political_ideology.\n?political_ideology wdt:[property:subclass of] ?ideology.\n?ideology wdt:[property:instance of] wd:Q14934048.\nOPTIONAL { ?political_party wdt:[property:political alignment] ?political_alignment. }\nOPTIONAL { ?political_party wdt:[property:image] ?image. }\nOPTIONAL { ?ideology wdt:[property:image] ?imageI. }\nOPTIONAL { ?political_party wdt:[property:country] ?country. }\n}",
    "complexity": "complex"
  }
]