[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "2377",
    "instruction": "What are the works written by Dante Alighieri?",
    "query": "SELECT\n?item ?title (YEAR(?date) as ?year)\n?itemLabel ?itemDescription\n?instanceof ?instanceofLabel\n?sts ?sls ?ids\n(COALESCE(?myurl, ?iturl) as ?Wikipedia)\n?Wikisource\nWHERE\n{\n?item wdt:P50 wd:Q1067 .\nOPTIONAL { ?item wdt:P31 ?instanceof }\nOPTIONAL { ?item wdt:P577 ?date }\nOPTIONAL { ?item wdt:P1476 ?title }\n?item wikibase:statements ?sts ; wikibase:sitelinks ?sls ; wikibase:identifiers ?ids\nOPTIONAL { ?myurl schema:about ?item ; schema:isPartOf / wikibase:wikiGroup \"wikipedia\" ; schema:inLanguage \"[AUTO_LANGUAGE]\" }\nOPTIONAL { ?iturl schema:about ?item ; schema:isPartOf <https://it.wikipedia.org/> ; schema:inLanguage \"it\" }\nOPTIONAL { ?Wikisource schema:about ?item ; schema:isPartOf <https://it.wikisource.org/> ; schema:inLanguage \"it\" }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],it,en\". }\n}\nORDER BY (!BOUND(?date)) ?date ?item",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT\n?item ?title (YEAR(?date) as ?year)\n?itemLabel ?itemDescription\n?instanceof ?instanceofLabel\n?sts ?sls ?ids\n(COALESCE(?myurl, ?iturl) as ?Wikipedia)\n?Wikisource\nWHERE\n{\n?item wdt:[property:author] wd:[entity:Dante Alighieri] .\nOPTIONAL { ?item wdt:[property:instance of] ?instanceof }\nOPTIONAL { ?item wdt:[property:publication date] ?date }\nOPTIONAL { ?item wdt:[property:title] ?title }\n?item wikibase:statements ?sts ; wikibase:sitelinks ?sls ; wikibase:identifiers ?ids\nOPTIONAL { ?myurl schema:about ?item ; schema:isPartOf / wikibase:wikiGroup \"wikipedia\" ; schema:inLanguage \"[AUTO_LANGUAGE]\" }\nOPTIONAL { ?iturl schema:about ?item ; schema:isPartOf <https://it.wikipedia.org/> ; schema:inLanguage \"it\" }\nOPTIONAL { ?Wikisource schema:about ?item ; schema:isPartOf <https://it.wikisource.org/> ; schema:inLanguage \"it\" }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],it,en\". }\n}\nORDER BY (!BOUND(?date)) ?date ?item",
    "complexity": "complex"
  },
  {
    "id": "2650",
    "instruction": "List the top 100 species that are most frequently mentioned in publications.",
    "query": "#defaultView:BubbleChart\nSELECT ?count ?topic ?taxonname\nWITH {\n  SELECT (COUNT(?publication) AS ?count) ?topic WHERE {\n    ?publication wdt:P921 ?topic .\n    ?topic wdt:P105 wd:Q7432 .\n  }\n  GROUP BY ?topic\n  ORDER BY DESC(?count)\n  LIMIT 100\n} AS %result\nWHERE {\n  INCLUDE %result\n  ?topic wdt:P225 ?taxonname .\n}\nORDER BY DESC(?count)",
    "annotated": "PREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\n#defaultView:BubbleChart\nSELECT ?count ?topic ?taxonname\nWITH {\n  SELECT (COUNT(?publication) AS ?count) ?topic WHERE {\n    ?publication wdt:[property:main subject] ?topic .\n    ?topic wdt:[property:taxon rank] wd:[entity:species] .\n  }\n  GROUP BY ?topic\n  ORDER BY DESC(?count)\n  LIMIT 100\n} AS %result\nWHERE {\n  INCLUDE %result\n  ?topic wdt:[property:taxon name] ?taxonname .\n}\nORDER BY DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "2133",
    "instruction": "Show me a map of where sports team players were born by decade.",
    "query": "SELECT ?x ?xLabel ?loc ?layer ?img ?line ?birthplace ?birthplaceLabel ?teamLabel WITH {\nSELECT ?team ?inception WHERE {\nBIND ( wd:Q9617 AS ?team )\n?team wdt:P571 ?inception .\n}} AS %team\nWITH { SELECT ?num ?start ?end ?gap WHERE {\nINCLUDE %team\nBIND (10 * FLOOR(YEAR(?inception) / 10) AS ?start)\nBIND (10 AS ?gap )\nBIND (10 * FLOOR(YEAR(NOW()) / 10) AS ?end )\nBIND ( (?end - ?start ) / ?gap + 1 AS ?x )\n[] p:P31 [\nps:P31 wd:Q21199 ;\npq:P155 ?prev].\n?prev wdt:P1181 ?num .\nFILTER (?num > 0 && ?num <= ?x )\n} } AS %range\nWITH { SELECT ?decade WHERE {\nINCLUDE %range\nBIND (?start + (?num - 1) * ?gap AS ?decade)\n} ORDER BY ?decade }\nAS %decades\nWITH { SELECT ?x ?start_year ?end_year ?team WHERE {\nINCLUDE %team\nBIND ( NOW() AS ?today )\n?x wdt:P31 wd:Q5.\n?x p:P54 ?stmt.\n?stmt ps:P54 ?team.\n?stmt pq:P580 ?start.\nOPTIONAL { ?stmt pq:P582 ?end }\nBIND ( IF (wikibase:isSomeValue(?end), ?today, ?end ) AS ?new_end)\nBIND(COALESCE(?new_end, ?today) as ?new_end)\nBIND (YEAR(?start) AS ?start_year)\nBIND (YEAR(?new_end) AS ?end_year)\n} } AS %players\nWHERE {\nINCLUDE %players\nINCLUDE %decades\n?x wdt:P19 ?birthplace.\n?birthplace wdt:P625 ?loc.\nOPTIONAL { ?x wdt:P18 ?img }\nFILTER ( (?start_year >= ?decade && ?start_year < ?decade + 10) || (?end_year < ?decade + 10 && ?end_year >= ?decade ) || (?decade > ?start_year && ?decade < ?end_year ))\n?birthplace p:P625 [\nps:P625 [];\npsv:P625 [\nwikibase:geoLongitude ?poblon;\nwikibase:geoLatitude ?poblat;\n]] .\n?team wdt:P115 ?home .\n?home p:P625 [\nps:P625 [];\npsv:P625 [\nwikibase:geoLongitude ?centrelon;\nwikibase:geoLatitude ?centrelat]] .\nBIND(CONCAT('LINESTRING (', STR(?poblon), ' ', STR(?poblat), ',', STR(?centrelon), ' ', STR(?centrelat), ')') AS ?str) .\nBIND(STRDT(?str, geo:wktLiteral) AS ?line)\nBIND(CONCAT(STR(?decade),\"s\") AS ?layer)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY ASC(?layer)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?x ?xLabel ?loc ?layer ?img ?line ?birthplace ?birthplaceLabel ?teamLabel WITH {\nSELECT ?team ?inception WHERE {\nBIND ( wd:[entity:Arsenal F.C.] AS ?team )\n?team wdt:[property:inception] ?inception .\n}} AS %team\nWITH { SELECT ?num ?start ?end ?gap WHERE {\nINCLUDE %team\nBIND (10 * FLOOR(YEAR(?inception) / 10) AS ?start)\nBIND (10 AS ?gap )\nBIND (10 * FLOOR(YEAR(NOW()) / 10) AS ?end )\nBIND ( (?end - ?start ) / ?gap + 1 AS ?x )\n[] p:[property:instance of] [\nps:[property:instance of] wd:[entity:natural number] ;\npq:[property:follows] ?prev].\n?prev wdt:[property:numeric value] ?num .\nFILTER (?num > 0 && ?num <= ?x )\n} } AS %range\nWITH { SELECT ?decade WHERE {\nINCLUDE %range\nBIND (?start + (?num - 1) * ?gap AS ?decade)\n} ORDER BY ?decade }\nAS %decades\nWITH { SELECT ?x ?start_year ?end_year ?team WHERE {\nINCLUDE %team\nBIND ( NOW() AS ?today )\n?x wdt:[property:instance of] wd:[entity:human].\n?x p:[property:member of sports team] ?stmt.\n?stmt ps:[property:member of sports team] ?team.\n?stmt pq:[property:start time] ?start.\nOPTIONAL { ?stmt pq:[property:end time] ?end }\nBIND ( IF (wikibase:isSomeValue(?end), ?today, ?end ) AS ?new_end)\nBIND(COALESCE(?new_end, ?today) as ?new_end)\nBIND (YEAR(?start) AS ?start_year)\nBIND (YEAR(?new_end) AS ?end_year)\n} } AS %players\nWHERE {\nINCLUDE %players\nINCLUDE %decades\n?x wdt:[property:place of birth] ?birthplace.\n?birthplace wdt:[property:coordinate location] ?loc.\nOPTIONAL { ?x wdt:[property:image] ?img }\nFILTER ( (?start_year >= ?decade && ?start_year < ?decade + 10) || (?end_year < ?decade + 10 && ?end_year >= ?decade ) || (?decade > ?start_year && ?decade < ?end_year ))\n?birthplace p:[property:coordinate location] [\nps:[property:coordinate location] [];\npsv:[property:coordinate location] [\nwikibase:geoLongitude ?poblon;\nwikibase:geoLatitude ?poblat;\n]] .\n?team wdt:[property:home venue] ?home .\n?home p:[property:coordinate location] [\nps:[property:coordinate location] [];\npsv:[property:coordinate location] [\nwikibase:geoLongitude ?centrelon;\nwikibase:geoLatitude ?centrelat]] .\nBIND(CONCAT('LINESTRING (', STR(?poblon), ' ', STR(?poblat), ',', STR(?centrelon), ' ', STR(?centrelat), ')') AS ?str) .\nBIND(STRDT(?str, geo:wktLiteral) AS ?line)\nBIND(CONCAT(STR(?decade),\"s\") AS ?layer)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY ASC(?layer)",
    "complexity": "complex"
  },
  {
    "id": "580",
    "instruction": "How many Wikidata items are classified as diseases?",
    "query": "SELECT (COUNT(?disease) AS ?total) (SUM(?ref) AS ?byDO) (100*?byDO/?total AS ?percent)\nWHERE\n{\n{?disease wdt:P31 wd:Q12136 }\nUNION\n{?disease wdt:P279 wd:Q12136 .}\nOPTIONAL {\n?disease p:P699 ?statement.\nBIND(1 AS ?ref).\n}\n}",
    "annotated": "PREFIX p: <http://www.wikidata.org/prop/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT (COUNT(?disease) AS ?total) (SUM(?ref) AS ?byDO) (100*?byDO/?total AS ?percent)\nWHERE\n{\n{?disease wdt:[property:instance of] wd:[entity:disease] }\nUNION\n{?disease wdt:[property:subclass of] wd:[entity:disease] .}\nOPTIONAL {\n?disease p:[property:Disease Ontology ID] ?statement.\nBIND(1 AS ?ref).\n}\n}",
    "complexity": "complex"
  },
  {
    "id": "1152",
    "instruction": "How many versions, editions and translations are there for each language?",
    "query": "SELECT ?language ?languageLabel (COUNT(DISTINCT ?item) AS ?count)\nWHERE {\n?item wdt:P31/wdt:P279* wd:Q3331189 ; wdt:P407 ?language .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n}\nGROUP BY ?language ?languageLabel\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?language ?languageLabel (COUNT(DISTINCT ?item) AS ?count)\nWHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:version, edition or translation] ; wdt:[property:language of work or name] ?language .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n}\nGROUP BY ?language ?languageLabel\nORDER BY DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "1643",
    "instruction": "List all Tekken characters and their fighting styles.",
    "query": "SELECT ?item1 ?image1 ?item1Label ?rgb ?item2 ?image2 ?item2Label ?edgeLabel\nWITH {\nSELECT ?item1 ?rgb WHERE {\n{\nSELECT (?character as ?item1) WHERE {\n?game wdt:P31 wd:Q7889.\n?game wdt:P179 wd:Q219623.\n?game wdt:P674 ?character.\n}\n}\nUNION\n{\n# Find sport -\nSELECT (?sport as ?item1) WHERE {\n?game wdt:P31 wd:Q7889.\n?game wdt:P179 wd:Q219623.\n?game wdt:P674 ?character.\n?character wdt:P641 ?sport.\n}\n}\nUNION\n{\n# Find games\nSELECT (?game as ?item1) ?rgb WHERE {\n?game wdt:P31 wd:Q7889.\n?game wdt:P179 wd:Q219623.\nBIND(\"7FFF00\" as ?rgb)\n}\n}\n}\n} AS %item1\nWITH {\nSELECT (?item1 AS ?item2) WHERE {\nINCLUDE %item1.\n}\n} AS %item2\nWHERE {\nINCLUDE %item1 .\nINCLUDE %item2 .\n?item1 ?wdt ?item2 .\n?edge wikibase:directClaim ?wdt;\na wikibase:Property .\nOPTIONAL { ?item1 wdt:P18 ?image1 . }\nOPTIONAL { ?item2 wdt:P18 ?image2 . }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item1 ?image1 ?item1Label ?rgb ?item2 ?image2 ?item2Label ?edgeLabel\nWITH {\nSELECT ?item1 ?rgb WHERE {\n{\nSELECT (?character as ?item1) WHERE {\n?game wdt:[property:instance of] wd:[entity:video game].\n?game wdt:[property:part of the series] wd:[entity:Tekken].\n?game wdt:[property:characters] ?character.\n}\n}\nUNION\n{\n# Find sport -\nSELECT (?sport as ?item1) WHERE {\n?game wdt:[property:instance of] wd:[entity:video game].\n?game wdt:[property:part of the series] wd:[entity:Tekken].\n?game wdt:[property:characters] ?character.\n?character wdt:[property:sport] ?sport.\n}\n}\nUNION\n{\n# Find games\nSELECT (?game as ?item1) ?rgb WHERE {\n?game wdt:[property:instance of] wd:[entity:video game].\n?game wdt:[property:part of the series] wd:[entity:Tekken].\nBIND(\"7FFF00\" as ?rgb)\n}\n}\n}\n} AS %item1\nWITH {\nSELECT (?item1 AS ?item2) WHERE {\nINCLUDE %item1.\n}\n} AS %item2\nWHERE {\nINCLUDE %item1 .\nINCLUDE %item2 .\n?item1 ?wdt ?item2 .\n?edge wikibase:directClaim ?wdt;\na wikibase:Property .\nOPTIONAL { ?item1 wdt:[property:image] ?image1 . }\nOPTIONAL { ?item2 wdt:[property:image] ?image2 . }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "1484",
    "instruction": "What is the average age of members in the 19th German Bundestag?",
    "query": "SELECT (AVG(?age) AS ?avgAge) WHERE {\n?mdb wdt:P31 wd:Q5;\np:P39 [\nps:P39 wd:Q1939555;\npq:P2937 wd:Q30579723\n];\nwdt:P569 ?dob.\nBIND(FLOOR((NOW() - ?dob)/365.2425) AS ?age)\n}",
    "annotated": "PREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT (AVG(?age) AS ?avgAge) WHERE {\n?mdb wdt:[property:instance of] wd:[entity:human];\np:[property:position held] [\nps:[property:position held] wd:[entity:member of the German Bundestag];\npq:[property:parliamentary term] wd:[entity:19th German Bundestag]\n];\nwdt:[property:date of birth] ?dob.\nBIND(FLOOR((NOW() - ?dob)/365.2425) AS ?age)\n}",
    "complexity": "complex"
  },
  {
    "id": "1099",
    "instruction": "List actors and actresses who have appeared in at least 50 films, excluding those with an image.",
    "query": "SELECT ?actor ?actorLabel ?actorDescription ?count WITH {\nSELECT ?actor (COUNT(DISTINCT ?film) AS ?count) WHERE {\n?film wdt:P31 wd:Q11424;\nwdt:P161 ?actor.\nMINUS { ?actor wdt:P18 ?image. }\nMINUS { ?actor wdt:P570 ?dateOfDeath. }\n}\nGROUP BY ?actor\nHAVING(?count >= 50)\n} AS %results WHERE {\nINCLUDE %results.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?actor ?actorLabel ?actorDescription ?count WITH {\nSELECT ?actor (COUNT(DISTINCT ?film) AS ?count) WHERE {\n?film wdt:[property:instance of] wd:[entity:film];\nwdt:[property:cast member] ?actor.\nMINUS { ?actor wdt:[property:image] ?image. }\nMINUS { ?actor wdt:[property:date of death] ?dateOfDeath. }\n}\nGROUP BY ?actor\nHAVING(?count >= 50)\n} AS %results WHERE {\nINCLUDE %results.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "785",
    "instruction": "List the countries with leaders older than 65 years old.",
    "query": "SELECT DISTINCT ?age ?country ?countryLabel ?hgovernmentLabel WHERE {\n?country wdt:P31 wd:Q3624078 .\nFILTER NOT EXISTS {?country wdt:P31 wd:Q3024240}\n?country p:P6 ?statement .\n?statement ps:P6 ?hgovernment .\nFILTER NOT EXISTS { ?statement pq:P582 ?x }\n?hgovernment wdt:P569 ?dob . BIND(YEAR(now())-YEAR(?dob) as ?age)\nFILTER(?age>=65)\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"{{int:lang}},en\" .\n}\n}\nORDER BY DESC(?age)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?age ?country ?countryLabel ?hgovernmentLabel WHERE {\n?country wdt:[property:instance of] wd:[entity:sovereign state] .\nFILTER NOT EXISTS {?country wdt:[property:instance of] wd:[entity:historical country]}\n?country p:[property:head of government] ?statement .\n?statement ps:[property:head of government] ?hgovernment .\nFILTER NOT EXISTS { ?statement pq:[property:end time] ?x }\n?hgovernment wdt:[property:date of birth] ?dob . BIND(YEAR(now())-YEAR(?dob) as ?age)\nFILTER(?age>=65)\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"{{int:lang}},en\" .\n}\n}\nORDER BY DESC(?age)",
    "complexity": "complex"
  },
  {
    "id": "2754",
    "instruction": "List the employers and affiliations of first authors in Journal of Cheminformatics articles.",
    "query": "#defaultView:Map\nSELECT DISTINCT ?author ?geo\nWITH {\nSELECT DISTINCT ?author_ ?author WHERE {\n  {\n    ?target p:P50 ?author_statement ; wdt:P1433 wd:Q6294930 .\n    ?author_statement ps:P50 ?author_ .\n    ?author_ rdfs:label ?author .\n    FILTER (LANG(?author) = 'en')\n    BIND(CONCAT(\"../author/\", SUBSTR(STR(?author_), 32)) AS ?authorUrl)\n    OPTIONAL {\n      ?author_statement pq:P1545 ?order_ .\n      BIND(xsd:integer(?order_) AS ?order)\n    }\n  }\n  UNION\n  {\n    ?target p:P2093 ?authorstring_statement ; wdt:P1433 wd:Q6294930 .\n    ?authorstring_statement ps:P2093 ?author_\n    BIND(CONCAT(?author_, \" \u2197\") AS ?author)\n    OPTIONAL {\n      ?authorstring_statement pq:P1545 ?order_ .\n      BIND(xsd:integer(?order_) AS ?order)\n    }\n  }\n  FILTER (?order = 1)\n}\n} AS %AUTHORS WHERE {\n  INCLUDE %AUTHORS\n  ?author_ ( wdt:P108 | wdt:P1416 ) / wdt:P361* ?organization . \n  ?organization wdt:P625 ?geo.\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\n#defaultView:Map\nSELECT DISTINCT ?author ?geo\nWITH {\nSELECT DISTINCT ?author_ ?author WHERE {\n  {\n    ?target p:[property:author] ?author_statement ; wdt:[property:published in] wd:[entity:Journal of Cheminformatics] .\n    ?author_statement ps:[property:author] ?author_ .\n    ?author_ rdfs:label ?author .\n    FILTER (LANG(?author) = 'en')\n    BIND(CONCAT(\"../author/\", SUBSTR(STR(?author_), 32)) AS ?authorUrl)\n    OPTIONAL {\n      ?author_statement pq:[property:series ordinal] ?order_ .\n      BIND(xsd:integer(?order_) AS ?order)\n    }\n  }\n  UNION\n  {\n    ?target p:[property:author name string] ?authorstring_statement ; wdt:[property:published in] wd:[entity:Journal of Cheminformatics] .\n    ?authorstring_statement ps:[property:author name string] ?author_\n    BIND(CONCAT(?author_, \" \u2197\") AS ?author)\n    OPTIONAL {\n      ?authorstring_statement pq:[property:series ordinal] ?order_ .\n      BIND(xsd:integer(?order_) AS ?order)\n    }\n  }\n  FILTER (?order = 1)\n}\n} AS %AUTHORS WHERE {\n  INCLUDE %AUTHORS\n  ?author_ ( wdt:[property:employer] | wdt:[property:affiliation] ) / wdt:[property:part of]* ?organization . \n  ?organization wdt:[property:coordinate location] ?geo.\n}",
    "complexity": "complex"
  },
  {
    "id": "997",
    "instruction": "What are the coordinates of volcanoes and earthquakes?",
    "query": "SELECT DISTINCT ?activity ?activityLabel ?coordinates (COALESCE(?layer, \"earthquake\") AS ?layer) WHERE {\n{\n?activity wdt:P31/wdt:P279* wd:Q8072.\n} UNION {\n?activity wdt:P31/wdt:P279* wd:Q7944.\n}\n?activity wdt:P625 ?coordinates.\nOPTIONAL {\n?activity wdt:P31/wdt:P279* wd:Q8072.\nBIND(\"volcano\" AS ?layer).\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?activity ?activityLabel ?coordinates (COALESCE(?layer, \"earthquake\") AS ?layer) WHERE {\n{\n?activity wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:volcano].\n} UNION {\n?activity wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:earthquake].\n}\n?activity wdt:[property:coordinate location] ?coordinates.\nOPTIONAL {\n?activity wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:volcano].\nBIND(\"volcano\" AS ?layer).\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "1585",
    "instruction": "List the Italian Renaissance humanists along with their birth dates.",
    "query": "SELECT DISTINCT ?wditem ?wditemLabel ?date ?work ?workLabel ?image WHERE {\nSERVICE <http://dbpedia.org/sparql> {\n?item dct:subject|dct:subject/skos:broader|dct:subject/skos:broader/skos:broader dbc:Italian_Renaissance_humanists ;\n# ?item rdf:type yago:WikicatPioneersOfPhotography ;\nowl:sameAs ?wditem FILTER regex (?wditem, \"wikidata.org\") .\n}\nSERVICE <https://query.wikidata.org/sparql> {\n?wditem wdt:P569 ?date .\n# OPTIONAL {?wditem wdt:P800 ?work }\nOPTIONAL {?wditem wdt:P18 ?image } .\n?wditem rdfs:label ?wditemLabel FILTER (LANG(?wditemLabel)=\"en\") .\n}\n}",
    "annotated": "PREFIX dct: <http://purl.org/dc/terms/>\nPREFIX owl: <http://www.w3.org/2002/07/owl#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX skos: <http://www.w3.org/2004/02/skos/core#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX dbc: <http://dbpedia.org/resource/Category:>\n\nSELECT DISTINCT ?wditem ?wditemLabel ?date ?work ?workLabel ?image WHERE {\nSERVICE <http://dbpedia.org/sparql> {\n?item dct:subject|dct:subject/skos:broader|dct:subject/skos:broader/skos:broader dbc:Italian_Renaissance_humanists ;\n# ?item rdf:type yago:WikicatPioneersOfPhotography ;\nowl:sameAs ?wditem FILTER regex (?wditem, \"wikidata.org\") .\n}\nSERVICE <https://query.wikidata.org/sparql> {\n?wditem wdt:[property:date of birth] ?date .\n# OPTIONAL {?wditem wdt:[property:notable work] ?work }\nOPTIONAL {?wditem wdt:[property:image] ?image } .\n?wditem rdfs:label ?wditemLabel FILTER (LANG(?wditemLabel)=\"en\") .\n}\n}",
    "complexity": "complex"
  },
  {
    "id": "924",
    "instruction": "List the directors who have worked with the same actor more than 20 times.",
    "query": "SELECT ?director ?directorLabel ?actor ?actorLabel ?FilmCount WHERE {\n{\nSELECT ?director ?actor (COUNT(?film) AS ?FilmCount) WHERE {\n?film wdt:P57 ?director.\n?film wdt:P161 ?actor.\n}\nGROUP BY ?director ?actor\nHAVING (?FilmCount > 20)\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nORDER BY DESC(?FilmCount) ?directorLabel ?actorLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?director ?directorLabel ?actor ?actorLabel ?FilmCount WHERE {\n{\nSELECT ?director ?actor (COUNT(?film) AS ?FilmCount) WHERE {\n?film wdt:[property:director] ?director.\n?film wdt:[property:cast member] ?actor.\n}\nGROUP BY ?director ?actor\nHAVING (?FilmCount > 20)\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nORDER BY DESC(?FilmCount) ?directorLabel ?actorLabel",
    "complexity": "complex"
  },
  {
    "id": "2741",
    "instruction": "What percentage of lexemes have an external ID for each of the top 20 languages in Wikidata?",
    "query": "SELECT ?language ?languageLabel ?lexemes ?withExternalId ?percent WITH {\nSELECT ?language (COUNT(*) AS ?count) { ?lexeme dct:language ?language }\nGROUP BY ?language\nORDER BY DESC(COUNT(*))\nLIMIT 20\n} AS %languages WITH {\nSELECT ?language ?lexemes ?withExternalId (ROUND(10000 / ?lexemes * ?withExternalId) / 100 AS ?percent) {\nSELECT ?language (COUNT(*) AS ?lexemes) (SUM(?hasExternalId) AS ?withExternalId) {\nINCLUDE %languages\n?lexeme dct:language ?language .\nBIND(IF(EXISTS {\n?property wikibase:propertyType wikibase:ExternalId ; wikibase:directClaim ?wdt .\n?lexeme ?wdt [] .\n}, 1, 0) AS ?hasExternalId) .\n}\nGROUP BY ?language\n}\nGROUP BY ?language ?lexemes ?withExternalId\n} AS %stats WHERE {\nINCLUDE %stats\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}\nORDER BY DESC(?lexemes)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX dct: <http://purl.org/dc/terms/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?language ?languageLabel ?lexemes ?withExternalId ?percent WITH {\nSELECT ?language (COUNT(*) AS ?count) { ?lexeme dct:language ?language }\nGROUP BY ?language\nORDER BY DESC(COUNT(*))\nLIMIT 20\n} AS %languages WITH {\nSELECT ?language ?lexemes ?withExternalId (ROUND(10000 / ?lexemes * ?withExternalId) / 100 AS ?percent) {\nSELECT ?language (COUNT(*) AS ?lexemes) (SUM(?hasExternalId) AS ?withExternalId) {\nINCLUDE %languages\n?lexeme dct:language ?language .\nBIND(IF(EXISTS {\n?property wikibase:propertyType wikibase:ExternalId ; wikibase:directClaim ?wdt .\n?lexeme ?wdt [] .\n}, 1, 0) AS ?hasExternalId) .\n}\nGROUP BY ?language\n}\nGROUP BY ?language ?lexemes ?withExternalId\n} AS %stats WHERE {\nINCLUDE %stats\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}\nORDER BY DESC(?lexemes)",
    "complexity": "complex"
  },
  {
    "id": "2576",
    "instruction": "List software with information about the gender of their developers, designers, and namesakes.",
    "query": "SELECT ?gender ?genderLabel (count(DISTINCT ?developer) as ?count)\nWITH {\nSELECT DISTINCT ?developer WHERE {\n?software wdt:P31/wdt:P279* wd:Q7397; #software\n(wdt:P178 | wdt:P287 | wdt:P138) ?developer. #developer, designer and the person named after\n}\n} AS %result\nWHERE {\nINCLUDE %result\nVALUES ?gender { wd:Q6581097 wd:Q6581072 wd:Q1052281 wd:Q48270 wd:Q1052281 wd:Q52261234 wd:Q44148 wd:Q2449503 wd:Q12964198 wd:Q505371}.\n?developer wdt:P21 ?gender.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nGROUP by ?gender ?genderLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?gender ?genderLabel (count(DISTINCT ?developer) as ?count)\nWITH {\nSELECT DISTINCT ?developer WHERE {\n?software wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:software]; #software\n(wdt:[property:developer] | wdt:[property:designed by] | wdt:[property:named after]) ?developer. #developer, designer and the person named after\n}\n} AS %result\nWHERE {\nINCLUDE %result\nVALUES ?gender { wd:[entity:male] wd:[entity:female] wd:[entity:trans woman] wd:[entity:non-binary] wd:[entity:trans woman] wd:[entity:neutral sex] wd:[entity:male organism] wd:[entity:trans man] wd:[entity:genderqueer] wd:[entity:agender]}.\n?developer wdt:[property:sex or gender] ?gender.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nGROUP by ?gender ?genderLabel",
    "complexity": "complex"
  },
  {
    "id": "2060",
    "instruction": "List all central libraries in California along with their branch libraries.",
    "query": "SELECT ?libSystem ?libSystemLabel ?centralLibrary ?centralLibraryLabel ?clCoord ?branchLibrary ?branchLibraryLabel ?blCoord ?line ?layer WHERE {\n?libSystem wdt:P31/wdt:P279* wd:Q28324850 ; wdt:P131 ?loc ;\nwdt:P527 ?centralLibrary ;\nwdt:P527 ?branchLibrary .\n?centralLibrary wdt:P31 wd:Q12317349 ;\nwdt:P625 ?clCoord .\n?branchLibrary wdt:P31 wd:Q11396180 ;\nwdt:P625 ?blCoord .\n?centralLibrary p:P625 [ ps:P625 []; psv:P625 [ wikibase:geoLongitude ?clLon; wikibase:geoLatitude ?clLat; ] ].\n?branchLibrary p:P625 [ ps:P625 []; psv:P625 [ wikibase:geoLongitude ?blLon; wikibase:geoLatitude ?blLat; ] ].\nBIND(CONCAT('LINESTRING (', STR(?clLon), ' ', STR(?clLat), ',', STR(?blLon), ' ', STR(?blLat), ')') AS ?str1) .\nBIND(STRDT(?str1, geo:wktLiteral) AS ?line) .\nBIND(?libSystem as ?layer)\n{ SELECT * { ?loc wdt:P131* wd:Q99 . } }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?libSystem ?libSystemLabel ?centralLibrary ?centralLibraryLabel ?clCoord ?branchLibrary ?branchLibraryLabel ?blCoord ?line ?layer WHERE {\n?libSystem wdt:[property:instance of]/wdt:[property:subclass of]* wd:Q28324850 ; wdt:[property:located in the administrative territorial entity] ?loc ;\nwdt:[property:has part(s)] ?centralLibrary ;\nwdt:[property:has part(s)] ?branchLibrary .\n?centralLibrary wdt:[property:instance of] wd:[entity:main library] ;\nwdt:[property:coordinate location] ?clCoord .\n?branchLibrary wdt:[property:instance of] wd:[entity:library branch] ;\nwdt:[property:coordinate location] ?blCoord .\n?centralLibrary p:[property:coordinate location] [ ps:[property:coordinate location] []; psv:[property:coordinate location] [ wikibase:geoLongitude ?clLon; wikibase:geoLatitude ?clLat; ] ].\n?branchLibrary p:[property:coordinate location] [ ps:[property:coordinate location] []; psv:[property:coordinate location] [ wikibase:geoLongitude ?blLon; wikibase:geoLatitude ?blLat; ] ].\nBIND(CONCAT('LINESTRING (', STR(?clLon), ' ', STR(?clLat), ',', STR(?blLon), ' ', STR(?blLat), ')') AS ?str1) .\nBIND(STRDT(?str1, geo:wktLiteral) AS ?line) .\nBIND(?libSystem as ?layer)\n{ SELECT * { ?loc wdt:[property:located in the administrative territorial entity]* wd:[entity:California] . } }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  }
]