[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "1992",
    "instruction": "List the winners of the FA Cup in a bubble chart.",
    "query": "SELECT ?winner ?winnerLabel ?colour ?count ?rgb WHERE {\n{SELECT ?winner ?count (SAMPLE(?colour) AS ?colour) WHERE {\n{SELECT ?winner (COUNT(?winner) AS ?count) WHERE {\n?event wdt:P31 wd:Q4484477.\n?event wdt:P1346 ?winner.\n}\nGROUP BY ?winner }\nOPTIONAL { ?winner wdt:P6364 ?colour }\nBIND (IF ( BOUND(?colour), ?colour, wd:Q1003676) AS ?colour)\n}\nGROUP BY ?winnerLabel ?winner ?count ?rgb }\nOPTIONAL { ?colour wdt:P465 ?rgb }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC (?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?winner ?winnerLabel ?colour ?count ?rgb WHERE {\n{SELECT ?winner ?count (SAMPLE(?colour) AS ?colour) WHERE {\n{SELECT ?winner (COUNT(?winner) AS ?count) WHERE {\n?event wdt:[property:instance of] wd:[entity:FA Cup Final].\n?event wdt:[property:winner] ?winner.\n}\nGROUP BY ?winner }\nOPTIONAL { ?winner wdt:[property:official color] ?colour }\nBIND (IF ( BOUND(?colour), ?colour, wd:[entity:steel blue]) AS ?colour)\n}\nGROUP BY ?winnerLabel ?winner ?count ?rgb }\nOPTIONAL { ?colour wdt:[property:sRGB color hex triplet] ?rgb }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC (?count)",
    "complexity": "complex"
  },
  {
    "id": "1216",
    "instruction": "List all minerals named after women.",
    "query": "SELECT ?item ?itemLabel ?named_after ?named_afterLabel ?article ?img\nWITH {\nSELECT DISTINCT ?item WHERE {\n?item wdt:P31/wdt:P279*/wdt:P31/wdt:P279* wd:Q55084935 .\nhint:Prior hint:gearing \"reverse\" .\n}\n} AS %minerals\nWHERE {\nINCLUDE %minerals .\n?item wdt:P138 ?named_after .\n?named_after wdt:P21 wd:Q6581072 .\nOPTIONAL {?item wdt:P18 ?img} .\nOPTIONAL {\n?article schema:about ?named_after .\n?article schema:isPartOf <https://en.wikipedia.org/> .\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX hint: <http://www.bigdata.com/queryHints#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?named_after ?named_afterLabel ?article ?img\nWITH {\nSELECT DISTINCT ?item WHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]*/wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:rank of mineral taxonomy] .\nhint:Prior hint:gearing \"reverse\" .\n}\n} AS %minerals\nWHERE {\nINCLUDE %minerals .\n?item wdt:[property:named after] ?named_after .\n?named_after wdt:[property:sex or gender] wd:[entity:female] .\nOPTIONAL {?item wdt:[property:image] ?img} .\nOPTIONAL {\n?article schema:about ?named_after .\n?article schema:isPartOf <https://en.wikipedia.org/> .\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY ?itemLabel",
    "complexity": "complex"
  },
  {
    "id": "1764",
    "instruction": "List the 100 cities closest to the North Pole with a population of over 200,000.",
    "query": "SELECT ?city ?cityLabel ?pop ?coord ?dist ?img\nWHERE {\n?city wdt:P31 wd:Q515.\n?city wdt:P1082 ?pop.\n?city wdt:P625 ?coord.\noptional {?city wdt:P18 ?img}\nfilter (?pop > 200000).\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"es,en\". }\nBIND(geof:distance(\"Point(0 90)\"^^geo:wktLiteral, ?coord) as ?dist)\n}\norder by ?dist\nLIMIT 100",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?city ?cityLabel ?pop ?coord ?dist ?img\nWHERE {\n?city wdt:[property:instance of] wd:[entity:city].\n?city wdt:[property:population] ?pop.\n?city wdt:[property:coordinate location] ?coord.\noptional {?city wdt:[property:image] ?img}\nfilter (?pop > 200000).\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"es,en\". }\nBIND(geof:distance(\"Point(0 90)\"^^geo:wktLiteral, ?coord) as ?dist)\n}\norder by ?dist\nLIMIT 100",
    "complexity": "complex"
  },
  {
    "id": "1931",
    "instruction": "List the organizations with the most female employees according to Wikidata.",
    "query": "SELECT ?thing ?thingLabel ?count with {\nSELECT ?thing (count(?thing) as ?count) WHERE {\n?item wdt:P108 ?thing .\n?item wdt:P21 wd:Q6581072 .\n?item wdt:P31 wd:Q5 .\n} group by ?thing } as %i\nwhere\n{\ninclude %i\nminus {?thing wdt:P31/wdt:P279* wd:Q3918 . }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} order by desc(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?thing ?thingLabel ?count with {\nSELECT ?thing (count(?thing) as ?count) WHERE {\n?item wdt:[property:employer] ?thing .\n?item wdt:[property:sex or gender] wd:[entity:female] .\n?item wdt:[property:instance of] wd:[entity:human] .\n} group by ?thing } as %i\nwhere\n{\ninclude %i\nminus {?thing wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:university] . }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} order by desc(?count)",
    "complexity": "complex"
  },
  {
    "id": "1120",
    "instruction": "What are the major periods in Japanese history and what were they named after?",
    "query": "SELECT ?era ?eraLabel (YEAR(?start_time) AS ?start) (YEAR(?end_time) AS ?end) ?namedLabel ?namedDescription WHERE {\n?era wdt:P31 wd:Q6428674; wdt:P361 wd:Q130436; # eras of the history of Japan\nwdt:P580 ?start_time.\nMINUS { ?era wdt:P2348/wdt:P361 wd:Q130436 } # exclude sub-eras\nOPTIONAL { ?era wdt:P582 ?end_time }\nOPTIONAL { ?era wdt:P138 ?named }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} ORDER BY ?start DESC(?end)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?era ?eraLabel (YEAR(?start_time) AS ?start) (YEAR(?end_time) AS ?end) ?namedLabel ?namedDescription WHERE {\n?era wdt:[property:instance of] wd:[entity:era]; wdt:[property:part of] wd:[entity:history of Japan]; # eras of the history of Japan\nwdt:[property:start time] ?start_time.\nMINUS { ?era wdt:[property:time period]/wdt:[property:part of] wd:[entity:history of Japan] } # exclude sub-eras\nOPTIONAL { ?era wdt:[property:end time] ?end_time }\nOPTIONAL { ?era wdt:[property:named after] ?named }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} ORDER BY ?start DESC(?end)",
    "complexity": "complex"
  },
  {
    "id": "32",
    "instruction": "List the awards received by international female alumni of University of Oxford.",
    "query": "SELECT DISTINCT ?alum ?alumLabel ?award ?awardLabel\nWHERE {\n{?alum wdt:P69 wd:Q34433 }\nUNION {?college wdt:P31 wd:Q2581649.\n?alum wdt:P69 ?college}\n?alum wdt:P166 ?award.\n?alum wdt:P21 wd:Q6581072 .\nMINUS { ?alum wdt:P27 wd:Q145 }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} ORDER BY ASC(?awardLabel)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?alum ?alumLabel ?award ?awardLabel\nWHERE {\n{?alum wdt:[property:educated at] wd:[entity:University of Oxford] }\nUNION {?college wdt:[property:instance of] wd:[entity:college of the University of Oxford].\n?alum wdt:[property:educated at] ?college}\n?alum wdt:[property:award received] ?award.\n?alum wdt:[property:sex or gender] wd:[entity:female] .\nMINUS { ?alum wdt:[property:country of citizenship] wd:[entity:United Kingdom] }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} ORDER BY ASC(?awardLabel)",
    "complexity": "complex"
  },
  {
    "id": "2806",
    "instruction": "List the birthplaces of Italian authors who died in 1852.",
    "query": "SELECT DISTINCT ?autore ?autoreLabel ?autoreDescription ?datanascita ?datamorte ?luogonascita ?luogonascitaLabel ?coord\nWHERE {\n?autore wdt:P27 ?p ; wdt:P570 ?datamorte ; ?id [] . VALUES ?p { wd:Q172579 wd:Q38 } . VALUES ?id { wdt:P214 wdt:P396 } .\nFILTER (\"1951-12-31\"^^xsd:dateTime < ?datamorte && ?datamorte < \"1953-01-01\"^^xsd:dateTime)\nOPTIONAL { ?autore wdt:P569 ?datanascita } .\nOPTIONAL { ?autore wdt:P19 ?luogonascita . ?luogonascita wdt:P625 ?coord } .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"it,en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?autore ?autoreLabel ?autoreDescription ?datanascita ?datamorte ?luogonascita ?luogonascitaLabel ?coord\nWHERE {\n?autore wdt:[property:country of citizenship] ?p ; wdt:[property:date of death] ?datamorte ; ?id [] . VALUES ?p { wd:[entity:Kingdom of Italy] wd:[entity:Italy] } . VALUES ?id { wdt:[property:VIAF ID] wdt:[property:SBN author ID] } .\nFILTER (\"1951-12-31\"^^xsd:dateTime < ?datamorte && ?datamorte < \"1953-01-01\"^^xsd:dateTime)\nOPTIONAL { ?autore wdt:[property:date of birth] ?datanascita } .\nOPTIONAL { ?autore wdt:[property:place of birth] ?luogonascita . ?luogonascita wdt:[property:coordinate location] ?coord } .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"it,en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "1750",
    "instruction": "Show me a map of airports in India with their flight connections.",
    "query": "SELECT DISTINCT ?cd ?l ?i ?iLabel ?ct ?ctLabel ?rgb ?x WITH{SELECT ?i ?cd ?lat1 ?lon1 ?x(sample(?op)as?op)WHERE{{?i wdt:P31 wd:Q1248784}UNION{?i wdt:P31 wd:Q644371}?i wdt:P625 ?cd;wdt:P17 wd:Q668;p:P625/psv:P625 ?y.?y wikibase:geoLatitude ?lat1;wikibase:geoLongitude ?lon1.OPTIONAL{?i wdt:P137 ?op}}GROUP BY ?i ?cd ?lat1 ?lon1 ?x}AS%s\nWITH{SELECT ?l ?o ?t WHERE{INCLUDE %s.?i wdt:P17 wd:Q668;p:P521 ?nss.?nss ps:P521 ?ns.?ns wdt:P17 wd:Q668;p:P625/psv:P625 ?z.?z wikibase:geoLatitude ?lat2;wikibase:geoLongitude ?lon2.OPTIONAL{?nss pq:P137 ?o}FILTER(STR(?i)< STR(?ns)).BIND(CONCAT('LINESTRING(',STR(?lon1),' ',STR(?lat1),',',STR(?lon2),' ',STR(?lat2),')')AS?str).BIND(STRDT(?str,geo:wktLiteral)AS?l)}}AS%l\nWHERE{{INCLUDE%s}UNION{INCLUDE%l}.BIND(IF(BOUND(?l),\"f0f\",\"007f00\") as ?rgb)SERVICE wikibase:label{bd:serviceParam wikibase:language \"en\".}}#",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?cd ?l ?i ?iLabel ?ct ?ctLabel ?rgb ?x WITH{SELECT ?i ?cd ?lat1 ?lon1 ?x(sample(?op)as?op)WHERE{{?i wdt:[property:instance of] wd:[entity:airport]}UNION{?i wdt:[property:instance of] wd:[entity:international airport]}?i wdt:[property:coordinate location] ?cd;wdt:[property:country] wd:[entity:India];p:[property:coordinate location]/psv:[property:coordinate location] ?y.?y wikibase:geoLatitude ?lat1;wikibase:geoLongitude ?lon1.OPTIONAL{?i wdt:[property:operator] ?op}}GROUP BY ?i ?cd ?lat1 ?lon1 ?x}AS%s\nWITH{SELECT ?l ?o ?t WHERE{INCLUDE %s.?i wdt:[property:country] wd:[entity:India];p:[property:scheduled service destination] ?nss.?nss ps:[property:scheduled service destination] ?ns.?ns wdt:[property:country] wd:[entity:India];p:[property:coordinate location]/psv:[property:coordinate location] ?z.?z wikibase:geoLatitude ?lat2;wikibase:geoLongitude ?lon2.OPTIONAL{?nss pq:[property:operator] ?o}FILTER(STR(?i)< STR(?ns)).BIND(CONCAT('LINESTRING(',STR(?lon1),' ',STR(?lat1),',',STR(?lon2),' ',STR(?lat2),')')AS?str).BIND(STRDT(?str,geo:wktLiteral)AS?l)}}AS%l\nWHERE{{INCLUDE%s}UNION{INCLUDE%l}.BIND(IF(BOUND(?l),\"f0f\",\"007f00\") as ?rgb)SERVICE wikibase:label{bd:serviceParam wikibase:language \"en\".}}#",
    "complexity": "complex"
  },
  {
    "id": "1537",
    "instruction": "What are the largest administrative divisions by country?",
    "query": "SELECT ?country ?entity ?countryLabel ?entityLabel ?area WHERE {\n{\nSELECT ?country (MAX(?a) AS ?a) WHERE {\n?entity wdt:P31/wdt:P279* wd:Q10864048 ;\np:P2046/psn:P2046/wikibase:quantityAmount ?a ;\nwdt:P17 ?country .\n?country wdt:P31 wd:Q3624078 .\nFILTER NOT EXISTS { ?entity wdt:P31/wdt:P279* wd:Q15042037 }\n}\nGROUP BY ?country\n}\n?entity wdt:P31/wdt:P279* wd:Q10864048 ;\np:P2046/psn:P2046/wikibase:quantityAmount ?a ;\nwdt:P17 ?country .\n?country wdt:P31 wd:Q3624078 .\nFILTER NOT EXISTS { ?entity wdt:P31/wdt:P279* wd:Q15042037 }\nBIND(ROUND(?a / 1000000) AS ?area)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nORDER BY ?countryLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psn: <http://www.wikidata.org/prop/statement/value-normalized/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?country ?entity ?countryLabel ?entityLabel ?area WHERE {\n{\nSELECT ?country (MAX(?a) AS ?a) WHERE {\n?entity wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:first-level administrative division] ;\np:[property:area]/psn:[property:area]/wikibase:quantityAmount ?a ;\nwdt:[property:country] ?country .\n?country wdt:[property:instance of] wd:[entity:sovereign state] .\nFILTER NOT EXISTS { ?entity wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:statistical territorial entity] }\n}\nGROUP BY ?country\n}\n?entity wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:first-level administrative division] ;\np:[property:area]/psn:[property:area]/wikibase:quantityAmount ?a ;\nwdt:[property:country] ?country .\n?country wdt:[property:instance of] wd:[entity:sovereign state] .\nFILTER NOT EXISTS { ?entity wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:statistical territorial entity] }\nBIND(ROUND(?a / 1000000) AS ?area)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nORDER BY ?countryLabel",
    "complexity": "complex"
  },
  {
    "id": "1105",
    "instruction": "What are the items under 'costume accessory' in the Getty AAT thesaurus that don't have a clear subclass relationship?",
    "query": "SELECT ?item ?itemLabel ?class ?classLabel ?aat_higher ?aat_higherLabel ?indirect WITH {\nSELECT ?item WHERE {\n# ?item (p:P1014/pq:P361)* wd:Q1065579 . very very slow\nwd:Q1065579 (^pq:P361/^p:P1014)* ?item . # much quicker\n}\n} AS %costume_tree\nWHERE {\nINCLUDE %costume_tree .\n?item p:P1014/pq:P361 ?aat_higher .\nOPTIONAL {\n?item wdt:P279+ ?aat_higher .\nhint:Prior hint:gearing \"reverse\" .\nBIND(1 AS ?subclassed) .\n}\nFILTER (!bound(?subclassed)) .\nOPTIONAL {\n?item wdt:P279 ?class .\n}\nOPTIONAL {\n?item p:P1014/pq:P1480 wd:Q50095342 .\nBIND (\"Y\" AS ?indirect) .\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY ?aat_higherLabel ?indirect ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX hint: <http://www.bigdata.com/queryHints#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?class ?classLabel ?aat_higher ?aat_higherLabel ?indirect WITH {\nSELECT ?item WHERE {\n# ?item (p:[property:Art & Architecture Thesaurus ID]/pq:[property:part of])* wd:[entity:costume accessory] . very very slow\nwd:[entity:costume accessory] (^pq:[property:part of]/^p:[property:Art & Architecture Thesaurus ID])* ?item . # much quicker\n}\n} AS %costume_tree\nWHERE {\nINCLUDE %costume_tree .\n?item p:[property:Art & Architecture Thesaurus ID]/pq:[property:part of] ?aat_higher .\nOPTIONAL {\n?item wdt:[property:subclass of]+ ?aat_higher .\nhint:Prior hint:gearing \"reverse\" .\nBIND(1 AS ?subclassed) .\n}\nFILTER (!bound(?subclassed)) .\nOPTIONAL {\n?item wdt:[property:subclass of] ?class .\n}\nOPTIONAL {\n?item p:[property:Art & Architecture Thesaurus ID]/pq:[property:sourcing circumstances] wd:[entity:hierarchical link is not direct] .\nBIND (\"Y\" AS ?indirect) .\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY ?aat_higherLabel ?indirect ?itemLabel",
    "complexity": "complex"
  },
  {
    "id": "2221",
    "instruction": "Find vegan restaurants near me.",
    "query": "SELECT DISTINCT ?item ?itemLabel WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE]\". }\n{ SELECT DISTINCT ?item WHERE { ?item (p:P31/ps:P31/(wdt:P279*)) wd:Q61960067. } }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE]\". }\n{ SELECT DISTINCT ?item WHERE { ?item (p:[property:instance of]/ps:[property:instance of]/(wdt:[property:subclass of]*)) wd:[entity:vegan restaurant]. } }\n}",
    "complexity": "complex"
  },
  {
    "id": "2500",
    "instruction": "What is the average height of people with the first name Joe?",
    "query": "select ?joe ?joeLabel ?height ?average_height ?difference {\n?joe wdt:P735 wd:Q17862013 .\n?joe p:P2048 ?statement .\n?statement a wikibase:BestRank .\n?statement psn:P2048/wikibase:quantityAmount ?height .\nbind (abs(?height - ?average_height) as ?difference)\n{\nselect (avg(?height) AS ?average_height) {\n?joe wdt:P735 wd:Q17862013 .\n?joe p:P2048 ?statement .\n?statement a wikibase:BestRank .\n?statement psn:P2048/wikibase:quantityAmount ?height .\n}\n}\nservice wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} order by asc (?difference) limit 30",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psn: <http://www.wikidata.org/prop/statement/value-normalized/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nselect ?joe ?joeLabel ?height ?average_height ?difference {\n?joe wdt:[property:given name] wd:[entity:Joe] .\n?joe p:[property:height] ?statement .\n?statement a wikibase:BestRank .\n?statement psn:[property:height]/wikibase:quantityAmount ?height .\nbind (abs(?height - ?average_height) as ?difference)\n{\nselect (avg(?height) AS ?average_height) {\n?joe wdt:[property:given name] wd:[entity:Joe] .\n?joe p:[property:height] ?statement .\n?statement a wikibase:BestRank .\n?statement psn:[property:height]/wikibase:quantityAmount ?height .\n}\n}\nservice wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} order by asc (?difference) limit 30",
    "complexity": "complex"
  },
  {
    "id": "1415",
    "instruction": "List items with more child statements than actual children.",
    "query": "SELECT ?item ?itemLabel (MAX(?numChildren) AS ?numChildren) (COUNT(DISTINCT ?child) AS ?countChilden) WHERE {\n?item wdt:P1971 ?numChildren;\nwdt:P40 ?child.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?item ?itemLabel\nHAVING(?countChilden > ?numChildren)\nORDER BY DESC(?countChilden - ?numChildren)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel (MAX(?numChildren) AS ?numChildren) (COUNT(DISTINCT ?child) AS ?countChilden) WHERE {\n?item wdt:[property:number of children] ?numChildren;\nwdt:[property:child] ?child.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?item ?itemLabel\nHAVING(?countChilden > ?numChildren)\nORDER BY DESC(?countChilden - ?numChildren)",
    "complexity": "complex"
  },
  {
    "id": "2010",
    "instruction": "How many people born in Czechia died in Germany and vice versa, grouped by decade of birth?",
    "query": "select (STR(?year1) as ?year) ((count(?item) * ?sgn) as ?count) ?layer where {\n?item wdt:P19/wdt:P17 ?country . values ?country {wd:Q213 wd:Q183} . ?item wdt:P569 ?birthdate bind((FLOOR(YEAR(?birthdate)/10)*10) as ?year1) FILTER(?year1>=1800).\noptional {?item wdt:P19/wdt:P17 wd:Q213 . ?item wdt:P20/wdt:P17 wd:Q183 . bind(\"Born in Czechia, died in Germany\" as ?layer). bind(1 as ?sgn)}\noptional {?item wdt:P19/wdt:P17 wd:Q183 . ?item wdt:P20/wdt:P17 wd:Q213 . bind(\"Born in Germany, died in the Czech Republic\" as ?layer). bind(-1 as ?sgn)}\nfilter(bound(?layer)) .\n}\ngroup by ?year1 ?layer ?sgn\norder by asc(?year1)",
    "annotated": "PREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nselect (STR(?year1) as ?year) ((count(?item) * ?sgn) as ?count) ?layer where {\n?item wdt:[property:place of birth]/wdt:[property:country] ?country . values ?country {wd:[entity:Czech Republic] wd:[entity:Germany]} . ?item wdt:[property:date of birth] ?birthdate bind((FLOOR(YEAR(?birthdate)/10)*10) as ?year1) FILTER(?year1>=1800).\noptional {?item wdt:[property:place of birth]/wdt:[property:country] wd:[entity:Czech Republic] . ?item wdt:[property:place of death]/wdt:[property:country] wd:[entity:Germany] . bind(\"Born in Czechia, died in Germany\" as ?layer). bind(1 as ?sgn)}\noptional {?item wdt:[property:place of birth]/wdt:[property:country] wd:[entity:Germany] . ?item wdt:[property:place of death]/wdt:[property:country] wd:[entity:Czech Republic] . bind(\"Born in Germany, died in the Czech Republic\" as ?layer). bind(-1 as ?sgn)}\nfilter(bound(?layer)) .\n}\ngroup by ?year1 ?layer ?sgn\norder by asc(?year1)",
    "complexity": "complex"
  },
  {
    "id": "1450",
    "instruction": "What are the shortest streets in Moscow?",
    "query": "SELECT ?item ?itemLabel ?length_in_meters WHERE {\nhint:Query hint:optimizer 'None' .\n?item wdt:P131* wd:Q649 .\n?item (wdt:P31/wdt:P279*) wd:Q79007 .\n?item p:P2043/psn:P2043/wikibase:quantityAmount ?length_in_meters .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"ru,en\". }\n}\nORDER BY ?length_in_meters\nLIMIT 100",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX hint: <http://www.bigdata.com/queryHints#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psn: <http://www.wikidata.org/prop/statement/value-normalized/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?length_in_meters WHERE {\nhint:Query hint:optimizer 'None' .\n?item wdt:[property:located in the administrative territorial entity]* wd:[entity:Moscow] .\n?item (wdt:[property:instance of]/wdt:[property:subclass of]*) wd:[entity:street] .\n?item p:[property:length]/psn:[property:length]/wikibase:quantityAmount ?length_in_meters .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"ru,en\". }\n}\nORDER BY ?length_in_meters\nLIMIT 100",
    "complexity": "complex"
  },
  {
    "id": "2753",
    "instruction": "List people born in Split or \u0160ibenik who spoke or wrote Latin.",
    "query": "SELECT DISTINCT ?item ?itemLabel WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE]\". }\n{\nSELECT DISTINCT ?item WHERE {\n{\n?item p:P19 ?bornSplit.\n?bornSplit (ps:P19) wd:Q1663.\n}\nUNION\n{\n?item p:P19 ?bornSibenik.\n?bornSibenik (ps:P19/(wdt:P279*)) wd:Q3549.\n}\n?item p:P1412 ?useLatin.\n?useLatin (ps:P1412/(wdt:P279*)) wd:Q397.\n}\nLIMIT 100\n}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE]\". }\n{\nSELECT DISTINCT ?item WHERE {\n{\n?item p:[property:place of birth] ?bornSplit.\n?bornSplit (ps:[property:place of birth]) wd:[entity:Split].\n}\nUNION\n{\n?item p:[property:place of birth] ?bornSibenik.\n?bornSibenik (ps:[property:place of birth]/(wdt:[property:subclass of]*)) wd:[entity:\u0160ibenik].\n}\n?item p:[property:languages spoken, written or signed] ?useLatin.\n?useLatin (ps:[property:languages spoken, written or signed]/(wdt:[property:subclass of]*)) wd:[entity:Latin].\n}\nLIMIT 100\n}\n}",
    "complexity": "complex"
  },
  {
    "id": "191",
    "instruction": "List all species depicted in Ferdinand Bauer's works, along with the number of times each appears.",
    "query": "SELECT ?name ?taxon (COUNT(?item) as ?count) WHERE {\n?item wdt:P170 wd:Q79012. # work by Bauer\n?item wdt:P180 ?taxon. # depicting a species\n?taxon wdt:P225 ?name # taxon name of species\n} GROUP BY ?name ?taxon\nORDER by DESC(?count) ?name",
    "annotated": "PREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?name ?taxon (COUNT(?item) as ?count) WHERE {\n?item wdt:[property:creator] wd:[entity:Ferdinand Bauer]. # work by Bauer\n?item wdt:[property:depicts] ?taxon. # depicting a species\n?taxon wdt:[property:taxon name] ?name # taxon name of species\n} GROUP BY ?name ?taxon\nORDER by DESC(?count) ?name",
    "complexity": "complex"
  },
  {
    "id": "255",
    "instruction": "What items in the Ashmolean Museum are made of silk?",
    "query": "SELECT ?item ?itemLabel ?inventory (GROUP_CONCAT(?typeLabel; separator=\", \") AS ?types) (YEAR(?earliest) AS ?from) (YEAR(?latest) AS ?to) WHERE {\n?item p:P195 [ps:P195 wd:Q636400; pq:P217 ?inventory].\n?item wdt:P186 wd:Q37681; wdt:P31 ?type;\nwdt:P973 ?url FILTER (STRSTARTS(STR(?url),\"http://jameelcentre\") ).\nOPTIONAL {?item p:P571 [pq:P1319 ?earliest; pq:P1326 ?latest] }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\".\n?item rdfs:label ?itemLabel. ?type rdfs:label ?typeLabel}\n} GROUP BY ?item ?itemLabel ?inventory ?earliest ?latest\nORDER BY ?from ?to ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?inventory (GROUP_CONCAT(?typeLabel; separator=\", \") AS ?types) (YEAR(?earliest) AS ?from) (YEAR(?latest) AS ?to) WHERE {\n?item p:[property:collection] [ps:[property:collection] wd:[entity:Ashmolean Museum]; pq:[property:inventory number] ?inventory].\n?item wdt:[property:made from material] wd:[entity:silk]; wdt:[property:instance of] ?type;\nwdt:[property:described at URL] ?url FILTER (STRSTARTS(STR(?url),\"http://jameelcentre\") ).\nOPTIONAL {?item p:[property:inception] [pq:[property:earliest date] ?earliest; pq:[property:latest date] ?latest] }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\".\n?item rdfs:label ?itemLabel. ?type rdfs:label ?typeLabel}\n} GROUP BY ?item ?itemLabel ?inventory ?earliest ?latest\nORDER BY ?from ?to ?itemLabel",
    "complexity": "complex"
  },
  {
    "id": "2779",
    "instruction": "What other awards have winners of the Booker Prize received?",
    "query": "SELECT (COUNT(?item) AS ?count) ?otheraward ?otherawardLabel WHERE {\nVALUES ?award{wd:Q160082 wd:Q2052291}\n?item wdt:P166 ?award.\n#UNION{ ?item wdt:P1411 ?award. BIND(\"nominated\" AS ?rel) }\n?item wdt:P31 wd:Q5.\n?item p:P166 ?s.?s ps:P166 ?otheraward FILTER(?otheraward NOT IN(wd:Q160082, wd:Q2052291))\nOPTIONAL{?s pq:P585 ?time}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} GROUP BY ?otheraward ?otherawardLabel\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT (COUNT(?item) AS ?count) ?otheraward ?otherawardLabel WHERE {\nVALUES ?award{wd:[entity:Booker Prize] wd:[entity:International Booker Prize]}\n?item wdt:[property:award received] ?award.\n#UNION{ ?item wdt:[property:nominated for] ?award. BIND(\"nominated\" AS ?rel) }\n?item wdt:[property:instance of] wd:[entity:human].\n?item p:[property:award received] ?s.?s ps:[property:award received] ?otheraward FILTER(?otheraward NOT IN(wd:[entity:Booker Prize], wd:[entity:International Booker Prize]))\nOPTIONAL{?s pq:[property:point in time] ?time}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} GROUP BY ?otheraward ?otherawardLabel\nORDER BY DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "1359",
    "instruction": "What are the longest streets in Moscow?",
    "query": "SELECT DISTINCT ?street ?streetLabel ?length\n{\nhint:Query hint:optimizer 'None' .\n?street wdt:P131* wd:Q649 .\n?street wdt:P31/wdt:P279* wd:Q79007 .\n?street p:P2043/psn:P2043/wikibase:quantityAmount ?length .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"ru\" }\n}\nORDER BY DESC(?length) ?street\nLIMIT 100",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX hint: <http://www.bigdata.com/queryHints#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psn: <http://www.wikidata.org/prop/statement/value-normalized/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?street ?streetLabel ?length\n{\nhint:Query hint:optimizer 'None' .\n?street wdt:[property:located in the administrative territorial entity]* wd:[entity:Moscow] .\n?street wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:street] .\n?street p:[property:length]/psn:[property:length]/wikibase:quantityAmount ?length .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"ru\" }\n}\nORDER BY DESC(?length) ?street\nLIMIT 100",
    "complexity": "complex"
  }
]