[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "338",
    "instruction": "List the organizations with their number of members who are part of Early Modern Letters Online.",
    "query": "SELECT ?orgname (COUNT(?person) AS ?members)\nWHERE {\n?person wdt:P1802 [];\nwdt:P463 ?org.\n?org rdfs:label ?orgname filter (lang(?orgname) = \"en\")\n} GROUP BY ?orgname\nORDER BY DESC (?members)",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?orgname (COUNT(?person) AS ?members)\nWHERE {\n?person wdt:[property:Early Modern Letters Online person ID] [];\nwdt:[property:member of] ?org.\n?org rdfs:label ?orgname filter (lang(?orgname) = \"en\")\n} GROUP BY ?orgname\nORDER BY DESC (?members)",
    "complexity": "medium"
  },
  {
    "id": "1906",
    "instruction": "List the top snipers in the world ranked by their number of victims.",
    "query": "SELECT ?person ?personLabel ?number ?loyalLabel WHERE {\n?person wdt:P31 wd:Q5.\n?person wdt:P1120 ?number.\n# ?person wdt:P1345 ?number.\nOPTIONAL {?person wdt:P945 ?loyal.}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?number)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?person ?personLabel ?number ?loyalLabel WHERE {\n?person wdt:[property:instance of] wd:[entity:human].\n?person wdt:[property:number of deaths] ?number.\n# ?person wdt:[property:number of victims of killer] ?number.\nOPTIONAL {?person wdt:[property:allegiance] ?loyal.}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY DESC(?number)",
    "complexity": "medium"
  },
  {
    "id": "2808",
    "instruction": "What is the proportion of paintings at the Museum of Brittany?",
    "query": "SELECT ?ratio (COUNT(?q) AS ?nombre) WHERE {\n?q wdt:P31 wd:Q3305213 ; #tableau\nwdt:P195 wd:Q3329701 ; #au musee de Bretagne\nwdt:P2048 ?hauteur ; #avec une hauteur\nwdt:P2049 ?largeur . #avec une largeur\nBIND ( STR(?hauteur/?largeur) AS ?ratio ) #ratio de la hauteur et de la largeur\n}\nGROUP BY ?ratio",
    "annotated": "PREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?ratio (COUNT(?q) AS ?nombre) WHERE {\n?q wdt:[property:instance of] wd:[entity:painting] ; #tableau\nwdt:[property:collection] wd:[entity:Museum of Brittany] ; #au musee de Bretagne\nwdt:[property:height] ?hauteur ; #avec une hauteur\nwdt:[property:width] ?largeur . #avec une largeur\nBIND ( STR(?hauteur/?largeur) AS ?ratio ) #ratio de la hauteur et de la largeur\n}\nGROUP BY ?ratio",
    "complexity": "medium"
  },
  {
    "id": "1616",
    "instruction": "Find French archivists with a picture.",
    "query": "SELECT ?item ?itemLabel ?img ?occupation ?occupationLabel WHERE {\n?item wdt:P31 wd:Q5.\n?item wdt:P106 wd:Q635734.\n?item wdt:P27 wd:Q142.\n?item wdt:P18 ?img.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\nOPTIONAL { ?item wdt:P106 ?occupation. }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?img ?occupation ?occupationLabel WHERE {\n?item wdt:[property:instance of] wd:[entity:human].\n?item wdt:[property:occupation] wd:[entity:archivist].\n?item wdt:[property:country of citizenship] wd:[entity:France].\n?item wdt:[property:image] ?img.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\nOPTIONAL { ?item wdt:[property:occupation] ?occupation. }\n}",
    "complexity": "medium"
  },
  {
    "id": "2605",
    "instruction": "List the people who died in a traffic accident, sorted by their death date.",
    "query": "select distinct ?item ?itemLabel ?itemDescription ?date where {\n?item wdt:P31 wd:Q5; # Any instance of a human.\nwdt:P509 wd:Q9687;\nwdt:P570 ?date.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,nl\" }\n}\nORDER BY ASC(?date)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nselect distinct ?item ?itemLabel ?itemDescription ?date where {\n?item wdt:[property:instance of] wd:[entity:human]; # Any instance of a human.\nwdt:[property:cause of death] wd:[entity:traffic collision];\nwdt:[property:date of death] ?date.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,nl\" }\n}\nORDER BY ASC(?date)",
    "complexity": "medium"
  },
  {
    "id": "1652",
    "instruction": "List the French alphabet signs in French Sign Language.",
    "query": "SELECT ?French_alphabet ?French_alphabetLabel ?media WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?French_alphabet wdt:P361 wd:Q755124.\nOPTIONAL { ?French_alphabet p:P2919 ?label_in_sign_language.\n?label_in_sign_language ps:P2919 ?media.\n?label_in_sign_language pq:P407 wd:Q33302\n}\n}\nORDER BY ?French_alphabetLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?French_alphabet ?French_alphabetLabel ?media WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?French_alphabet wdt:[property:part of] wd:[entity:French alphabet].\nOPTIONAL { ?French_alphabet p:[property:label in sign language] ?label_in_sign_language.\n?label_in_sign_language ps:[property:label in sign language] ?media.\n?label_in_sign_language pq:[property:language of work or name] wd:[entity:French Sign Language]\n}\n}\nORDER BY ?French_alphabetLabel",
    "complexity": "medium"
  },
  {
    "id": "2183",
    "instruction": "Show me a list of large sculptures in New Zealand along with their locations.",
    "query": "SELECT ?item ?label ?_image ?coordinate_location WHERE {\n?item wdt:P31 wd:Q100323579.\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\".\n?item rdfs:label ?label.\n}\nOPTIONAL { ?item wdt:P18 ?_image. }\nOPTIONAL { ?item wdt:P625 ?coordinate_location. }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?label ?_image ?coordinate_location WHERE {\n?item wdt:[property:instance of] wd:[entity:big thing in New Zealand].\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\".\n?item rdfs:label ?label.\n}\nOPTIONAL { ?item wdt:[property:image] ?_image. }\nOPTIONAL { ?item wdt:[property:coordinate location] ?coordinate_location. }\n}",
    "complexity": "medium"
  },
  {
    "id": "1760",
    "instruction": "List all cricketers who have played in the Indian Super League.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?team ?teamLabel ?image WHERE {\n?item wdt:P54 ?team. ?team wdt:P118 wd:Q16056350.\nOPTIONAL { ?item wdt:P18 ?image. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?team ?teamLabel ?image WHERE {\n?item wdt:[property:member of sports team] ?team. ?team wdt:[property:league] wd:[entity:Indian Super League].\nOPTIONAL { ?item wdt:[property:image] ?image. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "2223",
    "instruction": "Show me a map of historical landmarks in Lower Saxony, Germany.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?pic ?coord ?denkmallink ?wikipedia WHERE {\n?item wdt:P7900 ?denkmalatlas .\nOPTIONAL { ?item wdt:P625 ?coord . }\nOPTIONAL { ?item wdt:P18 ?pic . }\nOPTIONAL {\n?wikipedia schema:about ?item ;\nschema:inLanguage \"de\" ;\nschema:isPartOf <https://de.wikipedia.org/> . }\nBIND(URI(CONCAT(\"https://denkmalatlas.niedersachsen.de/viewer/metadata/\", STR(?denkmalatlas))) AS ?denkmallink)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"de,en\" . }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?pic ?coord ?denkmallink ?wikipedia WHERE {\n?item wdt:[property:Monument Atlas Lower Saxony Objekt-ID] ?denkmalatlas .\nOPTIONAL { ?item wdt:[property:coordinate location] ?coord . }\nOPTIONAL { ?item wdt:[property:image] ?pic . }\nOPTIONAL {\n?wikipedia schema:about ?item ;\nschema:inLanguage \"de\" ;\nschema:isPartOf <https://de.wikipedia.org/> . }\nBIND(URI(CONCAT(\"https://denkmalatlas.niedersachsen.de/viewer/metadata/\", STR(?denkmalatlas))) AS ?denkmallink)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"de,en\" . }\n}",
    "complexity": "medium"
  },
  {
    "id": "1298",
    "instruction": "What are the songs by ABBA that are in A major?",
    "query": "SELECT DISTINCT ?item ?itemLabel WHERE {\n?item wdt:P826 wd:Q277793; # tonality: A major\n?wdt [ wdt:P463? wd:Q18233 ]. # linked via any property (since I don't know if it should be \"composer\", \"performer\" or something else) to ABBA or one of its members\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel WHERE {\n?item wdt:[property:tonality] wd:[entity:A major]; # tonality: A major\n?wdt [ wdt:[property:member of]? wd:[entity:ABBA] ]. # linked via any property (since I don't know if it should be \"composer\", \"performer\" or something else) to ABBA or one of its members\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "8",
    "instruction": "List all works written by Voltaire.",
    "query": "SELECT ?work ?title ?year ?english ?french WHERE {\n?work wdt:P50 wd:Q9068\nOPTIONAL{?work wdt:P577 ?pubdate}\nBIND(YEAR(?pubdate) as ?year)\nOPTIONAL{ ?english schema:about ?work ; schema:isPartOf <https://en.wikipedia.org/> }\nOPTIONAL{ ?french schema:about ?work ; schema:isPartOf <https://fr.wikipedia.org/> }\nOPTIONAL{ ?work rdfs:label ?title filter(lang(?title) = \"en\") }\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?work ?title ?year ?english ?french WHERE {\n?work wdt:[property:author] wd:[entity:Voltaire]\nOPTIONAL{?work wdt:[property:publication date] ?pubdate}\nBIND(YEAR(?pubdate) as ?year)\nOPTIONAL{ ?english schema:about ?work ; schema:isPartOf <https://en.wikipedia.org/> }\nOPTIONAL{ ?french schema:about ?work ; schema:isPartOf <https://fr.wikipedia.org/> }\nOPTIONAL{ ?work rdfs:label ?title filter(lang(?title) = \"en\") }\n}",
    "complexity": "medium"
  },
  {
    "id": "2607",
    "instruction": "How many types of properties are there in Wikidata?",
    "query": "SELECT ?propType (COUNT(DISTINCT ?prop) AS ?props) WHERE {\n?prop wikibase:propertyType ?propType .\n}\nGROUP BY ?propType\nORDER BY DESC(?props)",
    "annotated": "PREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?propType (COUNT(DISTINCT ?prop) AS ?props) WHERE {\n?prop wikibase:propertyType ?propType .\n}\nGROUP BY ?propType\nORDER BY DESC(?props)",
    "complexity": "medium"
  },
  {
    "id": "2708",
    "instruction": "List the birthplaces of Riga's mayors from 1890 to 2022.",
    "query": "select distinct ?item ?itemLabel ?itemDescription ?pob ?coord where {\n?item wdt:P31 wd:Q5;\nwdt:P39 wd:Q11116728;\nwdt:P19 ?pob.\n?pob wdt:P625 ?coord.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}\nORDER BY DESC(?sitelinks)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nselect distinct ?item ?itemLabel ?itemDescription ?pob ?coord where {\n?item wdt:[property:instance of] wd:[entity:human];\nwdt:[property:position held] wd:[entity:Mayor of Riga];\nwdt:[property:place of birth] ?pob.\n?pob wdt:[property:coordinate location] ?coord.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}\nORDER BY DESC(?sitelinks)",
    "complexity": "medium"
  },
  {
    "id": "2443",
    "instruction": "List all members of the International Society for Biocuration along with their affiliations.",
    "query": "SELECT ?autor ?autorLabel ?organization ?organizationLabel ?geo\nWHERE {\n?autor wdt:P463 * wd:Q23809291 .\n?autor ( wdt:P108 | wdt:P463 | wdt:P1416 | wdt:P69) / wdt:P361* ?organization .\n?organization wdt:P625 ?geo .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?autor ?autorLabel ?organization ?organizationLabel ?geo\nWHERE {\n?autor wdt:[property:member of] * wd:[entity:International Society for Biocuration] .\n?autor ( wdt:[property:employer] | wdt:[property:member of] | wdt:[property:affiliation] | wdt:[property:educated at]) / wdt:[property:part of]* ?organization .\n?organization wdt:[property:coordinate location] ?geo .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "628",
    "instruction": "List the names of mathematicians along with their death dates and theorems they are known for.",
    "query": "SELECT\n?genderLabel\n?theorem\n?theoremLabel\n?nameLabel\n?death\n?formula\nWHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,de,pl\". }\n?theorem wdt:P31 wd:Q65943;\nwdt:P138 ?name.\n?name wdt:P570 ?death;\nwdt:P21 ?gender .\n# OPTIONAL{\n?theorem wdt:P2534 ?formula.\n# }\n}\nORDER BY DESC(?death)\nLIMIT 100",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT\n?genderLabel\n?theorem\n?theoremLabel\n?nameLabel\n?death\n?formula\nWHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,de,pl\". }\n?theorem wdt:[property:instance of] wd:[entity:theorem];\nwdt:[property:named after] ?name.\n?name wdt:[property:date of death] ?death;\nwdt:[property:sex or gender] ?gender .\n# OPTIONAL{\n?theorem wdt:[property:defining formula] ?formula.\n# }\n}\nORDER BY DESC(?death)\nLIMIT 100",
    "complexity": "medium"
  },
  {
    "id": "2563",
    "instruction": "What are the different types of quartz?",
    "query": "SELECT ?item ?itemLabel ?pic\nWHERE\n{\n?item wdt:P279* wd:Q43010 .\n?item wdt:P18 ?pic\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?pic\nWHERE\n{\n?item wdt:[property:subclass of]* wd:[entity:quartz] .\n?item wdt:[property:image] ?pic\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}",
    "complexity": "medium"
  },
  {
    "id": "1393",
    "instruction": "List all publications and presentations related to WikiCite.",
    "query": "SELECT ?item ?itemLabel ?date ?doi ?url ?video WHERE {\n?item wdt:P921 wd:Q30035267 .\nOPTIONAL { ?item wdt:P577 ?date }\nOPTIONAL { ?item wdt:P356 ?doi }\nOPTIONAL { ?item wdt:P10 ?video }\nOPTIONAL { ?item wdt:P953 ?url }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?date ?doi ?url ?video WHERE {\n?item wdt:[property:main subject] wd:Q30035267 .\nOPTIONAL { ?item wdt:[property:publication date] ?date }\nOPTIONAL { ?item wdt:[property:DOI] ?doi }\nOPTIONAL { ?item wdt:[property:video] ?video }\nOPTIONAL { ?item wdt:[property:full work available at URL] ?url }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "1932",
    "instruction": "Find libraries with a GitHub repository and their locations.",
    "query": "SELECT * WHERE {\n?bib wdt:P31/wdt:P279* wd:Q7075 ;\nwdt:P2037 ?github ;\nwdt:P625 ?coordinate .\n}",
    "annotated": "PREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT * WHERE {\n?bib wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:library] ;\nwdt:[property:GitHub username] ?github ;\nwdt:[property:coordinate location] ?coordinate .\n}",
    "complexity": "medium"
  },
  {
    "id": "1218",
    "instruction": "List all authors who contributed to the development of writing systems.",
    "query": "SELECT DISTINCT ?author ?authorLabel ?date ?image WHERE {\n?author wdt:P31/wdt:P279* wd:Q8192 .\n?author wdt:P580|wdt:P571 ?date .\n?author wdt:P18 ?image .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en, de, fr, es, it\" }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?author ?authorLabel ?date ?image WHERE {\n?author wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:writing system] .\n?author wdt:[property:start time]|wdt:[property:inception] ?date .\n?author wdt:[property:image] ?image .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en, de, fr, es, it\" }\n}",
    "complexity": "medium"
  },
  {
    "id": "1451",
    "instruction": "List all theologians who have worked in Berlin.",
    "query": "SELECT ?theologian ?theologianLabel ?date_of_birth ?image WHERE {\n?theologian wdt:P106 wd:Q1234713.\n?theologian wdt:P937 wd:Q64.\nOPTIONAL { ?theologian wdt:P569 ?date_of_birth. }\nOPTIONAL { ?theologian wdt:P18 ?image. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?theologian ?theologianLabel ?date_of_birth ?image WHERE {\n?theologian wdt:[property:occupation] wd:[entity:theologian].\n?theologian wdt:[property:work location] wd:[entity:Berlin].\nOPTIONAL { ?theologian wdt:[property:date of birth] ?date_of_birth. }\nOPTIONAL { ?theologian wdt:[property:image] ?image. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "1032",
    "instruction": "List all people buried in the Cemetery of La Croix Rousse in Lyon, France.",
    "query": "SELECT DISTINCT ?item ?itemLabel (year(?dateNaissance) as ?anneeNaissance) (year(?dateDeces) as ?anneeDeces) ?image\nWHERE {\n?item wdt:P31/wdt:P279* wd:Q5 . #humain\n?item wdt:P119 wd:Q1542 . #lieu de sepulture\nOPTIONAL{ ?item wdt:P1442 ?image . }\nOPTIONAL { ?item wdt:P569 ?dateNaissance . }\nOPTIONAL { ?item wdt:P570 ?dateDeces . }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\". }\n} ORDER BY DESC(?image)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel (year(?dateNaissance) as ?anneeNaissance) (year(?dateDeces) as ?anneeDeces) ?image\nWHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:human] . #humain\n?item wdt:[property:place of burial] wd:[entity:Cemetery of Croix-Rousse] . #lieu de sepulture\nOPTIONAL{ ?item wdt:[property:image of grave] ?image . }\nOPTIONAL { ?item wdt:[property:date of birth] ?dateNaissance . }\nOPTIONAL { ?item wdt:[property:date of death] ?dateDeces . }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr\". }\n} ORDER BY DESC(?image)",
    "complexity": "medium"
  },
  {
    "id": "2401",
    "instruction": "Find the locations of all weather stations in Navarre.",
    "query": "SELECT ?estazio_meteorologiko ?estazio_metereologikoLabel ?koordenatuak ?itsas_mailaren_gainetiko_altuera WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"eu,es\". }\n?estazio_meteorologiko wdt:P31 wd:Q190107;\n(wdt:P131/(wdt:P131+)) wd:Q4018;\nwdt:P625 ?koordenatuak.\n?estazio_meteorologiko wdt:P2044 ?itsas_mailaren_gainetiko_altuera.\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?estazio_meteorologiko ?estazio_metereologikoLabel ?koordenatuak ?itsas_mailaren_gainetiko_altuera WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"eu,es\". }\n?estazio_meteorologiko wdt:[property:instance of] wd:[entity:weather station];\n(wdt:[property:located in the administrative territorial entity]/(wdt:[property:located in the administrative territorial entity]+)) wd:[entity:Navarre];\nwdt:[property:coordinate location] ?koordenatuak.\n?estazio_meteorologiko wdt:[property:elevation above sea level] ?itsas_mailaren_gainetiko_altuera.\n}",
    "complexity": "medium"
  },
  {
    "id": "1791",
    "instruction": "List the places where most paintings were created.",
    "query": "SELECT ?location ?locationLabel (COUNT(?item) AS ?count) WHERE {\n?item wdt:P1071 ?location .\n?item wdt:P31 wd:Q3305213 .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} GROUP BY ?location ?locationLabel\nORDER BY DESC (?count)\nLIMIT 250",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?location ?locationLabel (COUNT(?item) AS ?count) WHERE {\n?item wdt:[property:location of creation] ?location .\n?item wdt:[property:instance of] wd:[entity:painting] .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} GROUP BY ?location ?locationLabel\nORDER BY DESC (?count)\nLIMIT 250",
    "complexity": "medium"
  },
  {
    "id": "806",
    "instruction": "List the most common eponyms in the world.",
    "query": "SELECT ?eponym (COUNT(?item) AS ?count) (SAMPLE(?item) AS ?sample)\nWHERE { ?item wdt:P138 ?eponym. }\nGROUP BY ?eponym\nORDER BY DESC(?count)",
    "annotated": "PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?eponym (COUNT(?item) AS ?count) (SAMPLE(?item) AS ?sample)\nWHERE { ?item wdt:[property:named after] ?eponym. }\nGROUP BY ?eponym\nORDER BY DESC(?count)",
    "complexity": "medium"
  },
  {
    "id": "301",
    "instruction": "List the creators of astrolabes displayed in the Museum of the History of Science.",
    "query": "SELECT DISTINCT ?person ?page ?image WHERE {\n?item wdt:P31 wd:Q164992; wdt:P195 wd:Q6941088.\n?item wdt:P170 ?person.\nOPTIONAL { ?item wdt:P18 ?image }\n?page schema:about ?person; schema:isPartOf <https://en.wikipedia.org/>\n} ORDER BY ?page",
    "annotated": "PREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT DISTINCT ?person ?page ?image WHERE {\n?item wdt:[property:instance of] wd:[entity:astrolabe]; wdt:[property:collection] wd:[entity:History of Science Museum].\n?item wdt:[property:creator] ?person.\nOPTIONAL { ?item wdt:[property:image] ?image }\n?page schema:about ?person; schema:isPartOf <https://en.wikipedia.org/>\n} ORDER BY ?page",
    "complexity": "medium"
  },
  {
    "id": "1399",
    "instruction": "List all circles of latitude and meridians with their coordinates.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?coordinates WHERE {\n{ ?item wdt:P31 wd:Q146591 } UNION { ?item wdt:P31 wd:Q32099 }\nOPTIONAL { ?item wdt:P625 ?coordinates . }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?coordinates WHERE {\n{ ?item wdt:[property:instance of] wd:[entity:circle of latitude] } UNION { ?item wdt:[property:instance of] wd:[entity:meridian] }\nOPTIONAL { ?item wdt:[property:coordinate location] ?coordinates . }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}",
    "complexity": "medium"
  },
  {
    "id": "451",
    "instruction": "How many items have an OpenStreetMap relation ID?",
    "query": "SELECT (COUNT (DISTINCT ?item) AS ?count)\nWHERE\n{\n?item wdt:P402 ?value\n# change P402 to another property\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT (COUNT (DISTINCT ?item) AS ?count)\nWHERE\n{\n?item wdt:[property:OpenStreetMap relation ID] ?value\n# change [property:OpenStreetMap relation ID] to another property\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "69",
    "instruction": "List all oil paintings from Rijksmuseum's collection.",
    "query": "SELECT DISTINCT ?painting ?paintingLabel ?painterLabel ?image where {\n?painting wdt:P31/wdt:P279* wd:Q3305213 ; # any painting (or type of painting)\nwdt:P195 wd:Q190804 ; # in collection Rijksmuseum\nwdt:P170 ?painter ; # get painter\nwdt:P186 wd:Q296955 ; # Made with oil paint\nwdt:P18 ?image . # Image from Commons of the artwork\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,fr,es\"\n}\n} LIMIT 160",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?painting ?paintingLabel ?painterLabel ?image where {\n?painting wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:painting] ; # any painting (or type of painting)\nwdt:[property:collection] wd:[entity:Rijksmuseum] ; # in collection Rijksmuseum\nwdt:[property:creator] ?painter ; # get painter\nwdt:[property:image]6 wd:[entity:oil paint] ; # Made with oil paint\nwdt:[property:image] ?image . # Image from Commons of the artwork\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,fr,es\"\n}\n} LIMIT 160",
    "complexity": "medium"
  },
  {
    "id": "1295",
    "instruction": "List all US Presidents with species named after them.",
    "query": "SELECT ?item ?itemLabel ?pres ?presLabel ?image WHERE {\n?item wdt:P225 ?taxonName.\n?item wdt:P105 wd:Q7432.\n?item wdt:P138 ?pres.\n?pres wdt:P39 wd:Q11696.\n?pres wdt:P18 ?image.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?pres ?presLabel ?image WHERE {\n?item wdt:[property:taxon name] ?taxonName.\n?item wdt:[property:taxon rank] wd:[entity:species].\n?item wdt:[property:named after] ?pres.\n?pres wdt:[property:position held] wd:[entity:President of the United States].\n?pres wdt:[property:image] ?image.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "medium"
  },
  {
    "id": "935",
    "instruction": "List all treaties signed in Paris.",
    "query": "SELECT DISTINCT ?Treaty ?TreatyLabel ?date WHERE {\n?Treaty (wdt:P31/wdt:P279*) wd:Q131569.\n?Treaty wdt:P276/wdt:P131* wd:Q90.\nOPTIONAL {\n?Treaty wdt:P585 ?date.\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n} ORDER BY ?date",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?Treaty ?TreatyLabel ?date WHERE {\n?Treaty (wdt:[property:instance of]/wdt:[property:subclass of]*) wd:[entity:treaty].\n?Treaty wdt:[property:location]/wdt:[property:located in the administrative territorial entity]* wd:[entity:Paris].\nOPTIONAL {\n?Treaty wdt:[property:point in time] ?date.\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n} ORDER BY ?date",
    "complexity": "medium"
  },
  {
    "id": "1213",
    "instruction": "List early aircraft pilots who died in accidents between 1850 and 1920.",
    "query": "SELECT DISTINCT ?author ?authorLabel ?date ?image WHERE {\n?author wdt:P106 wd:Q2095549 .\n?author wdt:P570 ?date FILTER ((YEAR(?date) < 1920)&&(YEAR(?date) > 1850)).\n?author wdt:P1196 wd:Q171558 .\nOPTIONAL {?author wdt:P18 ?image .}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en, de, fr, es, it\" }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?author ?authorLabel ?date ?image WHERE {\n?author wdt:[property:occupation] wd:[entity:aircraft pilot] .\n?author wdt:[property:date of death] ?date FILTER ((YEAR(?date) < 1920)&&(YEAR(?date) > 1850)).\n?author wdt:[property:manner of death] wd:[entity:accident] .\nOPTIONAL {?author wdt:[property:image] ?image .}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en, de, fr, es, it\" }\n}",
    "complexity": "medium"
  }
]