[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "10",
    "instruction": "List all works written by Voltaire, ranked by their popularity across different language versions of Wikipedia.",
    "query": "SELECT ?work ?workLabel (COUNT(DISTINCT ?sitelink) as ?linkcount) WHERE {\n?work wdt:P50 wd:Q9068. # works by Voltaire\nMINUS {?work wdt:P31 wd:Q39811647} # translations\nMINUS {?work wdt:P31 wd:Q3331189} # editions\nMINUS {?work wdt:P31 wd:Q105420} # anthologies\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,fr,de\". }\nOPTIONAL{?sitelink schema:about ?work . # get Wikimedia pages about the work\nFILTER(CONTAINS(str(?sitelink), \".wikipedia.org/\")) } # only Wikipedia links\n} GROUP BY ?work ?workLabel ORDER BY DESC(?linkcount)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?work ?workLabel (COUNT(DISTINCT ?sitelink) as ?linkcount) WHERE {\n?work wdt:[property:author] wd:[entity:Voltaire]. # works by Voltaire\nMINUS {?work wdt:[property:instance of] wd:Q39811647} # translations\nMINUS {?work wdt:[property:instance of] wd:[entity:version, edition or translation]} # editions\nMINUS {?work wdt:[property:instance of] wd:[entity:anthology]} # anthologies\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,fr,de\". }\nOPTIONAL{?sitelink schema:about ?work . # get Wikimedia pages about the work\nFILTER(CONTAINS(str(?sitelink), \".wikipedia.org/\")) } # only Wikipedia links\n} GROUP BY ?work ?workLabel ORDER BY DESC(?linkcount)",
    "complexity": "complex"
  },
  {
    "id": "641",
    "instruction": "What are the different periods in Japanese history and what were they named after?",
    "query": "SELECT ?era ?eraLabel (YEAR(?start_time) AS ?start) (YEAR(?end_time) AS ?end) ?namedLabel ?namedDescription WHERE {\n?era wdt:P31 wd:Q11514315; wdt:P361 wd:Q130436; # eras of the history of Japan\nwdt:P580 ?start_time.\nMINUS { ?era wdt:P2348/wdt:P361 wd:Q130436 } # exclude sub-eras\nOPTIONAL { ?era wdt:P582 ?end_time } # optional end-time to make sure we include the current era\nOPTIONAL { ?era wdt:P138 ?named }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} ORDER BY ?start DESC(?end)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?era ?eraLabel (YEAR(?start_time) AS ?start) (YEAR(?end_time) AS ?end) ?namedLabel ?namedDescription WHERE {\n?era wdt:[property:instance of] wd:[entity:historical period]; wdt:[property:part of] wd:[entity:history of Japan]; # eras of the history of Japan\nwdt:[property:start time] ?start_time.\nMINUS { ?era wdt:[property:time period]/wdt:[property:part of] wd:[entity:history of Japan] } # exclude sub-eras\nOPTIONAL { ?era wdt:[property:end time] ?end_time } # optional end-time to make sure we include the current era\nOPTIONAL { ?era wdt:[property:named after] ?named }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} ORDER BY ?start DESC(?end)",
    "complexity": "complex"
  },
  {
    "id": "1409",
    "instruction": "What is the average age of members in each legislative term of the Landtag of Thuringia?",
    "query": "SELECT ?period ?periodLabel ?periodNumber (SUBSTR((AVG(?periodStart - ?dob))/365.2425, 0, 5) AS ?avgAge) WHERE {\n?abg wdt:P31 wd:Q5;\nwdt:P569 ?dob;\np:P39 [\nps:P39 wd:Q17344251;\npq:P2937 ?period\n].\n?period p:P31 [\nps:P31 wd:Q15238777;\npq:P1545 ?periodNumber\n].\n?period wdt:P580 ?periodStart.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],de\". }\n}\nGROUP BY ?period ?periodLabel ?periodNumber\nORDER BY ?periodNumber",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?period ?periodLabel ?periodNumber (SUBSTR((AVG(?periodStart - ?dob))/365.2425, 0, 5) AS ?avgAge) WHERE {\n?abg wdt:[property:instance of] wd:[entity:human];\nwdt:[property:date of birth] ?dob;\np:[property:position held] [\nps:[property:position held] wd:[entity:Member of the Landtag of Thuringia];\npq:[property:parliamentary term] ?period\n].\n?period p:[property:instance of] [\nps:[property:instance of] wd:[entity:legislative term];\npq:[property:series ordinal] ?periodNumber\n].\n?period wdt:[property:start time] ?periodStart.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],de\". }\n}\nGROUP BY ?period ?periodLabel ?periodNumber\nORDER BY ?periodNumber",
    "complexity": "complex"
  },
  {
    "id": "988",
    "instruction": "What are the interesting places near Tempelhofer Ufer 23-24?",
    "query": "SELECT ?item ?itemLabel ?coords ?statementCount WHERE {\nBIND(wd:Q15260574 AS ?location). # WMDE office; insert your location here!\n?location wdt:P625 ?locationCoords.\nSERVICE wikibase:around {\n?item wdt:P625 ?coords.\nbd:serviceParam wikibase:center ?locationCoords;\nwikibase:radius 50.\n}\nMINUS { ?item wdt:P31/wdt:P279* wd:Q1496967. } # territorial entities (cities, ...) are boring\n?item ^schema:about?/wikibase:statements ?statementCount.\nFILTER(?statementCount >= 20).\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\", \"de\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?coords ?statementCount WHERE {\nBIND(wd:[entity:Tempelhofer Ufer 23\u201324] AS ?location). # WMDE office; insert your location here!\n?location wdt:[property:coordinate location] ?locationCoords.\nSERVICE wikibase:around {\n?item wdt:[property:coordinate location] ?coords.\nbd:serviceParam wikibase:center ?locationCoords;\nwikibase:radius 50.\n}\nMINUS { ?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:Q1496967. } # territorial entities (cities, ...) are boring\n?item ^schema:about?/wikibase:statements ?statementCount.\nFILTER(?statementCount >= 20).\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\", \"de\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "943",
    "instruction": "What are the most common jobs held by heads of state?",
    "query": "SELECT ?occupation ?occupationLabel (COUNT(DISTINCT ?head) AS ?count)\nWHERE\n{\nOPTIONAL { ?country (p:P6/ps:P6)|(p:P35/ps:P35) ?head. }\nOPTIONAL { ?head p:P39/ps:P39/^(wdt:P1313|wdt:P1906) ?country. }\nFILTER(BOUND(?head)).\n?head wdt:P31 wd:Q5;\nwdt:P106 ?occupation.\nMINUS { ?occupation wdt:P279* wd:Q82955. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nGROUP BY ?occupation ?occupationLabel\nHAVING(?count >= 10)\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?occupation ?occupationLabel (COUNT(DISTINCT ?head) AS ?count)\nWHERE\n{\nOPTIONAL { ?country (p:[property:head of government]/ps:[property:head of government])|(p:[property:head of state]/ps:[property:head of state]) ?head. }\nOPTIONAL { ?head p:[property:position held]/ps:[property:position held]/^(wdt:[property:office held by head of government]|wdt:[property:office held by head of state]) ?country. }\nFILTER(BOUND(?head)).\n?head wdt:[property:instance of] wd:[entity:human];\nwdt:[property:occupation] ?occupation.\nMINUS { ?occupation wdt:[property:subclass of]* wd:[entity:politician]. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nGROUP BY ?occupation ?occupationLabel\nHAVING(?count >= 10)\nORDER BY DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "1075",
    "instruction": "List all UK-based bands with an average member age of at least 70.",
    "query": "SELECT ?band ?bandLabel (AVG(?age) AS ?avgAge) WHERE {\n?band wdt:P31/wdt:P279* wd:Q215380 .\n?band (p:P740/ps:P740/p:P17/ps:P17)|(p:P495/ps:P495) wd:Q145 . # country of inception / country of origin; Q145 is UK\n?band p:P527 ?ms .\n?ms ps:P527 ?member .\nFILTER NOT EXISTS { ?ms pq:P582 [] } .\n?member p:P569/ps:P569 ?dob .\nBIND (YEAR(NOW()) - YEAR(?dob) AS ?age)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?band ?bandLabel\nHAVING (AVG(?age) >= 70 && COUNT(?age) > 1)\nORDER BY DESC(?avgAge)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?band ?bandLabel (AVG(?age) AS ?avgAge) WHERE {\n?band wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:musical group] .\n?band (p:[property:location of formation]/ps:[property:location of formation]/p:[property:country]/ps:[property:country])|(p:[property:country of origin]/ps:[property:country of origin]) wd:[entity:United Kingdom] . # country of inception / country of origin; [entity:United Kingdom] is UK\n?band p:[property:has part(s)] ?ms .\n?ms ps:[property:has part(s)] ?member .\nFILTER NOT EXISTS { ?ms pq:[property:end time] [] } .\n?member p:[property:date of birth]/ps:[property:date of birth] ?dob .\nBIND (YEAR(NOW()) - YEAR(?dob) AS ?age)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?band ?bandLabel\nHAVING (AVG(?age) >= 70 && COUNT(?age) > 1)\nORDER BY DESC(?avgAge)",
    "complexity": "complex"
  },
  {
    "id": "199",
    "instruction": "What places did the Sibthorp/Bauer expedition visit?",
    "query": "SELECT (SUBSTR(STR(?loc),32) AS ?q) ?locLabel (SAMPLE(?coords) AS ?latlong) (MONTH(?start) AS ?start_m) (YEAR(?start) AS ?start_y) (MONTH(?end) AS ?end_m) (YEAR(?end) AS ?end_y) WHERE {\nwd:Q52496052 p:P276 ?s.\n?s ps:P276 ?loc\nOPTIONAL {?s pq:P585 ?point}\nOPTIONAL {?s pq:P580 ?startpoint}\nBIND(COALESCE(?startpoint, ?point) AS ?start)\nOPTIONAL {?s pq:P582 ?end}\n?loc wdt:P625 ?coords.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} GROUP BY ?loc ?locLabel ?start ?end\nORDER BY ?start_y ?start_m ?end_y ?end_m",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT (SUBSTR(STR(?loc),32) AS ?q) ?locLabel (SAMPLE(?coords) AS ?latlong) (MONTH(?start) AS ?start_m) (YEAR(?start) AS ?start_y) (MONTH(?end) AS ?end_m) (YEAR(?end) AS ?end_y) WHERE {\nwd:[entity:Sibthorp and Bauer expedition] p:[property:location] ?s.\n?s ps:[property:location] ?loc\nOPTIONAL {?s pq:[property:point in time] ?point}\nOPTIONAL {?s pq:[property:start time] ?startpoint}\nBIND(COALESCE(?startpoint, ?point) AS ?start)\nOPTIONAL {?s pq:[property:end time] ?end}\n?loc wdt:[property:coordinate location] ?coords.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n} GROUP BY ?loc ?locLabel ?start ?end\nORDER BY ?start_y ?start_m ?end_y ?end_m",
    "complexity": "complex"
  },
  {
    "id": "2482",
    "instruction": "List the countries with the most places mentioned in multiple encyclopedias.",
    "query": "SELECT (COUNT(?item) as ?count) ?herrialdeaLabel WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?item wdt:P1296 ?cat .\n?item wdt:P1417 ?brit.\n?item wdt:P2924 ?rus.\n?item wdt:P4342 ?norske.\n?item wdt:P17 ?herrialdea .\n}\nGROUP by ?herrialdeaLabel\nORDER by DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT (COUNT(?item) as ?count) ?herrialdeaLabel WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n?item wdt:[property:Gran Enciclop\u00e8dia Catalana ID (former scheme)] ?cat .\n?item wdt:[property:Encyclop\u00e6dia Britannica Online ID] ?brit.\n?item wdt:[property:Great Russian Encyclopedia Online ID (old version)] ?rus.\n?item wdt:[property:Store norske leksikon ID] ?norske.\n?item wdt:[property:country] ?herrialdea .\n}\nGROUP by ?herrialdeaLabel\nORDER by DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "976",
    "instruction": "List asteroids named after characters from Lewis Carroll's works.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?characterLabel WHERE {\n?item wdt:P31/wdt:P279* wd:Q3863 .\n?item wdt:P138 ?character .\n?character wdt:P1441 ?work .\n?work wdt:P50 wd:Q38082 .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} ORDER BY ?characterLabel ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?characterLabel WHERE {\n?item wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:asteroid] .\n?item wdt:[property:named after] ?character .\n?character wdt:[property:present in work] ?work .\n?work wdt:[property:author] wd:[entity:Lewis Carroll] .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n} ORDER BY ?characterLabel ?itemLabel",
    "complexity": "complex"
  },
  {
    "id": "339",
    "instruction": "List the occupations with the most people in Early Modern Letters Online.",
    "query": "SELECT ?jobname (COUNT(?person) AS ?members)\nWHERE {\n?person wdt:P1802 ?emlo;\nwdt:P106 ?job.\n?job rdfs:label ?jobname filter (lang(?jobname) = \"en\")\n} GROUP BY ?jobname\nORDER BY DESC (?members)",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?jobname (COUNT(?person) AS ?members)\nWHERE {\n?person wdt:[property:Early Modern Letters Online person ID] ?emlo;\nwdt:[property:occupation] ?job.\n?job rdfs:label ?jobname filter (lang(?jobname) = \"en\")\n} GROUP BY ?jobname\nORDER BY DESC (?members)",
    "complexity": "complex"
  },
  {
    "id": "1654",
    "instruction": "List buildings that started construction before 1163.",
    "query": "SELECT DISTINCT ?item ?itemLabel (YEAR(?incept) AS ?start) ?time_precision ?older_than_Notre_Dame WHERE {\n?item (wdt:P31/(wdt:P279*)) wd:Q41176;\np:P571 _:b3.\n_:b3 ps:P571 ?incept;\npsv:P571 _:b2.\n_:b2 wikibase:timePrecision ?time_precision.\nFILTER((YEAR(?incept)) < 1163 )\nBIND(IF((?time_precision >= 9 ) || ((YEAR(?incept)) < 1100 ), \"definitely\", \"maybe\") AS ?older_than_Notre_Dame)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nORDER BY (?incept) (?time_precision)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel (YEAR(?incept) AS ?start) ?time_precision ?older_than_Notre_Dame WHERE {\n?item (wdt:[property:instance of]/(wdt:[property:subclass of]*)) wd:[entity:building];\np:[property:inception] _:b3.\n_:b3 ps:[property:inception] ?incept;\npsv:[property:inception] _:b2.\n_:b2 wikibase:timePrecision ?time_precision.\nFILTER((YEAR(?incept)) < 1163 )\nBIND(IF((?time_precision >= 9 ) || ((YEAR(?incept)) < 1100 ), \"definitely\", \"maybe\") AS ?older_than_Notre_Dame)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nORDER BY (?incept) (?time_precision)",
    "complexity": "complex"
  },
  {
    "id": "232",
    "instruction": "What are the items in the Matenadaran collection?",
    "query": "SELECT ?item ?itemLabel (GROUP_CONCAT(?typeLabel; separator=\", \") AS ?thing) (YEAR(?date) AS ?year) ?image WHERE {\n?item wdt:P195 wd:Q1322278\nOPTIONAL {?item wdt:P31 ?type}\nOPTIONAL {?item wdt:P571 ?date}\nOPTIONAL {?item wdt:P18 ?image}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,hy\".\n?item rdfs:label ?itemLabel. ?type rdfs:label ?typeLabel}\n} GROUP BY ?item ?itemLabel ?date ?image\nORDER BY DESC(?image) ?year",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel (GROUP_CONCAT(?typeLabel; separator=\", \") AS ?thing) (YEAR(?date) AS ?year) ?image WHERE {\n?item wdt:[property:collection] wd:[entity:Matenadaran]\nOPTIONAL {?item wdt:[property:instance of] ?type}\nOPTIONAL {?item wdt:[property:inception] ?date}\nOPTIONAL {?item wdt:[property:image] ?image}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en,hy\".\n?item rdfs:label ?itemLabel. ?type rdfs:label ?typeLabel}\n} GROUP BY ?item ?itemLabel ?date ?image\nORDER BY DESC(?image) ?year",
    "complexity": "complex"
  },
  {
    "id": "2497",
    "instruction": "List the family names shared by multiple astronauts.",
    "query": "SELECT (SAMPLE(?familyNameLabel_) AS ?familyNameLabel) ?astronauts ?items (CONCAT(SUBSTR(STR(?astronauts / ?items * 100), 1, 5), \"%\") AS ?percent) WITH {\nSELECT ?familyName (COUNT(DISTINCT ?astronaut) AS ?astronauts) WHERE {\n?astronaut wdt:P31 wd:Q5;\nwdt:P450 ?mission;\nwdt:P734 ?familyName.\n}\nGROUP BY ?familyName\nHAVING(?astronauts > 1)\n} AS %astronautNames WITH {\nSELECT ?familyName (COUNT(*) AS ?items) WHERE {\nINCLUDE %astronautNames.\n?item wdt:P734 ?familyName.\n}\nGROUP BY ?familyName\n} AS %names WHERE {\nINCLUDE %astronautNames.\nINCLUDE %names.\n?familyName wdt:P1705 ?familyNameLabel_.\n}\nGROUP BY ?familyName ?astronauts ?items\nORDER BY DESC(?astronauts / ?items) ?familyNameLabel",
    "annotated": "PREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT (SAMPLE(?familyNameLabel_) AS ?familyNameLabel) ?astronauts ?items (CONCAT(SUBSTR(STR(?astronauts / ?items * 100), 1, 5), \"%\") AS ?percent) WITH {\nSELECT ?familyName (COUNT(DISTINCT ?astronaut) AS ?astronauts) WHERE {\n?astronaut wdt:[property:instance of] wd:[entity:human];\nwdt:[property:astronaut mission] ?mission;\nwdt:[property:family name] ?familyName.\n}\nGROUP BY ?familyName\nHAVING(?astronauts > 1)\n} AS %astronautNames WITH {\nSELECT ?familyName (COUNT(*) AS ?items) WHERE {\nINCLUDE %astronautNames.\n?item wdt:[property:family name] ?familyName.\n}\nGROUP BY ?familyName\n} AS %names WHERE {\nINCLUDE %astronautNames.\nINCLUDE %names.\n?familyName wdt:[property:native label] ?familyNameLabel_.\n}\nGROUP BY ?familyName ?astronauts ?items\nORDER BY DESC(?astronauts / ?items) ?familyNameLabel",
    "complexity": "complex"
  },
  {
    "id": "2136",
    "instruction": "What are the tallest statues in the world, excluding pedestals?",
    "query": "SELECT DISTINCT ?item ?itemLabel ?height ?countryLabel ?subjectLabel ?coords ?image WITH {\nSELECT ?item ?heightStatement WHERE {\n?item wdt:P31 ?type .\nVALUES ?type { wd:Q1779653 wd:Q179700 wd:Q1051606 wd:Q29168169 wd:Q3476533 }\nFILTER NOT EXISTS { ?item wdt:P31 wd:Q21745157 }\nFILTER NOT EXISTS { ?item wdt:P5816 wd:Q56556915 }\n?item p:P2048 ?heightStatement .\n{ ?heightStatement pq:P518 wd:Q179700 } UNION\n{ FILTER NOT EXISTS { ?heightStatement pq:P518 ?x } }\n}\n} AS %i WHERE {\nINCLUDE %i .\n?heightStatement psv:P2048 [\nwikibase:quantityAmount ?baseHeight;\nwikibase:quantityUnit [\np:P2370/psv:P2370 [\nwikibase:quantityAmount ?unitHeight ;\nwikibase:quantityUnit wd:Q11573\n]\n]\n].\nBIND ( ?baseHeight * ?unitHeight AS ?height )\nFILTER ( ?height >= 30 )\nOPTIONAL { ?item wdt:P17 ?country }\nOPTIONAL { ?item wdt:P625 ?coords }\nOPTIONAL { ?item wdt:P18 ?image }\nOPTIONAL { ?item wdt:P921 ?subject }\n#SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}\nORDER BY DESC(?height) ?countryLabel ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?height ?countryLabel ?subjectLabel ?coords ?image WITH {\nSELECT ?item ?heightStatement WHERE {\n?item wdt:[property:instance of] ?type .\nVALUES ?type { wd:[entity:colossal statue] wd:[entity:statue] wd:[entity:daibutsu] wd:[entity:colossal statue of Jesus] wd:[entity:monumental sculpture] }\nFILTER NOT EXISTS { ?item wdt:[property:instance of] wd:[entity:destroyed artwork] }\nFILTER NOT EXISTS { ?item wdt:[property:state of conservation] wd:[entity:demolished or destroyed] }\n?item p:[property:height] ?heightStatement .\n{ ?heightStatement pq:[property:applies to part] wd:[entity:statue] } UNION\n{ FILTER NOT EXISTS { ?heightStatement pq:[property:applies to part] ?x } }\n}\n} AS %i WHERE {\nINCLUDE %i .\n?heightStatement psv:[property:height] [\nwikibase:quantityAmount ?baseHeight;\nwikibase:quantityUnit [\np:[property:conversion to SI unit]/psv:[property:conversion to SI unit] [\nwikibase:quantityAmount ?unitHeight ;\nwikibase:quantityUnit wd:[entity:metre]\n]\n]\n].\nBIND ( ?baseHeight * ?unitHeight AS ?height )\nFILTER ( ?height >= 30 )\nOPTIONAL { ?item wdt:[property:country] ?country }\nOPTIONAL { ?item wdt:[property:coordinate location] ?coords }\nOPTIONAL { ?item wdt:[property:image] ?image }\nOPTIONAL { ?item wdt:[property:main subject] ?subject }\n#SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}\nORDER BY DESC(?height) ?countryLabel ?itemLabel",
    "complexity": "complex"
  },
  {
    "id": "1572",
    "instruction": "List all countries with multiple capital cities.",
    "query": "SELECT ?country ?countryLabel\n(COUNT(DISTINCT ?city) AS ?cities)\n(GROUP_CONCAT(DISTINCT ?cityLabel; SEPARATOR=\", \") AS ?cityLabels) WHERE {\n{ SELECT ?country ?countryLabel (COUNT(DISTINCT ?city) AS ?cities) WHERE {\n?city wdt:P1376|^wdt:P36 ?country ;\nwdt:P31/wdt:P279* wd:Q515 .\n?country rdfs:label ?countryLabel ;\nwdt:P31/wdt:P279* wd:Q3624078 .\nFILTER (LANG(?countryLabel) = \"en\")\n} GROUP BY ?country ?countryLabel HAVING (?cities > 1)\n} ?city wdt:P1376|^wdt:P36 ?country ;\nwdt:P31/wdt:P279* wd:Q515 ;\nrdfs:label ?cityLabel .\nFILTER (LANG(?cityLabel) = \"en\")\n} GROUP BY ?country ?countryLabel ORDER BY ASC(?countryLabel)",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?country ?countryLabel\n(COUNT(DISTINCT ?city) AS ?cities)\n(GROUP_CONCAT(DISTINCT ?cityLabel; SEPARATOR=\", \") AS ?cityLabels) WHERE {\n{ SELECT ?country ?countryLabel (COUNT(DISTINCT ?city) AS ?cities) WHERE {\n?city wdt:[property:capital of]|^wdt:[property:capital] ?country ;\nwdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:city] .\n?country rdfs:label ?countryLabel ;\nwdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:sovereign state] .\nFILTER (LANG(?countryLabel) = \"en\")\n} GROUP BY ?country ?countryLabel HAVING (?cities > 1)\n} ?city wdt:[property:capital of]|^wdt:[property:capital] ?country ;\nwdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:city] ;\nrdfs:label ?cityLabel .\nFILTER (LANG(?cityLabel) = \"en\")\n} GROUP BY ?country ?countryLabel ORDER BY ASC(?countryLabel)",
    "complexity": "complex"
  },
  {
    "id": "2622",
    "instruction": "What are the dishes with most ingredients on Wikidata?",
    "query": "SELECT ?dish ?dishLabel (COUNT(DISTINCT ?ingredient) AS ?ingredientCount) (GROUP_CONCAT(?ingredientLabel; separator = \", \") as ?ingredients) {\n{\nSELECT ?dish ?ingredient ?ingredientLabel {\n?dish wdt:P31 wd:Q746549 ; wdt:P527 ?ingredient .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} GROUP BY ?dish ?dishLabel ORDER BY DESC(?ingredientCount)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?dish ?dishLabel (COUNT(DISTINCT ?ingredient) AS ?ingredientCount) (GROUP_CONCAT(?ingredientLabel; separator = \", \") as ?ingredients) {\n{\nSELECT ?dish ?ingredient ?ingredientLabel {\n?dish wdt:[property:instance of] wd:[entity:dish] ; wdt:[property:has part(s)] ?ingredient .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} GROUP BY ?dish ?dishLabel ORDER BY DESC(?ingredientCount)",
    "complexity": "complex"
  },
  {
    "id": "364",
    "instruction": "What are the types of structures that hillforts belong to, excluding hillfort itself?",
    "query": "SELECT ?label ?subj ?atlas (GROUP_CONCAT(?typeLabel; separator=\", \") AS ?types) WHERE\n{ ?subj wdt:P4102 ?atlas ;\nwdt:P31 ?type ;\nrdfs:label ?label filter (lang(?label) = \"en\").\nMINUS{?type wdt:P279? wd:Q744099 }\n?type rdfs:label ?typeLabel filter (lang(?typeLabel) = \"en\").\n} GROUP BY ?label ?subj ?atlas ORDER BY ?types",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?label ?subj ?atlas (GROUP_CONCAT(?typeLabel; separator=\", \") AS ?types) WHERE\n{ ?subj wdt:[property:Atlas of Hillforts ID] ?atlas ;\nwdt:[property:instance of] ?type ;\nrdfs:label ?label filter (lang(?label) = \"en\").\nMINUS{?type wdt:[property:subclass of]? wd:[entity:hillfort] }\n?type rdfs:label ?typeLabel filter (lang(?typeLabel) = \"en\").\n} GROUP BY ?label ?subj ?atlas ORDER BY ?types",
    "complexity": "complex"
  },
  {
    "id": "1555",
    "instruction": "List languages with lexemes having multiple grammatical genders.",
    "query": "SELECT ?language ?languageLabel (COUNT(?lexeme) AS ?count)\nWITH {\nSELECT ?lexeme WHERE {\n?lexeme p:P5185 ?genderStatement.\n}\nGROUP BY ?lexeme\nHAVING(COUNT(?genderStatement) > 1)\n} AS %lexemesWithMultipleGenders\nWHERE {\nINCLUDE %lexemesWithMultipleGenders.\n?lexeme dct:language ?language.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?language ?languageLabel\nORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX dct: <http://purl.org/dc/terms/>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?language ?languageLabel (COUNT(?lexeme) AS ?count)\nWITH {\nSELECT ?lexeme WHERE {\n?lexeme p:[property:grammatical gender] ?genderStatement.\n}\nGROUP BY ?lexeme\nHAVING(COUNT(?genderStatement) > 1)\n} AS %lexemesWithMultipleGenders\nWHERE {\nINCLUDE %lexemesWithMultipleGenders.\n?lexeme dct:language ?language.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?language ?languageLabel\nORDER BY DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "1051",
    "instruction": "List all painters with more than 4 Wikipedia articles about their paintings.",
    "query": "SELECT ?painter ?painterLabel (COUNT(DISTINCT ?article) AS ?count) WHERE {\n?item wdt:P31 wd:Q3305213 .\n?article schema:about ?item .\n?article schema:isPartOf ?wiki .\nFILTER regex (str(?wiki), \".+.wikipedia.org\").\n?item wdt:P170 ?painter .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n} GROUP BY ?painter ?painterLabel HAVING (?count > 4 )",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?painter ?painterLabel (COUNT(DISTINCT ?article) AS ?count) WHERE {\n?item wdt:[property:instance of] wd:[entity:painting] .\n?article schema:about ?item .\n?article schema:isPartOf ?wiki .\nFILTER regex (str(?wiki), \".+.wikipedia.org\").\n?item wdt:[property:creator] ?painter .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n} GROUP BY ?painter ?painterLabel HAVING (?count > 4 )",
    "complexity": "complex"
  },
  {
    "id": "1579",
    "instruction": "What are the community development blocks in West Bengal that share borders with Jangipara?",
    "query": "SELECT DISTINCT ?item ?itemLabel ?image ?linkTo\nWHERE\n{\nSERVICE gas:service {\ngas:program gas:gasClass \"com.bigdata.rdf.graph.analytics.SSSP\" ;\ngas:in wd:Q15229326;\ngas:traversalDirection \"Undirected\" ;\ngas:out ?item ;\ngas:out1 ?depth ;\ngas:maxIterations 2 ;\ngas:linkType wdt:P47 .\n}\nOPTIONAL { ?item wdt:P47 ?linkTo }\nSERVICE wikibase:label {bd:serviceParam wikibase:language \"bn,en\" }\n}\n#",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\nPREFIX gas: <http://www.bigdata.com/rdf/gas#>\n\nSELECT DISTINCT ?item ?itemLabel ?image ?linkTo\nWHERE\n{\nSERVICE gas:service {\ngas:program gas:gasClass \"com.bigdata.rdf.graph.analytics.SSSP\" ;\ngas:in wd:[entity:Jangipara community development block];\ngas:traversalDirection \"Undirected\" ;\ngas:out ?item ;\ngas:out1 ?depth ;\ngas:maxIterations 2 ;\ngas:linkType wdt:[property:shares border with] .\n}\nOPTIONAL { ?item wdt:[property:shares border with] ?linkTo }\nSERVICE wikibase:label {bd:serviceParam wikibase:language \"bn,en\" }\n}\n#",
    "complexity": "complex"
  }
]