[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "2",
    "instruction": "How many scholarly articles are there on Wikidata?",
    "query": "SELECT (COUNT(?article) AS ?count)\nWHERE {\n?article wdt:P31/wdt:P279* wd:Q13442814\n}",
    "annotated": "PREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT (COUNT(?article) AS ?count)\nWHERE {\n?article wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:scholarly article]\n}",
    "complexity": "simple"
  },
  {
    "id": "238",
    "instruction": "List all objects that are mistakenly classified as papyrus.",
    "query": "SELECT * WHERE {\n?item wdt:P31 wd:Q125576\n}",
    "annotated": "PREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT * WHERE {\n?item wdt:[property:instance of] wd:[entity:papyrus]\n}",
    "complexity": "simple"
  },
  {
    "id": "1468",
    "instruction": "What algorithms are used to solve specific problems?",
    "query": "SELECT ?algorithm ?algorithmLabel ?probLabel\n{\n?algorithm wdt:P2159 ?prob .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,en\" }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?algorithm ?algorithmLabel ?probLabel\n{\n?algorithm wdt:[property:computes solution to] ?prob .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en,en\" }\n}",
    "complexity": "simple"
  },
  {
    "id": "805",
    "instruction": "What are some examples of Redewendungen?",
    "query": "SELECT ?q ?qLabel\nWHERE\n{\n?q wdt:P31 wd:Q15841920.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?q ?qLabel\nWHERE\n{\n?q wdt:[property:instance of] wd:[entity:Redewendung].\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}",
    "complexity": "simple"
  },
  {
    "id": "411",
    "instruction": "List all the competitors and their rewards.",
    "query": "SELECT ?e ?value WHERE {\nVALUES (?e ?value ?date) {\n(\"James\" \"Belgium\" \"70\")\n(\"Mary\" \"worldwide\" \"71\")\n(\"Mary\" \"worldwide\" \"72\")\n(\"Mary\" \"worldwide\" \"73\")\n(\"Mary\" \"France\" \"76\")\n}\n}",
    "annotated": "SELECT ?e ?value WHERE {\nVALUES (?e ?value ?date) {\n(\"James\" \"Belgium\" \"70\")\n(\"Mary\" \"worldwide\" \"71\")\n(\"Mary\" \"worldwide\" \"72\")\n(\"Mary\" \"worldwide\" \"73\")\n(\"Mary\" \"France\" \"76\")\n}\n}",
    "complexity": "simple"
  },
  {
    "id": "188",
    "instruction": "List all the academic disciplines with their labels.",
    "query": "SELECT DISTINCT ?a ?aLabel WHERE {\n?a wdt:P31/wdt:P279? wd:Q11862829.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\"}\n} ORDER BY ?aLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?a ?aLabel WHERE {\n?a wdt:[property:instance of]/wdt:[property:subclass of]? wd:[entity:academic discipline].\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\"}\n} ORDER BY ?aLabel",
    "complexity": "simple"
  },
  {
    "id": "206",
    "instruction": "List all botanists with their abbreviations.",
    "query": "SELECT ?b ?q ?qLabel WHERE {\n?q wdt:P428 ?b.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY ?b",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?b ?q ?qLabel WHERE {\n?q wdt:[property:botanist author abbreviation] ?b.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY ?b",
    "complexity": "simple"
  },
  {
    "id": "1391",
    "instruction": "List all entities that are related to the field of computer science.",
    "query": "SELECT DISTINCT ?id WHERE { ?id wdt:P2578 []. }",
    "annotated": "PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT DISTINCT ?id WHERE { ?id wdt:[property:is the study of] []. }",
    "complexity": "simple"
  },
  {
    "id": "1100",
    "instruction": "List all magical creatures classified as beasts in the Harry Potter series.",
    "query": "SELECT ?species ?speciesLabel WHERE {\n?species wdt:P31/wdt:P279* wd:Q2537344.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY LCASE(?speciesLabel)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?species ?speciesLabel WHERE {\n?species wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:beast species in the Harry Potter universe].\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nORDER BY LCASE(?speciesLabel)",
    "complexity": "simple"
  },
  {
    "id": "584",
    "instruction": "What gene has a variant that is a positive predictor for colorectal cancer?",
    "query": "SELECT ?geneLabel ?variantLabel\nWHERE\n{\nVALUES ?disease {wd:Q188874}\n?variant wdt:P3358 ?disease ; # P3358 Positive prognostic predictor\nwdt:P3433 ?gene . # P3433 biological variant of\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?geneLabel ?variantLabel\nWHERE\n{\nVALUES ?disease {wd:[entity:colorectal cancer]}\n?variant wdt:[property:positive prognostic predictor for] ?disease ; # [property:positive prognostic predictor for] Positive prognostic predictor\nwdt:[property:biological variant of] ?gene . # [property:biological variant of] biological variant of\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\" }\n}",
    "complexity": "simple"
  },
  {
    "id": "487",
    "instruction": "How many humans are listed in Wikidata?",
    "query": "SELECT (COUNT(*) AS ?count)\nWHERE {\n?item wdt:P31 wd:Q5 .\n}",
    "annotated": "PREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT (COUNT(*) AS ?count)\nWHERE {\n?item wdt:[property:instance of] wd:[entity:human] .\n}",
    "complexity": "simple"
  },
  {
    "id": "956",
    "instruction": "List all humans on Wikidata with unknown sex or gender.",
    "query": "SELECT ?human ?humanLabel where {\n?human wdt:P21 ?gender FILTER isBLANK(?gender) .\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?human ?humanLabel where {\n?human wdt:[property:sex or gender] ?gender FILTER isBLANK(?gender) .\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n}",
    "complexity": "simple"
  },
  {
    "id": "835",
    "instruction": "What are the hashtags related to a specific topic?",
    "query": "SELECT ?item ?itemLabel ?hashtagLabel\nWHERE\n{\n?item wdt:P2572 ?hashtag\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?hashtagLabel\nWHERE\n{\n?item wdt:[property:hashtag] ?hashtag\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}",
    "complexity": "simple"
  },
  {
    "id": "387",
    "instruction": "What is the population of Madrid?",
    "query": "SELECT ?pop WHERE {\nwd:Q2807 wdt:P1082 ?pop\n}",
    "annotated": "PREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?pop WHERE {\nwd:[entity:Madrid] wdt:[property:population] ?pop\n}",
    "complexity": "simple"
  },
  {
    "id": "292",
    "instruction": "What are the relationships between Barack Obama and other entities?",
    "query": "SELECT ?item1 ?item1Label ?item2 ?item2Label WHERE {\nVALUES ?item1Label {\"Congressional Black Caucus\"@en\n\"Barack Obama\"@en\n\"Michelle Obama\"@en\n\"University of Chicago\"@en\n\"Time Person of the Year\"@en\n\"Democratic Party\"@en\n\"White House\"@en\n\"Hillary Clinton\"@en\n\"Aragorn\"@en\n\"C. S. Lewis\"@en\n\"J. R. R. Tolkien\"@en\n\"University of Oxford\"@en\n\"World War I\"@en\n\"Battle of the Somme\"@en\n\"British Army\"@en\n\"The Lord of the Rings\"@en}\nVALUES ?item2Label {\"Congressional Black Caucus\"@en\n\"Barack Obama\"@en\n\"Michelle Obama\"@en\n\"University of Chicago\"@en\n\"Time Person of the Year\"@en\n\"Democratic Party\"@en\n\"White House\"@en\n\"Hillary Clinton\"@en\n\"Aragorn\"@en\n\"C. S. Lewis\"@en\n\"J. R. R. Tolkien\"@en\n\"University of Oxford\"@en\n\"World War I\"@en\n\"Battle of the Somme\"@en\n\"British Army\"@en\n\"The Lord of the Rings\"@en}\n?item1 rdfs:label ?item1Label.\n?item2 rdfs:label ?item2Label.\n?item1 ?prop ?item2\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n\nSELECT ?item1 ?item1Label ?item2 ?item2Label WHERE {\nVALUES ?item1Label {\"Congressional Black Caucus\"@en\n\"Barack Obama\"@en\n\"Michelle Obama\"@en\n\"University of Chicago\"@en\n\"Time Person of the Year\"@en\n\"Democratic Party\"@en\n\"White House\"@en\n\"Hillary Clinton\"@en\n\"Aragorn\"@en\n\"C. S. Lewis\"@en\n\"J. R. R. Tolkien\"@en\n\"University of Oxford\"@en\n\"World War I\"@en\n\"Battle of the Somme\"@en\n\"British Army\"@en\n\"The Lord of the Rings\"@en}\nVALUES ?item2Label {\"Congressional Black Caucus\"@en\n\"Barack Obama\"@en\n\"Michelle Obama\"@en\n\"University of Chicago\"@en\n\"Time Person of the Year\"@en\n\"Democratic Party\"@en\n\"White House\"@en\n\"Hillary Clinton\"@en\n\"Aragorn\"@en\n\"C. S. Lewis\"@en\n\"J. R. R. Tolkien\"@en\n\"University of Oxford\"@en\n\"World War I\"@en\n\"Battle of the Somme\"@en\n\"British Army\"@en\n\"The Lord of the Rings\"@en}\n?item1 rdfs:label ?item1Label.\n?item2 rdfs:label ?item2Label.\n?item1 ?prop ?item2\n}",
    "complexity": "simple"
  },
  {
    "id": "1390",
    "instruction": "List all subreddits related to a specific geographic location.",
    "query": "SELECT ?item ?itemLabel ?coords ?subreddit WHERE {\n?item wdt:P3984 ?subreddit .\n?item wdt:P625 ?coords\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?coords ?subreddit WHERE {\n?item wdt:[property:subreddit] ?subreddit .\n?item wdt:[property:coordinate location] ?coords\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}",
    "complexity": "simple"
  },
  {
    "id": "1008",
    "instruction": "List all abandoned villages in the Czech Republic.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?coord WHERE {\n{\n?item wdt:P31 wd:Q350895 .\n?item wdt:P17 wd:Q213 .\n?item wdt:P625 ?coord\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"cs\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?coord WHERE {\n{\n?item wdt:[property:instance of] wd:[entity:abandoned village] .\n?item wdt:[property:country] wd:[entity:Czech Republic] .\n?item wdt:[property:coordinate location] ?coord\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"cs\". }\n}",
    "complexity": "simple"
  },
  {
    "id": "743",
    "instruction": "What are the top 10 most populous countries?",
    "query": "SELECT ?element ?elementLabel ?symbol ?number\nWHERE\n{\n?element wdt:P31 wd:Q11344;\nwdt:P246 ?symbol;\nwdt:P1086 ?number.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE]\". }\n}\nORDER BY ?number",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?element ?elementLabel ?symbol ?number\nWHERE\n{\n?element wdt:[property:instance of] wd:[entity:chemical element];\nwdt:[property:element symbol] ?symbol;\nwdt:[property:atomic number] ?number.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE]\". }\n}\nORDER BY ?number",
    "complexity": "simple"
  },
  {
    "id": "663",
    "instruction": "Show me a map of movie locations.",
    "query": "SELECT ?movie ?movieLabel ?narrative_location ?narrative_locationLabel ?coordinates WHERE {\n?movie wdt:P840 ?narrative_location ;\nwdt:P31 wd:Q11424 .\n?narrative_location wdt:P625 ?coordinates .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?movie ?movieLabel ?narrative_location ?narrative_locationLabel ?coordinates WHERE {\n?movie wdt:[property:narrative location] ?narrative_location ;\nwdt:[property:instance of] wd:[entity:film] .\n?narrative_location wdt:[property:coordinate location] ?coordinates .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "simple"
  },
  {
    "id": "2449",
    "instruction": "How many items have no information?",
    "query": "SELECT (COUNT(*) as ?count) { ?item wikibase:statements 0 }",
    "annotated": "PREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT (COUNT(*) as ?count) { ?item wikibase:statements 0 }",
    "complexity": "simple"
  },
  {
    "id": "845",
    "instruction": "What is the main topic of each episode in The West Wing series?",
    "query": "SELECT DISTINCT ?subject ?subjectLabel WHERE {\n?episode wdt:P31 wd:Q1983062.\n?episode wdt:P179 wd:Q3577037.\n?episode wdt:P921 ?subject.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?subject ?subjectLabel WHERE {\n?episode wdt:[property:instance of] wd:[entity:episode].\n?episode wdt:[property:part of the series] wd:[entity:The West Wing].\n?episode wdt:[property:main subject] ?subject.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "complexity": "simple"
  },
  {
    "id": "2447",
    "instruction": "List all individuals buried in Cimeti\u00e8re des Carmes along with their birth and death dates.",
    "query": "SELECT ?person ?personLabel ?dateN ?dateM WHERE {\n?person wdt:P119 wd:Q2972588 .\n?person wdt:P569 ?dateN .\n?person wdt:P570 ?dateM .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?person ?personLabel ?dateN ?dateM WHERE {\n?person wdt:[property:place of burial] wd:[entity:Cimeti\u00e8re des Carmes] .\n?person wdt:[property:date of birth] ?dateN .\n?person wdt:[property:date of death] ?dateM .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "simple"
  },
  {
    "id": "1301",
    "instruction": "Find paintings that are part of the Bavarian State Painting Collections.",
    "query": "SELECT DISTINCT ?item ?image WHERE {\n?item wdt:P195 wd:Q812285 .\n?item wdt:P31 wd:Q3305213 .\n?item wdt:P18 ?image .\n}",
    "annotated": "PREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT DISTINCT ?item ?image WHERE {\n?item wdt:[property:collection] wd:[entity:Bavarian State Painting Collections] .\n?item wdt:[property:instance of] wd:[entity:painting] .\n?item wdt:[property:image] ?image .\n}",
    "complexity": "simple"
  },
  {
    "id": "1544",
    "instruction": "List all species named in honor of Donald Trump.",
    "query": "SELECT ?item ?taxonName WHERE {\n?item wdt:P225 ?taxonName.\n?item wdt:P105 wd:Q7432.\n?item wdt:P138 wd:Q22686.\n}",
    "annotated": "PREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?item ?taxonName WHERE {\n?item wdt:[property:taxon name] ?taxonName.\n?item wdt:[property:taxon rank] wd:[entity:species].\n?item wdt:[property:named after] wd:[entity:Donald Trump].\n}",
    "complexity": "simple"
  },
  {
    "id": "969",
    "instruction": "What languages share similar grammatical cases?",
    "query": "SELECT ?item ?itemLabel ?case ?caseLabel (concat(\"F3A2FF\") as ?rgb)\nWHERE\n{\n?item wdt:P2989 ?case .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?case ?caseLabel (concat(\"F3A2FF\") as ?rgb)\nWHERE\n{\n?item wdt:[property:has grammatical case] ?case .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}",
    "complexity": "simple"
  },
  {
    "id": "447",
    "instruction": "List all US presidents who were married.",
    "query": "SELECT ?pres ?presLabel ?spouse ?spouseLabel WHERE {\n?pres wdt:P31 wd:Q5 .\n?pres wdt:P39 wd:Q11696 .\n?pres wdt:P26 ?spouse .\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?pres ?presLabel ?spouse ?spouseLabel WHERE {\n?pres wdt:[property:instance of] wd:[entity:human] .\n?pres wdt:[property:position held] wd:[entity:President of the United States] .\n?pres wdt:[property:spouse] ?spouse .\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n}",
    "complexity": "simple"
  },
  {
    "id": "1361",
    "instruction": "What are the dates of each Paris Marathon edition?",
    "query": "SELECT ?marathon ?marathonLabel ?edition ?date\nWHERE {\n?marathon wdt:P31 wd:Q1071285 .\n?marathon wdt:P585 ?date .\n?marathon wdt:P393 ?edition .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n}\nORDER BY ?date",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?marathon ?marathonLabel ?edition ?date\nWHERE {\n?marathon wdt:[property:instance of] wd:[entity:Paris Marathon] .\n?marathon wdt:[property:point in time] ?date .\n?marathon wdt:[property:edition number] ?edition .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n}\nORDER BY ?date",
    "complexity": "simple"
  },
  {
    "id": "1475",
    "instruction": "List all the things that are considered as a service.",
    "query": "SELECT ?item ?label WHERE {\n?item wdt:P279 wd:Q25036597.\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n?item rdfs:label ?label\n}\n}\nLIMIT 100",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?label WHERE {\n?item wdt:[property:subclass of] wd:[entity:as a service].\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n?item rdfs:label ?label\n}\n}\nLIMIT 100",
    "complexity": "simple"
  },
  {
    "id": "316",
    "instruction": "List all entries related to 'A Dictionary of the Booksellers and Printers who Were at Work in England, Scotland and Ireland from 1641 to 1667'.",
    "query": "SELECT ?entry ?wslink WHERE {\n?entry wdt:P1433 wd:Q40901539. # published in Plomer DBP\nOPTIONAL{ ?wslink schema:about ?entry; schema:isPartOf <https://en.wikisource.org/> }\n}",
    "annotated": "PREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?entry ?wslink WHERE {\n?entry wdt:[property:published in] wd:[entity:A Dictionary of the Booksellers and Printers who Were at Work in England, Scotland and Ireland from 1641 to 1667]. # published in Plomer DBP\nOPTIONAL{ ?wslink schema:about ?entry; schema:isPartOf <https://en.wikisource.org/> }\n}",
    "complexity": "simple"
  },
  {
    "id": "1287",
    "instruction": "List the species showcased in the 'Especes en voies d'illumination' exhibition at the Paris natural history museum.",
    "query": "SELECT ?item ?itemLabel ?image WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr, en\". }\nwd:Q59312512 wdt:P180 ?item.\nOPTIONAL { ?item wdt:P18 ?image. }\n}\nLIMIT 500",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?image WHERE {\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"fr, en\". }\nwd:[entity:illuminated species] wdt:[property:image]0 ?item.\nOPTIONAL { ?item wdt:[property:image] ?image. }\n}\nLIMIT 500",
    "complexity": "simple"
  },
  {
    "id": "1775",
    "instruction": "List paintings that feature people with domestic cats.",
    "query": "SELECT * WHERE {\n?item wdt:P31 wd:Q3305213 .\n?item wdt:P136 wd:Q134307 .\n?item wdt:P180 wd:Q146 .\n?item wdt:P18 ?img .\n}\nlimit 100",
    "annotated": "PREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT * WHERE {\n?item wdt:[property:instance of] wd:[entity:painting] .\n?item wdt:[property:genre] wd:[entity:portrait] .\n?item wdt:[property:image]0 wd:[entity:house cat] .\n?item wdt:[property:image] ?img .\n}\nlimit 100",
    "complexity": "simple"
  },
  {
    "id": "1657",
    "instruction": "Show me the locations of churches in Sri Lanka on a map.",
    "query": "SELECT DISTINCT ?esglesia ?esglesialabel ?coor\nWHERE {\n?esglesia wdt:P31 wd:Q16970 ;\n?range wd:Q854;\nwdt:P625 ?coor.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?esglesia ?esglesialabel ?coor\nWHERE {\n?esglesia wdt:[property:instance of] wd:[entity:church building] ;\n?range wd:[entity:Sri Lanka];\nwdt:[property:coordinate location] ?coor.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "simple"
  },
  {
    "id": "426",
    "instruction": "Find publications associated with an author using their ORCID iD.",
    "query": "SELECT distinct ?work ?workLabel ?typeLabel\nWHERE {\n?person wdt:P496 ?orcid . # person has an ORCID\nValues ?orcid { \"0000-0001-5882-6823\" }. # ...and the ORCID is...\n?work wdt:P50 ?person . # a work has this person as author\n?work wdt:P31 ?type . # what type is the work?\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT distinct ?work ?workLabel ?typeLabel\nWHERE {\n?person wdt:[property:ORCID iD] ?orcid . # person has an ORCID\nValues ?orcid { \"0000-0001-5882-6823\" }. # ...and the ORCID is...\n?work wdt:[property:author] ?person . # a work has this person as author\n?work wdt:[property:instance of] ?type . # what type is the work?\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "simple"
  },
  {
    "id": "1013",
    "instruction": "List all items that reference themselves in their citations.",
    "query": "SELECT ?item ?itemLabel WHERE {\n?item wdt:P2860 ?item.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel WHERE {\n?item wdt:[property:cites work] ?item.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "complexity": "simple"
  },
  {
    "id": "1908",
    "instruction": "Show me a map of railway stations in France.",
    "query": "SELECT * WHERE {\n?q wdt:P17 wd:Q142 ; wdt:P31/wdt:P279* wd:Q55488 ; wdt:P625 ?coord .\n}",
    "annotated": "PREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT * WHERE {\n?q wdt:[property:country] wd:[entity:France] ; wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:railway station] ; wdt:[property:coordinate location] ?coord .\n}",
    "complexity": "simple"
  },
  {
    "id": "349",
    "instruction": "Find the locations in Early Modern Letters Online and their corresponding IDs.",
    "query": "SELECT ?q ?qLabel ?qDescription ?emlo_loc WHERE {\n?q wdt:P4672 ?emlo_loc.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?q ?qLabel ?qDescription ?emlo_loc WHERE {\n?q wdt:[property:Early Modern Letters Online location ID] ?emlo_loc.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "simple"
  },
  {
    "id": "500",
    "instruction": "Find the Wikidata items for a list of Wikipedia articles in German.",
    "query": "SELECT ?lemma ?item WHERE {\nVALUES ?lemma {\n\"Wikipedia\"@de\n\"Wikidata\"@de\n\"Berlin\"@de\n\"Technische Universitat Berlin\"@de\n}\n?sitelink schema:about ?item;\nschema:isPartOf <https://de.wikipedia.org/>;\nschema:name ?lemma.\n}",
    "annotated": "PREFIX schema: <http://schema.org/>\n\nSELECT ?lemma ?item WHERE {\nVALUES ?lemma {\n\"Wikipedia\"@de\n\"Wikidata\"@de\n\"Berlin\"@de\n\"Technische Universitat Berlin\"@de\n}\n?sitelink schema:about ?item;\nschema:isPartOf <https://de.wikipedia.org/>;\nschema:name ?lemma.\n}",
    "complexity": "simple"
  },
  {
    "id": "1534",
    "instruction": "List all cryptocurrencies named after something or someone.",
    "query": "SELECT ?crypto ?cryptoLabel ?namesakeLabel ?image\nWHERE {\n?crypto wdt:P31 wd:Q13479982.\n?crypto wdt:P138 ?namesake.\n?namesake wdt:P18 ?image.\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?crypto ?cryptoLabel ?namesakeLabel ?image\nWHERE {\n?crypto wdt:[property:instance of] wd:[entity:cryptocurrency].\n?crypto wdt:[property:named after] ?namesake.\n?namesake wdt:[property:image] ?image.\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n}",
    "complexity": "simple"
  },
  {
    "id": "258",
    "instruction": "List all items in the Ashmolean Museum without a label.",
    "query": "SELECT ?item WHERE {\n?item wdt:P195 wd:Q636400.\nMINUS {?item rdfs:label []}\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?item WHERE {\n?item wdt:[property:collection] wd:[entity:Ashmolean Museum].\nMINUS {?item rdfs:label []}\n}",
    "complexity": "simple"
  },
  {
    "id": "463",
    "instruction": "How many references are there that mention Le Figaro with a specific publication date?",
    "query": "SELECT (count(?ref) as ?mentions) WHERE {\n?statement prov:wasDerivedFrom ?ref .\n?ref pr:P248 wd:Q216047 .\n?ref pr:P577 ?date .\n}",
    "annotated": "PREFIX prov: <http://www.w3.org/ns/prov#>\nPREFIX pr: <http://www.wikidata.org/prop/reference/>\nPREFIX wd: <http://www.wikidata.org/entity/>\n\nSELECT (count(?ref) as ?mentions) WHERE {\n?statement prov:wasDerivedFrom ?ref .\n?ref pr:[property:stated in] wd:[entity:Le Figaro] .\n?ref pr:[property:publication date] ?date .\n}",
    "complexity": "simple"
  },
  {
    "id": "305",
    "instruction": "List all astrolabes with the King number 150.",
    "query": "SELECT * WHERE {\n?item wdt:P31/wdt:P361? wd:Q164992; wdt:P528 \"150\"\n}",
    "annotated": "PREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT * WHERE {\n?item wdt:[property:instance of]/wdt:[property:part of]? wd:[entity:astrolabe]; wdt:[property:catalog code] \"150\"\n}",
    "complexity": "simple"
  },
  {
    "id": "381",
    "instruction": "What is the predicate of a node with value 'Wikidata'?",
    "query": "SELECT ?node ?predicate WHERE {\n?node ?predicate \"Wikidata\"\n}",
    "annotated": "SELECT ?node ?predicate WHERE {\n?node ?predicate \"Wikidata\"\n}",
    "complexity": "simple"
  },
  {
    "id": "1417",
    "instruction": "Find the locations of departmental archives in France on a map.",
    "query": "SELECT ?objectLabel ?objectDescription ?link ?coord\nWHERE {\n?object wdt:P31 wd:Q2860456 ;\nwdt:P625 ?coord .\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"fr\"\n}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?objectLabel ?objectDescription ?link ?coord\nWHERE {\n?object wdt:[property:instance of] wd:[entity:departmental archives] ;\nwdt:[property:coordinate location] ?coord .\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"fr\"\n}\n}",
    "complexity": "simple"
  },
  {
    "id": "190",
    "instruction": "List all artworks created by Ferdinand Bauer.",
    "query": "SELECT ?item ?itemLabel ?typeLabel WHERE {\n?item wdt:P170 wd:Q79012; wdt:P31 ?type\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER by ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?typeLabel WHERE {\n?item wdt:[property:creator] wd:[entity:Ferdinand Bauer]; wdt:[property:instance of] ?type\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER by ?itemLabel",
    "complexity": "simple"
  }
]