[
  {
    "id": "1226",
    "instruction": "List all Amara taxons with their corresponding Wikispecies articles.",
    "query": "SELECT ?q ?article {\n?q wdt:P31 wd:Q16521 ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "annotated": "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX schema: <http://schema.org/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\n\nSELECT ?q ?article {\n?q wdt:[property:instance of] wd:[entity:taxon] ; rdfs:label 'Amara'@en .\n?article schema:about ?q ; schema:isPartOf <https://species.wikimedia.org/>\n}",
    "complexity": "simple"
  },
  {
    "id": "2353",
    "instruction": "List the places where Swedish athletes were born who participated in the 1912 Summer Olympics.",
    "query": "SELECT ?person ?personLabel ?personDescription ?birth ?sportLabel ?SPA ?coord ?coord2 ?coord3 ?img WHERE {\n?person wdt:P1344 wd:Q8118.\n?person wdt:P27 wd:Q34.\n?person wdt:P569 ?birth.\nOPTIONAL {?person wdt:P2416 ?sport}\nOPTIONAL { ?person wdt:P4819 ?SPAID} # Svenskt Portrattarkiv\nBIND (URI(CONCAT(\"https://xn--portrttarkiv-kcb.se/details/\",?SPAID)) AS ?SPA)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"sv\",\"en\" . }\nOPTIONAL { ?person wdt:P18 ?img. }\nOPTIONAL { ?person wdt:P19 ?loc . # P19 Place of Birth\n?loc wdt:P625 ?coord } . # Get coordinates from Place of Birth\nOPTIONAL { ?person wdt:P20 ?loc2 . # P19 Place of Death\n?loc2 wdt:P625 ?coord2 } . # Get coordinates from Place of Death\nOPTIONAL { ?person wdt:P119 ?loc3 . # P19 Place of Burial\n?loc3 wdt:P625 ?coord3 } . # Get coordinates from Place of Burial\n}\norder by ?personLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?person ?personLabel ?personDescription ?birth ?sportLabel ?SPA ?coord ?coord2 ?coord3 ?img WHERE {\n?person wdt:[property:participant in] wd:[entity:1912 Summer Olympics].\n?person wdt:[property:country of citizenship] wd:[entity:Sweden].\n?person wdt:[property:date of birth] ?birth.\nOPTIONAL {?person wdt:[property:sports discipline competed in] ?sport}\nOPTIONAL { ?person wdt:[property:Swedish Portrait Archive ID] ?SPAID} # Svenskt Portrattarkiv\nBIND (URI(CONCAT(\"https://xn--portrttarkiv-kcb.se/details/\",?SPAID)) AS ?SPA)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"sv\",\"en\" . }\nOPTIONAL { ?person wdt:[property:image] ?img. }\nOPTIONAL { ?person wdt:[property:place of birth] ?loc . # [property:place of birth] Place of Birth\n?loc wdt:[property:coordinate location] ?coord } . # Get coordinates from Place of Birth\nOPTIONAL { ?person wdt:[property:place of death] ?loc2 . # [property:place of birth] Place of Death\n?loc2 wdt:[property:coordinate location] ?coord2 } . # Get coordinates from Place of Death\nOPTIONAL { ?person wdt:[property:place of burial] ?loc3 . # [property:place of birth] Place of Burial\n?loc3 wdt:[property:coordinate location] ?coord3 } . # Get coordinates from Place of Burial\n}\norder by ?personLabel",
    "complexity": "complex"
  },
  {
    "id": "1886",
    "instruction": "List all municipalities in the Basque Country with a population of less than 5,000.",
    "query": "SELECT ?item ?itemLabel ?biztanleria ?koordenatuak WHERE {\n{ ?item wdt:P31 wd:Q2074737. }\nUNION\n{ ?item wdt:P31 wd:Q484170. }\n?item ((wdt:P131*)/^wdt:P527) wd:Q47588;\nwdt:P1082 ?biztanleria.\nFILTER(?biztanleria < 5000 )\n?item wdt:P625 ?koordenatuak.\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"eu\" .\n}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?item ?itemLabel ?biztanleria ?koordenatuak WHERE {\n{ ?item wdt:[property:instance of] wd:[entity:municipality of Spain]. }\nUNION\n{ ?item wdt:[property:instance of] wd:[entity:commune of France]. }\n?item ((wdt:[property:located in the administrative territorial entity]*)/^wdt:[property:has part(s)]) wd:[entity:Basque Country];\nwdt:[property:population] ?biztanleria.\nFILTER(?biztanleria < 5000 )\n?item wdt:[property:coordinate location] ?koordenatuak.\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"eu\" .\n}\n}",
    "complexity": "complex"
  },
  {
    "id": "476",
    "instruction": "Find places between Arc de Triomphe and Louvre Museum on a map.",
    "query": "SELECT ?place ?placeLabel ?location WHERE {\nwd:Q64436 wdt:P625 ?Wloc .\nwd:Q19675 wdt:P625 ?Eloc .\nSERVICE wikibase:box {\n?place wdt:P625 ?location .\nbd:serviceParam wikibase:cornerWest ?Wloc .\nbd:serviceParam wikibase:cornerEast ?Eloc .\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?place ?placeLabel ?location WHERE {\nwd:[entity:Arc de Triomphe] wdt:[property:coordinate location] ?Wloc .\nwd:[entity:Louvre Museum] wdt:[property:coordinate location] ?Eloc .\nSERVICE wikibase:box {\n?place wdt:[property:coordinate location] ?location .\nbd:serviceParam wikibase:cornerWest ?Wloc .\nbd:serviceParam wikibase:cornerEast ?Eloc .\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "875",
    "instruction": "What are the largest cities in each country?",
    "query": "SELECT DISTINCT ?city ?cityLabel ?population ?country ?countryLabel ?loc WHERE {\n{\nSELECT (MAX(?population) AS ?population) ?country WHERE {\n?city wdt:P31/wdt:P279* wd:Q515 .\n?city wdt:P1082 ?population .\n?city wdt:P17 ?country .\n}\nGROUP BY ?country\nORDER BY DESC(?population)\n}\n?city wdt:P31/wdt:P279* wd:Q515 .\n?city wdt:P1082 ?population .\n?city wdt:P17 ?country .\n?city wdt:P625 ?loc .\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?city ?cityLabel ?population ?country ?countryLabel ?loc WHERE {\n{\nSELECT (MAX(?population) AS ?population) ?country WHERE {\n?city wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:city] .\n?city wdt:[property:population] ?population .\n?city wdt:[property:country] ?country .\n}\nGROUP BY ?country\nORDER BY DESC(?population)\n}\n?city wdt:[property:instance of]/wdt:[property:subclass of]* wd:[entity:city] .\n?city wdt:[property:population] ?population .\n?city wdt:[property:country] ?country .\n?city wdt:[property:coordinate location] ?loc .\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en\" .\n}\n}",
    "complexity": "complex"
  },
  {
    "id": "903",
    "instruction": "List the authors of scholarly articles with external data available at specific URLs.",
    "query": "select ?author1 ?author1Label ?image ?author2 where {\n?item wdt:P31 wd:Q13442814 .\n?item wdt:P1325 ?resource .\nfilter ( strstarts(str(?resource), \"https://openfmri.org/\") || strstarts(str(?resource), \"http://neurosynth.org/\") || strstarts(str(?resource), \"http://neurovault.org/\")\n)\n?item wdt:P50 ?author1 ;\nwdt:P50 ?author2 .\noptional { ?author1 wdt:P18 ?image . }\nfilter not exists { filter (?author1 = ?author2) }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nselect ?author1 ?author1Label ?image ?author2 where {\n?item wdt:[property:instance of] wd:[entity:scholarly article] .\n?item wdt:[property:external data available at URL] ?resource .\nfilter ( strstarts(str(?resource), \"https://openfmri.org/\") || strstarts(str(?resource), \"http://neurosynth.org/\") || strstarts(str(?resource), \"http://neurovault.org/\")\n)\n?item wdt:[property:author] ?author1 ;\nwdt:[property:author] ?author2 .\noptional { ?author1 wdt:[property:image] ?image . }\nfilter not exists { filter (?author1 = ?author2) }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n}",
    "complexity": "complex"
  },
  {
    "id": "871",
    "instruction": "What are the objects with the highest mass?",
    "query": "SELECT ?object ?objectLabel (MAX(?mass) AS ?mass)\nWHERE\n{\n?object p:P2067/psv:P2067 [\nwikibase:quantityAmount ?baseMass;\nwikibase:quantityUnit [\np:P2370/psv:P2370 [\nwikibase:quantityAmount ?unitMass;\nwikibase:quantityUnit wd:Q11570\n]\n]\n].\nBIND(?baseMass * ?unitMass AS ?mass).\nMINUS { ?object wdt:P31 wd:Q3647172. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nGROUP BY ?object ?objectLabel\nORDER BY DESC(?mass)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?object ?objectLabel (MAX(?mass) AS ?mass)\nWHERE\n{\n?object p:[property:mass]/psv:[property:mass] [\nwikibase:quantityAmount ?baseMass;\nwikibase:quantityUnit [\np:[property:conversion to SI unit]/psv:[property:conversion to SI unit] [\nwikibase:quantityAmount ?unitMass;\nwikibase:quantityUnit wd:[entity:kilogram]\n]\n]\n].\nBIND(?baseMass * ?unitMass AS ?mass).\nMINUS { ?object wdt:[property:instance of] wd:[entity:unit of mass]. }\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}\nGROUP BY ?object ?objectLabel\nORDER BY DESC(?mass)",
    "complexity": "complex"
  },
  {
    "id": "1988",
    "instruction": "List the number of members elected to the Swedish parliament for each election since 1970.",
    "query": "SELECT (COUNT(?item) AS ?count) ?electedLabel WHERE {\n?item p:P39 ?positionStatement .\n?positionStatement ps:P39 wd:Q10655178 .\n?positionStatement pq:P2715 ?elected\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?electedLabel\nORDER BY DESC(?electedLabel)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT (COUNT(?item) AS ?count) ?electedLabel WHERE {\n?item p:[property:position held] ?positionStatement .\n?positionStatement ps:[property:position held] wd:[entity:member of the Swedish Riksdag] .\n?positionStatement pq:[property:elected in] ?elected\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}\nGROUP BY ?electedLabel\nORDER BY DESC(?electedLabel)",
    "complexity": "complex"
  },
  {
    "id": "1885",
    "instruction": "List all French municipalities with archived departmental archives in Bouches-du-Rhone.",
    "query": "SELECT DISTINCT ?itemLabel ?NumeroInv ?item ?coord ?blason ?archives ?rgb WHERE {\n?item wdt:P485 ?archives.\n?archives wdt:P31 wd:Q2860456.\n?item p:P485 ?instat.\n?instat ps:P485 ?AD83;\npq:P217 ?NumeroInv.\n?item wdt:P31 wd:Q484170;\nwdt:P625 ?coord;\nwdt:P94 ?blason.\nBIND ( substr(str(?archives),34,6) AS ?rgb )\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],fr\". }\n}\nORDER BY (?itemLabel)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?itemLabel ?NumeroInv ?item ?coord ?blason ?archives ?rgb WHERE {\n?item wdt:[property:archives at] ?archives.\n?archives wdt:[property:instance of] wd:[entity:departmental archives].\n?item p:[property:archives at] ?instat.\n?instat ps:[property:archives at] ?AD83;\npq:[property:inventory number] ?NumeroInv.\n?item wdt:[property:instance of] wd:[entity:commune of France];\nwdt:[property:coordinate location] ?coord;\nwdt:[property:coat of arms image] ?blason.\nBIND ( substr(str(?archives),34,6) AS ?rgb )\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],fr\". }\n}\nORDER BY (?itemLabel)",
    "complexity": "complex"
  },
  {
    "id": "2608",
    "instruction": "What languages have the most native speakers?",
    "query": "SELECT DISTINCT (?item AS ?QNumber) ?P220 ?LanguageLabel ?P1098 ?Qualifier_P585\nWHERE\n{\nVALUES ?instance_of { wd:Q34770 wd:Q33384 } # Language or dialect\n?item wdt:P31 ?instance_of .\nOPTIONAL { ?item wdt:P220 ?P220 . } # ISO 639 3 code\n?item p:P1098 ?no_of_speakers_statement .\n?no_of_speakers_statement wikibase:rank wikibase:PreferredRank . # Has preferred rank\n?no_of_speakers_statement pq:P518 wd:Q36870 . # Has the qualifier applies to part = first language\n?no_of_speakers_statement ps:P1098 ?P1098 . # No of speakers\nOPTIONAL { ?no_of_speakers_statement pq:P585 ?Qualifier_P585 . } # Optional timestamp\nSERVICE wikibase:label\n{\nbd:serviceParam wikibase:language \"en\" .\n?item rdfs:label ?LanguageLabel .\n}\n}\nORDER BY DESC(?P1098)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT (?item AS ?QNumber) ?[property:ISO 639-3 code] ?LanguageLabel ?[property:number of speakers, writers, or signers] ?Qualifier_[property:point in time]\nWHERE\n{\nVALUES ?instance_of { wd:[entity:language] wd:[entity:dialect] } # Language or dialect\n?item wdt:[property:instance of] ?instance_of .\nOPTIONAL { ?item wdt:[property:ISO 639-3 code] ?[property:ISO 639-3 code] . } # ISO 639 3 code\n?item p:[property:number of speakers, writers, or signers] ?no_of_speakers_statement .\n?no_of_speakers_statement wikibase:rank wikibase:PreferredRank . # Has preferred rank\n?no_of_speakers_statement pq:[property:applies to part] wd:[entity:first language] . # Has the qualifier applies to part = first language\n?no_of_speakers_statement ps:[property:number of speakers, writers, or signers] ?[property:number of speakers, writers, or signers] . # No of speakers\nOPTIONAL { ?no_of_speakers_statement pq:[property:point in time] ?Qualifier_[property:point in time] . } # Optional timestamp\nSERVICE wikibase:label\n{\nbd:serviceParam wikibase:language \"en\" .\n?item rdfs:label ?LanguageLabel .\n}\n}\nORDER BY DESC(?[property:number of speakers, writers, or signers])",
    "complexity": "complex"
  },
  {
    "id": "1983",
    "instruction": "List all UK parliament members with mythical ancestors.",
    "query": "SELECT ?mp ?mpLabel ?person ?personLabel ?born ?died ?typeLabel WHERE {\n?mp p:P39 ?positionStatement .\n?positionStatement ps:P39 wd:Q77685926 . # this person is a member of the current parliament\n{ ?mp (wdt:P25|wdt:P22)* ?person . } # mp's mother or father, or their mother or father, and so on\nfilter not exists { ?person wdt:P31 wd:Q5 } . # the ancestor is not \"a human\"\n?person wdt:P31 ?type .\nOPTIONAL { ?person wdt:P569 ?born } .\nOPTIONAL { ?person wdt:P570 ?died } .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?mp ?mpLabel ?person ?personLabel ?born ?died ?typeLabel WHERE {\n?mp p:[property:position held] ?positionStatement .\n?positionStatement ps:[property:position held] wd:[entity:member of the 58th Parliament of the United Kingdom] . # this person is a member of the current parliament\n{ ?mp (wdt:[property:mother]|wdt:[property:father])* ?person . } # mp's mother or father, or their mother or father, and so on\nfilter not exists { ?person wdt:[property:instance of] wd:[entity:human] } . # the ancestor is not \"a human\"\n?person wdt:[property:instance of] ?type .\nOPTIONAL { ?person wdt:[property:date of birth] ?born } .\nOPTIONAL { ?person wdt:[property:date of death] ?died } .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "2695",
    "instruction": "List all occupations classified by ISCO or ESCO.",
    "query": "SELECT DISTINCT ?url ?code ?named_as ?links ?stmts ?item ?itemLabel ?itemDescription\nWITH {\nSELECT DISTINCT ?url ?code ?named_as ?item WHERE {\n{\n?item p:P4652 ?stmt .\nOPTIONAL {?stmt ps:P4652 ?esco .\nwd:P4652 wdt:P1630 ?fmt .\nBIND(IRI(REPLACE(?esco, '(^.*)', ?fmt)) AS ?esco_url) .\nOPTIONAL {?stmt pq:P528 ?code} .\n}\nOPTIONAL {?stmt pq:P4900/p:P4652/pq:P528 ?c1 . BIND(CONCAT(?c1, \".x\") AS ?code)} .\n} UNION {\n?item wdt:P31 wd:Q108300140 .\n?item p:P8283 ?stmt .\n?stmt ps:P8283 ?code .\nwd:P8283 wdt:P1630 ?fmt .\nBIND(IRI(REPLACE(?code, '(^.*)', ?fmt)) AS ?isco_url) .\n} .\nOPTIONAL {?stmt pq:P1810 ?named_as} .\nBIND(COALESCE(?isco_url, ?esco_url) AS ?url) .\n}\n} AS %items\nWHERE {\nINCLUDE %items .\n?item wikibase:statements ?stmts .\n?item wikibase:sitelinks ?links .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY ?code ?named_as ?itemLabel",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX ps: <http://www.wikidata.org/prop/statement/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?url ?code ?named_as ?links ?stmts ?item ?itemLabel ?itemDescription\nWITH {\nSELECT DISTINCT ?url ?code ?named_as ?item WHERE {\n{\n?item p:[property:ESCO Occupation ID] ?stmt .\nOPTIONAL {?stmt ps:[property:ESCO Occupation ID] ?esco .\nwd:[property:ESCO Occupation ID] wdt:[property:formatter URL] ?fmt .\nBIND(IRI(REPLACE(?esco, '(^.*)', ?fmt)) AS ?esco_url) .\nOPTIONAL {?stmt pq:[property:catalog code] ?code} .\n}\nOPTIONAL {?stmt pq:[property:broader concept]/p:[property:ESCO Occupation ID]/pq:[property:catalog code] ?c1 . BIND(CONCAT(?c1, \".x\") AS ?code)} .\n} UNION {\n?item wdt:[property:instance of] wd:[entity:occupation group according to ISCO-08] .\n?item p:[property:ISCO-08 occupation class] ?stmt .\n?stmt ps:[property:ISCO-08 occupation class] ?code .\nwd:[property:ISCO-08 occupation class] wdt:[property:formatter URL] ?fmt .\nBIND(IRI(REPLACE(?code, '(^.*)', ?fmt)) AS ?isco_url) .\n} .\nOPTIONAL {?stmt pq:[property:subject named as] ?named_as} .\nBIND(COALESCE(?isco_url, ?esco_url) AS ?url) .\n}\n} AS %items\nWHERE {\nINCLUDE %items .\n?item wikibase:statements ?stmts .\n?item wikibase:sitelinks ?links .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY ?code ?named_as ?itemLabel",
    "complexity": "complex"
  },
  {
    "id": "1857",
    "instruction": "List all topic pairs that frequently co-occur with SARS-CoV-2 in the COVID-19 literature.",
    "query": "SELECT\n?topic1 ?topic1Label ?topic2 ?topic2Label\nWITH {\nSELECT\n(COUNT(?work) AS ?count) ?topic1 ?topic2\nWHERE {\n# Find works that are marked with main subject of the topic.\n?work wdt:P921 / ( wdt:P31*/wdt:P279* | wdt:P361+ | wdt:P1269+ ) wd:Q82069695 .\n# Identify co-occuring topics.\n?work wdt:P921 ?topic1, ?topic2 .\n# Exclude the topic it self\nFILTER (wd:Q82069695 != ?topic1 && wd:Q82069695 != ?topic2 && ?topic1 != ?topic2)\n}\nGROUP BY ?topic1 ?topic2\nORDER BY DESC(?count)\n# There a performance problems in the browser: We cannot show large graphs,\n# so we put a limit on the number of links displayed.\nLIMIT 400\n} AS %results\nWHERE {\nINCLUDE %results\n# Label the results\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en,da,de,es,fr,jp,nl,no,ru,sv,zh\".\n}\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT\n?topic1 ?topic1Label ?topic2 ?topic2Label\nWITH {\nSELECT\n(COUNT(?work) AS ?count) ?topic1 ?topic2\nWHERE {\n# Find works that are marked with main subject of the topic.\n?work wdt:[property:main subject] / ( wdt:[property:instance of]*/wdt:[property:subclass of]* | wdt:[property:part of]+ | wdt:[property:facet of]+ ) wd:[entity:SARS-CoV-2] .\n# Identify co-occuring topics.\n?work wdt:[property:main subject] ?topic1, ?topic2 .\n# Exclude the topic it self\nFILTER (wd:[entity:SARS-CoV-2] != ?topic1 && wd:[entity:SARS-CoV-2] != ?topic2 && ?topic1 != ?topic2)\n}\nGROUP BY ?topic1 ?topic2\nORDER BY DESC(?count)\n# There a performance problems in the browser: We cannot show large graphs,\n# so we put a limit on the number of links displayed.\nLIMIT 400\n} AS %results\nWHERE {\nINCLUDE %results\n# Label the results\nSERVICE wikibase:label {\nbd:serviceParam wikibase:language \"en,da,de,es,fr,jp,nl,no,ru,sv,zh\".\n}\n}",
    "complexity": "complex"
  },
  {
    "id": "2325",
    "instruction": "How many statements are there for each property in theatrical plays?",
    "query": "SELECT ?property ?propertyLabel ?count WITH {\nSELECT ?property (count(?property) as ?count)\nWHERE\n{\n?item wdt:P31 wd:Q25379.\nhint:Prior hint:runFirst true.\n?item ?predicate [].\n?property wikibase:directClaim ?predicate .\n} group by ?property ?propertyLabel } as %i\nWHERE\n{\nINCLUDE %i\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY DESC(?count)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX hint: <http://www.bigdata.com/queryHints#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?property ?propertyLabel ?count WITH {\nSELECT ?property (count(?property) as ?count)\nWHERE\n{\n?item wdt:[property:instance of] wd:[entity:play].\nhint:Prior hint:runFirst true.\n?item ?predicate [].\n?property wikibase:directClaim ?predicate .\n} group by ?property ?propertyLabel } as %i\nWHERE\n{\nINCLUDE %i\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} ORDER BY DESC(?count)",
    "complexity": "complex"
  },
  {
    "id": "994",
    "instruction": "List people who died farthest from their birthplace.",
    "query": "SELECT DISTINCT ?item ?itemLabel ?birthLabel ?deathLabel ?distance WHERE {\n{\nSELECT ?item ?birth ?death ?distance WHERE {\n?item wdt:P31 wd:Q5 .\n?item wdt:P19 ?birth .\n?item wdt:P20 ?death .\n?birth wdt:P625 ?coordsb .\n?death wdt:P625 ?coordsd .\nBIND(ROUND(geof:distance(?coordsb, ?coordsd)) AS ?distance) .\nFILTER (?distance>19000)\n}\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n}\nORDER BY DESC(?distance)",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT DISTINCT ?item ?itemLabel ?birthLabel ?deathLabel ?distance WHERE {\n{\nSELECT ?item ?birth ?death ?distance WHERE {\n?item wdt:[property:instance of] wd:[entity:human] .\n?item wdt:[property:place of birth] ?birth .\n?item wdt:[property:place of death] ?death .\n?birth wdt:[property:coordinate location] ?coordsb .\n?death wdt:[property:coordinate location] ?coordsd .\nBIND(ROUND(geof:distance(?coordsb, ?coordsd)) AS ?distance) .\nFILTER (?distance>19000)\n}\n}\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . }\n}\nORDER BY DESC(?distance)",
    "complexity": "complex"
  },
  {
    "id": "1137",
    "instruction": "List the longest chain of people who murdered each other.",
    "query": "SELECT distinct ?pers1 ?pers1Label ?pers2 ?pers2Label ?pers3 ?pers3Label ?pers4 ?pers4Label ?pers5 ?pers5Label ?pers6 ?pers6Label\nWHERE {\n?pers1 wdt:P157 ?pers2 .\nFILTER ( ?pers1 != ?pers2 )\n?pers2 wdt:P157 ?pers3 .\nFILTER ( ?pers1 != ?pers3 )\nFILTER ( ?pers2 != ?pers3 )\n?pers3 wdt:P157 ?pers4 .\nFILTER ( ?pers1 != ?pers4 )\nFILTER ( ?pers2 != ?pers4 )\n?pers4 wdt:P157 ?pers5 .\nFILTER ( ?pers1 != ?pers5 )\n?pers5 wdt:P157 ?pers6 .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT distinct ?pers1 ?pers1Label ?pers2 ?pers2Label ?pers3 ?pers3Label ?pers4 ?pers4Label ?pers5 ?pers5Label ?pers6 ?pers6Label\nWHERE {\n?pers1 wdt:[property:killed by] ?pers2 .\nFILTER ( ?pers1 != ?pers2 )\n?pers2 wdt:[property:killed by] ?pers3 .\nFILTER ( ?pers1 != ?pers3 )\nFILTER ( ?pers2 != ?pers3 )\n?pers3 wdt:[property:killed by] ?pers4 .\nFILTER ( ?pers1 != ?pers4 )\nFILTER ( ?pers2 != ?pers4 )\n?pers4 wdt:[property:killed by] ?pers5 .\nFILTER ( ?pers1 != ?pers5 )\n?pers5 wdt:[property:killed by] ?pers6 .\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "590",
    "instruction": "What are the interactions between metabolites and their pKa changes?",
    "query": "SELECT DISTINCT ?wpid ?metaboliteLabel ?pKa ?pKa2 ?metabolite2Label ?wpid2\nWITH {\nSELECT ?wpid ?source_pathway ?metabolite ?pKa ?pKa2 ?metabolite2 ?wpid2\nWHERE {\n# VALUES ?wpid { \"WP550\" }\n?pathway wdt:P2410 ?wpid ;\nwdt:P527 ?metabolite ;\nwdt:P2888 ?source_pathway .\n?metabolite wdt:P1117 ?pKa .\nSERVICE <http://sparql.wikipathways.org/sparql> {\n?wp_mb1 wp:bdbWikidata ?metabolite .\n?wp_mb1 dcterms:isPartOf ?interaction .\n?interaction rdf:type wp:Interaction .\n?wp_mb2 dcterms:isPartOf ?interaction .\n?wp_mb2 wp:bdbWikidata ?metabolite2 .\nFILTER (?wp_mb1 != ?wp_mb2)\n}\n}\n} AS %result\nWHERE {\nINCLUDE %result\n?metabolite2 wdt:P1117 ?pKa2 .\n?pathway2 wdt:P2410 ?wpid2 ;\nwdt:P527 ?metabolite2 ;\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\nPREFIX wp: <http://vocabularies.wikipathways.org/wp#>\nPREFIX dcterms: <http://purl.org/dc/terms/>\n\nSELECT DISTINCT ?wpid ?metaboliteLabel ?pKa ?pKa2 ?metabolite2Label ?wpid2\nWITH {\nSELECT ?wpid ?source_pathway ?metabolite ?pKa ?pKa2 ?metabolite2 ?wpid2\nWHERE {\n# VALUES ?wpid { \"WP550\" }\n?pathway wdt:[property:WikiPathways ID] ?wpid ;\nwdt:[property:has part(s)] ?metabolite ;\nwdt:[property:exact match] ?source_pathway .\n?metabolite wdt:[property:pKa] ?pKa .\nSERVICE <http://sparql.wikipathways.org/sparql> {\n?wp_mb1 wp:bdbWikidata ?metabolite .\n?wp_mb1 dcterms:isPartOf ?interaction .\n?interaction rdf:type wp:Interaction .\n?wp_mb2 dcterms:isPartOf ?interaction .\n?wp_mb2 wp:bdbWikidata ?metabolite2 .\nFILTER (?wp_mb1 != ?wp_mb2)\n}\n}\n} AS %result\nWHERE {\nINCLUDE %result\n?metabolite2 wdt:[property:pKa] ?pKa2 .\n?pathway2 wdt:[property:WikiPathways ID] ?wpid2 ;\nwdt:[property:has part(s)] ?metabolite2 ;\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n}",
    "complexity": "complex"
  },
  {
    "id": "294",
    "instruction": "Show me a map of places where astrolabes were created.",
    "query": "SELECT ?loc ?locLabel ?coords (COUNT(?item) as ?count) WHERE {\n?item wdt:P31/wdt:P361? wd:Q164992.\n?item wdt:P1071 ?loc. ?loc wdt:P625 ?coords.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} GROUP BY ?loc ?locLabel ?coords",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?loc ?locLabel ?coords (COUNT(?item) as ?count) WHERE {\n?item wdt:[property:instance of]/wdt:[property:part of]? wd:[entity:astrolabe].\n?item wdt:[property:location of creation] ?loc. ?loc wdt:[property:coordinate location] ?coords.\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n} GROUP BY ?loc ?locLabel ?coords",
    "complexity": "complex"
  },
  {
    "id": "1611",
    "instruction": "What is the highest temperature ever recorded on Earth in both Fahrenheit and Celsius?",
    "query": "SELECT ?degrees_Celsius ?degrees_Fahrenheit ?item ?itemLabel ?location ?locationLabel ?date ?coor ?layer\nWHERE\n{\n?item p:P6591 ?st .\n{\n?st psv:P6591 [ wikibase:quantityAmount ?degrees_Celsius ; wikibase:quantityUnit wd:Q25267 ]\nBIND ( ROUND ( ?degrees_Celsius * 1.8 + 32 ) as ?degrees_Fahrenheit )\n}\nUNION\n{\n?st psv:P6591 [ wikibase:quantityAmount ?degrees_Fahrenheit ; wikibase:quantityUnit wd:Q42289 ]\nBIND( ROUND( ( ?degrees_Fahrenheit - 32 ) / 1.8 * 10)/10 as ?degrees_Celsius )\n}\nOPTIONAL { ?st pq:P276 ?location }\nOPTIONAL { ?st pq:P585 ?date }\nOPTIONAL { ?item wdt:P625 ?coor }\nBIND( CONCAT(str(Floor(?degrees_Celsius / 10)),\"0s degC\") as ?layer)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}\nORDER BY DESC(?degrees_Celsius)\nLIMIT 1000",
    "annotated": "PREFIX bd: <http://www.bigdata.com/rdf#>\nPREFIX p: <http://www.wikidata.org/prop/>\nPREFIX pq: <http://www.wikidata.org/prop/qualifier/>\nPREFIX psv: <http://www.wikidata.org/prop/statement/value/>\nPREFIX wd: <http://www.wikidata.org/entity/>\nPREFIX wdt: <http://www.wikidata.org/prop/direct/>\nPREFIX wikibase: <http://wikiba.se/ontology#>\n\nSELECT ?degrees_Celsius ?degrees_Fahrenheit ?item ?itemLabel ?location ?locationLabel ?date ?coor ?layer\nWHERE\n{\n?item p:[property:maximum temperature record] ?st .\n{\n?st psv:[property:maximum temperature record] [ wikibase:quantityAmount ?degrees_Celsius ; wikibase:quantityUnit wd:[entity:degree Celsius] ]\nBIND ( ROUND ( ?degrees_Celsius * 1.8 + 32 ) as ?degrees_Fahrenheit )\n}\nUNION\n{\n?st psv:[property:maximum temperature record] [ wikibase:quantityAmount ?degrees_Fahrenheit ; wikibase:quantityUnit wd:[entity:degree Fahrenheit] ]\nBIND( ROUND( ( ?degrees_Fahrenheit - 32 ) / 1.8 * 10)/10 as ?degrees_Celsius )\n}\nOPTIONAL { ?st pq:[property:location] ?location }\nOPTIONAL { ?st pq:[property:point in time] ?date }\nOPTIONAL { ?item wdt:[property:coordinate location] ?coor }\nBIND( CONCAT(str(Floor(?degrees_Celsius / 10)),\"0s degC\") as ?layer)\nSERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n}\nORDER BY DESC(?degrees_Celsius)\nLIMIT 1000",
    "complexity": "complex"
  }
]